<abi-corpus path='libzfs.so' architecture='elf-amd-x86_64' soname='libzfs.so.4'>
  <elf-needed>
    <dependency name='libzfs_core.so.3'/>
    <dependency name='libnvpair.so.3'/>
    <dependency name='libuutil.so.3'/>
    <dependency name='libcrypto.so.1.1'/>
    <dependency name='libz.so.1'/>
    <dependency name='libm.so.6'/>
    <dependency name='libpthread.so.0'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='SHA256Init' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='SHA2Final' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='SHA2Init' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='SHA2Update' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='SHA384Init' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='SHA512Init' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='bookmark_namecheck' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='changelist_free' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='zprop_free_list' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zprop_get_list' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zprop_index_to_string' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zprop_iter' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zprop_iter_common' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zprop_name_to_prop' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zprop_parse_value' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zprop_print_one_property' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zprop_random_value' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zprop_register_hidden' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zprop_register_impl' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zprop_register_index' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zprop_register_number' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zprop_register_string' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zprop_string_to_index' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zprop_valid_for_type' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zprop_values' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zprop_width' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zvol_volsize_to_reservation' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <elf-variable-symbols>
    <elf-symbol name='fletcher_4_abd_ops' size='24' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fletcher_4_avx2_ops' size='64' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fletcher_4_avx512bw_ops' size='64' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fletcher_4_avx512f_ops' size='64' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fletcher_4_sse2_ops' size='64' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fletcher_4_ssse3_ops' size='64' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fletcher_4_superscalar4_ops' size='64' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fletcher_4_superscalar_ops' size='64' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='libzfs_config_ops' size='16' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nfs_only' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='proto_table' size='48' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='share_all_proto' size='12' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='smb_only' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='smb_shares' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spa_feature_table' size='1960' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zfeature_checks_disable' size='4' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zfs_deleg_perm_tab' size='512' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zfs_history_event_names' size='328' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zfs_max_dataset_nesting' size='4' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zfs_userquota_prop_prefixes' size='96' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-variable-symbols>
  <abi-instr version='1.0' address-size='64' path='libshare.c' comp-dir-path='/home/ryan/zfs/lib/libshare' language='LANG_C99'>
    <typedef-decl name='sa_fstype_t' type-id='type-id-1' filepath='/home/ryan/zfs/lib/libshare/libshare_impl.h' line='59' column='1' id='type-id-2'/>
    <class-decl name='sa_fstype' size-in-bits='256' is-struct='yes' visibility='default' filepath='/home/ryan/zfs/lib/libshare/libshare_impl.h' line='53' column='1' id='type-id-1'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-3' visibility='default' filepath='/home/ryan/zfs/lib/libshare/libshare_impl.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='name' type-id='type-id-4' visibility='default' filepath='/home/ryan/zfs/lib/libshare/libshare_impl.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ops' type-id='type-id-5' visibility='default' filepath='/home/ryan/zfs/lib/libshare/libshare_impl.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='fsinfo_index' type-id='type-id-6' visibility='default' filepath='/home/ryan/zfs/lib/libshare/libshare_impl.h' line='58' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='sa_share_ops_t' type-id='type-id-7' filepath='/home/ryan/zfs/lib/libshare/libshare_impl.h' line='51' column='1' id='type-id-8'/>
    <class-decl name='sa_share_ops' size-in-bits='448' is-struct='yes' visibility='default' filepath='/home/ryan/zfs/lib/libshare/libshare_impl.h' line='42' column='1' id='type-id-7'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='enable_share' type-id='type-id-9' visibility='default' filepath='/home/ryan/zfs/lib/libshare/libshare_impl.h' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='disable_share' type-id='type-id-9' visibility='default' filepath='/home/ryan/zfs/lib/libshare/libshare_impl.h' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='is_shared' type-id='type-id-10' visibility='default' filepath='/home/ryan/zfs/lib/libshare/libshare_impl.h' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='validate_shareopts' type-id='type-id-11' visibility='default' filepath='/home/ryan/zfs/lib/libshare/libshare_impl.h' line='46' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='update_shareopts' type-id='type-id-12' visibility='default' filepath='/home/ryan/zfs/lib/libshare/libshare_impl.h' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='clear_shareopts' type-id='type-id-13' visibility='default' filepath='/home/ryan/zfs/lib/libshare/libshare_impl.h' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='commit_shares' type-id='type-id-14' visibility='default' filepath='/home/ryan/zfs/lib/libshare/libshare_impl.h' line='50' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='sa_share_impl_t' type-id='type-id-15' filepath='/home/ryan/zfs/lib/libshare/libshare_impl.h' line='37' column='1' id='type-id-16'/>
    <class-decl name='sa_share_impl' size-in-bits='192' is-struct='yes' visibility='default' filepath='/home/ryan/zfs/lib/libshare/libshare_impl.h' line='32' column='1' id='type-id-17'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sa_mountpoint' type-id='type-id-18' visibility='default' filepath='/home/ryan/zfs/lib/libshare/libshare_impl.h' line='33' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='sa_zfsname' type-id='type-id-18' visibility='default' filepath='/home/ryan/zfs/lib/libshare/libshare_impl.h' line='34' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='sa_fsinfo' type-id='type-id-19' visibility='default' filepath='/home/ryan/zfs/lib/libshare/libshare_impl.h' line='36' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='sa_share_fsinfo_t' type-id='type-id-20' filepath='/home/ryan/zfs/lib/libshare/libshare_impl.h' line='30' column='1' id='type-id-21'/>
    <class-decl name='sa_share_fsinfo' size-in-bits='64' is-struct='yes' visibility='default' filepath='/home/ryan/zfs/lib/libshare/libshare_impl.h' line='28' column='1' id='type-id-20'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='shareopts' type-id='type-id-18' visibility='default' filepath='/home/ryan/zfs/lib/libshare/libshare_impl.h' line='29' column='1'/>
      </data-member>
    </class-decl>
    <qualified-type-def type-id='type-id-8' const='yes' id='type-id-22'/>
    <pointer-type-def type-id='type-id-22' size-in-bits='64' id='type-id-5'/>
    <pointer-type-def type-id='type-id-23' size-in-bits='64' id='type-id-14'/>
    <pointer-type-def type-id='type-id-24' size-in-bits='64' id='type-id-11'/>
    <pointer-type-def type-id='type-id-25' size-in-bits='64' id='type-id-9'/>
    <pointer-type-def type-id='type-id-26' size-in-bits='64' id='type-id-12'/>
    <pointer-type-def type-id='type-id-1' size-in-bits='64' id='type-id-3'/>
    <pointer-type-def type-id='type-id-2' size-in-bits='64' id='type-id-27'/>
    <pointer-type-def type-id='type-id-21' size-in-bits='64' id='type-id-19'/>
    <pointer-type-def type-id='type-id-17' size-in-bits='64' id='type-id-15'/>
    <pointer-type-def type-id='type-id-28' size-in-bits='64' id='type-id-10'/>
    <pointer-type-def type-id='type-id-29' size-in-bits='64' id='type-id-13'/>
    <function-decl name='sa_validate_shareopts' mangled-name='sa_validate_shareopts' filepath='/home/ryan/zfs/lib/libshare/libshare.c' line='299' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='sa_validate_shareopts'>
      <parameter type-id='type-id-18' name='options' filepath='/home/ryan/zfs/lib/libshare/libshare.c' line='299' column='1'/>
      <parameter type-id='type-id-18' name='proto' filepath='/home/ryan/zfs/lib/libshare/libshare.c' line='299' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='sa_errorstr' mangled-name='sa_errorstr' filepath='/home/ryan/zfs/lib/libshare/libshare.c' line='182' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='sa_errorstr'>
      <parameter type-id='type-id-6' name='err' filepath='/home/ryan/zfs/lib/libshare/libshare.c' line='182' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='sa_commit_shares' mangled-name='sa_commit_shares' filepath='/home/ryan/zfs/lib/libshare/libshare.c' line='166' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='sa_commit_shares'>
      <parameter type-id='type-id-4' name='protocol' filepath='/home/ryan/zfs/lib/libshare/libshare.c' line='166' column='1'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='sa_is_shared' mangled-name='sa_is_shared' filepath='/home/ryan/zfs/lib/libshare/libshare.c' line='144' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='sa_is_shared'>
      <parameter type-id='type-id-4' name='mountpoint' filepath='/home/ryan/zfs/lib/libshare/libshare.c' line='144' column='1'/>
      <parameter type-id='type-id-18' name='protocol' filepath='/home/ryan/zfs/lib/libshare/libshare.c' line='144' column='1'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='sa_disable_share' mangled-name='sa_disable_share' filepath='/home/ryan/zfs/lib/libshare/libshare.c' line='115' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='sa_disable_share'>
      <parameter type-id='type-id-4' name='mountpoint' filepath='/home/ryan/zfs/lib/libshare/libshare.c' line='115' column='1'/>
      <parameter type-id='type-id-18' name='protocol' filepath='/home/ryan/zfs/lib/libshare/libshare.c' line='115' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='sa_enable_share' mangled-name='sa_enable_share' filepath='/home/ryan/zfs/lib/libshare/libshare.c' line='80' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='sa_enable_share'>
      <parameter type-id='type-id-4' name='zfsname' filepath='/home/ryan/zfs/lib/libshare/libshare.c' line='80' column='1'/>
      <parameter type-id='type-id-4' name='mountpoint' filepath='/home/ryan/zfs/lib/libshare/libshare.c' line='80' column='1'/>
      <parameter type-id='type-id-4' name='shareopts' filepath='/home/ryan/zfs/lib/libshare/libshare.c' line='81' column='1'/>
      <parameter type-id='type-id-18' name='protocol' filepath='/home/ryan/zfs/lib/libshare/libshare.c' line='81' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='register_fstype' mangled-name='register_fstype' filepath='/home/ryan/zfs/lib/libshare/libshare.c' line='51' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='register_fstype'>
      <parameter type-id='type-id-4' name='name' filepath='/home/ryan/zfs/lib/libshare/libshare.c' line='51' column='1'/>
      <parameter type-id='type-id-5' name='ops' filepath='/home/ryan/zfs/lib/libshare/libshare.c' line='51' column='1'/>
      <return type-id='type-id-27'/>
    </function-decl>
    <function-decl name='libshare_nfs_init' mangled-name='libshare_nfs_init' filepath='/home/ryan/zfs/lib/libshare/nfs.h' line='27' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='libshare_smb_init' mangled-name='libshare_smb_init' filepath='/home/ryan/zfs/lib/libshare/smb.h' line='49' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
    <pointer-type-def type-id='type-id-32' size-in-bits='64' id='type-id-18'/>
    <pointer-type-def type-id='type-id-33' size-in-bits='64' id='type-id-4'/>
    <function-type size-in-bits='64' id='type-id-23'>
      <return type-id='type-id-6'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-24'>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-6'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-25'>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-6'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-26'>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-6'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-28'>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-31'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-29'>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-30'/>
    </function-type>
    <type-decl name='int' size-in-bits='32' id='type-id-6'/>
    <typedef-decl name='boolean_t' type-id='type-id-34' filepath='../../lib/libspl/include/sys/stdtypes.h' line='29' column='1' id='type-id-31'/>
    <type-decl name='void' id='type-id-30'/>
    <type-decl name='char' size-in-bits='8' id='type-id-32'/>
    <qualified-type-def type-id='type-id-32' const='yes' id='type-id-33'/>
    <enum-decl name='__anonymous_enum__1' is-anonymous='yes' filepath='../../lib/libspl/include/sys/stdtypes.h' line='26' column='1' id='type-id-34'>
      <underlying-type type-id='type-id-35'/>
      <enumerator name='B_FALSE' value='0'/>
      <enumerator name='B_TRUE' value='1'/>
    </enum-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='os/linux/nfs.c' comp-dir-path='/home/ryan/zfs/lib/libshare' language='LANG_C99'>
    <function-decl name='__builtin_stpcpy' mangled-name='stpcpy' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='register_fstype' mangled-name='register_fstype' filepath='./libshare_impl.h' line='61' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='unlink' mangled-name='unlink' filepath='/usr/include/unistd.h' line='825' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='fputs' mangled-name='fputs' filepath='/usr/include/stdio.h' line='626' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='rename' mangled-name='rename' filepath='/usr/include/stdio.h' line='148' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='mkstemp' mangled-name='mkstemp64' filepath='/usr/include/stdlib.h' line='691' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='mkdir' mangled-name='mkdir' filepath='/usr/include/x86_64-linux-gnu/sys/stat.h' line='317' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='flock' mangled-name='flock' filepath='/usr/include/x86_64-linux-gnu/sys/file.h' line='50' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='os/linux/smb.c' comp-dir-path='/home/ryan/zfs/lib/libshare' language='LANG_C99'>
    <array-type-def dimensions='1' type-id='type-id-32' size-in-bits='2040' id='type-id-36'>
      <subrange length='255' type-id='type-id-37' id='type-id-38'/>
    </array-type-def>
    <typedef-decl name='smb_share_t' type-id='type-id-39' filepath='./smb.h' line='45' column='1' id='type-id-40'/>
    <class-decl name='smb_share_s' size-in-bits='36992' is-struct='yes' visibility='default' filepath='./smb.h' line='38' column='1' id='type-id-39'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-36' visibility='default' filepath='./smb.h' line='39' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2040'>
        <var-decl name='path' type-id='type-id-41' visibility='default' filepath='./smb.h' line='40' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='34808'>
        <var-decl name='comment' type-id='type-id-36' visibility='default' filepath='./smb.h' line='41' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='36864'>
        <var-decl name='guest_ok' type-id='type-id-31' visibility='default' filepath='./smb.h' line='42' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='36928'>
        <var-decl name='next' type-id='type-id-42' visibility='default' filepath='./smb.h' line='44' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-39' size-in-bits='64' id='type-id-42'/>
    <pointer-type-def type-id='type-id-40' size-in-bits='64' id='type-id-43'/>
    <var-decl name='smb_shares' type-id='type-id-43' mangled-name='smb_shares' visibility='default' filepath='./smb.h' line='47' column='1' elf-symbol-id='smb_shares'/>
    <function-decl name='opendir' mangled-name='opendir' filepath='/usr/include/dirent.h' line='134' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='fgets' mangled-name='fgets' filepath='/usr/include/stdio.h' line='564' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
    <array-type-def dimensions='1' type-id='type-id-32' size-in-bits='32768' id='type-id-41'>
      <subrange length='4096' type-id='type-id-37' id='type-id-44'/>
    </array-type-def>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-37'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../../module/icp/algs/sha2/sha2.c' comp-dir-path='/home/ryan/zfs/lib/libzfs' language='LANG_C99'>
    <array-type-def dimensions='1' type-id='type-id-45' size-in-bits='64' id='type-id-46'>
      <subrange length='2' type-id='type-id-37' id='type-id-47'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-45' size-in-bits='1024' id='type-id-48'>
      <subrange length='32' type-id='type-id-37' id='type-id-49'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-45' size-in-bits='256' id='type-id-50'>
      <subrange length='8' type-id='type-id-37' id='type-id-51'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-52' size-in-bits='1024' id='type-id-53'>
      <subrange length='16' type-id='type-id-37' id='type-id-54'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-52' size-in-bits='512' id='type-id-55'>
      <subrange length='8' type-id='type-id-37' id='type-id-51'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-56' size-in-bits='1024' id='type-id-57'>
      <subrange length='128' type-id='type-id-37' id='type-id-58'/>
    </array-type-def>
    <typedef-decl name='SHA2_CTX' type-id='type-id-59' filepath='../../lib/libspl/include/sys/sha2.h' line='87' column='1' id='type-id-60'/>
    <class-decl name='__anonymous_struct__' size-in-bits='1728' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-60' visibility='default' filepath='../../lib/libspl/include/sys/sha2.h' line='69' column='1' id='type-id-59'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='algotype' type-id='type-id-45' visibility='default' filepath='../../lib/libspl/include/sys/sha2.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='state' type-id='type-id-61' visibility='default' filepath='../../lib/libspl/include/sys/sha2.h' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='count' type-id='type-id-62' visibility='default' filepath='../../lib/libspl/include/sys/sha2.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='buf_un' type-id='type-id-63' visibility='default' filepath='../../lib/libspl/include/sys/sha2.h' line='86' column='1'/>
      </data-member>
    </class-decl>
    <union-decl name='__anonymous_union__' size-in-bits='512' is-anonymous='yes' visibility='default' filepath='../../lib/libspl/include/sys/sha2.h' line='73' column='1' id='type-id-61'>
      <data-member access='private'>
        <var-decl name='s32' type-id='type-id-50' visibility='default' filepath='../../lib/libspl/include/sys/sha2.h' line='74' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='s64' type-id='type-id-55' visibility='default' filepath='../../lib/libspl/include/sys/sha2.h' line='75' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__1' size-in-bits='128' is-anonymous='yes' visibility='default' filepath='../../lib/libspl/include/sys/sha2.h' line='78' column='1' id='type-id-62'>
      <data-member access='private'>
        <var-decl name='c32' type-id='type-id-46' visibility='default' filepath='../../lib/libspl/include/sys/sha2.h' line='79' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='c64' type-id='type-id-64' visibility='default' filepath='../../lib/libspl/include/sys/sha2.h' line='80' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__2' size-in-bits='1024' is-anonymous='yes' visibility='default' filepath='../../lib/libspl/include/sys/sha2.h' line='82' column='1' id='type-id-63'>
      <data-member access='private'>
        <var-decl name='buf8' type-id='type-id-57' visibility='default' filepath='../../lib/libspl/include/sys/sha2.h' line='83' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='buf32' type-id='type-id-48' visibility='default' filepath='../../lib/libspl/include/sys/sha2.h' line='84' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='buf64' type-id='type-id-53' visibility='default' filepath='../../lib/libspl/include/sys/sha2.h' line='85' column='1'/>
      </data-member>
    </union-decl>
    <typedef-decl name='SHA512_CTX' type-id='type-id-60' filepath='../../lib/libspl/include/sys/sha2.h' line='91' column='1' id='type-id-65'/>
    <typedef-decl name='SHA384_CTX' type-id='type-id-60' filepath='../../lib/libspl/include/sys/sha2.h' line='90' column='1' id='type-id-66'/>
    <typedef-decl name='SHA256_CTX' type-id='type-id-60' filepath='../../lib/libspl/include/sys/sha2.h' line='89' column='1' id='type-id-67'/>
    <pointer-type-def type-id='type-id-67' size-in-bits='64' id='type-id-68'/>
    <pointer-type-def type-id='type-id-60' size-in-bits='64' id='type-id-69'/>
    <pointer-type-def type-id='type-id-66' size-in-bits='64' id='type-id-70'/>
    <pointer-type-def type-id='type-id-65' size-in-bits='64' id='type-id-71'/>
    <function-decl name='SHA2Final' mangled-name='SHA2Final' filepath='../../module/icp/algs/sha2/sha2.c' line='904' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='SHA2Final'>
      <parameter type-id='type-id-72' name='digest' filepath='../../module/icp/algs/sha2/sha2.c' line='904' column='1'/>
      <parameter type-id='type-id-69' name='ctx' filepath='../../module/icp/algs/sha2/sha2.c' line='904' column='1'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='SHA2Update' mangled-name='SHA2Update' filepath='../../module/icp/algs/sha2/sha2.c' line='782' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='SHA2Update'>
      <parameter type-id='type-id-69' name='ctx' filepath='../../module/icp/algs/sha2/sha2.c' line='782' column='1'/>
      <parameter type-id='type-id-72' name='inptr' filepath='../../module/icp/algs/sha2/sha2.c' line='782' column='1'/>
      <parameter type-id='type-id-73' name='input_len' filepath='../../module/icp/algs/sha2/sha2.c' line='782' column='1'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='SHA512Init' mangled-name='SHA512Init' filepath='../../module/icp/algs/sha2/sha2.c' line='763' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='SHA512Init'>
      <parameter type-id='type-id-71' name='ctx' filepath='../../module/icp/algs/sha2/sha2.c' line='763' column='1'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='SHA384Init' mangled-name='SHA384Init' filepath='../../module/icp/algs/sha2/sha2.c' line='757' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='SHA384Init'>
      <parameter type-id='type-id-70' name='ctx' filepath='../../module/icp/algs/sha2/sha2.c' line='757' column='1'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='SHA256Init' mangled-name='SHA256Init' filepath='../../module/icp/algs/sha2/sha2.c' line='751' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='SHA256Init'>
      <parameter type-id='type-id-68' name='ctx' filepath='../../module/icp/algs/sha2/sha2.c' line='751' column='1'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='SHA2Init' mangled-name='SHA2Init' filepath='../../module/icp/algs/sha2/sha2.c' line='674' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='SHA2Init'>
      <parameter type-id='type-id-52' name='mech' filepath='../../module/icp/algs/sha2/sha2.c' line='674' column='1'/>
      <parameter type-id='type-id-69' name='ctx' filepath='../../module/icp/algs/sha2/sha2.c' line='674' column='1'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='htonl' mangled-name='htonl' filepath='../../lib/libspl/include/os/linux/sys/byteorder.h' line='79' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
    <typedef-decl name='size_t' type-id='type-id-37' filepath='/usr/lib/gcc/x86_64-linux-gnu/10/include/stddef.h' line='209' column='1' id='type-id-73'/>
    <typedef-decl name='uint32_t' type-id='type-id-74' filepath='/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h' line='26' column='1' id='type-id-45'/>
    <typedef-decl name='uint64_t' type-id='type-id-75' filepath='/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h' line='27' column='1' id='type-id-52'/>
    <typedef-decl name='uint8_t' type-id='type-id-76' filepath='/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h' line='24' column='1' id='type-id-56'/>
    <array-type-def dimensions='1' type-id='type-id-52' size-in-bits='128' id='type-id-64'>
      <subrange length='2' type-id='type-id-37' id='type-id-47'/>
    </array-type-def>
    <pointer-type-def type-id='type-id-30' size-in-bits='64' id='type-id-72'/>
    <typedef-decl name='__uint32_t' type-id='type-id-77' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='42' column='1' id='type-id-74'/>
    <typedef-decl name='__uint64_t' type-id='type-id-37' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='45' column='1' id='type-id-75'/>
    <typedef-decl name='__uint8_t' type-id='type-id-78' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='38' column='1' id='type-id-76'/>
    <type-decl name='unsigned char' size-in-bits='8' id='type-id-78'/>
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-77'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../../module/zcommon/cityhash.c' comp-dir-path='/home/ryan/zfs/lib/libzfs' language='LANG_C99'>
    <function-decl name='cityhash4' mangled-name='cityhash4' filepath='../../module/zcommon/cityhash.c' line='53' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='cityhash4'>
      <parameter type-id='type-id-52' name='w1' filepath='../../module/zcommon/cityhash.c' line='53' column='1'/>
      <parameter type-id='type-id-52' name='w2' filepath='../../module/zcommon/cityhash.c' line='53' column='1'/>
      <parameter type-id='type-id-52' name='w3' filepath='../../module/zcommon/cityhash.c' line='53' column='1'/>
      <parameter type-id='type-id-52' name='w4' filepath='../../module/zcommon/cityhash.c' line='53' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../../module/zcommon/zfeature_common.c' comp-dir-path='/home/ryan/zfs/lib/libzfs' language='LANG_C99'>
    <array-type-def dimensions='1' type-id='type-id-79' size-in-bits='15680' id='type-id-80'>
      <subrange length='35' type-id='type-id-37' id='type-id-81'/>
    </array-type-def>
    <typedef-decl name='zfeature_info_t' type-id='type-id-82' filepath='../../include/zfeature_common.h' line='114' column='1' id='type-id-79'/>
    <class-decl name='zfeature_info' size-in-bits='448' is-struct='yes' visibility='default' filepath='../../include/zfeature_common.h' line='104' column='1' id='type-id-82'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fi_feature' type-id='type-id-83' visibility='default' filepath='../../include/zfeature_common.h' line='105' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='fi_uname' type-id='type-id-4' visibility='default' filepath='../../include/zfeature_common.h' line='106' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='fi_guid' type-id='type-id-4' visibility='default' filepath='../../include/zfeature_common.h' line='107' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='fi_desc' type-id='type-id-4' visibility='default' filepath='../../include/zfeature_common.h' line='108' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='fi_flags' type-id='type-id-84' visibility='default' filepath='../../include/zfeature_common.h' line='109' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='fi_zfs_mod_supported' type-id='type-id-31' visibility='default' filepath='../../include/zfeature_common.h' line='110' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='fi_type' type-id='type-id-85' visibility='default' filepath='../../include/zfeature_common.h' line='111' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='fi_depends' type-id='type-id-86' visibility='default' filepath='../../include/zfeature_common.h' line='113' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='spa_feature_t' type-id='type-id-87' filepath='../../include/zfeature_common.h' line='80' column='1' id='type-id-83'/>
    <enum-decl name='spa_feature' filepath='../../include/zfeature_common.h' line='42' column='1' id='type-id-87'>
      <underlying-type type-id='type-id-35'/>
      <enumerator name='SPA_FEATURE_NONE' value='-1'/>
      <enumerator name='SPA_FEATURE_ASYNC_DESTROY' value='0'/>
      <enumerator name='SPA_FEATURE_EMPTY_BPOBJ' value='1'/>
      <enumerator name='SPA_FEATURE_LZ4_COMPRESS' value='2'/>
      <enumerator name='SPA_FEATURE_MULTI_VDEV_CRASH_DUMP' value='3'/>
      <enumerator name='SPA_FEATURE_SPACEMAP_HISTOGRAM' value='4'/>
      <enumerator name='SPA_FEATURE_ENABLED_TXG' value='5'/>
      <enumerator name='SPA_FEATURE_HOLE_BIRTH' value='6'/>
      <enumerator name='SPA_FEATURE_EXTENSIBLE_DATASET' value='7'/>
      <enumerator name='SPA_FEATURE_EMBEDDED_DATA' value='8'/>
      <enumerator name='SPA_FEATURE_BOOKMARKS' value='9'/>
      <enumerator name='SPA_FEATURE_FS_SS_LIMIT' value='10'/>
      <enumerator name='SPA_FEATURE_LARGE_BLOCKS' value='11'/>
      <enumerator name='SPA_FEATURE_LARGE_DNODE' value='12'/>
      <enumerator name='SPA_FEATURE_SHA512' value='13'/>
      <enumerator name='SPA_FEATURE_SKEIN' value='14'/>
      <enumerator name='SPA_FEATURE_EDONR' value='15'/>
      <enumerator name='SPA_FEATURE_USEROBJ_ACCOUNTING' value='16'/>
      <enumerator name='SPA_FEATURE_ENCRYPTION' value='17'/>
      <enumerator name='SPA_FEATURE_PROJECT_QUOTA' value='18'/>
      <enumerator name='SPA_FEATURE_DEVICE_REMOVAL' value='19'/>
      <enumerator name='SPA_FEATURE_OBSOLETE_COUNTS' value='20'/>
      <enumerator name='SPA_FEATURE_POOL_CHECKPOINT' value='21'/>
      <enumerator name='SPA_FEATURE_SPACEMAP_V2' value='22'/>
      <enumerator name='SPA_FEATURE_ALLOCATION_CLASSES' value='23'/>
      <enumerator name='SPA_FEATURE_RESILVER_DEFER' value='24'/>
      <enumerator name='SPA_FEATURE_BOOKMARK_V2' value='25'/>
      <enumerator name='SPA_FEATURE_REDACTION_BOOKMARKS' value='26'/>
      <enumerator name='SPA_FEATURE_REDACTED_DATASETS' value='27'/>
      <enumerator name='SPA_FEATURE_BOOKMARK_WRITTEN' value='28'/>
      <enumerator name='SPA_FEATURE_LOG_SPACEMAP' value='29'/>
      <enumerator name='SPA_FEATURE_LIVELIST' value='30'/>
      <enumerator name='SPA_FEATURE_DEVICE_REBUILD' value='31'/>
      <enumerator name='SPA_FEATURE_ZSTD_COMPRESS' value='32'/>
      <enumerator name='SPA_FEATURE_DRAID' value='33'/>
      <enumerator name='SPA_FEATURES' value='34'/>
    </enum-decl>
    <typedef-decl name='zfeature_flags_t' type-id='type-id-88' filepath='../../include/zfeature_common.h' line='96' column='1' id='type-id-84'/>
    <enum-decl name='zfeature_flags' filepath='../../include/zfeature_common.h' line='84' column='1' id='type-id-88'>
      <underlying-type type-id='type-id-35'/>
      <enumerator name='ZFEATURE_FLAG_READONLY_COMPAT' value='1'/>
      <enumerator name='ZFEATURE_FLAG_MOS' value='2'/>
      <enumerator name='ZFEATURE_FLAG_ACTIVATE_ON_ENABLE' value='4'/>
      <enumerator name='ZFEATURE_FLAG_PER_DATASET' value='8'/>
    </enum-decl>
    <typedef-decl name='zfeature_type_t' type-id='type-id-89' filepath='../../include/zfeature_common.h' line='102' column='1' id='type-id-85'/>
    <enum-decl name='zfeature_type' filepath='../../include/zfeature_common.h' line='98' column='1' id='type-id-89'>
      <underlying-type type-id='type-id-35'/>
      <enumerator name='ZFEATURE_TYPE_BOOLEAN' value='0'/>
      <enumerator name='ZFEATURE_TYPE_UINT64_ARRAY' value='1'/>
      <enumerator name='ZFEATURE_NUM_TYPES' value='2'/>
    </enum-decl>
    <qualified-type-def type-id='type-id-83' const='yes' id='type-id-90'/>
    <pointer-type-def type-id='type-id-90' size-in-bits='64' id='type-id-86'/>
    <pointer-type-def type-id='type-id-83' size-in-bits='64' id='type-id-91'/>
    <var-decl name='zfeature_checks_disable' type-id='type-id-31' mangled-name='zfeature_checks_disable' visibility='default' filepath='../../module/zcommon/zfeature_common.c' line='49' column='1' elf-symbol-id='zfeature_checks_disable'/>
    <var-decl name='spa_feature_table' type-id='type-id-80' mangled-name='spa_feature_table' visibility='default' filepath='../../include/zfeature_common.h' line='120' column='1' elf-symbol-id='spa_feature_table'/>
    <function-decl name='zpool_feature_init' mangled-name='zpool_feature_init' filepath='../../module/zcommon/zfeature_common.c' line='287' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_feature_init'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='zfs_mod_supported' mangled-name='zfs_mod_supported' filepath='../../module/zcommon/zfeature_common.c' line='187' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_mod_supported'>
      <parameter type-id='type-id-4' name='scope' filepath='../../module/zcommon/zfeature_common.c' line='187' column='1'/>
      <parameter type-id='type-id-4' name='name' filepath='../../module/zcommon/zfeature_common.c' line='187' column='1'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='zfeature_depends_on' mangled-name='zfeature_depends_on' filepath='../../module/zcommon/zfeature_common.c' line='146' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfeature_depends_on'>
      <parameter type-id='type-id-83' name='fid' filepath='../../module/zcommon/zfeature_common.c' line='146' column='1'/>
      <parameter type-id='type-id-83' name='check' filepath='../../module/zcommon/zfeature_common.c' line='146' column='1'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='zfeature_lookup_name' mangled-name='zfeature_lookup_name' filepath='../../module/zcommon/zfeature_common.c' line='129' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfeature_lookup_name'>
      <parameter type-id='type-id-4' name='name' filepath='../../module/zcommon/zfeature_common.c' line='129' column='1'/>
      <parameter type-id='type-id-91' name='res' filepath='../../module/zcommon/zfeature_common.c' line='129' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfeature_lookup_guid' mangled-name='zfeature_lookup_guid' filepath='../../module/zcommon/zfeature_common.c' line='112' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfeature_lookup_guid'>
      <parameter type-id='type-id-4' name='guid' filepath='../../module/zcommon/zfeature_common.c' line='112' column='1'/>
      <parameter type-id='type-id-91' name='res' filepath='../../module/zcommon/zfeature_common.c' line='112' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfeature_is_supported' mangled-name='zfeature_is_supported' filepath='../../module/zcommon/zfeature_common.c' line='96' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfeature_is_supported'>
      <parameter type-id='type-id-4' name='guid' filepath='../../module/zcommon/zfeature_common.c' line='96' column='1'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='zfeature_is_valid_guid' mangled-name='zfeature_is_valid_guid' filepath='../../module/zcommon/zfeature_common.c' line='74' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfeature_is_valid_guid'>
      <parameter type-id='type-id-4' name='name' filepath='../../module/zcommon/zfeature_common.c' line='74' column='1'/>
      <return type-id='type-id-31'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../../module/zcommon/zfs_comutil.c' comp-dir-path='/home/ryan/zfs/lib/libzfs' language='LANG_C99'>
    <array-type-def dimensions='1' type-id='type-id-4' size-in-bits='2624' id='type-id-92'>
      <subrange length='41' type-id='type-id-37' id='type-id-93'/>
    </array-type-def>
    <typedef-decl name='zpool_load_policy_t' type-id='type-id-94' filepath='../../include/sys/fs/zfs.h' line='603' column='1' id='type-id-95'/>
    <class-decl name='zpool_load_policy' size-in-bits='256' is-struct='yes' visibility='default' filepath='../../include/sys/fs/zfs.h' line='598' column='1' id='type-id-94'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='zlp_rewind' type-id='type-id-45' visibility='default' filepath='../../include/sys/fs/zfs.h' line='599' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='zlp_maxmeta' type-id='type-id-52' visibility='default' filepath='../../include/sys/fs/zfs.h' line='600' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='zlp_maxdata' type-id='type-id-52' visibility='default' filepath='../../include/sys/fs/zfs.h' line='601' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='zlp_txg' type-id='type-id-52' visibility='default' filepath='../../include/sys/fs/zfs.h' line='602' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-95' size-in-bits='64' id='type-id-96'/>
    <var-decl name='zfs_history_event_names' type-id='type-id-92' mangled-name='zfs_history_event_names' visibility='default' filepath='../../include/zfs_comutil.h' line='46' column='1' elf-symbol-id='zfs_history_event_names'/>
    <function-decl name='zfs_dataset_name_hidden' mangled-name='zfs_dataset_name_hidden' filepath='../../module/zcommon/zfs_comutil.c' line='239' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_dataset_name_hidden'>
      <parameter type-id='type-id-4' name='name' filepath='../../module/zcommon/zfs_comutil.c' line='239' column='1'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='zfs_spa_version_map' mangled-name='zfs_spa_version_map' filepath='../../module/zcommon/zfs_comutil.c' line='177' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_spa_version_map'>
      <parameter type-id='type-id-6' name='zpl_version' filepath='../../module/zcommon/zfs_comutil.c' line='177' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_zpl_version_map' mangled-name='zfs_zpl_version_map' filepath='../../module/zcommon/zfs_comutil.c' line='159' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_zpl_version_map'>
      <parameter type-id='type-id-6' name='spa_version' filepath='../../module/zcommon/zfs_comutil.c' line='159' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zpool_get_load_policy' mangled-name='zpool_get_load_policy' filepath='../../module/zcommon/zfs_comutil.c' line='99' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_get_load_policy'>
      <parameter type-id='type-id-97' name='nvl' filepath='../../module/zcommon/zfs_comutil.c' line='99' column='1'/>
      <parameter type-id='type-id-96' name='zlpp' filepath='../../module/zcommon/zfs_comutil.c' line='99' column='1'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='zfs_special_devs' mangled-name='zfs_special_devs' filepath='../../module/zcommon/zfs_comutil.c' line='71' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_special_devs'>
      <parameter type-id='type-id-97' name='nv' filepath='../../module/zcommon/zfs_comutil.c' line='71' column='1'/>
      <parameter type-id='type-id-18' name='type' filepath='../../module/zcommon/zfs_comutil.c' line='71' column='1'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='zfs_allocatable_devs' mangled-name='zfs_allocatable_devs' filepath='../../module/zcommon/zfs_comutil.c' line='46' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_allocatable_devs'>
      <parameter type-id='type-id-97' name='nv' filepath='../../module/zcommon/zfs_comutil.c' line='46' column='1'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='nvpair_value_uint32' mangled-name='nvpair_value_uint32' filepath='../../include/sys/nvpair.h' line='254' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
    <pointer-type-def type-id='type-id-98' size-in-bits='64' id='type-id-97'/>
    <typedef-decl name='nvlist_t' type-id='type-id-99' filepath='../../include/sys/nvpair.h' line='91' column='1' id='type-id-98'/>
    <class-decl name='nvlist' size-in-bits='192' is-struct='yes' visibility='default' filepath='../../include/sys/nvpair.h' line='85' column='1' id='type-id-99'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nvl_version' type-id='type-id-100' visibility='default' filepath='../../include/sys/nvpair.h' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='nvl_nvflag' type-id='type-id-45' visibility='default' filepath='../../include/sys/nvpair.h' line='87' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='nvl_priv' type-id='type-id-52' visibility='default' filepath='../../include/sys/nvpair.h' line='88' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='nvl_flag' type-id='type-id-45' visibility='default' filepath='../../include/sys/nvpair.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='nvl_pad' type-id='type-id-100' visibility='default' filepath='../../include/sys/nvpair.h' line='90' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='int32_t' type-id='type-id-101' filepath='/usr/include/x86_64-linux-gnu/bits/stdint-intn.h' line='26' column='1' id='type-id-100'/>
    <typedef-decl name='__int32_t' type-id='type-id-6' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='41' column='1' id='type-id-101'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../../module/zcommon/zfs_deleg.c' comp-dir-path='/home/ryan/zfs/lib/libzfs' language='LANG_C99'>
    <array-type-def dimensions='1' type-id='type-id-102' size-in-bits='4096' id='type-id-103'>
      <subrange length='32' type-id='type-id-37' id='type-id-49'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-102' size-in-bits='infinite' id='type-id-104'>
      <subrange length='infinite' id='type-id-105'/>
    </array-type-def>
    <typedef-decl name='zfs_deleg_perm_tab_t' type-id='type-id-106' filepath='../../include/zfs_deleg.h' line='86' column='1' id='type-id-102'/>
    <class-decl name='zfs_deleg_perm_tab' size-in-bits='128' is-struct='yes' visibility='default' filepath='../../include/zfs_deleg.h' line='83' column='1' id='type-id-106'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='z_perm' type-id='type-id-18' visibility='default' filepath='../../include/zfs_deleg.h' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='z_note' type-id='type-id-107' visibility='default' filepath='../../include/zfs_deleg.h' line='85' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='zfs_deleg_note_t' type-id='type-id-108' filepath='../../include/zfs_deleg.h' line='81' column='1' id='type-id-107'/>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' filepath='../../include/zfs_deleg.h' line='48' column='1' id='type-id-108'>
      <underlying-type type-id='type-id-35'/>
      <enumerator name='ZFS_DELEG_NOTE_CREATE' value='0'/>
      <enumerator name='ZFS_DELEG_NOTE_DESTROY' value='1'/>
      <enumerator name='ZFS_DELEG_NOTE_SNAPSHOT' value='2'/>
      <enumerator name='ZFS_DELEG_NOTE_ROLLBACK' value='3'/>
      <enumerator name='ZFS_DELEG_NOTE_CLONE' value='4'/>
      <enumerator name='ZFS_DELEG_NOTE_PROMOTE' value='5'/>
      <enumerator name='ZFS_DELEG_NOTE_RENAME' value='6'/>
      <enumerator name='ZFS_DELEG_NOTE_SEND' value='7'/>
      <enumerator name='ZFS_DELEG_NOTE_RECEIVE' value='8'/>
      <enumerator name='ZFS_DELEG_NOTE_ALLOW' value='9'/>
      <enumerator name='ZFS_DELEG_NOTE_USERPROP' value='10'/>
      <enumerator name='ZFS_DELEG_NOTE_MOUNT' value='11'/>
      <enumerator name='ZFS_DELEG_NOTE_SHARE' value='12'/>
      <enumerator name='ZFS_DELEG_NOTE_USERQUOTA' value='13'/>
      <enumerator name='ZFS_DELEG_NOTE_GROUPQUOTA' value='14'/>
      <enumerator name='ZFS_DELEG_NOTE_USERUSED' value='15'/>
      <enumerator name='ZFS_DELEG_NOTE_GROUPUSED' value='16'/>
      <enumerator name='ZFS_DELEG_NOTE_USEROBJQUOTA' value='17'/>
      <enumerator name='ZFS_DELEG_NOTE_GROUPOBJQUOTA' value='18'/>
      <enumerator name='ZFS_DELEG_NOTE_USEROBJUSED' value='19'/>
      <enumerator name='ZFS_DELEG_NOTE_GROUPOBJUSED' value='20'/>
      <enumerator name='ZFS_DELEG_NOTE_HOLD' value='21'/>
      <enumerator name='ZFS_DELEG_NOTE_RELEASE' value='22'/>
      <enumerator name='ZFS_DELEG_NOTE_DIFF' value='23'/>
      <enumerator name='ZFS_DELEG_NOTE_BOOKMARK' value='24'/>
      <enumerator name='ZFS_DELEG_NOTE_LOAD_KEY' value='25'/>
      <enumerator name='ZFS_DELEG_NOTE_CHANGE_KEY' value='26'/>
      <enumerator name='ZFS_DELEG_NOTE_PROJECTUSED' value='27'/>
      <enumerator name='ZFS_DELEG_NOTE_PROJECTQUOTA' value='28'/>
      <enumerator name='ZFS_DELEG_NOTE_PROJECTOBJUSED' value='29'/>
      <enumerator name='ZFS_DELEG_NOTE_PROJECTOBJQUOTA' value='30'/>
      <enumerator name='ZFS_DELEG_NOTE_NONE' value='31'/>
    </enum-decl>
    <typedef-decl name='zfs_deleg_who_type_t' type-id='type-id-109' filepath='../../include/sys/fs/zfs.h' line='354' column='1' id='type-id-110'/>
    <enum-decl name='__anonymous_enum__1' is-anonymous='yes' filepath='../../include/sys/fs/zfs.h' line='342' column='1' id='type-id-109'>
      <underlying-type type-id='type-id-35'/>
      <enumerator name='ZFS_DELEG_WHO_UNKNOWN' value='0'/>
      <enumerator name='ZFS_DELEG_USER' value='117'/>
      <enumerator name='ZFS_DELEG_USER_SETS' value='85'/>
      <enumerator name='ZFS_DELEG_GROUP' value='103'/>
      <enumerator name='ZFS_DELEG_GROUP_SETS' value='71'/>
      <enumerator name='ZFS_DELEG_EVERYONE' value='101'/>
      <enumerator name='ZFS_DELEG_EVERYONE_SETS' value='69'/>
      <enumerator name='ZFS_DELEG_CREATE' value='99'/>
      <enumerator name='ZFS_DELEG_CREATE_SETS' value='67'/>
      <enumerator name='ZFS_DELEG_NAMED_SET' value='115'/>
      <enumerator name='ZFS_DELEG_NAMED_SET_SETS' value='83'/>
    </enum-decl>
    <var-decl name='zfs_deleg_perm_tab' type-id='type-id-104' mangled-name='zfs_deleg_perm_tab' visibility='default' filepath='../../include/zfs_deleg.h' line='88' column='1' elf-symbol-id='zfs_deleg_perm_tab'/>
    <function-decl name='zfs_deleg_whokey' mangled-name='zfs_deleg_whokey' filepath='../../module/zcommon/zfs_deleg.c' line='211' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_deleg_whokey'>
      <parameter type-id='type-id-18' name='attr' filepath='../../module/zcommon/zfs_deleg.c' line='211' column='1'/>
      <parameter type-id='type-id-110' name='type' filepath='../../module/zcommon/zfs_deleg.c' line='211' column='1'/>
      <parameter type-id='type-id-32' name='inheritchr' filepath='../../module/zcommon/zfs_deleg.c' line='212' column='1'/>
      <parameter type-id='type-id-72' name='data' filepath='../../module/zcommon/zfs_deleg.c' line='212' column='1'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='zfs_deleg_verify_nvlist' mangled-name='zfs_deleg_verify_nvlist' filepath='../../module/zcommon/zfs_deleg.c' line='157' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_deleg_verify_nvlist'>
      <parameter type-id='type-id-97' name='nvp' filepath='../../module/zcommon/zfs_deleg.c' line='157' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_deleg_canonicalize_perm' mangled-name='zfs_deleg_canonicalize_perm' filepath='../../module/zcommon/zfs_deleg.c' line='90' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_deleg_canonicalize_perm'>
      <parameter type-id='type-id-4' name='perm' filepath='../../module/zcommon/zfs_deleg.c' line='90' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='permset_namecheck' mangled-name='permset_namecheck' filepath='../../include/zfs_namecheck.h' line='65' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='zfs_prop_delegatable' mangled-name='zfs_prop_delegatable' filepath='../../include/zfs_prop.h' line='92' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../../module/zcommon/zfs_fletcher.c' comp-dir-path='/home/ryan/zfs/lib/libzfs' language='LANG_C99'>
    <array-type-def dimensions='1' type-id='type-id-52' size-in-bits='256' id='type-id-111'>
      <subrange length='4' type-id='type-id-37' id='type-id-112'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-113' size-in-bits='2048' id='type-id-114'>
      <subrange length='4' type-id='type-id-37' id='type-id-112'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-115' size-in-bits='1024' id='type-id-116'>
      <subrange length='4' type-id='type-id-37' id='type-id-112'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-117' size-in-bits='512' id='type-id-118'>
      <subrange length='4' type-id='type-id-37' id='type-id-112'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-119' size-in-bits='1024' id='type-id-120'>
      <subrange length='4' type-id='type-id-37' id='type-id-112'/>
    </array-type-def>
    <typedef-decl name='zio_abd_checksum_func_t' type-id='type-id-121' filepath='../../include/sys/zio_checksum.h' line='81' column='1' id='type-id-122'/>
    <class-decl name='zio_abd_checksum_func' size-in-bits='192' is-struct='yes' visibility='default' filepath='../../include/sys/zio_checksum.h' line='77' column='1' id='type-id-123'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='acf_init' type-id='type-id-124' visibility='default' filepath='../../include/sys/zio_checksum.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='acf_fini' type-id='type-id-125' visibility='default' filepath='../../include/sys/zio_checksum.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='acf_iter' type-id='type-id-126' visibility='default' filepath='../../include/sys/zio_checksum.h' line='80' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='zio_abd_checksum_init_t' type-id='type-id-127' filepath='../../include/sys/zio_checksum.h' line='73' column='1' id='type-id-128'/>
    <typedef-decl name='zio_abd_checksum_data_t' type-id='type-id-129' filepath='../../include/sys/zio_checksum.h' line='71' column='1' id='type-id-130'/>
    <class-decl name='zio_abd_checksum_data' size-in-bits='256' is-struct='yes' visibility='default' filepath='../../include/sys/zio_checksum.h' line='66' column='1' id='type-id-129'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='acd_byteorder' type-id='type-id-131' visibility='default' filepath='../../include/sys/zio_checksum.h' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='acd_ctx' type-id='type-id-132' visibility='default' filepath='../../include/sys/zio_checksum.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='acd_zcp' type-id='type-id-133' visibility='default' filepath='../../include/sys/zio_checksum.h' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='acd_private' type-id='type-id-72' visibility='default' filepath='../../include/sys/zio_checksum.h' line='70' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='zio_byteorder_t' type-id='type-id-134' filepath='../../include/sys/zio_checksum.h' line='64' column='1' id='type-id-131'/>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' filepath='../../include/sys/zio_checksum.h' line='61' column='1' id='type-id-134'>
      <underlying-type type-id='type-id-35'/>
      <enumerator name='ZIO_CHECKSUM_NATIVE' value='0'/>
      <enumerator name='ZIO_CHECKSUM_BYTESWAP' value='1'/>
    </enum-decl>
    <typedef-decl name='fletcher_4_ctx_t' type-id='type-id-135' filepath='../../include/zfs_fletcher.h' line='106' column='1' id='type-id-136'/>
    <union-decl name='fletcher_4_ctx' size-in-bits='2048' visibility='default' filepath='../../include/zfs_fletcher.h' line='90' column='1' id='type-id-135'>
      <data-member access='private'>
        <var-decl name='scalar' type-id='type-id-137' visibility='default' filepath='../../include/zfs_fletcher.h' line='91' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='superscalar' type-id='type-id-120' visibility='default' filepath='../../include/zfs_fletcher.h' line='92' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='sse' type-id='type-id-118' visibility='default' filepath='../../include/zfs_fletcher.h' line='95' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='avx' type-id='type-id-116' visibility='default' filepath='../../include/zfs_fletcher.h' line='98' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='avx512' type-id='type-id-114' visibility='default' filepath='../../include/zfs_fletcher.h' line='101' column='1'/>
      </data-member>
    </union-decl>
    <typedef-decl name='zio_cksum_t' type-id='type-id-138' filepath='../../include/sys/spa_checksum.h' line='40' column='1' id='type-id-137'/>
    <class-decl name='zio_cksum' size-in-bits='256' is-struct='yes' visibility='default' filepath='../../include/sys/spa_checksum.h' line='38' column='1' id='type-id-138'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='zc_word' type-id='type-id-111' visibility='default' filepath='../../include/sys/spa_checksum.h' line='39' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='zfs_fletcher_superscalar_t' type-id='type-id-139' filepath='../../include/zfs_fletcher.h' line='71' column='1' id='type-id-119'/>
    <class-decl name='zfs_fletcher_superscalar' size-in-bits='256' is-struct='yes' visibility='default' filepath='../../include/zfs_fletcher.h' line='69' column='1' id='type-id-139'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='v' type-id='type-id-111' visibility='default' filepath='../../include/zfs_fletcher.h' line='70' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='zfs_fletcher_sse_t' type-id='type-id-140' filepath='../../include/zfs_fletcher.h' line='75' column='1' id='type-id-117'/>
    <class-decl name='zfs_fletcher_sse' size-in-bits='128' is-struct='yes' visibility='default' filepath='../../include/zfs_fletcher.h' line='73' column='1' id='type-id-140'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='v' type-id='type-id-64' visibility='default' filepath='../../include/zfs_fletcher.h' line='74' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='zfs_fletcher_avx_t' type-id='type-id-141' filepath='../../include/zfs_fletcher.h' line='79' column='1' id='type-id-115'/>
    <class-decl name='zfs_fletcher_avx' size-in-bits='256' is-struct='yes' visibility='default' filepath='../../include/zfs_fletcher.h' line='77' column='1' id='type-id-141'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='v' type-id='type-id-111' visibility='default' filepath='../../include/zfs_fletcher.h' line='78' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='zfs_fletcher_avx512_t' type-id='type-id-142' filepath='../../include/zfs_fletcher.h' line='83' column='1' id='type-id-113'/>
    <class-decl name='zfs_fletcher_avx512' size-in-bits='512' is-struct='yes' visibility='default' filepath='../../include/zfs_fletcher.h' line='81' column='1' id='type-id-142'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='v' type-id='type-id-55' visibility='default' filepath='../../include/zfs_fletcher.h' line='82' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='zio_abd_checksum_fini_t' type-id='type-id-127' filepath='../../include/sys/zio_checksum.h' line='74' column='1' id='type-id-143'/>
    <typedef-decl name='zio_abd_checksum_iter_t' type-id='type-id-144' filepath='../../include/sys/zio_checksum.h' line='75' column='1' id='type-id-145'/>
    <qualified-type-def type-id='type-id-123' const='yes' id='type-id-121'/>
    <pointer-type-def type-id='type-id-136' size-in-bits='64' id='type-id-132'/>
    <pointer-type-def type-id='type-id-130' size-in-bits='64' id='type-id-146'/>
    <pointer-type-def type-id='type-id-143' size-in-bits='64' id='type-id-125'/>
    <pointer-type-def type-id='type-id-128' size-in-bits='64' id='type-id-124'/>
    <pointer-type-def type-id='type-id-145' size-in-bits='64' id='type-id-126'/>
    <pointer-type-def type-id='type-id-137' size-in-bits='64' id='type-id-133'/>
    <var-decl name='fletcher_4_abd_ops' type-id='type-id-122' mangled-name='fletcher_4_abd_ops' visibility='default' filepath='../../include/sys/zio_checksum.h' line='125' column='1' elf-symbol-id='fletcher_4_abd_ops'/>
    <function-decl name='fletcher_4_fini' mangled-name='fletcher_4_fini' filepath='../../module/zcommon/zfs_fletcher.c' line='798' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fletcher_4_fini'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='fletcher_4_init' mangled-name='fletcher_4_init' filepath='../../module/zcommon/zfs_fletcher.c' line='773' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fletcher_4_init'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='fletcher_4_incremental_byteswap' mangled-name='fletcher_4_incremental_byteswap' filepath='../../module/zcommon/zfs_fletcher.c' line='589' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fletcher_4_incremental_byteswap'>
      <parameter type-id='type-id-72' name='buf' filepath='../../module/zcommon/zfs_fletcher.c' line='589' column='1'/>
      <parameter type-id='type-id-73' name='size' filepath='../../module/zcommon/zfs_fletcher.c' line='589' column='1'/>
      <parameter type-id='type-id-72' name='data' filepath='../../module/zcommon/zfs_fletcher.c' line='589' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='fletcher_4_incremental_native' mangled-name='fletcher_4_incremental_native' filepath='../../module/zcommon/zfs_fletcher.c' line='577' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fletcher_4_incremental_native'>
      <parameter type-id='type-id-72' name='buf' filepath='../../module/zcommon/zfs_fletcher.c' line='577' column='1'/>
      <parameter type-id='type-id-73' name='size' filepath='../../module/zcommon/zfs_fletcher.c' line='577' column='1'/>
      <parameter type-id='type-id-72' name='data' filepath='../../module/zcommon/zfs_fletcher.c' line='577' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='fletcher_4_byteswap' mangled-name='fletcher_4_byteswap' filepath='../../module/zcommon/zfs_fletcher.c' line='507' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fletcher_4_byteswap'>
      <parameter type-id='type-id-72' name='buf' filepath='../../module/zcommon/zfs_fletcher.c' line='507' column='1'/>
      <parameter type-id='type-id-52' name='size' filepath='../../module/zcommon/zfs_fletcher.c' line='507' column='1'/>
      <parameter type-id='type-id-72' name='ctx_template' filepath='../../module/zcommon/zfs_fletcher.c' line='508' column='1'/>
      <parameter type-id='type-id-133' name='zcp' filepath='../../module/zcommon/zfs_fletcher.c' line='508' column='1'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='fletcher_4_native_varsize' mangled-name='fletcher_4_native_varsize' filepath='../../module/zcommon/zfs_fletcher.c' line='488' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fletcher_4_native_varsize'>
      <parameter type-id='type-id-72' name='buf' filepath='../../module/zcommon/zfs_fletcher.c' line='488' column='1'/>
      <parameter type-id='type-id-52' name='size' filepath='../../module/zcommon/zfs_fletcher.c' line='488' column='1'/>
      <parameter type-id='type-id-133' name='zcp' filepath='../../module/zcommon/zfs_fletcher.c' line='488' column='1'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='fletcher_4_native' mangled-name='fletcher_4_native' filepath='../../module/zcommon/zfs_fletcher.c' line='465' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fletcher_4_native'>
      <parameter type-id='type-id-72' name='buf' filepath='../../module/zcommon/zfs_fletcher.c' line='465' column='1'/>
      <parameter type-id='type-id-52' name='size' filepath='../../module/zcommon/zfs_fletcher.c' line='465' column='1'/>
      <parameter type-id='type-id-72' name='ctx_template' filepath='../../module/zcommon/zfs_fletcher.c' line='466' column='1'/>
      <parameter type-id='type-id-133' name='zcp' filepath='../../module/zcommon/zfs_fletcher.c' line='466' column='1'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='fletcher_4_impl_set' mangled-name='fletcher_4_impl_set' filepath='../../module/zcommon/zfs_fletcher.c' line='369' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fletcher_4_impl_set'>
      <parameter type-id='type-id-4' name='val' filepath='../../module/zcommon/zfs_fletcher.c' line='369' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='fletcher_2_byteswap' mangled-name='fletcher_2_byteswap' filepath='../../module/zcommon/zfs_fletcher.c' line='297' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fletcher_2_byteswap'>
      <parameter type-id='type-id-72' name='buf' filepath='../../module/zcommon/zfs_fletcher.c' line='297' column='1'/>
      <parameter type-id='type-id-52' name='size' filepath='../../module/zcommon/zfs_fletcher.c' line='297' column='1'/>
      <parameter type-id='type-id-72' name='ctx_template' filepath='../../module/zcommon/zfs_fletcher.c' line='298' column='1'/>
      <parameter type-id='type-id-133' name='zcp' filepath='../../module/zcommon/zfs_fletcher.c' line='298' column='1'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='fletcher_2_incremental_byteswap' mangled-name='fletcher_2_incremental_byteswap' filepath='../../module/zcommon/zfs_fletcher.c' line='271' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fletcher_2_incremental_byteswap'>
      <parameter type-id='type-id-72' name='buf' filepath='../../module/zcommon/zfs_fletcher.c' line='271' column='1'/>
      <parameter type-id='type-id-73' name='size' filepath='../../module/zcommon/zfs_fletcher.c' line='271' column='1'/>
      <parameter type-id='type-id-72' name='data' filepath='../../module/zcommon/zfs_fletcher.c' line='271' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='fletcher_2_native' mangled-name='fletcher_2_native' filepath='../../module/zcommon/zfs_fletcher.c' line='263' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fletcher_2_native'>
      <parameter type-id='type-id-72' name='buf' filepath='../../module/zcommon/zfs_fletcher.c' line='263' column='1'/>
      <parameter type-id='type-id-52' name='size' filepath='../../module/zcommon/zfs_fletcher.c' line='263' column='1'/>
      <parameter type-id='type-id-72' name='ctx_template' filepath='../../module/zcommon/zfs_fletcher.c' line='264' column='1'/>
      <parameter type-id='type-id-133' name='zcp' filepath='../../module/zcommon/zfs_fletcher.c' line='264' column='1'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='fletcher_2_incremental_native' mangled-name='fletcher_2_incremental_native' filepath='../../module/zcommon/zfs_fletcher.c' line='237' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fletcher_2_incremental_native'>
      <parameter type-id='type-id-72' name='buf' filepath='../../module/zcommon/zfs_fletcher.c' line='237' column='1'/>
      <parameter type-id='type-id-73' name='size' filepath='../../module/zcommon/zfs_fletcher.c' line='237' column='1'/>
      <parameter type-id='type-id-72' name='data' filepath='../../module/zcommon/zfs_fletcher.c' line='237' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='fletcher_init' mangled-name='fletcher_init' filepath='../../module/zcommon/zfs_fletcher.c' line='231' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fletcher_init'>
      <parameter type-id='type-id-133' name='zcp' filepath='../../module/zcommon/zfs_fletcher.c' line='231' column='1'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='membar_producer' mangled-name='membar_producer' filepath='../../lib/libspl/include/atomic.h' line='323' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='atomic_swap_32' mangled-name='atomic_swap_32' filepath='../../lib/libspl/include/atomic.h' line='240' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-144'>
      <parameter type-id='type-id-72'/>
      <parameter type-id='type-id-73'/>
      <parameter type-id='type-id-72'/>
      <return type-id='type-id-6'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-127'>
      <parameter type-id='type-id-146'/>
      <return type-id='type-id-30'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../../module/zcommon/zfs_fletcher_avx512.c' comp-dir-path='/home/ryan/zfs/lib/libzfs' language='LANG_C99'>
    <typedef-decl name='fletcher_4_ops_t' type-id='type-id-147' filepath='../../include/zfs_fletcher.h' line='125' column='1' id='type-id-148'/>
    <class-decl name='fletcher_4_func' size-in-bits='512' is-struct='yes' visibility='default' filepath='../../include/zfs_fletcher.h' line='116' column='1' id='type-id-147'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='init_native' type-id='type-id-149' visibility='default' filepath='../../include/zfs_fletcher.h' line='117' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='fini_native' type-id='type-id-150' visibility='default' filepath='../../include/zfs_fletcher.h' line='118' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='compute_native' type-id='type-id-151' visibility='default' filepath='../../include/zfs_fletcher.h' line='119' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='init_byteswap' type-id='type-id-149' visibility='default' filepath='../../include/zfs_fletcher.h' line='120' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='fini_byteswap' type-id='type-id-150' visibility='default' filepath='../../include/zfs_fletcher.h' line='121' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='compute_byteswap' type-id='type-id-151' visibility='default' filepath='../../include/zfs_fletcher.h' line='122' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='valid' type-id='type-id-152' visibility='default' filepath='../../include/zfs_fletcher.h' line='123' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='name' type-id='type-id-4' visibility='default' filepath='../../include/zfs_fletcher.h' line='124' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='fletcher_4_init_f' type-id='type-id-153' filepath='../../include/zfs_fletcher.h' line='111' column='1' id='type-id-149'/>
    <typedef-decl name='fletcher_4_fini_f' type-id='type-id-154' filepath='../../include/zfs_fletcher.h' line='112' column='1' id='type-id-150'/>
    <typedef-decl name='fletcher_4_compute_f' type-id='type-id-155' filepath='../../include/zfs_fletcher.h' line='113' column='1' id='type-id-151'/>
    <qualified-type-def type-id='type-id-148' const='yes' id='type-id-156'/>
    <pointer-type-def type-id='type-id-157' size-in-bits='64' id='type-id-152'/>
    <pointer-type-def type-id='type-id-158' size-in-bits='64' id='type-id-153'/>
    <pointer-type-def type-id='type-id-159' size-in-bits='64' id='type-id-155'/>
    <pointer-type-def type-id='type-id-160' size-in-bits='64' id='type-id-154'/>
    <var-decl name='fletcher_4_avx512f_ops' type-id='type-id-156' mangled-name='fletcher_4_avx512f_ops' visibility='default' filepath='../../include/zfs_fletcher.h' line='143' column='1' elf-symbol-id='fletcher_4_avx512f_ops'/>
    <var-decl name='fletcher_4_avx512bw_ops' type-id='type-id-156' mangled-name='fletcher_4_avx512bw_ops' visibility='default' filepath='../../include/zfs_fletcher.h' line='147' column='1' elf-symbol-id='fletcher_4_avx512bw_ops'/>
    <function-type size-in-bits='64' id='type-id-157'>
      <return type-id='type-id-31'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-158'>
      <parameter type-id='type-id-132'/>
      <return type-id='type-id-30'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-159'>
      <parameter type-id='type-id-132'/>
      <parameter type-id='type-id-72'/>
      <parameter type-id='type-id-52'/>
      <return type-id='type-id-30'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-160'>
      <parameter type-id='type-id-132'/>
      <parameter type-id='type-id-133'/>
      <return type-id='type-id-30'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../../module/zcommon/zfs_fletcher_intel.c' comp-dir-path='/home/ryan/zfs/lib/libzfs' language='LANG_C99'>
    <var-decl name='fletcher_4_avx2_ops' type-id='type-id-156' mangled-name='fletcher_4_avx2_ops' visibility='default' filepath='../../include/zfs_fletcher.h' line='139' column='1' elf-symbol-id='fletcher_4_avx2_ops'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../../module/zcommon/zfs_fletcher_sse.c' comp-dir-path='/home/ryan/zfs/lib/libzfs' language='LANG_C99'>
    <var-decl name='fletcher_4_sse2_ops' type-id='type-id-156' mangled-name='fletcher_4_sse2_ops' visibility='default' filepath='../../include/zfs_fletcher.h' line='131' column='1' elf-symbol-id='fletcher_4_sse2_ops'/>
    <var-decl name='fletcher_4_ssse3_ops' type-id='type-id-156' mangled-name='fletcher_4_ssse3_ops' visibility='default' filepath='../../include/zfs_fletcher.h' line='135' column='1' elf-symbol-id='fletcher_4_ssse3_ops'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../../module/zcommon/zfs_fletcher_superscalar.c' comp-dir-path='/home/ryan/zfs/lib/libzfs' language='LANG_C99'>
    <var-decl name='fletcher_4_superscalar_ops' type-id='type-id-156' mangled-name='fletcher_4_superscalar_ops' visibility='default' filepath='../../include/zfs_fletcher.h' line='127' column='1' elf-symbol-id='fletcher_4_superscalar_ops'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../../module/zcommon/zfs_fletcher_superscalar4.c' comp-dir-path='/home/ryan/zfs/lib/libzfs' language='LANG_C99'>
    <var-decl name='fletcher_4_superscalar4_ops' type-id='type-id-156' mangled-name='fletcher_4_superscalar4_ops' visibility='default' filepath='../../include/zfs_fletcher.h' line='128' column='1' elf-symbol-id='fletcher_4_superscalar4_ops'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../../module/zcommon/zfs_namecheck.c' comp-dir-path='/home/ryan/zfs/lib/libzfs' language='LANG_C99'>
    <typedef-decl name='namecheck_err_t' type-id='type-id-161' filepath='../../include/zfs_namecheck.h' line='50' column='1' id='type-id-162'/>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' filepath='../../include/zfs_namecheck.h' line='36' column='1' id='type-id-161'>
      <underlying-type type-id='type-id-35'/>
      <enumerator name='NAME_ERR_LEADING_SLASH' value='0'/>
      <enumerator name='NAME_ERR_EMPTY_COMPONENT' value='1'/>
      <enumerator name='NAME_ERR_TRAILING_SLASH' value='2'/>
      <enumerator name='NAME_ERR_INVALCHAR' value='3'/>
      <enumerator name='NAME_ERR_MULTIPLE_DELIMITERS' value='4'/>
      <enumerator name='NAME_ERR_NOLETTER' value='5'/>
      <enumerator name='NAME_ERR_RESERVED' value='6'/>
      <enumerator name='NAME_ERR_DISKLIKE' value='7'/>
      <enumerator name='NAME_ERR_TOOLONG' value='8'/>
      <enumerator name='NAME_ERR_SELF_REF' value='9'/>
      <enumerator name='NAME_ERR_PARENT_REF' value='10'/>
      <enumerator name='NAME_ERR_NO_AT' value='11'/>
      <enumerator name='NAME_ERR_NO_POUND' value='12'/>
    </enum-decl>
    <pointer-type-def type-id='type-id-162' size-in-bits='64' id='type-id-163'/>
    <var-decl name='zfs_max_dataset_nesting' type-id='type-id-6' mangled-name='zfs_max_dataset_nesting' visibility='default' filepath='../../include/zfs_namecheck.h' line='54' column='1' elf-symbol-id='zfs_max_dataset_nesting'/>
    <function-decl name='pool_namecheck' mangled-name='pool_namecheck' filepath='../../module/zcommon/zfs_namecheck.c' line='407' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='pool_namecheck'>
      <parameter type-id='type-id-4' name='pool' filepath='../../module/zcommon/zfs_namecheck.c' line='407' column='1'/>
      <parameter type-id='type-id-163' name='why' filepath='../../module/zcommon/zfs_namecheck.c' line='407' column='1'/>
      <parameter type-id='type-id-18' name='what' filepath='../../module/zcommon/zfs_namecheck.c' line='407' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='mountpoint_namecheck' mangled-name='mountpoint_namecheck' filepath='../../module/zcommon/zfs_namecheck.c' line='361' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='mountpoint_namecheck'>
      <parameter type-id='type-id-4' name='path' filepath='../../module/zcommon/zfs_namecheck.c' line='361' column='1'/>
      <parameter type-id='type-id-163' name='why' filepath='../../module/zcommon/zfs_namecheck.c' line='361' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='snapshot_namecheck' mangled-name='snapshot_namecheck' filepath='../../module/zcommon/zfs_namecheck.c' line='338' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='snapshot_namecheck'>
      <parameter type-id='type-id-4' name='path' filepath='../../module/zcommon/zfs_namecheck.c' line='338' column='1'/>
      <parameter type-id='type-id-163' name='why' filepath='../../module/zcommon/zfs_namecheck.c' line='338' column='1'/>
      <parameter type-id='type-id-18' name='what' filepath='../../module/zcommon/zfs_namecheck.c' line='338' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='bookmark_namecheck' mangled-name='bookmark_namecheck' filepath='../../module/zcommon/zfs_namecheck.c' line='319' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='bookmark_namecheck'>
      <parameter type-id='type-id-4' name='path' filepath='../../module/zcommon/zfs_namecheck.c' line='319' column='1'/>
      <parameter type-id='type-id-163' name='why' filepath='../../module/zcommon/zfs_namecheck.c' line='319' column='1'/>
      <parameter type-id='type-id-18' name='what' filepath='../../module/zcommon/zfs_namecheck.c' line='319' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='dataset_namecheck' mangled-name='dataset_namecheck' filepath='../../module/zcommon/zfs_namecheck.c' line='300' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dataset_namecheck'>
      <parameter type-id='type-id-4' name='path' filepath='../../module/zcommon/zfs_namecheck.c' line='300' column='1'/>
      <parameter type-id='type-id-163' name='why' filepath='../../module/zcommon/zfs_namecheck.c' line='300' column='1'/>
      <parameter type-id='type-id-18' name='what' filepath='../../module/zcommon/zfs_namecheck.c' line='300' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='entity_namecheck' mangled-name='entity_namecheck' filepath='../../module/zcommon/zfs_namecheck.c' line='182' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='entity_namecheck'>
      <parameter type-id='type-id-4' name='path' filepath='../../module/zcommon/zfs_namecheck.c' line='182' column='1'/>
      <parameter type-id='type-id-163' name='why' filepath='../../module/zcommon/zfs_namecheck.c' line='182' column='1'/>
      <parameter type-id='type-id-18' name='what' filepath='../../module/zcommon/zfs_namecheck.c' line='182' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='dataset_nestcheck' mangled-name='dataset_nestcheck' filepath='../../module/zcommon/zfs_namecheck.c' line='161' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dataset_nestcheck'>
      <parameter type-id='type-id-4' name='path' filepath='../../module/zcommon/zfs_namecheck.c' line='161' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='permset_namecheck' mangled-name='permset_namecheck' filepath='../../module/zcommon/zfs_namecheck.c' line='135' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='permset_namecheck'>
      <parameter type-id='type-id-4' name='path' filepath='../../module/zcommon/zfs_namecheck.c' line='135' column='1'/>
      <parameter type-id='type-id-163' name='why' filepath='../../module/zcommon/zfs_namecheck.c' line='135' column='1'/>
      <parameter type-id='type-id-18' name='what' filepath='../../module/zcommon/zfs_namecheck.c' line='135' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_component_namecheck' mangled-name='zfs_component_namecheck' filepath='../../module/zcommon/zfs_namecheck.c' line='98' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_component_namecheck'>
      <parameter type-id='type-id-4' name='path' filepath='../../module/zcommon/zfs_namecheck.c' line='98' column='1'/>
      <parameter type-id='type-id-163' name='why' filepath='../../module/zcommon/zfs_namecheck.c' line='98' column='1'/>
      <parameter type-id='type-id-18' name='what' filepath='../../module/zcommon/zfs_namecheck.c' line='98' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='get_dataset_depth' mangled-name='get_dataset_depth' filepath='../../module/zcommon/zfs_namecheck.c' line='70' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='get_dataset_depth'>
      <parameter type-id='type-id-4' name='path' filepath='../../module/zcommon/zfs_namecheck.c' line='70' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../../module/zcommon/zfs_prop.c' comp-dir-path='/home/ryan/zfs/lib/libzfs' language='LANG_C99'>
    <array-type-def dimensions='1' type-id='type-id-4' size-in-bits='768' id='type-id-164'>
      <subrange length='12' type-id='type-id-37' id='type-id-165'/>
    </array-type-def>
    <typedef-decl name='zprop_type_t' type-id='type-id-166' filepath='../../include/zfs_prop.h' line='44' column='1' id='type-id-167'/>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' filepath='../../include/zfs_prop.h' line='40' column='1' id='type-id-166'>
      <underlying-type type-id='type-id-35'/>
      <enumerator name='PROP_TYPE_NUMBER' value='0'/>
      <enumerator name='PROP_TYPE_STRING' value='1'/>
      <enumerator name='PROP_TYPE_INDEX' value='2'/>
    </enum-decl>
    <typedef-decl name='zprop_desc_t' type-id='type-id-168' filepath='../../include/zfs_prop.h' line='85' column='1' id='type-id-169'/>
    <class-decl name='__anonymous_struct__' size-in-bits='704' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-169' visibility='default' filepath='../../include/zfs_prop.h' line='67' column='1' id='type-id-168'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='pd_name' type-id='type-id-4' visibility='default' filepath='../../include/zfs_prop.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='pd_propnum' type-id='type-id-6' visibility='default' filepath='../../include/zfs_prop.h' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='pd_proptype' type-id='type-id-167' visibility='default' filepath='../../include/zfs_prop.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='pd_strdefault' type-id='type-id-4' visibility='default' filepath='../../include/zfs_prop.h' line='71' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='pd_numdefault' type-id='type-id-52' visibility='default' filepath='../../include/zfs_prop.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='pd_attr' type-id='type-id-170' visibility='default' filepath='../../include/zfs_prop.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='pd_types' type-id='type-id-6' visibility='default' filepath='../../include/zfs_prop.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='pd_values' type-id='type-id-4' visibility='default' filepath='../../include/zfs_prop.h' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='pd_colname' type-id='type-id-4' visibility='default' filepath='../../include/zfs_prop.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='pd_rightalign' type-id='type-id-31' visibility='default' filepath='../../include/zfs_prop.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='pd_visible' type-id='type-id-31' visibility='default' filepath='../../include/zfs_prop.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='pd_zfs_mod_supported' type-id='type-id-31' visibility='default' filepath='../../include/zfs_prop.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='pd_table' type-id='type-id-171' visibility='default' filepath='../../include/zfs_prop.h' line='82' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='pd_table_size' type-id='type-id-73' visibility='default' filepath='../../include/zfs_prop.h' line='84' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='zprop_attr_t' type-id='type-id-172' filepath='../../include/zfs_prop.h' line='60' column='1' id='type-id-170'/>
    <enum-decl name='__anonymous_enum__1' is-anonymous='yes' filepath='../../include/zfs_prop.h' line='46' column='1' id='type-id-172'>
      <underlying-type type-id='type-id-35'/>
      <enumerator name='PROP_DEFAULT' value='0'/>
      <enumerator name='PROP_READONLY' value='1'/>
      <enumerator name='PROP_INHERIT' value='2'/>
      <enumerator name='PROP_ONETIME' value='3'/>
      <enumerator name='PROP_ONETIME_DEFAULT' value='4'/>
    </enum-decl>
    <typedef-decl name='zprop_index_t' type-id='type-id-173' filepath='../../include/zfs_prop.h' line='65' column='1' id='type-id-174'/>
    <class-decl name='zfs_index' size-in-bits='128' is-struct='yes' visibility='default' filepath='../../include/zfs_prop.h' line='62' column='1' id='type-id-173'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='pi_name' type-id='type-id-4' visibility='default' filepath='../../include/zfs_prop.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='pi_value' type-id='type-id-52' visibility='default' filepath='../../include/zfs_prop.h' line='64' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-4' size-in-bits='64' id='type-id-175'/>
    <qualified-type-def type-id='type-id-174' const='yes' id='type-id-176'/>
    <pointer-type-def type-id='type-id-176' size-in-bits='64' id='type-id-171'/>
    <pointer-type-def type-id='type-id-169' size-in-bits='64' id='type-id-177'/>
    <var-decl name='zfs_userquota_prop_prefixes' type-id='type-id-164' mangled-name='zfs_userquota_prop_prefixes' visibility='default' filepath='../../include/sys/fs/zfs.h' line='210' column='1' elf-symbol-id='zfs_userquota_prop_prefixes'/>
    <function-decl name='zfs_prop_align_right' mangled-name='zfs_prop_align_right' filepath='../../module/zcommon/zfs_prop.c' line='1001' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_align_right'>
      <parameter type-id='type-id-178' name='prop' filepath='../../module/zcommon/zfs_prop.c' line='1001' column='1'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='zfs_prop_column_name' mangled-name='zfs_prop_column_name' filepath='../../module/zcommon/zfs_prop.c' line='991' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_column_name'>
      <parameter type-id='type-id-178' name='prop' filepath='../../module/zcommon/zfs_prop.c' line='991' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zfs_prop_is_string' mangled-name='zfs_prop_is_string' filepath='../../module/zcommon/zfs_prop.c' line='980' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_is_string'>
      <parameter type-id='type-id-178' name='prop' filepath='../../module/zcommon/zfs_prop.c' line='980' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_prop_values' mangled-name='zfs_prop_values' filepath='../../module/zcommon/zfs_prop.c' line='969' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_values'>
      <parameter type-id='type-id-178' name='prop' filepath='../../module/zcommon/zfs_prop.c' line='969' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zfs_prop_valid_keylocation' mangled-name='zfs_prop_valid_keylocation' filepath='../../module/zcommon/zfs_prop.c' line='948' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_valid_keylocation'>
      <parameter type-id='type-id-4' name='str' filepath='../../module/zcommon/zfs_prop.c' line='948' column='1'/>
      <parameter type-id='type-id-31' name='encrypted' filepath='../../module/zcommon/zfs_prop.c' line='948' column='1'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='zfs_prop_encryption_key_param' mangled-name='zfs_prop_encryption_key_param' filepath='../../module/zcommon/zfs_prop.c' line='932' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_encryption_key_param'>
      <parameter type-id='type-id-178' name='prop' filepath='../../module/zcommon/zfs_prop.c' line='932' column='1'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='zfs_prop_inheritable' mangled-name='zfs_prop_inheritable' filepath='../../module/zcommon/zfs_prop.c' line='921' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_inheritable'>
      <parameter type-id='type-id-178' name='prop' filepath='../../module/zcommon/zfs_prop.c' line='921' column='1'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='zfs_prop_to_name' mangled-name='zfs_prop_to_name' filepath='../../module/zcommon/zfs_prop.c' line='912' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_to_name'>
      <parameter type-id='type-id-178' name='prop' filepath='../../module/zcommon/zfs_prop.c' line='912' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zfs_prop_default_numeric' mangled-name='zfs_prop_default_numeric' filepath='../../module/zcommon/zfs_prop.c' line='902' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_default_numeric'>
      <parameter type-id='type-id-178' name='prop' filepath='../../module/zcommon/zfs_prop.c' line='902' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='zfs_prop_default_string' mangled-name='zfs_prop_default_string' filepath='../../module/zcommon/zfs_prop.c' line='896' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_default_string'>
      <parameter type-id='type-id-178' name='prop' filepath='../../module/zcommon/zfs_prop.c' line='896' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zfs_prop_setonce' mangled-name='zfs_prop_setonce' filepath='../../module/zcommon/zfs_prop.c' line='889' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_setonce'>
      <parameter type-id='type-id-178' name='prop' filepath='../../module/zcommon/zfs_prop.c' line='889' column='1'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='zfs_prop_visible' mangled-name='zfs_prop_visible' filepath='../../module/zcommon/zfs_prop.c' line='879' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_visible'>
      <parameter type-id='type-id-178' name='prop' filepath='../../module/zcommon/zfs_prop.c' line='879' column='1'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='zfs_prop_readonly' mangled-name='zfs_prop_readonly' filepath='../../module/zcommon/zfs_prop.c' line='868' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_readonly'>
      <parameter type-id='type-id-178' name='prop' filepath='../../module/zcommon/zfs_prop.c' line='868' column='1'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='zfs_prop_get_type' mangled-name='zfs_prop_get_type' filepath='../../module/zcommon/zfs_prop.c' line='859' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_get_type'>
      <parameter type-id='type-id-178' name='prop' filepath='../../module/zcommon/zfs_prop.c' line='859' column='1'/>
      <return type-id='type-id-167'/>
    </function-decl>
    <function-decl name='zfs_prop_valid_for_type' mangled-name='zfs_prop_valid_for_type' filepath='../../module/zcommon/zfs_prop.c' line='853' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_valid_for_type'>
      <parameter type-id='type-id-6' name='prop' filepath='../../module/zcommon/zfs_prop.c' line='853' column='1'/>
      <parameter type-id='type-id-179' name='types' filepath='../../module/zcommon/zfs_prop.c' line='853' column='1'/>
      <parameter type-id='type-id-31' name='headcheck' filepath='../../module/zcommon/zfs_prop.c' line='853' column='1'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='zfs_prop_random_value' mangled-name='zfs_prop_random_value' filepath='../../module/zcommon/zfs_prop.c' line='844' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_random_value'>
      <parameter type-id='type-id-178' name='prop' filepath='../../module/zcommon/zfs_prop.c' line='844' column='1'/>
      <parameter type-id='type-id-52' name='seed' filepath='../../module/zcommon/zfs_prop.c' line='844' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='zfs_prop_index_to_string' mangled-name='zfs_prop_index_to_string' filepath='../../module/zcommon/zfs_prop.c' line='838' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_index_to_string'>
      <parameter type-id='type-id-178' name='prop' filepath='../../module/zcommon/zfs_prop.c' line='838' column='1'/>
      <parameter type-id='type-id-52' name='index' filepath='../../module/zcommon/zfs_prop.c' line='838' column='1'/>
      <parameter type-id='type-id-175' name='string' filepath='../../module/zcommon/zfs_prop.c' line='838' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_prop_string_to_index' mangled-name='zfs_prop_string_to_index' filepath='../../module/zcommon/zfs_prop.c' line='832' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_string_to_index'>
      <parameter type-id='type-id-178' name='prop' filepath='../../module/zcommon/zfs_prop.c' line='832' column='1'/>
      <parameter type-id='type-id-4' name='string' filepath='../../module/zcommon/zfs_prop.c' line='832' column='1'/>
      <parameter type-id='type-id-180' name='index' filepath='../../module/zcommon/zfs_prop.c' line='832' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_prop_written' mangled-name='zfs_prop_written' filepath='../../module/zcommon/zfs_prop.c' line='819' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_written'>
      <parameter type-id='type-id-4' name='name' filepath='../../module/zcommon/zfs_prop.c' line='819' column='1'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='zfs_prop_userquota' mangled-name='zfs_prop_userquota' filepath='../../module/zcommon/zfs_prop.c' line='799' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_userquota'>
      <parameter type-id='type-id-4' name='name' filepath='../../module/zcommon/zfs_prop.c' line='799' column='1'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='zfs_prop_user' mangled-name='zfs_prop_user' filepath='../../module/zcommon/zfs_prop.c' line='773' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_user'>
      <parameter type-id='type-id-4' name='name' filepath='../../module/zcommon/zfs_prop.c' line='773' column='1'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='zfs_name_to_prop' mangled-name='zfs_name_to_prop' filepath='../../module/zcommon/zfs_prop.c' line='752' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_name_to_prop'>
      <parameter type-id='type-id-4' name='propname' filepath='../../module/zcommon/zfs_prop.c' line='752' column='1'/>
      <return type-id='type-id-178'/>
    </function-decl>
    <function-decl name='zfs_prop_delegatable' mangled-name='zfs_prop_delegatable' filepath='../../module/zcommon/zfs_prop.c' line='737' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_delegatable'>
      <parameter type-id='type-id-178' name='prop' filepath='../../module/zcommon/zfs_prop.c' line='737' column='1'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='zfs_prop_init' mangled-name='zfs_prop_init' filepath='../../module/zcommon/zfs_prop.c' line='75' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_init'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='zfs_prop_get_table' mangled-name='zfs_prop_get_table' filepath='../../module/zcommon/zfs_prop.c' line='69' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_get_table'>
      <return type-id='type-id-177'/>
    </function-decl>
    <function-decl name='zprop_random_value' mangled-name='zprop_random_value' filepath='../../include/zfs_prop.h' line='124' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='zprop_index_to_string' mangled-name='zprop_index_to_string' filepath='../../include/zfs_prop.h' line='123' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='zprop_register_index' mangled-name='zprop_register_index' filepath='../../include/zfs_prop.h' line='112' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='zprop_register_string' mangled-name='zprop_register_string' filepath='../../include/zfs_prop.h' line='108' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='zprop_register_number' mangled-name='zprop_register_number' filepath='../../include/zfs_prop.h' line='110' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='zprop_register_hidden' mangled-name='zprop_register_hidden' filepath='../../include/zfs_prop.h' line='114' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='zprop_register_impl' mangled-name='zprop_register_impl' filepath='../../include/zfs_prop.h' line='105' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
    <typedef-decl name='zfs_prop_t' type-id='type-id-181' filepath='../../include/sys/fs/zfs.h' line='192' column='1' id='type-id-178'/>
    <typedef-decl name='zfs_type_t' type-id='type-id-182' filepath='../../include/sys/fs/zfs.h' line='58' column='1' id='type-id-179'/>
    <pointer-type-def type-id='type-id-52' size-in-bits='64' id='type-id-180'/>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' filepath='../../include/sys/fs/zfs.h' line='91' column='1' id='type-id-181'>
      <underlying-type type-id='type-id-35'/>
      <enumerator name='ZPROP_CONT' value='-2'/>
      <enumerator name='ZPROP_INVAL' value='-1'/>
      <enumerator name='ZFS_PROP_TYPE' value='0'/>
      <enumerator name='ZFS_PROP_CREATION' value='1'/>
      <enumerator name='ZFS_PROP_USED' value='2'/>
      <enumerator name='ZFS_PROP_AVAILABLE' value='3'/>
      <enumerator name='ZFS_PROP_REFERENCED' value='4'/>
      <enumerator name='ZFS_PROP_COMPRESSRATIO' value='5'/>
      <enumerator name='ZFS_PROP_MOUNTED' value='6'/>
      <enumerator name='ZFS_PROP_ORIGIN' value='7'/>
      <enumerator name='ZFS_PROP_QUOTA' value='8'/>
      <enumerator name='ZFS_PROP_RESERVATION' value='9'/>
      <enumerator name='ZFS_PROP_VOLSIZE' value='10'/>
      <enumerator name='ZFS_PROP_VOLBLOCKSIZE' value='11'/>
      <enumerator name='ZFS_PROP_RECORDSIZE' value='12'/>
      <enumerator name='ZFS_PROP_MOUNTPOINT' value='13'/>
      <enumerator name='ZFS_PROP_SHARENFS' value='14'/>
      <enumerator name='ZFS_PROP_CHECKSUM' value='15'/>
      <enumerator name='ZFS_PROP_COMPRESSION' value='16'/>
      <enumerator name='ZFS_PROP_ATIME' value='17'/>
      <enumerator name='ZFS_PROP_DEVICES' value='18'/>
      <enumerator name='ZFS_PROP_EXEC' value='19'/>
      <enumerator name='ZFS_PROP_SETUID' value='20'/>
      <enumerator name='ZFS_PROP_READONLY' value='21'/>
      <enumerator name='ZFS_PROP_ZONED' value='22'/>
      <enumerator name='ZFS_PROP_SNAPDIR' value='23'/>
      <enumerator name='ZFS_PROP_ACLMODE' value='24'/>
      <enumerator name='ZFS_PROP_ACLINHERIT' value='25'/>
      <enumerator name='ZFS_PROP_CREATETXG' value='26'/>
      <enumerator name='ZFS_PROP_NAME' value='27'/>
      <enumerator name='ZFS_PROP_CANMOUNT' value='28'/>
      <enumerator name='ZFS_PROP_ISCSIOPTIONS' value='29'/>
      <enumerator name='ZFS_PROP_XATTR' value='30'/>
      <enumerator name='ZFS_PROP_NUMCLONES' value='31'/>
      <enumerator name='ZFS_PROP_COPIES' value='32'/>
      <enumerator name='ZFS_PROP_VERSION' value='33'/>
      <enumerator name='ZFS_PROP_UTF8ONLY' value='34'/>
      <enumerator name='ZFS_PROP_NORMALIZE' value='35'/>
      <enumerator name='ZFS_PROP_CASE' value='36'/>
      <enumerator name='ZFS_PROP_VSCAN' value='37'/>
      <enumerator name='ZFS_PROP_NBMAND' value='38'/>
      <enumerator name='ZFS_PROP_SHARESMB' value='39'/>
      <enumerator name='ZFS_PROP_REFQUOTA' value='40'/>
      <enumerator name='ZFS_PROP_REFRESERVATION' value='41'/>
      <enumerator name='ZFS_PROP_GUID' value='42'/>
      <enumerator name='ZFS_PROP_PRIMARYCACHE' value='43'/>
      <enumerator name='ZFS_PROP_SECONDARYCACHE' value='44'/>
      <enumerator name='ZFS_PROP_USEDSNAP' value='45'/>
      <enumerator name='ZFS_PROP_USEDDS' value='46'/>
      <enumerator name='ZFS_PROP_USEDCHILD' value='47'/>
      <enumerator name='ZFS_PROP_USEDREFRESERV' value='48'/>
      <enumerator name='ZFS_PROP_USERACCOUNTING' value='49'/>
      <enumerator name='ZFS_PROP_STMF_SHAREINFO' value='50'/>
      <enumerator name='ZFS_PROP_DEFER_DESTROY' value='51'/>
      <enumerator name='ZFS_PROP_USERREFS' value='52'/>
      <enumerator name='ZFS_PROP_LOGBIAS' value='53'/>
      <enumerator name='ZFS_PROP_UNIQUE' value='54'/>
      <enumerator name='ZFS_PROP_OBJSETID' value='55'/>
      <enumerator name='ZFS_PROP_DEDUP' value='56'/>
      <enumerator name='ZFS_PROP_MLSLABEL' value='57'/>
      <enumerator name='ZFS_PROP_SYNC' value='58'/>
      <enumerator name='ZFS_PROP_DNODESIZE' value='59'/>
      <enumerator name='ZFS_PROP_REFRATIO' value='60'/>
      <enumerator name='ZFS_PROP_WRITTEN' value='61'/>
      <enumerator name='ZFS_PROP_CLONES' value='62'/>
      <enumerator name='ZFS_PROP_LOGICALUSED' value='63'/>
      <enumerator name='ZFS_PROP_LOGICALREFERENCED' value='64'/>
      <enumerator name='ZFS_PROP_INCONSISTENT' value='65'/>
      <enumerator name='ZFS_PROP_VOLMODE' value='66'/>
      <enumerator name='ZFS_PROP_FILESYSTEM_LIMIT' value='67'/>
      <enumerator name='ZFS_PROP_SNAPSHOT_LIMIT' value='68'/>
      <enumerator name='ZFS_PROP_FILESYSTEM_COUNT' value='69'/>
      <enumerator name='ZFS_PROP_SNAPSHOT_COUNT' value='70'/>
      <enumerator name='ZFS_PROP_SNAPDEV' value='71'/>
      <enumerator name='ZFS_PROP_ACLTYPE' value='72'/>
      <enumerator name='ZFS_PROP_SELINUX_CONTEXT' value='73'/>
      <enumerator name='ZFS_PROP_SELINUX_FSCONTEXT' value='74'/>
      <enumerator name='ZFS_PROP_SELINUX_DEFCONTEXT' value='75'/>
      <enumerator name='ZFS_PROP_SELINUX_ROOTCONTEXT' value='76'/>
      <enumerator name='ZFS_PROP_RELATIME' value='77'/>
      <enumerator name='ZFS_PROP_REDUNDANT_METADATA' value='78'/>
      <enumerator name='ZFS_PROP_OVERLAY' value='79'/>
      <enumerator name='ZFS_PROP_PREV_SNAP' value='80'/>
      <enumerator name='ZFS_PROP_RECEIVE_RESUME_TOKEN' value='81'/>
      <enumerator name='ZFS_PROP_ENCRYPTION' value='82'/>
      <enumerator name='ZFS_PROP_KEYLOCATION' value='83'/>
      <enumerator name='ZFS_PROP_KEYFORMAT' value='84'/>
      <enumerator name='ZFS_PROP_PBKDF2_SALT' value='85'/>
      <enumerator name='ZFS_PROP_PBKDF2_ITERS' value='86'/>
      <enumerator name='ZFS_PROP_ENCRYPTION_ROOT' value='87'/>
      <enumerator name='ZFS_PROP_KEY_GUID' value='88'/>
      <enumerator name='ZFS_PROP_KEYSTATUS' value='89'/>
      <enumerator name='ZFS_PROP_REMAPTXG' value='90'/>
      <enumerator name='ZFS_PROP_SPECIAL_SMALL_BLOCKS' value='91'/>
      <enumerator name='ZFS_PROP_IVSET_GUID' value='92'/>
      <enumerator name='ZFS_PROP_REDACTED' value='93'/>
      <enumerator name='ZFS_PROP_REDACT_SNAPS' value='94'/>
      <enumerator name='ZFS_PROP_XATTR_COMPAT' value='95'/>
      <enumerator name='ZFS_PROP_XATTR_FALLBACK' value='96'/>
      <enumerator name='ZFS_NUM_PROPS' value='97'/>
    </enum-decl>
    <enum-decl name='__anonymous_enum__2' is-anonymous='yes' filepath='../../include/sys/fs/zfs.h' line='52' column='1' id='type-id-182'>
      <underlying-type type-id='type-id-35'/>
      <enumerator name='ZFS_TYPE_FILESYSTEM' value='1'/>
      <enumerator name='ZFS_TYPE_SNAPSHOT' value='2'/>
      <enumerator name='ZFS_TYPE_VOLUME' value='4'/>
      <enumerator name='ZFS_TYPE_POOL' value='8'/>
      <enumerator name='ZFS_TYPE_BOOKMARK' value='16'/>
    </enum-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../../module/zcommon/zpool_prop.c' comp-dir-path='/home/ryan/zfs/lib/libzfs' language='LANG_C99'>
    <function-decl name='zpool_prop_align_right' mangled-name='zpool_prop_align_right' filepath='../../module/zcommon/zpool_prop.c' line='257' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_prop_align_right'>
      <parameter type-id='type-id-183' name='prop' filepath='../../module/zcommon/zpool_prop.c' line='257' column='1'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='zpool_prop_column_name' mangled-name='zpool_prop_column_name' filepath='../../module/zcommon/zpool_prop.c' line='251' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_prop_column_name'>
      <parameter type-id='type-id-183' name='prop' filepath='../../module/zcommon/zpool_prop.c' line='251' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zpool_prop_values' mangled-name='zpool_prop_values' filepath='../../module/zcommon/zpool_prop.c' line='245' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_prop_values'>
      <parameter type-id='type-id-183' name='prop' filepath='../../module/zcommon/zpool_prop.c' line='245' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zpool_prop_random_value' mangled-name='zpool_prop_random_value' filepath='../../module/zcommon/zpool_prop.c' line='236' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_prop_random_value'>
      <parameter type-id='type-id-183' name='prop' filepath='../../module/zcommon/zpool_prop.c' line='236' column='1'/>
      <parameter type-id='type-id-52' name='seed' filepath='../../module/zcommon/zpool_prop.c' line='236' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='zpool_prop_index_to_string' mangled-name='zpool_prop_index_to_string' filepath='../../module/zcommon/zpool_prop.c' line='229' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_prop_index_to_string'>
      <parameter type-id='type-id-183' name='prop' filepath='../../module/zcommon/zpool_prop.c' line='229' column='1'/>
      <parameter type-id='type-id-52' name='index' filepath='../../module/zcommon/zpool_prop.c' line='229' column='1'/>
      <parameter type-id='type-id-175' name='string' filepath='../../module/zcommon/zpool_prop.c' line='230' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zpool_prop_string_to_index' mangled-name='zpool_prop_string_to_index' filepath='../../module/zcommon/zpool_prop.c' line='222' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_prop_string_to_index'>
      <parameter type-id='type-id-183' name='prop' filepath='../../module/zcommon/zpool_prop.c' line='222' column='1'/>
      <parameter type-id='type-id-4' name='string' filepath='../../module/zcommon/zpool_prop.c' line='222' column='1'/>
      <parameter type-id='type-id-180' name='index' filepath='../../module/zcommon/zpool_prop.c' line='223' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zpool_prop_unsupported' mangled-name='zpool_prop_unsupported' filepath='../../module/zcommon/zpool_prop.c' line='215' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_prop_unsupported'>
      <parameter type-id='type-id-4' name='name' filepath='../../module/zcommon/zpool_prop.c' line='215' column='1'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='zpool_prop_feature' mangled-name='zpool_prop_feature' filepath='../../module/zcommon/zpool_prop.c' line='205' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_prop_feature'>
      <parameter type-id='type-id-4' name='name' filepath='../../module/zcommon/zpool_prop.c' line='205' column='1'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='zpool_prop_default_numeric' mangled-name='zpool_prop_default_numeric' filepath='../../module/zcommon/zpool_prop.c' line='196' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_prop_default_numeric'>
      <parameter type-id='type-id-183' name='prop' filepath='../../module/zcommon/zpool_prop.c' line='196' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='zpool_prop_default_string' mangled-name='zpool_prop_default_string' filepath='../../module/zcommon/zpool_prop.c' line='190' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_prop_default_string'>
      <parameter type-id='type-id-183' name='prop' filepath='../../module/zcommon/zpool_prop.c' line='190' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zpool_prop_setonce' mangled-name='zpool_prop_setonce' filepath='../../module/zcommon/zpool_prop.c' line='184' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_prop_setonce'>
      <parameter type-id='type-id-183' name='prop' filepath='../../module/zcommon/zpool_prop.c' line='184' column='1'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='zpool_prop_readonly' mangled-name='zpool_prop_readonly' filepath='../../module/zcommon/zpool_prop.c' line='178' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_prop_readonly'>
      <parameter type-id='type-id-183' name='prop' filepath='../../module/zcommon/zpool_prop.c' line='178' column='1'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='zpool_prop_get_type' mangled-name='zpool_prop_get_type' filepath='../../module/zcommon/zpool_prop.c' line='172' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_prop_get_type'>
      <parameter type-id='type-id-183' name='prop' filepath='../../module/zcommon/zpool_prop.c' line='172' column='1'/>
      <return type-id='type-id-167'/>
    </function-decl>
    <function-decl name='zpool_prop_to_name' mangled-name='zpool_prop_to_name' filepath='../../module/zcommon/zpool_prop.c' line='166' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_prop_to_name'>
      <parameter type-id='type-id-183' name='prop' filepath='../../module/zcommon/zpool_prop.c' line='166' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zpool_name_to_prop' mangled-name='zpool_name_to_prop' filepath='../../module/zcommon/zpool_prop.c' line='156' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_name_to_prop'>
      <parameter type-id='type-id-4' name='propname' filepath='../../module/zcommon/zpool_prop.c' line='156' column='1'/>
      <return type-id='type-id-183'/>
    </function-decl>
    <function-decl name='zpool_prop_init' mangled-name='zpool_prop_init' filepath='../../module/zcommon/zpool_prop.c' line='51' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_prop_init'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='zpool_prop_get_table' mangled-name='zpool_prop_get_table' filepath='../../module/zcommon/zpool_prop.c' line='45' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_prop_get_table'>
      <return type-id='type-id-177'/>
    </function-decl>
    <typedef-decl name='zpool_prop_t' type-id='type-id-184' filepath='../../include/sys/fs/zfs.h' line='253' column='1' id='type-id-183'/>
    <enum-decl name='__anonymous_enum__2' is-anonymous='yes' filepath='../../include/sys/fs/zfs.h' line='217' column='1' id='type-id-184'>
      <underlying-type type-id='type-id-35'/>
      <enumerator name='ZPOOL_PROP_INVAL' value='-1'/>
      <enumerator name='ZPOOL_PROP_NAME' value='0'/>
      <enumerator name='ZPOOL_PROP_SIZE' value='1'/>
      <enumerator name='ZPOOL_PROP_CAPACITY' value='2'/>
      <enumerator name='ZPOOL_PROP_ALTROOT' value='3'/>
      <enumerator name='ZPOOL_PROP_HEALTH' value='4'/>
      <enumerator name='ZPOOL_PROP_GUID' value='5'/>
      <enumerator name='ZPOOL_PROP_VERSION' value='6'/>
      <enumerator name='ZPOOL_PROP_BOOTFS' value='7'/>
      <enumerator name='ZPOOL_PROP_DELEGATION' value='8'/>
      <enumerator name='ZPOOL_PROP_AUTOREPLACE' value='9'/>
      <enumerator name='ZPOOL_PROP_CACHEFILE' value='10'/>
      <enumerator name='ZPOOL_PROP_FAILUREMODE' value='11'/>
      <enumerator name='ZPOOL_PROP_LISTSNAPS' value='12'/>
      <enumerator name='ZPOOL_PROP_AUTOEXPAND' value='13'/>
      <enumerator name='ZPOOL_PROP_DEDUPDITTO' value='14'/>
      <enumerator name='ZPOOL_PROP_DEDUPRATIO' value='15'/>
      <enumerator name='ZPOOL_PROP_FREE' value='16'/>
      <enumerator name='ZPOOL_PROP_ALLOCATED' value='17'/>
      <enumerator name='ZPOOL_PROP_READONLY' value='18'/>
      <enumerator name='ZPOOL_PROP_ASHIFT' value='19'/>
      <enumerator name='ZPOOL_PROP_COMMENT' value='20'/>
      <enumerator name='ZPOOL_PROP_EXPANDSZ' value='21'/>
      <enumerator name='ZPOOL_PROP_FREEING' value='22'/>
      <enumerator name='ZPOOL_PROP_FRAGMENTATION' value='23'/>
      <enumerator name='ZPOOL_PROP_LEAKED' value='24'/>
      <enumerator name='ZPOOL_PROP_MAXBLOCKSIZE' value='25'/>
      <enumerator name='ZPOOL_PROP_TNAME' value='26'/>
      <enumerator name='ZPOOL_PROP_MAXDNODESIZE' value='27'/>
      <enumerator name='ZPOOL_PROP_MULTIHOST' value='28'/>
      <enumerator name='ZPOOL_PROP_CHECKPOINT' value='29'/>
      <enumerator name='ZPOOL_PROP_LOAD_GUID' value='30'/>
      <enumerator name='ZPOOL_PROP_AUTOTRIM' value='31'/>
      <enumerator name='ZPOOL_PROP_COMPATIBILITY' value='32'/>
      <enumerator name='ZPOOL_NUM_PROPS' value='33'/>
    </enum-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../../module/zcommon/zprop_common.c' comp-dir-path='/home/ryan/zfs/lib/libzfs' language='LANG_C99'>
    <function-decl name='zprop_width' mangled-name='zprop_width' filepath='../../module/zcommon/zprop_common.c' line='401' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zprop_width'>
      <parameter type-id='type-id-6' name='prop' filepath='../../module/zcommon/zprop_common.c' line='401' column='1'/>
      <parameter type-id='type-id-185' name='fixed' filepath='../../module/zcommon/zprop_common.c' line='401' column='1'/>
      <parameter type-id='type-id-179' name='type' filepath='../../module/zcommon/zprop_common.c' line='401' column='1'/>
      <return type-id='type-id-73'/>
    </function-decl>
    <function-decl name='zprop_valid_for_type' mangled-name='zprop_valid_for_type' filepath='../../module/zcommon/zprop_common.c' line='380' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zprop_valid_for_type'>
      <parameter type-id='type-id-6' name='prop' filepath='../../module/zcommon/zprop_common.c' line='380' column='1'/>
      <parameter type-id='type-id-179' name='type' filepath='../../module/zcommon/zprop_common.c' line='380' column='1'/>
      <parameter type-id='type-id-31' name='headcheck' filepath='../../module/zcommon/zprop_common.c' line='380' column='1'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='zprop_values' mangled-name='zprop_values' filepath='../../module/zcommon/zprop_common.c' line='360' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zprop_values'>
      <parameter type-id='type-id-6' name='prop' filepath='../../module/zcommon/zprop_common.c' line='360' column='1'/>
      <parameter type-id='type-id-179' name='type' filepath='../../module/zcommon/zprop_common.c' line='360' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zprop_random_value' mangled-name='zprop_random_value' filepath='../../module/zcommon/zprop_common.c' line='344' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zprop_random_value'>
      <parameter type-id='type-id-6' name='prop' filepath='../../module/zcommon/zprop_common.c' line='344' column='1'/>
      <parameter type-id='type-id-52' name='seed' filepath='../../module/zcommon/zprop_common.c' line='344' column='1'/>
      <parameter type-id='type-id-179' name='type' filepath='../../module/zcommon/zprop_common.c' line='344' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='zprop_index_to_string' mangled-name='zprop_index_to_string' filepath='../../module/zcommon/zprop_common.c' line='315' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zprop_index_to_string'>
      <parameter type-id='type-id-6' name='prop' filepath='../../module/zcommon/zprop_common.c' line='315' column='1'/>
      <parameter type-id='type-id-52' name='index' filepath='../../module/zcommon/zprop_common.c' line='315' column='1'/>
      <parameter type-id='type-id-175' name='string' filepath='../../module/zcommon/zprop_common.c' line='315' column='1'/>
      <parameter type-id='type-id-179' name='type' filepath='../../module/zcommon/zprop_common.c' line='316' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zprop_string_to_index' mangled-name='zprop_string_to_index' filepath='../../module/zcommon/zprop_common.c' line='289' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zprop_string_to_index'>
      <parameter type-id='type-id-6' name='prop' filepath='../../module/zcommon/zprop_common.c' line='289' column='1'/>
      <parameter type-id='type-id-4' name='string' filepath='../../module/zcommon/zprop_common.c' line='289' column='1'/>
      <parameter type-id='type-id-180' name='index' filepath='../../module/zcommon/zprop_common.c' line='289' column='1'/>
      <parameter type-id='type-id-179' name='type' filepath='../../module/zcommon/zprop_common.c' line='290' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zprop_name_to_prop' mangled-name='zprop_name_to_prop' filepath='../../module/zcommon/zprop_common.c' line='274' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zprop_name_to_prop'>
      <parameter type-id='type-id-4' name='propname' filepath='../../module/zcommon/zprop_common.c' line='274' column='1'/>
      <parameter type-id='type-id-179' name='type' filepath='../../module/zcommon/zprop_common.c' line='274' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zprop_iter_common' mangled-name='zprop_iter_common' filepath='../../module/zcommon/zprop_common.c' line='185' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zprop_iter_common'>
      <parameter type-id='type-id-186' name='func' filepath='../../module/zcommon/zprop_common.c' line='185' column='1'/>
      <parameter type-id='type-id-72' name='cb' filepath='../../module/zcommon/zprop_common.c' line='185' column='1'/>
      <parameter type-id='type-id-31' name='show_all' filepath='../../module/zcommon/zprop_common.c' line='185' column='1'/>
      <parameter type-id='type-id-31' name='ordered' filepath='../../module/zcommon/zprop_common.c' line='186' column='1'/>
      <parameter type-id='type-id-179' name='type' filepath='../../module/zcommon/zprop_common.c' line='186' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zprop_register_hidden' mangled-name='zprop_register_hidden' filepath='../../module/zcommon/zprop_common.c' line='150' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zprop_register_hidden'>
      <parameter type-id='type-id-6' name='prop' filepath='../../module/zcommon/zprop_common.c' line='150' column='1'/>
      <parameter type-id='type-id-4' name='name' filepath='../../module/zcommon/zprop_common.c' line='150' column='1'/>
      <parameter type-id='type-id-167' name='type' filepath='../../module/zcommon/zprop_common.c' line='150' column='1'/>
      <parameter type-id='type-id-170' name='attr' filepath='../../module/zcommon/zprop_common.c' line='151' column='1'/>
      <parameter type-id='type-id-6' name='objset_types' filepath='../../module/zcommon/zprop_common.c' line='151' column='1'/>
      <parameter type-id='type-id-4' name='colname' filepath='../../module/zcommon/zprop_common.c' line='151' column='1'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='zprop_register_index' mangled-name='zprop_register_index' filepath='../../module/zcommon/zprop_common.c' line='141' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zprop_register_index'>
      <parameter type-id='type-id-6' name='prop' filepath='../../module/zcommon/zprop_common.c' line='141' column='1'/>
      <parameter type-id='type-id-4' name='name' filepath='../../module/zcommon/zprop_common.c' line='141' column='1'/>
      <parameter type-id='type-id-52' name='def' filepath='../../module/zcommon/zprop_common.c' line='141' column='1'/>
      <parameter type-id='type-id-170' name='attr' filepath='../../module/zcommon/zprop_common.c' line='142' column='1'/>
      <parameter type-id='type-id-6' name='objset_types' filepath='../../module/zcommon/zprop_common.c' line='142' column='1'/>
      <parameter type-id='type-id-4' name='values' filepath='../../module/zcommon/zprop_common.c' line='142' column='1'/>
      <parameter type-id='type-id-4' name='colname' filepath='../../module/zcommon/zprop_common.c' line='143' column='1'/>
      <parameter type-id='type-id-171' name='idx_tbl' filepath='../../module/zcommon/zprop_common.c' line='143' column='1'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='zprop_register_number' mangled-name='zprop_register_number' filepath='../../module/zcommon/zprop_common.c' line='132' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zprop_register_number'>
      <parameter type-id='type-id-6' name='prop' filepath='../../module/zcommon/zprop_common.c' line='132' column='1'/>
      <parameter type-id='type-id-4' name='name' filepath='../../module/zcommon/zprop_common.c' line='132' column='1'/>
      <parameter type-id='type-id-52' name='def' filepath='../../module/zcommon/zprop_common.c' line='132' column='1'/>
      <parameter type-id='type-id-170' name='attr' filepath='../../module/zcommon/zprop_common.c' line='133' column='1'/>
      <parameter type-id='type-id-6' name='objset_types' filepath='../../module/zcommon/zprop_common.c' line='133' column='1'/>
      <parameter type-id='type-id-4' name='values' filepath='../../module/zcommon/zprop_common.c' line='133' column='1'/>
      <parameter type-id='type-id-4' name='colname' filepath='../../module/zcommon/zprop_common.c' line='134' column='1'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='zprop_register_string' mangled-name='zprop_register_string' filepath='../../module/zcommon/zprop_common.c' line='122' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zprop_register_string'>
      <parameter type-id='type-id-6' name='prop' filepath='../../module/zcommon/zprop_common.c' line='122' column='1'/>
      <parameter type-id='type-id-4' name='name' filepath='../../module/zcommon/zprop_common.c' line='122' column='1'/>
      <parameter type-id='type-id-4' name='def' filepath='../../module/zcommon/zprop_common.c' line='122' column='1'/>
      <parameter type-id='type-id-170' name='attr' filepath='../../module/zcommon/zprop_common.c' line='123' column='1'/>
      <parameter type-id='type-id-6' name='objset_types' filepath='../../module/zcommon/zprop_common.c' line='123' column='1'/>
      <parameter type-id='type-id-4' name='values' filepath='../../module/zcommon/zprop_common.c' line='123' column='1'/>
      <parameter type-id='type-id-4' name='colname' filepath='../../module/zcommon/zprop_common.c' line='124' column='1'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='zprop_register_impl' mangled-name='zprop_register_impl' filepath='../../module/zcommon/zprop_common.c' line='89' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zprop_register_impl'>
      <parameter type-id='type-id-6' name='prop' filepath='../../module/zcommon/zprop_common.c' line='89' column='1'/>
      <parameter type-id='type-id-4' name='name' filepath='../../module/zcommon/zprop_common.c' line='89' column='1'/>
      <parameter type-id='type-id-167' name='type' filepath='../../module/zcommon/zprop_common.c' line='89' column='1'/>
      <parameter type-id='type-id-52' name='numdefault' filepath='../../module/zcommon/zprop_common.c' line='90' column='1'/>
      <parameter type-id='type-id-4' name='strdefault' filepath='../../module/zcommon/zprop_common.c' line='90' column='1'/>
      <parameter type-id='type-id-170' name='attr' filepath='../../module/zcommon/zprop_common.c' line='90' column='1'/>
      <parameter type-id='type-id-6' name='objset_types' filepath='../../module/zcommon/zprop_common.c' line='91' column='1'/>
      <parameter type-id='type-id-4' name='values' filepath='../../module/zcommon/zprop_common.c' line='91' column='1'/>
      <parameter type-id='type-id-4' name='colname' filepath='../../module/zcommon/zprop_common.c' line='91' column='1'/>
      <parameter type-id='type-id-31' name='rightalign' filepath='../../module/zcommon/zprop_common.c' line='92' column='1'/>
      <parameter type-id='type-id-31' name='visible' filepath='../../module/zcommon/zprop_common.c' line='92' column='1'/>
      <parameter type-id='type-id-171' name='idx_tbl' filepath='../../module/zcommon/zprop_common.c' line='92' column='1'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='__ctype_tolower_loc' mangled-name='__ctype_tolower_loc' filepath='/usr/include/ctype.h' line='81' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='zfs_mod_supported' mangled-name='zfs_mod_supported' filepath='../../include/sys/zfs_sysfs.h' line='38' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
    <pointer-type-def type-id='type-id-31' size-in-bits='64' id='type-id-185'/>
    <typedef-decl name='zprop_func' type-id='type-id-187' filepath='../../include/sys/fs/zfs.h' line='289' column='1' id='type-id-186'/>
    <pointer-type-def type-id='type-id-188' size-in-bits='64' id='type-id-187'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='libzfs_changelist.c' comp-dir-path='/home/ryan/zfs/lib/libzfs' language='LANG_C99'>
    <array-type-def dimensions='1' type-id='type-id-189' size-in-bits='128' id='type-id-190'>
      <subrange length='2' type-id='type-id-37' id='type-id-47'/>
    </array-type-def>
    <type-decl name='char' size-in-bits='8' id='type-id-32'/>
    <array-type-def dimensions='1' type-id='type-id-32' size-in-bits='8192' id='type-id-191'>
      <subrange length='1024' type-id='type-id-37' id='type-id-192'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-32' size-in-bits='8' id='type-id-193'>
      <subrange length='1' type-id='type-id-37' id='type-id-194'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-32' size-in-bits='160' id='type-id-195'>
      <subrange length='20' type-id='type-id-37' id='type-id-196'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-32' size-in-bits='2048' id='type-id-197'>
      <subrange length='256' type-id='type-id-37' id='type-id-198'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-32' size-in-bits='320' id='type-id-199'>
      <subrange length='40' type-id='type-id-37' id='type-id-200'/>
    </array-type-def>
    <class-decl name='_IO_codecvt' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-201'/>
    <class-decl name='_IO_marker' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-202'/>
    <class-decl name='_IO_wide_data' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-203'/>
    <class-decl name='re_dfa_t' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-204'/>
    <class-decl name='uu_avl' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-205'/>
    <class-decl name='uu_avl_pool' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-206'/>
    <type-decl name='int' size-in-bits='32' id='type-id-6'/>
    <type-decl name='long int' size-in-bits='64' id='type-id-207'/>
    <type-decl name='long long int' size-in-bits='64' id='type-id-208'/>
    <type-decl name='short int' size-in-bits='16' id='type-id-209'/>
    <type-decl name='signed char' size-in-bits='8' id='type-id-210'/>
    <type-decl name='unnamed-enum-underlying-type-32' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='type-id-35'/>
    <type-decl name='unsigned char' size-in-bits='8' id='type-id-78'/>
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-77'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-37'/>
    <type-decl name='unsigned short int' size-in-bits='16' id='type-id-211'/>
    <type-decl name='void' id='type-id-30'/>
    <typedef-decl name='prop_changelist_t' type-id='type-id-212' filepath='../../include/libzfs_impl.h' line='174' column='1' id='type-id-213'/>
    <class-decl name='prop_changelist' size-in-bits='448' is-struct='yes' visibility='default' filepath='/home/ryan/zfs/lib/libzfs/libzfs_changelist.c' line='75' column='1' id='type-id-212'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cl_prop' type-id='type-id-178' visibility='default' filepath='/home/ryan/zfs/lib/libzfs/libzfs_changelist.c' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='cl_realprop' type-id='type-id-178' visibility='default' filepath='/home/ryan/zfs/lib/libzfs/libzfs_changelist.c' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='cl_shareprop' type-id='type-id-178' visibility='default' filepath='/home/ryan/zfs/lib/libzfs/libzfs_changelist.c' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='cl_pool' type-id='type-id-214' visibility='default' filepath='/home/ryan/zfs/lib/libzfs/libzfs_changelist.c' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='cl_tree' type-id='type-id-215' visibility='default' filepath='/home/ryan/zfs/lib/libzfs/libzfs_changelist.c' line='80' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='cl_waslegacy' type-id='type-id-31' visibility='default' filepath='/home/ryan/zfs/lib/libzfs/libzfs_changelist.c' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='cl_allchildren' type-id='type-id-31' visibility='default' filepath='/home/ryan/zfs/lib/libzfs/libzfs_changelist.c' line='82' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='cl_alldependents' type-id='type-id-31' visibility='default' filepath='/home/ryan/zfs/lib/libzfs/libzfs_changelist.c' line='83' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='cl_mflags' type-id='type-id-6' visibility='default' filepath='/home/ryan/zfs/lib/libzfs/libzfs_changelist.c' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='cl_gflags' type-id='type-id-6' visibility='default' filepath='/home/ryan/zfs/lib/libzfs/libzfs_changelist.c' line='85' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='cl_haszonedchild' type-id='type-id-31' visibility='default' filepath='/home/ryan/zfs/lib/libzfs/libzfs_changelist.c' line='86' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='zfs_prop_t' type-id='type-id-181' filepath='../../include/sys/fs/zfs.h' line='192' column='1' id='type-id-178'/>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' filepath='../../include/sys/fs/zfs.h' line='91' column='1' id='type-id-181'>
      <underlying-type type-id='type-id-35'/>
      <enumerator name='ZPROP_CONT' value='-2'/>
      <enumerator name='ZPROP_INVAL' value='-1'/>
      <enumerator name='ZFS_PROP_TYPE' value='0'/>
      <enumerator name='ZFS_PROP_CREATION' value='1'/>
      <enumerator name='ZFS_PROP_USED' value='2'/>
      <enumerator name='ZFS_PROP_AVAILABLE' value='3'/>
      <enumerator name='ZFS_PROP_REFERENCED' value='4'/>
      <enumerator name='ZFS_PROP_COMPRESSRATIO' value='5'/>
      <enumerator name='ZFS_PROP_MOUNTED' value='6'/>
      <enumerator name='ZFS_PROP_ORIGIN' value='7'/>
      <enumerator name='ZFS_PROP_QUOTA' value='8'/>
      <enumerator name='ZFS_PROP_RESERVATION' value='9'/>
      <enumerator name='ZFS_PROP_VOLSIZE' value='10'/>
      <enumerator name='ZFS_PROP_VOLBLOCKSIZE' value='11'/>
      <enumerator name='ZFS_PROP_RECORDSIZE' value='12'/>
      <enumerator name='ZFS_PROP_MOUNTPOINT' value='13'/>
      <enumerator name='ZFS_PROP_SHARENFS' value='14'/>
      <enumerator name='ZFS_PROP_CHECKSUM' value='15'/>
      <enumerator name='ZFS_PROP_COMPRESSION' value='16'/>
      <enumerator name='ZFS_PROP_ATIME' value='17'/>
      <enumerator name='ZFS_PROP_DEVICES' value='18'/>
      <enumerator name='ZFS_PROP_EXEC' value='19'/>
      <enumerator name='ZFS_PROP_SETUID' value='20'/>
      <enumerator name='ZFS_PROP_READONLY' value='21'/>
      <enumerator name='ZFS_PROP_ZONED' value='22'/>
      <enumerator name='ZFS_PROP_SNAPDIR' value='23'/>
      <enumerator name='ZFS_PROP_ACLMODE' value='24'/>
      <enumerator name='ZFS_PROP_ACLINHERIT' value='25'/>
      <enumerator name='ZFS_PROP_CREATETXG' value='26'/>
      <enumerator name='ZFS_PROP_NAME' value='27'/>
      <enumerator name='ZFS_PROP_CANMOUNT' value='28'/>
      <enumerator name='ZFS_PROP_ISCSIOPTIONS' value='29'/>
      <enumerator name='ZFS_PROP_XATTR' value='30'/>
      <enumerator name='ZFS_PROP_NUMCLONES' value='31'/>
      <enumerator name='ZFS_PROP_COPIES' value='32'/>
      <enumerator name='ZFS_PROP_VERSION' value='33'/>
      <enumerator name='ZFS_PROP_UTF8ONLY' value='34'/>
      <enumerator name='ZFS_PROP_NORMALIZE' value='35'/>
      <enumerator name='ZFS_PROP_CASE' value='36'/>
      <enumerator name='ZFS_PROP_VSCAN' value='37'/>
      <enumerator name='ZFS_PROP_NBMAND' value='38'/>
      <enumerator name='ZFS_PROP_SHARESMB' value='39'/>
      <enumerator name='ZFS_PROP_REFQUOTA' value='40'/>
      <enumerator name='ZFS_PROP_REFRESERVATION' value='41'/>
      <enumerator name='ZFS_PROP_GUID' value='42'/>
      <enumerator name='ZFS_PROP_PRIMARYCACHE' value='43'/>
      <enumerator name='ZFS_PROP_SECONDARYCACHE' value='44'/>
      <enumerator name='ZFS_PROP_USEDSNAP' value='45'/>
      <enumerator name='ZFS_PROP_USEDDS' value='46'/>
      <enumerator name='ZFS_PROP_USEDCHILD' value='47'/>
      <enumerator name='ZFS_PROP_USEDREFRESERV' value='48'/>
      <enumerator name='ZFS_PROP_USERACCOUNTING' value='49'/>
      <enumerator name='ZFS_PROP_STMF_SHAREINFO' value='50'/>
      <enumerator name='ZFS_PROP_DEFER_DESTROY' value='51'/>
      <enumerator name='ZFS_PROP_USERREFS' value='52'/>
      <enumerator name='ZFS_PROP_LOGBIAS' value='53'/>
      <enumerator name='ZFS_PROP_UNIQUE' value='54'/>
      <enumerator name='ZFS_PROP_OBJSETID' value='55'/>
      <enumerator name='ZFS_PROP_DEDUP' value='56'/>
      <enumerator name='ZFS_PROP_MLSLABEL' value='57'/>
      <enumerator name='ZFS_PROP_SYNC' value='58'/>
      <enumerator name='ZFS_PROP_DNODESIZE' value='59'/>
      <enumerator name='ZFS_PROP_REFRATIO' value='60'/>
      <enumerator name='ZFS_PROP_WRITTEN' value='61'/>
      <enumerator name='ZFS_PROP_CLONES' value='62'/>
      <enumerator name='ZFS_PROP_LOGICALUSED' value='63'/>
      <enumerator name='ZFS_PROP_LOGICALREFERENCED' value='64'/>
      <enumerator name='ZFS_PROP_INCONSISTENT' value='65'/>
      <enumerator name='ZFS_PROP_VOLMODE' value='66'/>
      <enumerator name='ZFS_PROP_FILESYSTEM_LIMIT' value='67'/>
      <enumerator name='ZFS_PROP_SNAPSHOT_LIMIT' value='68'/>
      <enumerator name='ZFS_PROP_FILESYSTEM_COUNT' value='69'/>
      <enumerator name='ZFS_PROP_SNAPSHOT_COUNT' value='70'/>
      <enumerator name='ZFS_PROP_SNAPDEV' value='71'/>
      <enumerator name='ZFS_PROP_ACLTYPE' value='72'/>
      <enumerator name='ZFS_PROP_SELINUX_CONTEXT' value='73'/>
      <enumerator name='ZFS_PROP_SELINUX_FSCONTEXT' value='74'/>
      <enumerator name='ZFS_PROP_SELINUX_DEFCONTEXT' value='75'/>
      <enumerator name='ZFS_PROP_SELINUX_ROOTCONTEXT' value='76'/>
      <enumerator name='ZFS_PROP_RELATIME' value='77'/>
      <enumerator name='ZFS_PROP_REDUNDANT_METADATA' value='78'/>
      <enumerator name='ZFS_PROP_OVERLAY' value='79'/>
      <enumerator name='ZFS_PROP_PREV_SNAP' value='80'/>
      <enumerator name='ZFS_PROP_RECEIVE_RESUME_TOKEN' value='81'/>
      <enumerator name='ZFS_PROP_ENCRYPTION' value='82'/>
      <enumerator name='ZFS_PROP_KEYLOCATION' value='83'/>
      <enumerator name='ZFS_PROP_KEYFORMAT' value='84'/>
      <enumerator name='ZFS_PROP_PBKDF2_SALT' value='85'/>
      <enumerator name='ZFS_PROP_PBKDF2_ITERS' value='86'/>
      <enumerator name='ZFS_PROP_ENCRYPTION_ROOT' value='87'/>
      <enumerator name='ZFS_PROP_KEY_GUID' value='88'/>
      <enumerator name='ZFS_PROP_KEYSTATUS' value='89'/>
      <enumerator name='ZFS_PROP_REMAPTXG' value='90'/>
      <enumerator name='ZFS_PROP_SPECIAL_SMALL_BLOCKS' value='91'/>
      <enumerator name='ZFS_PROP_IVSET_GUID' value='92'/>
      <enumerator name='ZFS_PROP_REDACTED' value='93'/>
      <enumerator name='ZFS_PROP_REDACT_SNAPS' value='94'/>
      <enumerator name='ZFS_PROP_XATTR_COMPAT' value='95'/>
      <enumerator name='ZFS_PROP_XATTR_FALLBACK' value='96'/>
      <enumerator name='ZFS_NUM_PROPS' value='97'/>
    </enum-decl>
    <typedef-decl name='uu_avl_pool_t' type-id='type-id-206' filepath='../../include/libuutil.h' line='287' column='1' id='type-id-216'/>
    <typedef-decl name='uu_avl_t' type-id='type-id-205' filepath='../../include/libuutil.h' line='288' column='1' id='type-id-217'/>
    <typedef-decl name='boolean_t' type-id='type-id-34' filepath='../../lib/libspl/include/sys/stdtypes.h' line='29' column='1' id='type-id-31'/>
    <enum-decl name='__anonymous_enum__1' is-anonymous='yes' filepath='../../lib/libspl/include/sys/stdtypes.h' line='26' column='1' id='type-id-34'>
      <underlying-type type-id='type-id-35'/>
      <enumerator name='B_FALSE' value='0'/>
      <enumerator name='B_TRUE' value='1'/>
    </enum-decl>
    <typedef-decl name='zfs_handle_t' type-id='type-id-218' filepath='../../include/libzfs.h' line='195' column='1' id='type-id-219'/>
    <class-decl name='zfs_handle' size-in-bits='4928' is-struct='yes' visibility='default' filepath='../../include/libzfs_impl.h' line='77' column='1' id='type-id-218'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='zfs_hdl' type-id='type-id-220' visibility='default' filepath='../../include/libzfs_impl.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='zpool_hdl' type-id='type-id-221' visibility='default' filepath='../../include/libzfs_impl.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='zfs_name' type-id='type-id-197' visibility='default' filepath='../../include/libzfs_impl.h' line='80' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='zfs_type' type-id='type-id-179' visibility='default' filepath='../../include/libzfs_impl.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2208'>
        <var-decl name='zfs_head_type' type-id='type-id-179' visibility='default' filepath='../../include/libzfs_impl.h' line='82' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <var-decl name='zfs_dmustats' type-id='type-id-222' visibility='default' filepath='../../include/libzfs_impl.h' line='83' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4544'>
        <var-decl name='zfs_props' type-id='type-id-97' visibility='default' filepath='../../include/libzfs_impl.h' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4608'>
        <var-decl name='zfs_user_props' type-id='type-id-97' visibility='default' filepath='../../include/libzfs_impl.h' line='85' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4672'>
        <var-decl name='zfs_recvd_props' type-id='type-id-97' visibility='default' filepath='../../include/libzfs_impl.h' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4736'>
        <var-decl name='zfs_mntcheck' type-id='type-id-31' visibility='default' filepath='../../include/libzfs_impl.h' line='87' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4800'>
        <var-decl name='zfs_mntopts' type-id='type-id-18' visibility='default' filepath='../../include/libzfs_impl.h' line='88' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4864'>
        <var-decl name='zfs_props_table' type-id='type-id-223' visibility='default' filepath='../../include/libzfs_impl.h' line='89' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='libzfs_handle' size-in-bits='20224' is-struct='yes' visibility='default' filepath='../../include/libzfs_impl.h' line='48' column='1' id='type-id-224'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='libzfs_error' type-id='type-id-6' visibility='default' filepath='../../include/libzfs_impl.h' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='libzfs_fd' type-id='type-id-6' visibility='default' filepath='../../include/libzfs_impl.h' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='libzfs_mnttab' type-id='type-id-225' visibility='default' filepath='../../include/libzfs_impl.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='libzfs_pool_handles' type-id='type-id-221' visibility='default' filepath='../../include/libzfs_impl.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='libzfs_ns_avlpool' type-id='type-id-214' visibility='default' filepath='../../include/libzfs_impl.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='libzfs_ns_avl' type-id='type-id-215' visibility='default' filepath='../../include/libzfs_impl.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='libzfs_ns_gen' type-id='type-id-52' visibility='default' filepath='../../include/libzfs_impl.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='libzfs_desc_active' type-id='type-id-6' visibility='default' filepath='../../include/libzfs_impl.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='libzfs_action' type-id='type-id-191' visibility='default' filepath='../../include/libzfs_impl.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8608'>
        <var-decl name='libzfs_desc' type-id='type-id-191' visibility='default' filepath='../../include/libzfs_impl.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16800'>
        <var-decl name='libzfs_printerr' type-id='type-id-6' visibility='default' filepath='../../include/libzfs_impl.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16832'>
        <var-decl name='libzfs_storeerr' type-id='type-id-6' visibility='default' filepath='../../include/libzfs_impl.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16864'>
        <var-decl name='libzfs_mnttab_enable' type-id='type-id-31' visibility='default' filepath='../../include/libzfs_impl.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16896'>
        <var-decl name='libzfs_mnttab_cache_lock' type-id='type-id-226' visibility='default' filepath='../../include/libzfs_impl.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17216'>
        <var-decl name='libzfs_mnttab_cache' type-id='type-id-227' visibility='default' filepath='../../include/libzfs_impl.h' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17536'>
        <var-decl name='libzfs_pool_iter' type-id='type-id-6' visibility='default' filepath='../../include/libzfs_impl.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17568'>
        <var-decl name='libzfs_chassis_id' type-id='type-id-197' visibility='default' filepath='../../include/libzfs_impl.h' line='71' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='19616'>
        <var-decl name='libzfs_prop_debug' type-id='type-id-31' visibility='default' filepath='../../include/libzfs_impl.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='19648'>
        <var-decl name='libzfs_urire' type-id='type-id-228' visibility='default' filepath='../../include/libzfs_impl.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='20160'>
        <var-decl name='libzfs_max_nvlist' type-id='type-id-52' visibility='default' filepath='../../include/libzfs_impl.h' line='74' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='FILE' type-id='type-id-229' filepath='/usr/include/x86_64-linux-gnu/bits/types/FILE.h' line='7' column='1' id='type-id-230'/>
    <class-decl name='_IO_FILE' size-in-bits='1728' is-struct='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='49' column='1' id='type-id-229'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_flags' type-id='type-id-6' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_IO_read_ptr' type-id='type-id-18' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_IO_read_end' type-id='type-id-18' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_IO_read_base' type-id='type-id-18' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='_IO_write_base' type-id='type-id-18' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='_IO_write_ptr' type-id='type-id-18' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_IO_write_end' type-id='type-id-18' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='_IO_buf_base' type-id='type-id-18' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='_IO_buf_end' type-id='type-id-18' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='_IO_save_base' type-id='type-id-18' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='_IO_backup_base' type-id='type-id-18' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='_IO_save_end' type-id='type-id-18' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='_markers' type-id='type-id-231' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='_chain' type-id='type-id-232' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='_fileno' type-id='type-id-6' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='_flags2' type-id='type-id-6' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='_old_offset' type-id='type-id-233' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='_cur_column' type-id='type-id-211' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1040'>
        <var-decl name='_vtable_offset' type-id='type-id-210' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1048'>
        <var-decl name='_shortbuf' type-id='type-id-193' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='_lock' type-id='type-id-234' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='_offset' type-id='type-id-235' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='_codecvt' type-id='type-id-236' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='_wide_data' type-id='type-id-237' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='_freeres_list' type-id='type-id-232' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='_freeres_buf' type-id='type-id-72' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='__pad5' type-id='type-id-73' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='_mode' type-id='type-id-6' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='_unused2' type-id='type-id-195' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='98' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__off_t' type-id='type-id-207' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='152' column='1' id='type-id-233'/>
    <typedef-decl name='_IO_lock_t' type-id='type-id-30' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='43' column='1' id='type-id-238'/>
    <typedef-decl name='__off64_t' type-id='type-id-207' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='153' column='1' id='type-id-235'/>
    <typedef-decl name='size_t' type-id='type-id-37' filepath='/usr/lib/gcc/x86_64-linux-gnu/10/include/stddef.h' line='209' column='1' id='type-id-73'/>
    <class-decl name='zpool_handle' size-in-bits='2560' is-struct='yes' visibility='default' filepath='../../include/libzfs_impl.h' line='98' column='1' id='type-id-239'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='zpool_hdl' type-id='type-id-220' visibility='default' filepath='../../include/libzfs_impl.h' line='99' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='zpool_next' type-id='type-id-221' visibility='default' filepath='../../include/libzfs_impl.h' line='100' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='zpool_name' type-id='type-id-197' visibility='default' filepath='../../include/libzfs_impl.h' line='101' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='zpool_state' type-id='type-id-6' visibility='default' filepath='../../include/libzfs_impl.h' line='102' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <var-decl name='zpool_config_size' type-id='type-id-73' visibility='default' filepath='../../include/libzfs_impl.h' line='103' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2304'>
        <var-decl name='zpool_config' type-id='type-id-97' visibility='default' filepath='../../include/libzfs_impl.h' line='104' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2368'>
        <var-decl name='zpool_old_config' type-id='type-id-97' visibility='default' filepath='../../include/libzfs_impl.h' line='105' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2432'>
        <var-decl name='zpool_props' type-id='type-id-97' visibility='default' filepath='../../include/libzfs_impl.h' line='106' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2496'>
        <var-decl name='zpool_start_block' type-id='type-id-240' visibility='default' filepath='../../include/libzfs_impl.h' line='107' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='libzfs_handle_t' type-id='type-id-224' filepath='../../include/libzfs.h' line='197' column='1' id='type-id-241'/>
    <typedef-decl name='zpool_handle_t' type-id='type-id-239' filepath='../../include/libzfs.h' line='196' column='1' id='type-id-242'/>
    <typedef-decl name='nvlist_t' type-id='type-id-99' filepath='../../include/sys/nvpair.h' line='91' column='1' id='type-id-98'/>
    <class-decl name='nvlist' size-in-bits='192' is-struct='yes' visibility='default' filepath='../../include/sys/nvpair.h' line='85' column='1' id='type-id-99'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nvl_version' type-id='type-id-100' visibility='default' filepath='../../include/sys/nvpair.h' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='nvl_nvflag' type-id='type-id-45' visibility='default' filepath='../../include/sys/nvpair.h' line='87' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='nvl_priv' type-id='type-id-52' visibility='default' filepath='../../include/sys/nvpair.h' line='88' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='nvl_flag' type-id='type-id-45' visibility='default' filepath='../../include/sys/nvpair.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='nvl_pad' type-id='type-id-100' visibility='default' filepath='../../include/sys/nvpair.h' line='90' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='int32_t' type-id='type-id-101' filepath='/usr/include/x86_64-linux-gnu/bits/stdint-intn.h' line='26' column='1' id='type-id-100'/>
    <typedef-decl name='__int32_t' type-id='type-id-6' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='41' column='1' id='type-id-101'/>
    <typedef-decl name='uint32_t' type-id='type-id-74' filepath='/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h' line='26' column='1' id='type-id-45'/>
    <typedef-decl name='__uint32_t' type-id='type-id-77' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='42' column='1' id='type-id-74'/>
    <typedef-decl name='uint64_t' type-id='type-id-75' filepath='/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h' line='27' column='1' id='type-id-52'/>
    <typedef-decl name='__uint64_t' type-id='type-id-37' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='45' column='1' id='type-id-75'/>
    <typedef-decl name='diskaddr_t' type-id='type-id-243' filepath='../../lib/libspl/include/sys/stdtypes.h' line='41' column='1' id='type-id-240'/>
    <typedef-decl name='longlong_t' type-id='type-id-208' filepath='../../lib/libspl/include/sys/stdtypes.h' line='36' column='1' id='type-id-243'/>
    <typedef-decl name='pthread_mutex_t' type-id='type-id-244' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='72' column='1' id='type-id-226'/>
    <union-decl name='__anonymous_union__' size-in-bits='320' is-anonymous='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='67' column='1' id='type-id-244'>
      <data-member access='private'>
        <var-decl name='__data' type-id='type-id-245' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='69' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='__size' type-id='type-id-199' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='70' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='__align' type-id='type-id-207' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='71' column='1'/>
      </data-member>
    </union-decl>
    <class-decl name='__pthread_mutex_s' size-in-bits='320' is-struct='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/struct_mutex.h' line='22' column='1' id='type-id-245'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__lock' type-id='type-id-6' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/struct_mutex.h' line='24' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='__count' type-id='type-id-77' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/struct_mutex.h' line='25' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__owner' type-id='type-id-6' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/struct_mutex.h' line='26' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='__nusers' type-id='type-id-77' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/struct_mutex.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='__kind' type-id='type-id-6' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/struct_mutex.h' line='32' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='__spins' type-id='type-id-209' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/struct_mutex.h' line='34' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='176'>
        <var-decl name='__elision' type-id='type-id-209' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/struct_mutex.h' line='35' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='__list' type-id='type-id-246' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/struct_mutex.h' line='36' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__pthread_list_t' type-id='type-id-247' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='53' column='1' id='type-id-246'/>
    <class-decl name='__pthread_internal_list' size-in-bits='128' is-struct='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='49' column='1' id='type-id-247'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__prev' type-id='type-id-248' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__next' type-id='type-id-248' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='52' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='avl_tree_t' type-id='type-id-249' filepath='../../include/sys/avl.h' line='119' column='1' id='type-id-227'/>
    <class-decl name='avl_tree' size-in-bits='320' is-struct='yes' visibility='default' filepath='../../include/sys/avl_impl.h' line='146' column='1' id='type-id-249'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='avl_root' type-id='type-id-189' visibility='default' filepath='../../include/sys/avl_impl.h' line='147' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='avl_compar' type-id='type-id-250' visibility='default' filepath='../../include/sys/avl_impl.h' line='148' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='avl_offset' type-id='type-id-73' visibility='default' filepath='../../include/sys/avl_impl.h' line='149' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='avl_numnodes' type-id='type-id-251' visibility='default' filepath='../../include/sys/avl_impl.h' line='150' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='avl_size' type-id='type-id-73' visibility='default' filepath='../../include/sys/avl_impl.h' line='151' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='avl_node' size-in-bits='192' is-struct='yes' visibility='default' filepath='../../include/sys/avl_impl.h' line='90' column='1' id='type-id-252'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='avl_child' type-id='type-id-190' visibility='default' filepath='../../include/sys/avl_impl.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='avl_pcb' type-id='type-id-253' visibility='default' filepath='../../include/sys/avl_impl.h' line='92' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='uintptr_t' type-id='type-id-37' filepath='/usr/include/stdint.h' line='90' column='1' id='type-id-253'/>
    <typedef-decl name='ulong_t' type-id='type-id-37' filepath='../../lib/libspl/include/sys/stdtypes.h' line='34' column='1' id='type-id-251'/>
    <typedef-decl name='regex_t' type-id='type-id-254' filepath='/usr/include/regex.h' line='478' column='1' id='type-id-228'/>
    <class-decl name='re_pattern_buffer' size-in-bits='512' is-struct='yes' visibility='default' filepath='/usr/include/regex.h' line='413' column='1' id='type-id-254'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='buffer' type-id='type-id-255' visibility='default' filepath='/usr/include/regex.h' line='417' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='allocated' type-id='type-id-256' visibility='default' filepath='/usr/include/regex.h' line='420' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='used' type-id='type-id-256' visibility='default' filepath='/usr/include/regex.h' line='423' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='syntax' type-id='type-id-257' visibility='default' filepath='/usr/include/regex.h' line='426' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='fastmap' type-id='type-id-18' visibility='default' filepath='/usr/include/regex.h' line='431' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='translate' type-id='type-id-258' visibility='default' filepath='/usr/include/regex.h' line='437' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='re_nsub' type-id='type-id-73' visibility='default' filepath='/usr/include/regex.h' line='440' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31'>
        <var-decl name='can_be_null' type-id='type-id-77' visibility='default' filepath='/usr/include/regex.h' line='446' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='29'>
        <var-decl name='regs_allocated' type-id='type-id-77' visibility='default' filepath='/usr/include/regex.h' line='457' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='28'>
        <var-decl name='fastmap_accurate' type-id='type-id-77' visibility='default' filepath='/usr/include/regex.h' line='461' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='27'>
        <var-decl name='no_sub' type-id='type-id-77' visibility='default' filepath='/usr/include/regex.h' line='465' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='26'>
        <var-decl name='not_bol' type-id='type-id-77' visibility='default' filepath='/usr/include/regex.h' line='469' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='25'>
        <var-decl name='not_eol' type-id='type-id-77' visibility='default' filepath='/usr/include/regex.h' line='472' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='newline_anchor' type-id='type-id-77' visibility='default' filepath='/usr/include/regex.h' line='475' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__re_long_size_t' type-id='type-id-37' filepath='/usr/include/regex.h' line='56' column='1' id='type-id-256'/>
    <typedef-decl name='reg_syntax_t' type-id='type-id-37' filepath='/usr/include/regex.h' line='72' column='1' id='type-id-257'/>
    <typedef-decl name='zfs_type_t' type-id='type-id-182' filepath='../../include/sys/fs/zfs.h' line='58' column='1' id='type-id-179'/>
    <enum-decl name='__anonymous_enum__2' is-anonymous='yes' filepath='../../include/sys/fs/zfs.h' line='52' column='1' id='type-id-182'>
      <underlying-type type-id='type-id-35'/>
      <enumerator name='ZFS_TYPE_FILESYSTEM' value='1'/>
      <enumerator name='ZFS_TYPE_SNAPSHOT' value='2'/>
      <enumerator name='ZFS_TYPE_VOLUME' value='4'/>
      <enumerator name='ZFS_TYPE_POOL' value='8'/>
      <enumerator name='ZFS_TYPE_BOOKMARK' value='16'/>
    </enum-decl>
    <typedef-decl name='dmu_objset_stats_t' type-id='type-id-259' filepath='../../include/sys/dmu.h' line='940' column='1' id='type-id-222'/>
    <class-decl name='dmu_objset_stats' size-in-bits='2304' is-struct='yes' visibility='default' filepath='../../include/sys/dmu.h' line='931' column='1' id='type-id-259'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='dds_num_clones' type-id='type-id-52' visibility='default' filepath='../../include/sys/dmu.h' line='932' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='dds_creation_txg' type-id='type-id-52' visibility='default' filepath='../../include/sys/dmu.h' line='933' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='dds_guid' type-id='type-id-52' visibility='default' filepath='../../include/sys/dmu.h' line='934' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='dds_type' type-id='type-id-260' visibility='default' filepath='../../include/sys/dmu.h' line='935' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='dds_is_snapshot' type-id='type-id-56' visibility='default' filepath='../../include/sys/dmu.h' line='936' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='232'>
        <var-decl name='dds_inconsistent' type-id='type-id-56' visibility='default' filepath='../../include/sys/dmu.h' line='937' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='240'>
        <var-decl name='dds_redacted' type-id='type-id-56' visibility='default' filepath='../../include/sys/dmu.h' line='938' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='248'>
        <var-decl name='dds_origin' type-id='type-id-197' visibility='default' filepath='../../include/sys/dmu.h' line='939' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='dmu_objset_type_t' type-id='type-id-261' filepath='../../include/sys/fs/zfs.h' line='72' column='1' id='type-id-260'/>
    <enum-decl name='dmu_objset_type' filepath='../../include/sys/fs/zfs.h' line='64' column='1' id='type-id-261'>
      <underlying-type type-id='type-id-35'/>
      <enumerator name='DMU_OST_NONE' value='0'/>
      <enumerator name='DMU_OST_META' value='1'/>
      <enumerator name='DMU_OST_ZFS' value='2'/>
      <enumerator name='DMU_OST_ZVOL' value='3'/>
      <enumerator name='DMU_OST_OTHER' value='4'/>
      <enumerator name='DMU_OST_ANY' value='5'/>
      <enumerator name='DMU_OST_NUMTYPES' value='6'/>
    </enum-decl>
    <typedef-decl name='uint8_t' type-id='type-id-76' filepath='/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h' line='24' column='1' id='type-id-56'/>
    <typedef-decl name='__uint8_t' type-id='type-id-78' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='38' column='1' id='type-id-76'/>
    <typedef-decl name='zfs_share_proto_t' type-id='type-id-262' filepath='../../include/libzfs_impl.h' line='114' column='1' id='type-id-263'/>
    <enum-decl name='__anonymous_enum__3' is-anonymous='yes' filepath='../../include/libzfs_impl.h' line='110' column='1' id='type-id-262'>
      <underlying-type type-id='type-id-35'/>
      <enumerator name='PROTO_NFS' value='0'/>
      <enumerator name='PROTO_SMB' value='1'/>
      <enumerator name='PROTO_END' value='2'/>
    </enum-decl>
    <pointer-type-def type-id='type-id-230' size-in-bits='64' id='type-id-225'/>
    <pointer-type-def type-id='type-id-229' size-in-bits='64' id='type-id-232'/>
    <pointer-type-def type-id='type-id-201' size-in-bits='64' id='type-id-236'/>
    <pointer-type-def type-id='type-id-238' size-in-bits='64' id='type-id-234'/>
    <pointer-type-def type-id='type-id-202' size-in-bits='64' id='type-id-231'/>
    <pointer-type-def type-id='type-id-203' size-in-bits='64' id='type-id-237'/>
    <pointer-type-def type-id='type-id-247' size-in-bits='64' id='type-id-248'/>
    <pointer-type-def type-id='type-id-252' size-in-bits='64' id='type-id-189'/>
    <pointer-type-def type-id='type-id-32' size-in-bits='64' id='type-id-18'/>
    <qualified-type-def type-id='type-id-32' const='yes' id='type-id-33'/>
    <pointer-type-def type-id='type-id-33' size-in-bits='64' id='type-id-4'/>
    <pointer-type-def type-id='type-id-264' size-in-bits='64' id='type-id-250'/>
    <pointer-type-def type-id='type-id-241' size-in-bits='64' id='type-id-220'/>
    <pointer-type-def type-id='type-id-98' size-in-bits='64' id='type-id-97'/>
    <pointer-type-def type-id='type-id-213' size-in-bits='64' id='type-id-265'/>
    <pointer-type-def type-id='type-id-204' size-in-bits='64' id='type-id-255'/>
    <pointer-type-def type-id='type-id-56' size-in-bits='64' id='type-id-223'/>
    <pointer-type-def type-id='type-id-78' size-in-bits='64' id='type-id-258'/>
    <pointer-type-def type-id='type-id-216' size-in-bits='64' id='type-id-214'/>
    <pointer-type-def type-id='type-id-217' size-in-bits='64' id='type-id-215'/>
    <pointer-type-def type-id='type-id-30' size-in-bits='64' id='type-id-72'/>
    <pointer-type-def type-id='type-id-219' size-in-bits='64' id='type-id-266'/>
    <pointer-type-def type-id='type-id-263' size-in-bits='64' id='type-id-267'/>
    <pointer-type-def type-id='type-id-242' size-in-bits='64' id='type-id-221'/>
    <function-decl name='changelist_gather' mangled-name='changelist_gather' filepath='/home/ryan/zfs/lib/libzfs/libzfs_changelist.c' line='624' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='changelist_gather'>
      <parameter type-id='type-id-266' name='zhp' filepath='/home/ryan/zfs/lib/libzfs/libzfs_changelist.c' line='624' column='1'/>
      <parameter type-id='type-id-178' name='prop' filepath='/home/ryan/zfs/lib/libzfs/libzfs_changelist.c' line='624' column='1'/>
      <parameter type-id='type-id-6' name='gather_flags' filepath='/home/ryan/zfs/lib/libzfs/libzfs_changelist.c' line='624' column='1'/>
      <parameter type-id='type-id-6' name='mnt_flags' filepath='/home/ryan/zfs/lib/libzfs/libzfs_changelist.c' line='625' column='1'/>
      <return type-id='type-id-265'/>
    </function-decl>
    <function-decl name='changelist_free' mangled-name='changelist_free' filepath='/home/ryan/zfs/lib/libzfs/libzfs_changelist.c' line='412' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='changelist_free'>
      <parameter type-id='type-id-265' name='clp' filepath='/home/ryan/zfs/lib/libzfs/libzfs_changelist.c' line='412' column='1'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='changelist_remove' mangled-name='changelist_remove' filepath='/home/ryan/zfs/lib/libzfs/libzfs_changelist.c' line='387' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='changelist_remove'>
      <parameter type-id='type-id-265' name='clp' filepath='/home/ryan/zfs/lib/libzfs/libzfs_changelist.c' line='387' column='1'/>
      <parameter type-id='type-id-4' name='name' filepath='/home/ryan/zfs/lib/libzfs/libzfs_changelist.c' line='387' column='1'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='changelist_haszonedchild' mangled-name='changelist_haszonedchild' filepath='/home/ryan/zfs/lib/libzfs/libzfs_changelist.c' line='378' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='changelist_haszonedchild'>
      <parameter type-id='type-id-265' name='clp' filepath='/home/ryan/zfs/lib/libzfs/libzfs_changelist.c' line='378' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='changelist_unshare' mangled-name='changelist_unshare' filepath='/home/ryan/zfs/lib/libzfs/libzfs_changelist.c' line='348' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='changelist_unshare'>
      <parameter type-id='type-id-265' name='clp' filepath='/home/ryan/zfs/lib/libzfs/libzfs_changelist.c' line='348' column='1'/>
      <parameter type-id='type-id-267' name='proto' filepath='/home/ryan/zfs/lib/libzfs/libzfs_changelist.c' line='348' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='changelist_rename' mangled-name='changelist_rename' filepath='/home/ryan/zfs/lib/libzfs/libzfs_changelist.c' line='311' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='changelist_rename'>
      <parameter type-id='type-id-265' name='clp' filepath='/home/ryan/zfs/lib/libzfs/libzfs_changelist.c' line='311' column='1'/>
      <parameter type-id='type-id-4' name='src' filepath='/home/ryan/zfs/lib/libzfs/libzfs_changelist.c' line='311' column='1'/>
      <parameter type-id='type-id-4' name='dst' filepath='/home/ryan/zfs/lib/libzfs/libzfs_changelist.c' line='311' column='1'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='isa_child_of' mangled-name='isa_child_of' filepath='/home/ryan/zfs/lib/libzfs/libzfs_changelist.c' line='288' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='isa_child_of'>
      <parameter type-id='type-id-4' name='dataset' filepath='/home/ryan/zfs/lib/libzfs/libzfs_changelist.c' line='288' column='1'/>
      <parameter type-id='type-id-4' name='parent' filepath='/home/ryan/zfs/lib/libzfs/libzfs_changelist.c' line='288' column='1'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='changelist_postfix' mangled-name='changelist_postfix' filepath='/home/ryan/zfs/lib/libzfs/libzfs_changelist.c' line='170' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='changelist_postfix'>
      <parameter type-id='type-id-265' name='clp' filepath='/home/ryan/zfs/lib/libzfs/libzfs_changelist.c' line='170' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='changelist_prefix' mangled-name='changelist_prefix' filepath='/home/ryan/zfs/lib/libzfs/libzfs_changelist.c' line='96' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='changelist_prefix'>
      <parameter type-id='type-id-265' name='clp' filepath='/home/ryan/zfs/lib/libzfs/libzfs_changelist.c' line='96' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_alloc' mangled-name='zfs_alloc' filepath='../../include/libzfs_impl.h' line='139' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='uu_avl_pool_create' mangled-name='uu_avl_pool_create' filepath='../../include/libuutil.h' line='332' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='uu_avl_create' mangled-name='uu_avl_create' filepath='../../include/libuutil.h' line='351' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='zfs_prop_get' mangled-name='zfs_prop_get' filepath='../../include/libzfs.h' line='494' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='uu_error' mangled-name='uu_error' filepath='../../include/libuutil.h' line='75' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='zfs_error' mangled-name='zfs_error' filepath='../../include/libzfs_impl.h' line='136' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='zfs_iter_dependents' mangled-name='zfs_iter_dependents' filepath='../../include/libzfs.h' line='615' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='zfs_get_name' mangled-name='zfs_get_name' filepath='../../include/libzfs.h' line='471' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='zfs_open' mangled-name='zfs_open' filepath='../../include/libzfs.h' line='467' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='zfs_is_shared' mangled-name='zfs_is_shared' filepath='../../include/libzfs.h' line='843' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='zfs_prop_get_int' mangled-name='zfs_prop_get_int' filepath='../../include/libzfs.h' line='511' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='uu_avl_node_init' mangled-name='uu_avl_node_init' filepath='../../include/libuutil.h' line='348' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='uu_avl_find' mangled-name='uu_avl_find' filepath='../../include/libuutil.h' line='370' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='free' mangled-name='free' filepath='/usr/include/stdlib.h' line='565' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='zfs_close' mangled-name='zfs_close' filepath='../../include/libzfs.h' line='469' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='zfs_iter_children' mangled-name='zfs_iter_children' filepath='../../include/libzfs.h' line='614' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='__assert_fail' mangled-name='__assert_fail' filepath='/usr/include/assert.h' line='69' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='zfs_is_mounted' mangled-name='zfs_is_mounted' filepath='../../include/libzfs.h' line='827' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='uu_avl_insert' mangled-name='uu_avl_insert' filepath='../../include/libuutil.h' line='371' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='zfs_iter_mounted' mangled-name='zfs_iter_mounted' filepath='../../include/libzfs.h' line='623' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='strcmp' mangled-name='strcmp' filepath='/usr/include/string.h' line='137' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='zfs_get_handle' mangled-name='zfs_get_handle' filepath='../../include/libzfs.h' line='210' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='getzoneid' mangled-name='getzoneid' filepath='../../include/sys/zfs_context.h' line='726' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='libspl_assertf' mangled-name='libspl_assertf' filepath='../../lib/libspl/include/assert.h' line='40' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='uu_avl_walk_start' mangled-name='uu_avl_walk_start' filepath='../../include/libuutil.h' line='366' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='uu_avl_remove' mangled-name='uu_avl_remove' filepath='../../include/libuutil.h' line='378' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='uu_avl_walk_next' mangled-name='uu_avl_walk_next' filepath='../../include/libuutil.h' line='367' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='uu_avl_walk_end' mangled-name='uu_avl_walk_end' filepath='../../include/libuutil.h' line='368' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='uu_avl_destroy' mangled-name='uu_avl_destroy' filepath='../../include/libuutil.h' line='354' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='uu_avl_pool_destroy' mangled-name='uu_avl_pool_destroy' filepath='../../include/libuutil.h' line='336' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='zfs_unshare_proto' mangled-name='zfs_unshare_proto' filepath='../../include/libzfs_impl.h' line='211' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='zfs_commit_proto' mangled-name='zfs_commit_proto' filepath='../../include/libzfs_impl.h' line='260' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='remove_mountpoint' mangled-name='remove_mountpoint' filepath='../../include/libzfs_impl.h' line='192' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='strlcpy' mangled-name='strlcpy' filepath='../../lib/libspl/include/string.h' line='41' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='strlen' mangled-name='strlen' filepath='/usr/include/string.h' line='385' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='strlcat' mangled-name='strlcat' filepath='../../lib/libspl/include/string.h' line='37' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='strncmp' mangled-name='strncmp' filepath='/usr/include/string.h' line='140' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='zfs_refresh_properties' mangled-name='zfs_refresh_properties' filepath='../../include/libzfs.h' line='813' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='zfs_share_nfs' mangled-name='zfs_share_nfs' filepath='../../include/libzfs.h' line='852' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='zfs_unshare_smb' mangled-name='zfs_unshare_smb' filepath='../../include/libzfs.h' line='856' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='zfs_unshare_nfs' mangled-name='zfs_unshare_nfs' filepath='../../include/libzfs.h' line='855' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='zfs_share_smb' mangled-name='zfs_share_smb' filepath='../../include/libzfs.h' line='853' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='zfs_mount' mangled-name='zfs_mount' filepath='../../include/libzfs.h' line='828' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='uu_avl_last' mangled-name='uu_avl_last' filepath='../../include/libuutil.h' line='359' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='zfs_commit_smb_shares' mangled-name='zfs_commit_smb_shares' filepath='../../include/libzfs.h' line='865' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='zfs_commit_nfs_shares' mangled-name='zfs_commit_nfs_shares' filepath='../../include/libzfs.h' line='864' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='zfs_unmount' mangled-name='zfs_unmount' filepath='../../include/libzfs.h' line='830' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-264'>
      <parameter type-id='type-id-72'/>
      <parameter type-id='type-id-72'/>
      <return type-id='type-id-6'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='libzfs_config.c' comp-dir-path='/home/ryan/zfs/lib/libzfs' language='LANG_C99'>
    <typedef-decl name='zfs_iter_f' type-id='type-id-268' filepath='../../include/libzfs.h' line='612' column='1' id='type-id-269'/>
    <typedef-decl name='zpool_iter_f' type-id='type-id-270' filepath='../../include/libzfs.h' line='246' column='1' id='type-id-271'/>
    <pointer-type-def type-id='type-id-31' size-in-bits='64' id='type-id-185'/>
    <pointer-type-def type-id='type-id-272' size-in-bits='64' id='type-id-268'/>
    <pointer-type-def type-id='type-id-273' size-in-bits='64' id='type-id-270'/>
    <pointer-type-def type-id='type-id-97' size-in-bits='64' id='type-id-274'/>
    <function-decl name='__builtin_memset' mangled-name='memset' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='zfs_iter_root' mangled-name='zfs_iter_root' filepath='/home/ryan/zfs/lib/libzfs/libzfs_config.c' line='434' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_iter_root'>
      <parameter type-id='type-id-220' name='hdl' filepath='/home/ryan/zfs/lib/libzfs/libzfs_config.c' line='434' column='1'/>
      <parameter type-id='type-id-269' name='func' filepath='/home/ryan/zfs/lib/libzfs/libzfs_config.c' line='434' column='1'/>
      <parameter type-id='type-id-72' name='data' filepath='/home/ryan/zfs/lib/libzfs/libzfs_config.c' line='434' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zpool_iter' mangled-name='zpool_iter' filepath='/home/ryan/zfs/lib/libzfs/libzfs_config.c' line='389' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_iter'>
      <parameter type-id='type-id-220' name='hdl' filepath='/home/ryan/zfs/lib/libzfs/libzfs_config.c' line='389' column='1'/>
      <parameter type-id='type-id-271' name='func' filepath='/home/ryan/zfs/lib/libzfs/libzfs_config.c' line='389' column='1'/>
      <parameter type-id='type-id-72' name='data' filepath='/home/ryan/zfs/lib/libzfs/libzfs_config.c' line='389' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zpool_skip_pool' mangled-name='zpool_skip_pool' filepath='/home/ryan/zfs/lib/libzfs/libzfs_config.c' line='340' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_skip_pool'>
      <parameter type-id='type-id-4' name='poolname' filepath='/home/ryan/zfs/lib/libzfs/libzfs_config.c' line='340' column='1'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='zpool_refresh_stats' mangled-name='zpool_refresh_stats' filepath='/home/ryan/zfs/lib/libzfs/libzfs_config.c' line='265' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_refresh_stats'>
      <parameter type-id='type-id-221' name='zhp' filepath='/home/ryan/zfs/lib/libzfs/libzfs_config.c' line='265' column='1'/>
      <parameter type-id='type-id-185' name='missing' filepath='/home/ryan/zfs/lib/libzfs/libzfs_config.c' line='265' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zpool_get_features' mangled-name='zpool_get_features' filepath='/home/ryan/zfs/lib/libzfs/libzfs_config.c' line='232' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_get_features'>
      <parameter type-id='type-id-221' name='zhp' filepath='/home/ryan/zfs/lib/libzfs/libzfs_config.c' line='232' column='1'/>
      <return type-id='type-id-97'/>
    </function-decl>
    <function-decl name='zpool_get_config' mangled-name='zpool_get_config' filepath='/home/ryan/zfs/lib/libzfs/libzfs_config.c' line='220' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_get_config'>
      <parameter type-id='type-id-221' name='zhp' filepath='/home/ryan/zfs/lib/libzfs/libzfs_config.c' line='220' column='1'/>
      <parameter type-id='type-id-274' name='oldconfig' filepath='/home/ryan/zfs/lib/libzfs/libzfs_config.c' line='220' column='1'/>
      <return type-id='type-id-97'/>
    </function-decl>
    <function-decl name='namespace_clear' mangled-name='namespace_clear' filepath='/home/ryan/zfs/lib/libzfs/libzfs_config.c' line='79' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='namespace_clear'>
      <parameter type-id='type-id-220' name='hdl' filepath='/home/ryan/zfs/lib/libzfs/libzfs_config.c' line='79' column='1'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='uu_avl_first' mangled-name='uu_avl_first' filepath='../../include/libuutil.h' line='358' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='make_dataset_handle' mangled-name='make_dataset_handle' filepath='../../include/libzfs_impl.h' line='196' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='uu_avl_next' mangled-name='uu_avl_next' filepath='../../include/libuutil.h' line='361' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='zpool_open_silent' mangled-name='zpool_open_silent' filepath='../../include/libzfs_impl.h' line='200' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='strchr' mangled-name='strchr' filepath='/usr/include/string.h' line='226' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='getenv' mangled-name='getenv' filepath='/usr/include/stdlib.h' line='634' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='strcpy' mangled-name='strcpy' filepath='/usr/include/string.h' line='122' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='zcmd_alloc_dst_nvlist' mangled-name='zcmd_alloc_dst_nvlist' filepath='../../include/libzfs_impl.h' line='176' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='__errno_location' mangled-name='__errno_location' filepath='/usr/include/errno.h' line='37' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='zcmd_expand_dst_nvlist' mangled-name='zcmd_expand_dst_nvlist' filepath='../../include/libzfs_impl.h' line='179' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='zfs_ioctl' mangled-name='zfs_ioctl' filepath='../../include/libzfs.h' line='455' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='zcmd_read_dst_nvlist' mangled-name='zcmd_read_dst_nvlist' filepath='../../include/libzfs_impl.h' line='180' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='zcmd_free_nvlists' mangled-name='zcmd_free_nvlists' filepath='../../include/libzfs_impl.h' line='181' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='nvlist_free' mangled-name='nvlist_free' filepath='../../include/sys/nvpair.h' line='152' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='nvlist_exists' mangled-name='nvlist_exists' filepath='../../include/sys/nvpair.h' line='238' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='nvlist_lookup_nvlist' mangled-name='nvlist_lookup_nvlist' filepath='../../include/sys/nvpair.h' line='214' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='no_memory' mangled-name='no_memory' filepath='../../include/libzfs_impl.h' line='143' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='nvlist_dup' mangled-name='nvlist_dup' filepath='../../include/sys/nvpair.h' line='156' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='nvpair_name' mangled-name='nvpair_name' filepath='../../include/sys/nvpair.h' line='244' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='zfs_strdup' mangled-name='zfs_strdup' filepath='../../include/libzfs_impl.h' line='142' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='nvpair_value_nvlist' mangled-name='nvpair_value_nvlist' filepath='../../include/sys/nvpair.h' line='258' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='dcgettext' mangled-name='dcgettext' filepath='/usr/include/libintl.h' line='51' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='zfs_standard_error' mangled-name='zfs_standard_error' filepath='../../include/libzfs_impl.h' line='145' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='uu_avl_teardown' mangled-name='uu_avl_teardown' filepath='../../include/libuutil.h' line='376' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='nvlist_next_nvpair' mangled-name='nvlist_next_nvpair' filepath='../../include/sys/nvpair.h' line='242' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-272'>
      <parameter type-id='type-id-266'/>
      <parameter type-id='type-id-72'/>
      <return type-id='type-id-6'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-273'>
      <parameter type-id='type-id-221'/>
      <parameter type-id='type-id-72'/>
      <return type-id='type-id-6'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='libzfs_crypto.c' comp-dir-path='/home/ryan/zfs/lib/libzfs' language='LANG_C99'>
    <typedef-decl name='uint_t' type-id='type-id-77' filepath='../../lib/libspl/include/sys/stdtypes.h' line='33' column='1' id='type-id-275'/>
    <pointer-type-def type-id='type-id-223' size-in-bits='64' id='type-id-276'/>
    <pointer-type-def type-id='type-id-275' size-in-bits='64' id='type-id-277'/>
    <function-decl name='__builtin_memcpy' mangled-name='memcpy' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='__builtin_memmove' mangled-name='memmove' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='__builtin_putchar' mangled-name='putchar' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='zfs_crypto_rewrap' mangled-name='zfs_crypto_rewrap' filepath='/home/ryan/zfs/lib/libzfs/libzfs_crypto.c' line='1387' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_crypto_rewrap'>
      <parameter type-id='type-id-266' name='zhp' filepath='/home/ryan/zfs/lib/libzfs/libzfs_crypto.c' line='1387' column='1'/>
      <parameter type-id='type-id-97' name='raw_props' filepath='/home/ryan/zfs/lib/libzfs/libzfs_crypto.c' line='1387' column='1'/>
      <parameter type-id='type-id-31' name='inheritkey' filepath='/home/ryan/zfs/lib/libzfs/libzfs_crypto.c' line='1387' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_crypto_unload_key' mangled-name='zfs_crypto_unload_key' filepath='/home/ryan/zfs/lib/libzfs/libzfs_crypto.c' line='1251' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_crypto_unload_key'>
      <parameter type-id='type-id-266' name='zhp' filepath='/home/ryan/zfs/lib/libzfs/libzfs_crypto.c' line='1251' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_crypto_load_key' mangled-name='zfs_crypto_load_key' filepath='/home/ryan/zfs/lib/libzfs/libzfs_crypto.c' line='1083' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_crypto_load_key'>
      <parameter type-id='type-id-266' name='zhp' filepath='/home/ryan/zfs/lib/libzfs/libzfs_crypto.c' line='1083' column='1'/>
      <parameter type-id='type-id-31' name='noop' filepath='/home/ryan/zfs/lib/libzfs/libzfs_crypto.c' line='1083' column='1'/>
      <parameter type-id='type-id-18' name='alt_keylocation' filepath='/home/ryan/zfs/lib/libzfs/libzfs_crypto.c' line='1083' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_crypto_attempt_load_keys' mangled-name='zfs_crypto_attempt_load_keys' filepath='/home/ryan/zfs/lib/libzfs/libzfs_crypto.c' line='1048' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_crypto_attempt_load_keys'>
      <parameter type-id='type-id-220' name='hdl' filepath='/home/ryan/zfs/lib/libzfs/libzfs_crypto.c' line='1048' column='1'/>
      <parameter type-id='type-id-18' name='fsname' filepath='/home/ryan/zfs/lib/libzfs/libzfs_crypto.c' line='1048' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_crypto_clone_check' mangled-name='zfs_crypto_clone_check' filepath='/home/ryan/zfs/lib/libzfs/libzfs_crypto.c' line='982' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_crypto_clone_check'>
      <parameter type-id='type-id-220' name='hdl' filepath='/home/ryan/zfs/lib/libzfs/libzfs_crypto.c' line='982' column='1'/>
      <parameter type-id='type-id-266' name='origin_zhp' filepath='/home/ryan/zfs/lib/libzfs/libzfs_crypto.c' line='982' column='1'/>
      <parameter type-id='type-id-18' name='parent_name' filepath='/home/ryan/zfs/lib/libzfs/libzfs_crypto.c' line='983' column='1'/>
      <parameter type-id='type-id-97' name='props' filepath='/home/ryan/zfs/lib/libzfs/libzfs_crypto.c' line='983' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_crypto_create' mangled-name='zfs_crypto_create' filepath='/home/ryan/zfs/lib/libzfs/libzfs_crypto.c' line='810' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_crypto_create'>
      <parameter type-id='type-id-220' name='hdl' filepath='/home/ryan/zfs/lib/libzfs/libzfs_crypto.c' line='810' column='1'/>
      <parameter type-id='type-id-18' name='parent_name' filepath='/home/ryan/zfs/lib/libzfs/libzfs_crypto.c' line='810' column='1'/>
      <parameter type-id='type-id-97' name='props' filepath='/home/ryan/zfs/lib/libzfs/libzfs_crypto.c' line='810' column='1'/>
      <parameter type-id='type-id-97' name='pool_props' filepath='/home/ryan/zfs/lib/libzfs/libzfs_crypto.c' line='811' column='1'/>
      <parameter type-id='type-id-31' name='stdin_available' filepath='/home/ryan/zfs/lib/libzfs/libzfs_crypto.c' line='811' column='1'/>
      <parameter type-id='type-id-276' name='wkeydata_out' filepath='/home/ryan/zfs/lib/libzfs/libzfs_crypto.c' line='811' column='1'/>
      <parameter type-id='type-id-277' name='wkeylen_out' filepath='/home/ryan/zfs/lib/libzfs/libzfs_crypto.c' line='812' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_crypto_get_encryption_root' mangled-name='zfs_crypto_get_encryption_root' filepath='/home/ryan/zfs/lib/libzfs/libzfs_crypto.c' line='779' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_crypto_get_encryption_root'>
      <parameter type-id='type-id-266' name='zhp' filepath='/home/ryan/zfs/lib/libzfs/libzfs_crypto.c' line='779' column='1'/>
      <parameter type-id='type-id-185' name='is_encroot' filepath='/home/ryan/zfs/lib/libzfs/libzfs_crypto.c' line='779' column='1'/>
      <parameter type-id='type-id-18' name='buf' filepath='/home/ryan/zfs/lib/libzfs/libzfs_crypto.c' line='780' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='snprintf' mangled-name='snprintf' filepath='/usr/include/stdio.h' line='354' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='zfs_parent_name' mangled-name='zfs_parent_name' filepath='../../include/libzfs.h' line='817' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='lzc_change_key' mangled-name='lzc_change_key' filepath='../../include/libzfs_core.h' line='64' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='zfs_error_aux' mangled-name='zfs_error_aux' filepath='../../include/libzfs_impl.h' line='138' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='zfs_prop_to_name' mangled-name='zfs_prop_to_name' filepath='../../include/libzfs.h' line='491' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='nvlist_lookup_uint64' mangled-name='nvlist_lookup_uint64' filepath='../../include/sys/nvpair.h' line='212' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='nvlist_lookup_string' mangled-name='nvlist_lookup_string' filepath='../../include/sys/nvpair.h' line='213' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='nvlist_add_string' mangled-name='nvlist_add_string' filepath='../../include/sys/nvpair.h' line='179' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='nvlist_add_uint64' mangled-name='nvlist_add_uint64' filepath='../../include/sys/nvpair.h' line='178' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='zfs_name_to_prop' mangled-name='zfs_name_to_prop' filepath='../../include/sys/fs/zfs.h' line='315' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='fnvlist_alloc' mangled-name='fnvlist_alloc' filepath='../../include/sys/nvpair.h' line='276' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='zfs_valid_proplist' mangled-name='zfs_valid_proplist' filepath='../../include/libzfs.h' line='488' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='lzc_unload_key' mangled-name='lzc_unload_key' filepath='../../include/libzfs_core.h' line='63' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='lzc_load_key' mangled-name='lzc_load_key' filepath='../../include/libzfs_core.h' line='62' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='zfs_handle_dup' mangled-name='zfs_handle_dup' filepath='../../include/libzfs.h' line='468' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='printf' mangled-name='printf' filepath='/usr/include/stdio.h' line='332' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='zfs_iter_filesystems' mangled-name='zfs_iter_filesystems' filepath='../../include/libzfs.h' line='616' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='zpool_get_prop_int' mangled-name='zpool_get_prop_int' filepath='../../include/libzfs.h' line='329' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='zpool_get_features' mangled-name='zpool_get_features' filepath='../../include/libzfs.h' line='413' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='fileno' mangled-name='fileno' filepath='/usr/include/stdio.h' line='786' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='isatty' mangled-name='isatty' filepath='/usr/include/unistd.h' line='779' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='fopen' mangled-name='fopen64' filepath='/usr/include/stdio.h' line='257' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='fclose' mangled-name='fclose' filepath='/usr/include/stdio.h' line='213' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='getline' mangled-name='getline' filepath='/usr/include/stdio.h' line='616' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='malloc' mangled-name='malloc' filepath='/usr/include/stdlib.h' line='539' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='fread' mangled-name='fread' filepath='/usr/include/stdio.h' line='646' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='ferror' mangled-name='ferror' filepath='/usr/include/stdio.h' line='761' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='sigemptyset' mangled-name='sigemptyset' filepath='/usr/include/signal.h' line='196' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='sigaction' mangled-name='sigaction' filepath='/usr/include/signal.h' line='240' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='fputc' mangled-name='fputc' filepath='/usr/include/stdio.h' line='521' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='fflush' mangled-name='fflush' filepath='/usr/include/stdio.h' line='218' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='tcgetattr' mangled-name='tcgetattr' filepath='/usr/include/termios.h' line='66' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='tcsetattr' mangled-name='tcsetattr' filepath='/usr/include/termios.h' line='70' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='getpid' mangled-name='getpid' filepath='/usr/include/unistd.h' line='628' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='kill' mangled-name='kill' filepath='/usr/include/signal.h' line='112' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='__ctype_b_loc' mangled-name='__ctype_b_loc' filepath='/usr/include/ctype.h' line='79' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='sscanf' mangled-name='__isoc99_sscanf' filepath='/usr/include/stdio.h' line='412' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='PKCS5_PBKDF2_HMAC_SHA1' mangled-name='PKCS5_PBKDF2_HMAC_SHA1' filepath='/usr/include/openssl/evp.h' line='1087' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='calloc' mangled-name='calloc' filepath='/usr/include/stdlib.h' line='542' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='regexec' mangled-name='regexec' filepath='/usr/include/regex.h' line='643' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='read' mangled-name='read' filepath='/usr/include/unistd.h' line='360' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='open' mangled-name='open64' filepath='/usr/include/fcntl.h' line='171' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='close' mangled-name='close' filepath='/usr/include/unistd.h' line='353' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='libzfs_dataset.c' comp-dir-path='/home/ryan/zfs/lib/libzfs' language='LANG_C99'>
    <array-type-def dimensions='1' type-id='type-id-32' size-in-bits='32768' id='type-id-41'>
      <subrange length='4096' type-id='type-id-37' id='type-id-44'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-32' size-in-bits='65536' id='type-id-278'>
      <subrange length='8192' type-id='type-id-37' id='type-id-279'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-52' size-in-bits='128' id='type-id-64'>
      <subrange length='2' type-id='type-id-37' id='type-id-47'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-56' size-in-bits='24' id='type-id-280'>
      <subrange length='3' type-id='type-id-37' id='type-id-281'/>
    </array-type-def>
    <typedef-decl name='zfs_wait_activity_t' type-id='type-id-282' filepath='../../include/sys/fs/zfs.h' line='1449' column='1' id='type-id-283'/>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' filepath='../../include/sys/fs/zfs.h' line='1446' column='1' id='type-id-282'>
      <underlying-type type-id='type-id-35'/>
      <enumerator name='ZFS_WAIT_DELETEQ' value='0'/>
      <enumerator name='ZFS_WAIT_NUM_ACTIVITIES' value='1'/>
    </enum-decl>
    <typedef-decl name='zfs_userquota_prop_t' type-id='type-id-284' filepath='../../include/sys/fs/zfs.h' line='208' column='1' id='type-id-285'/>
    <enum-decl name='__anonymous_enum__1' is-anonymous='yes' filepath='../../include/sys/fs/zfs.h' line='194' column='1' id='type-id-284'>
      <underlying-type type-id='type-id-35'/>
      <enumerator name='ZFS_PROP_USERUSED' value='0'/>
      <enumerator name='ZFS_PROP_USERQUOTA' value='1'/>
      <enumerator name='ZFS_PROP_GROUPUSED' value='2'/>
      <enumerator name='ZFS_PROP_GROUPQUOTA' value='3'/>
      <enumerator name='ZFS_PROP_USEROBJUSED' value='4'/>
      <enumerator name='ZFS_PROP_USEROBJQUOTA' value='5'/>
      <enumerator name='ZFS_PROP_GROUPOBJUSED' value='6'/>
      <enumerator name='ZFS_PROP_GROUPOBJQUOTA' value='7'/>
      <enumerator name='ZFS_PROP_PROJECTUSED' value='8'/>
      <enumerator name='ZFS_PROP_PROJECTQUOTA' value='9'/>
      <enumerator name='ZFS_PROP_PROJECTOBJUSED' value='10'/>
      <enumerator name='ZFS_PROP_PROJECTOBJQUOTA' value='11'/>
      <enumerator name='ZFS_NUM_USERQUOTA_PROPS' value='12'/>
    </enum-decl>
    <typedef-decl name='zfs_userspace_cb_t' type-id='type-id-286' filepath='../../include/libzfs.h' line='741' column='1' id='type-id-287'/>
    <typedef-decl name='uid_t' type-id='type-id-288' filepath='/usr/include/x86_64-linux-gnu/sys/types.h' line='79' column='1' id='type-id-289'/>
    <typedef-decl name='__uid_t' type-id='type-id-77' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='146' column='1' id='type-id-288'/>
    <typedef-decl name='zprop_list_t' type-id='type-id-290' filepath='../../include/libzfs.h' line='544' column='1' id='type-id-291'/>
    <class-decl name='zprop_list' size-in-bits='448' is-struct='yes' visibility='default' filepath='../../include/libzfs.h' line='536' column='1' id='type-id-290'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='pl_prop' type-id='type-id-6' visibility='default' filepath='../../include/libzfs.h' line='537' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='pl_user_prop' type-id='type-id-18' visibility='default' filepath='../../include/libzfs.h' line='538' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='pl_next' type-id='type-id-292' visibility='default' filepath='../../include/libzfs.h' line='539' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='pl_all' type-id='type-id-31' visibility='default' filepath='../../include/libzfs.h' line='540' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='pl_width' type-id='type-id-73' visibility='default' filepath='../../include/libzfs.h' line='541' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='pl_recvd_width' type-id='type-id-73' visibility='default' filepath='../../include/libzfs.h' line='542' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='pl_fixed' type-id='type-id-31' visibility='default' filepath='../../include/libzfs.h' line='543' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='renameflags_t' type-id='type-id-293' filepath='../../include/libzfs.h' line='659' column='1' id='type-id-294'/>
    <class-decl name='renameflags' size-in-bits='32' is-struct='yes' visibility='default' filepath='../../include/libzfs.h' line='650' column='1' id='type-id-293'>
      <data-member access='public' layout-offset-in-bits='31'>
        <var-decl name='recursive' type-id='type-id-6' visibility='default' filepath='../../include/libzfs.h' line='652' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='30'>
        <var-decl name='nounmount' type-id='type-id-6' visibility='default' filepath='../../include/libzfs.h' line='655' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='29'>
        <var-decl name='forceunmount' type-id='type-id-6' visibility='default' filepath='../../include/libzfs.h' line='658' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='zprop_source_t' type-id='type-id-295' filepath='../../include/sys/fs/zfs.h' line='268' column='1' id='type-id-296'/>
    <enum-decl name='__anonymous_enum__2' is-anonymous='yes' filepath='../../include/sys/fs/zfs.h' line='261' column='1' id='type-id-295'>
      <underlying-type type-id='type-id-35'/>
      <enumerator name='ZPROP_SRC_NONE' value='1'/>
      <enumerator name='ZPROP_SRC_DEFAULT' value='2'/>
      <enumerator name='ZPROP_SRC_TEMPORARY' value='4'/>
      <enumerator name='ZPROP_SRC_LOCAL' value='8'/>
      <enumerator name='ZPROP_SRC_INHERITED' value='16'/>
      <enumerator name='ZPROP_SRC_RECEIVED' value='32'/>
    </enum-decl>
    <class-decl name='mnttab' size-in-bits='256' is-struct='yes' visibility='default' filepath='../../lib/libspl/include/os/linux/sys/mnttab.h' line='49' column='1' id='type-id-297'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mnt_special' type-id='type-id-18' visibility='default' filepath='../../lib/libspl/include/os/linux/sys/mnttab.h' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='mnt_mountp' type-id='type-id-18' visibility='default' filepath='../../lib/libspl/include/os/linux/sys/mnttab.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='mnt_fstype' type-id='type-id-18' visibility='default' filepath='../../lib/libspl/include/os/linux/sys/mnttab.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='mnt_mntopts' type-id='type-id-18' visibility='default' filepath='../../lib/libspl/include/os/linux/sys/mnttab.h' line='53' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='zfs_cmd_t' type-id='type-id-298' filepath='../../include/sys/zfs_ioctl.h' line='518' column='1' id='type-id-299'/>
    <class-decl name='zfs_cmd' size-in-bits='109952' is-struct='yes' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='477' column='1' id='type-id-298'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='zc_name' type-id='type-id-41' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='478' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32768'>
        <var-decl name='zc_nvlist_src' type-id='type-id-52' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='479' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32832'>
        <var-decl name='zc_nvlist_src_size' type-id='type-id-52' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='480' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32896'>
        <var-decl name='zc_nvlist_dst' type-id='type-id-52' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='481' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32960'>
        <var-decl name='zc_nvlist_dst_size' type-id='type-id-52' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='482' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='33024'>
        <var-decl name='zc_nvlist_dst_filled' type-id='type-id-31' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='483' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='33056'>
        <var-decl name='zc_pad2' type-id='type-id-6' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='484' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='33088'>
        <var-decl name='zc_history' type-id='type-id-52' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='490' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='33152'>
        <var-decl name='zc_value' type-id='type-id-278' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='491' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='98688'>
        <var-decl name='zc_string' type-id='type-id-197' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='492' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='100736'>
        <var-decl name='zc_guid' type-id='type-id-52' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='493' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='100800'>
        <var-decl name='zc_nvlist_conf' type-id='type-id-52' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='494' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='100864'>
        <var-decl name='zc_nvlist_conf_size' type-id='type-id-52' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='495' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='100928'>
        <var-decl name='zc_cookie' type-id='type-id-52' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='496' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='100992'>
        <var-decl name='zc_objset_type' type-id='type-id-52' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='497' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='101056'>
        <var-decl name='zc_perm_action' type-id='type-id-52' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='498' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='101120'>
        <var-decl name='zc_history_len' type-id='type-id-52' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='499' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='101184'>
        <var-decl name='zc_history_offset' type-id='type-id-52' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='500' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='101248'>
        <var-decl name='zc_obj' type-id='type-id-52' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='501' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='101312'>
        <var-decl name='zc_iflags' type-id='type-id-52' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='502' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='101376'>
        <var-decl name='zc_share' type-id='type-id-300' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='503' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='101632'>
        <var-decl name='zc_objset_stats' type-id='type-id-222' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='504' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='103936'>
        <var-decl name='zc_begin_record' type-id='type-id-301' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='505' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='106368'>
        <var-decl name='zc_inject_record' type-id='type-id-302' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='506' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109184'>
        <var-decl name='zc_defer_destroy' type-id='type-id-45' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='507' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109216'>
        <var-decl name='zc_flags' type-id='type-id-45' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='508' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109248'>
        <var-decl name='zc_action_handle' type-id='type-id-52' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='509' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109312'>
        <var-decl name='zc_cleanup_fd' type-id='type-id-6' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='510' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109344'>
        <var-decl name='zc_simple' type-id='type-id-56' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='511' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109352'>
        <var-decl name='zc_pad' type-id='type-id-280' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='512' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109376'>
        <var-decl name='zc_sendobj' type-id='type-id-52' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='513' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109440'>
        <var-decl name='zc_fromobj' type-id='type-id-52' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='514' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109504'>
        <var-decl name='zc_createtxg' type-id='type-id-52' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='515' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109568'>
        <var-decl name='zc_stat' type-id='type-id-303' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='516' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109888'>
        <var-decl name='zc_zoneid' type-id='type-id-52' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='517' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='zfs_share_t' type-id='type-id-304' filepath='../../include/sys/zfs_ioctl.h' line='457' column='1' id='type-id-300'/>
    <class-decl name='zfs_share' size-in-bits='256' is-struct='yes' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='452' column='1' id='type-id-304'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='z_exportdata' type-id='type-id-52' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='453' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='z_sharedata' type-id='type-id-52' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='454' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='z_sharetype' type-id='type-id-52' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='455' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='z_sharemax' type-id='type-id-52' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='456' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='drr_begin' size-in-bits='2432' is-struct='yes' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='231' column='1' id='type-id-301'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='drr_magic' type-id='type-id-52' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='232' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='drr_versioninfo' type-id='type-id-52' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='233' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='drr_creation_time' type-id='type-id-52' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='234' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='drr_type' type-id='type-id-260' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='235' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='drr_flags' type-id='type-id-45' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='236' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='drr_toguid' type-id='type-id-52' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='237' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='drr_fromguid' type-id='type-id-52' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='238' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='drr_toname' type-id='type-id-197' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='239' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='zinject_record_t' type-id='type-id-305' filepath='../../include/sys/zfs_ioctl.h' line='421' column='1' id='type-id-302'/>
    <class-decl name='zinject_record' size-in-bits='2816' is-struct='yes' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='403' column='1' id='type-id-305'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='zi_objset' type-id='type-id-52' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='404' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='zi_object' type-id='type-id-52' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='405' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='zi_start' type-id='type-id-52' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='406' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='zi_end' type-id='type-id-52' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='407' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='zi_guid' type-id='type-id-52' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='408' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='zi_level' type-id='type-id-45' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='409' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='zi_error' type-id='type-id-45' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='410' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='zi_type' type-id='type-id-52' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='411' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='zi_freq' type-id='type-id-45' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='412' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='zi_failfast' type-id='type-id-45' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='413' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='zi_func' type-id='type-id-197' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='414' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2560'>
        <var-decl name='zi_iotype' type-id='type-id-45' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='415' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2592'>
        <var-decl name='zi_duration' type-id='type-id-100' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='416' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2624'>
        <var-decl name='zi_timer' type-id='type-id-52' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='417' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2688'>
        <var-decl name='zi_nlanes' type-id='type-id-52' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='418' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2752'>
        <var-decl name='zi_cmd' type-id='type-id-45' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='419' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2784'>
        <var-decl name='zi_dvas' type-id='type-id-45' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='420' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='zfs_stat_t' type-id='type-id-306' filepath='../../include/sys/zfs_stat.h' line='47' column='1' id='type-id-303'/>
    <class-decl name='zfs_stat' size-in-bits='320' is-struct='yes' visibility='default' filepath='../../include/sys/zfs_stat.h' line='42' column='1' id='type-id-306'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='zs_gen' type-id='type-id-52' visibility='default' filepath='../../include/sys/zfs_stat.h' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='zs_mode' type-id='type-id-52' visibility='default' filepath='../../include/sys/zfs_stat.h' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='zs_links' type-id='type-id-52' visibility='default' filepath='../../include/sys/zfs_stat.h' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='zs_ctime' type-id='type-id-64' visibility='default' filepath='../../include/sys/zfs_stat.h' line='46' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-18' size-in-bits='64' id='type-id-307'/>
    <qualified-type-def type-id='type-id-219' const='yes' id='type-id-308'/>
    <pointer-type-def type-id='type-id-308' size-in-bits='64' id='type-id-309'/>
    <pointer-type-def type-id='type-id-310' size-in-bits='64' id='type-id-286'/>
    <pointer-type-def type-id='type-id-6' size-in-bits='64' id='type-id-311'/>
    <pointer-type-def type-id='type-id-297' size-in-bits='64' id='type-id-312'/>
    <pointer-type-def type-id='type-id-52' size-in-bits='64' id='type-id-180'/>
    <pointer-type-def type-id='type-id-299' size-in-bits='64' id='type-id-313'/>
    <pointer-type-def type-id='type-id-290' size-in-bits='64' id='type-id-292'/>
    <pointer-type-def type-id='type-id-291' size-in-bits='64' id='type-id-314'/>
    <pointer-type-def type-id='type-id-314' size-in-bits='64' id='type-id-315'/>
    <pointer-type-def type-id='type-id-296' size-in-bits='64' id='type-id-316'/>
    <function-decl name='zfs_wait_status' mangled-name='zfs_wait_status' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='5543' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_wait_status'>
      <parameter type-id='type-id-266' name='zhp' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='5543' column='1'/>
      <parameter type-id='type-id-283' name='activity' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='5543' column='1'/>
      <parameter type-id='type-id-185' name='missing' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='5544' column='1'/>
      <parameter type-id='type-id-185' name='waited' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='5544' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zvol_volsize_to_reservation' mangled-name='zvol_volsize_to_reservation' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='5487' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zvol_volsize_to_reservation'>
      <parameter type-id='type-id-221' name='zph' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='5487' column='1'/>
      <parameter type-id='type-id-52' name='volsize' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='5487' column='1'/>
      <parameter type-id='type-id-97' name='props' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='5488' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='zfs_get_holds' mangled-name='zfs_get_holds' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='5229' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_get_holds'>
      <parameter type-id='type-id-266' name='zhp' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='5229' column='1'/>
      <parameter type-id='type-id-274' name='nvl' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='5229' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_set_fsacl' mangled-name='zfs_set_fsacl' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='5175' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_set_fsacl'>
      <parameter type-id='type-id-266' name='zhp' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='5175' column='1'/>
      <parameter type-id='type-id-31' name='un' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='5175' column='1'/>
      <parameter type-id='type-id-97' name='nvl' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='5175' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_get_fsacl' mangled-name='zfs_get_fsacl' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='5109' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_get_fsacl'>
      <parameter type-id='type-id-266' name='zhp' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='5109' column='1'/>
      <parameter type-id='type-id-274' name='nvl' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='5109' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_release' mangled-name='zfs_release' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='5028' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_release'>
      <parameter type-id='type-id-266' name='zhp' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='5028' column='1'/>
      <parameter type-id='type-id-4' name='snapname' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='5028' column='1'/>
      <parameter type-id='type-id-4' name='tag' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='5028' column='1'/>
      <parameter type-id='type-id-31' name='recursive' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='5029' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_hold_nvl' mangled-name='zfs_hold_nvl' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='4929' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_hold_nvl'>
      <parameter type-id='type-id-266' name='zhp' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='4929' column='1'/>
      <parameter type-id='type-id-6' name='cleanup_fd' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='4929' column='1'/>
      <parameter type-id='type-id-97' name='holds' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='4929' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_hold' mangled-name='zfs_hold' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='4897' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_hold'>
      <parameter type-id='type-id-266' name='zhp' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='4897' column='1'/>
      <parameter type-id='type-id-4' name='snapname' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='4897' column='1'/>
      <parameter type-id='type-id-4' name='tag' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='4897' column='1'/>
      <parameter type-id='type-id-31' name='recursive' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='4898' column='1'/>
      <parameter type-id='type-id-6' name='cleanup_fd' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='4898' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_userspace' mangled-name='zfs_userspace' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='4820' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_userspace'>
      <parameter type-id='type-id-266' name='zhp' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='4820' column='1'/>
      <parameter type-id='type-id-285' name='type' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='4820' column='1'/>
      <parameter type-id='type-id-287' name='func' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='4821' column='1'/>
      <parameter type-id='type-id-72' name='arg' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='4821' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_smb_acl_rename' mangled-name='zfs_smb_acl_rename' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='4812' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_smb_acl_rename'>
      <parameter type-id='type-id-220' name='hdl' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='4812' column='1'/>
      <parameter type-id='type-id-18' name='dataset' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='4812' column='1'/>
      <parameter type-id='type-id-18' name='path' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='4812' column='1'/>
      <parameter type-id='type-id-18' name='oldname' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='4813' column='1'/>
      <parameter type-id='type-id-18' name='newname' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='4813' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_smb_acl_purge' mangled-name='zfs_smb_acl_purge' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='4805' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_smb_acl_purge'>
      <parameter type-id='type-id-220' name='hdl' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='4805' column='1'/>
      <parameter type-id='type-id-18' name='dataset' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='4805' column='1'/>
      <parameter type-id='type-id-18' name='path' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='4805' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_smb_acl_remove' mangled-name='zfs_smb_acl_remove' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='4797' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_smb_acl_remove'>
      <parameter type-id='type-id-220' name='hdl' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='4797' column='1'/>
      <parameter type-id='type-id-18' name='dataset' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='4797' column='1'/>
      <parameter type-id='type-id-18' name='path' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='4798' column='1'/>
      <parameter type-id='type-id-18' name='resource' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='4798' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_smb_acl_add' mangled-name='zfs_smb_acl_add' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='4789' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_smb_acl_add'>
      <parameter type-id='type-id-220' name='hdl' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='4789' column='1'/>
      <parameter type-id='type-id-18' name='dataset' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='4789' column='1'/>
      <parameter type-id='type-id-18' name='path' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='4790' column='1'/>
      <parameter type-id='type-id-18' name='resource' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='4790' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_prune_proplist' mangled-name='zfs_prune_proplist' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='4707' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prune_proplist'>
      <parameter type-id='type-id-266' name='zhp' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='4707' column='1'/>
      <parameter type-id='type-id-223' name='props' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='4707' column='1'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='zfs_expand_proplist' mangled-name='zfs_expand_proplist' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='4610' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_expand_proplist'>
      <parameter type-id='type-id-266' name='zhp' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='4610' column='1'/>
      <parameter type-id='type-id-315' name='plp' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='4610' column='1'/>
      <parameter type-id='type-id-31' name='received' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='4610' column='1'/>
      <parameter type-id='type-id-31' name='literal' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='4611' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_get_user_props' mangled-name='zfs_get_user_props' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='4591' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_get_user_props'>
      <parameter type-id='type-id-266' name='zhp' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='4591' column='1'/>
      <return type-id='type-id-97'/>
    </function-decl>
    <function-decl name='zfs_get_recvd_props' mangled-name='zfs_get_recvd_props' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='4582' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_get_recvd_props'>
      <parameter type-id='type-id-266' name='zhp' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='4582' column='1'/>
      <return type-id='type-id-97'/>
    </function-decl>
    <function-decl name='zfs_get_all_props' mangled-name='zfs_get_all_props' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='4576' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_get_all_props'>
      <parameter type-id='type-id-266' name='zhp' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='4576' column='1'/>
      <return type-id='type-id-97'/>
    </function-decl>
    <function-decl name='zfs_rename' mangled-name='zfs_rename' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='4374' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_rename'>
      <parameter type-id='type-id-266' name='zhp' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='4374' column='1'/>
      <parameter type-id='type-id-4' name='target' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='4374' column='1'/>
      <parameter type-id='type-id-294' name='flags' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='4374' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_rollback' mangled-name='zfs_rollback' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='4274' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_rollback'>
      <parameter type-id='type-id-266' name='zhp' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='4274' column='1'/>
      <parameter type-id='type-id-266' name='snap' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='4274' column='1'/>
      <parameter type-id='type-id-31' name='force' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='4274' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_snapshot' mangled-name='zfs_snapshot' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='4173' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_snapshot'>
      <parameter type-id='type-id-220' name='hdl' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='4173' column='1'/>
      <parameter type-id='type-id-4' name='path' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='4173' column='1'/>
      <parameter type-id='type-id-31' name='recursive' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='4173' column='1'/>
      <parameter type-id='type-id-97' name='props' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='4174' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_snapshot_nvl' mangled-name='zfs_snapshot_nvl' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='4093' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_snapshot_nvl'>
      <parameter type-id='type-id-220' name='hdl' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='4093' column='1'/>
      <parameter type-id='type-id-97' name='snaps' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='4093' column='1'/>
      <parameter type-id='type-id-97' name='props' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='4093' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_promote' mangled-name='zfs_promote' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='4009' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_promote'>
      <parameter type-id='type-id-266' name='zhp' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='4009' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_clone' mangled-name='zfs_clone' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='3923' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_clone'>
      <parameter type-id='type-id-266' name='zhp' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='3923' column='1'/>
      <parameter type-id='type-id-4' name='target' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='3923' column='1'/>
      <parameter type-id='type-id-97' name='props' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='3923' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_destroy_snaps_nvl' mangled-name='zfs_destroy_snaps_nvl' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='3876' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_destroy_snaps_nvl'>
      <parameter type-id='type-id-220' name='hdl' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='3876' column='1'/>
      <parameter type-id='type-id-97' name='snaps' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='3876' column='1'/>
      <parameter type-id='type-id-31' name='defer' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='3876' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_destroy_snaps' mangled-name='zfs_destroy_snaps' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='3852' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_destroy_snaps'>
      <parameter type-id='type-id-266' name='zhp' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='3852' column='1'/>
      <parameter type-id='type-id-18' name='snapname' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='3852' column='1'/>
      <parameter type-id='type-id-31' name='defer' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='3852' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_destroy' mangled-name='zfs_destroy' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='3784' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_destroy'>
      <parameter type-id='type-id-266' name='zhp' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='3784' column='1'/>
      <parameter type-id='type-id-31' name='defer' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='3784' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_create' mangled-name='zfs_create' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='3609' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_create'>
      <parameter type-id='type-id-220' name='hdl' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='3609' column='1'/>
      <parameter type-id='type-id-4' name='path' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='3609' column='1'/>
      <parameter type-id='type-id-179' name='type' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='3609' column='1'/>
      <parameter type-id='type-id-97' name='props' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='3610' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_create_ancestors' mangled-name='zfs_create_ancestors' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='3572' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_create_ancestors'>
      <parameter type-id='type-id-220' name='hdl' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='3572' column='1'/>
      <parameter type-id='type-id-4' name='path' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='3572' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='create_parents' mangled-name='create_parents' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='3498' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='create_parents'>
      <parameter type-id='type-id-220' name='hdl' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='3498' column='1'/>
      <parameter type-id='type-id-18' name='target' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='3498' column='1'/>
      <parameter type-id='type-id-6' name='prefixlen' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='3498' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_dataset_exists' mangled-name='zfs_dataset_exists' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='3472' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_dataset_exists'>
      <parameter type-id='type-id-220' name='hdl' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='3472' column='1'/>
      <parameter type-id='type-id-4' name='path' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='3472' column='1'/>
      <parameter type-id='type-id-179' name='types' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='3472' column='1'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='zfs_parent_name' mangled-name='zfs_parent_name' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='3377' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_parent_name'>
      <parameter type-id='type-id-266' name='zhp' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='3377' column='1'/>
      <parameter type-id='type-id-18' name='buf' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='3377' column='1'/>
      <parameter type-id='type-id-73' name='buflen' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='3377' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_get_type' mangled-name='zfs_get_type' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='3331' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_get_type'>
      <parameter type-id='type-id-309' name='zhp' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='3331' column='1'/>
      <return type-id='type-id-179'/>
    </function-decl>
    <function-decl name='zfs_get_pool_name' mangled-name='zfs_get_pool_name' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='3322' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_get_pool_name'>
      <parameter type-id='type-id-309' name='zhp' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='3322' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zfs_get_name' mangled-name='zfs_get_name' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='3313' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_get_name'>
      <parameter type-id='type-id-309' name='zhp' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='3313' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zfs_prop_get_written' mangled-name='zfs_prop_get_written' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='3288' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_get_written'>
      <parameter type-id='type-id-266' name='zhp' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='3288' column='1'/>
      <parameter type-id='type-id-4' name='propname' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='3288' column='1'/>
      <parameter type-id='type-id-18' name='propbuf' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='3289' column='1'/>
      <parameter type-id='type-id-6' name='proplen' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='3289' column='1'/>
      <parameter type-id='type-id-31' name='literal' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='3289' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_prop_get_written_int' mangled-name='zfs_prop_get_written_int' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='3253' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_get_written_int'>
      <parameter type-id='type-id-266' name='zhp' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='3253' column='1'/>
      <parameter type-id='type-id-4' name='propname' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='3253' column='1'/>
      <parameter type-id='type-id-180' name='propvalue' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='3254' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_prop_get_userquota' mangled-name='zfs_prop_get_userquota' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='3217' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_get_userquota'>
      <parameter type-id='type-id-266' name='zhp' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='3217' column='1'/>
      <parameter type-id='type-id-4' name='propname' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='3217' column='1'/>
      <parameter type-id='type-id-18' name='propbuf' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='3218' column='1'/>
      <parameter type-id='type-id-6' name='proplen' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='3218' column='1'/>
      <parameter type-id='type-id-31' name='literal' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='3218' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_prop_get_userquota_int' mangled-name='zfs_prop_get_userquota_int' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='3207' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_get_userquota_int'>
      <parameter type-id='type-id-266' name='zhp' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='3207' column='1'/>
      <parameter type-id='type-id-4' name='propname' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='3207' column='1'/>
      <parameter type-id='type-id-180' name='propvalue' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='3208' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_prop_get_numeric' mangled-name='zfs_prop_get_numeric' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='3003' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_get_numeric'>
      <parameter type-id='type-id-266' name='zhp' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='3003' column='1'/>
      <parameter type-id='type-id-178' name='prop' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='3003' column='1'/>
      <parameter type-id='type-id-180' name='value' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='3003' column='1'/>
      <parameter type-id='type-id-316' name='src' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='3004' column='1'/>
      <parameter type-id='type-id-18' name='statbuf' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='3004' column='1'/>
      <parameter type-id='type-id-73' name='statlen' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='3004' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_prop_get_int' mangled-name='zfs_prop_get_int' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='2980' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_get_int'>
      <parameter type-id='type-id-266' name='zhp' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='2980' column='1'/>
      <parameter type-id='type-id-178' name='prop' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='2980' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='zfs_prop_get' mangled-name='zfs_prop_get' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='2605' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_get'>
      <parameter type-id='type-id-266' name='zhp' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='2605' column='1'/>
      <parameter type-id='type-id-178' name='prop' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='2605' column='1'/>
      <parameter type-id='type-id-18' name='propbuf' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='2605' column='1'/>
      <parameter type-id='type-id-73' name='proplen' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='2605' column='1'/>
      <parameter type-id='type-id-316' name='src' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='2606' column='1'/>
      <parameter type-id='type-id-18' name='statbuf' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='2606' column='1'/>
      <parameter type-id='type-id-73' name='statlen' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='2606' column='1'/>
      <parameter type-id='type-id-31' name='literal' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='2606' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_get_clones_nvl' mangled-name='zfs_get_clones_nvl' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='2436' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_get_clones_nvl'>
      <parameter type-id='type-id-266' name='zhp' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='2436' column='1'/>
      <return type-id='type-id-97'/>
    </function-decl>
    <function-decl name='zfs_prop_get_recvd' mangled-name='zfs_prop_get_recvd' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='2349' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_get_recvd'>
      <parameter type-id='type-id-266' name='zhp' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='2349' column='1'/>
      <parameter type-id='type-id-4' name='propname' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='2349' column='1'/>
      <parameter type-id='type-id-18' name='propbuf' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='2349' column='1'/>
      <parameter type-id='type-id-73' name='proplen' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='2350' column='1'/>
      <parameter type-id='type-id-31' name='literal' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='2350' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='getprop_uint64' mangled-name='getprop_uint64' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='2038' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getprop_uint64'>
      <parameter type-id='type-id-266' name='zhp' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='2038' column='1'/>
      <parameter type-id='type-id-178' name='prop' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='2038' column='1'/>
      <parameter type-id='type-id-307' name='source' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='2038' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='zfs_prop_inherit' mangled-name='zfs_prop_inherit' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='1926' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_inherit'>
      <parameter type-id='type-id-266' name='zhp' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='1926' column='1'/>
      <parameter type-id='type-id-4' name='propname' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='1926' column='1'/>
      <parameter type-id='type-id-31' name='received' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='1926' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_prop_set_list' mangled-name='zfs_prop_set_list' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='1744' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_set_list'>
      <parameter type-id='type-id-266' name='zhp' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='1744' column='1'/>
      <parameter type-id='type-id-97' name='props' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='1744' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_prop_set' mangled-name='zfs_prop_set' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='1713' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_set'>
      <parameter type-id='type-id-266' name='zhp' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='1713' column='1'/>
      <parameter type-id='type-id-4' name='propname' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='1713' column='1'/>
      <parameter type-id='type-id-4' name='propval' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='1713' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_valid_proplist' mangled-name='zfs_valid_proplist' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='1004' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_valid_proplist'>
      <parameter type-id='type-id-220' name='hdl' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='1004' column='1'/>
      <parameter type-id='type-id-179' name='type' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='1004' column='1'/>
      <parameter type-id='type-id-97' name='nvl' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='1004' column='1'/>
      <parameter type-id='type-id-52' name='zoned' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='1005' column='1'/>
      <parameter type-id='type-id-266' name='zhp' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='1005' column='1'/>
      <parameter type-id='type-id-221' name='zpool_hdl' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='1005' column='1'/>
      <parameter type-id='type-id-31' name='key_params_ok' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='1006' column='1'/>
      <parameter type-id='type-id-4' name='errbuf' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='1006' column='1'/>
      <return type-id='type-id-97'/>
    </function-decl>
    <function-decl name='zfs_spa_version' mangled-name='zfs_spa_version' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='967' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_spa_version'>
      <parameter type-id='type-id-266' name='zhp' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='967' column='1'/>
      <parameter type-id='type-id-311' name='spa_version' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='967' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='libzfs_mnttab_remove' mangled-name='libzfs_mnttab_remove' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='947' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='libzfs_mnttab_remove'>
      <parameter type-id='type-id-220' name='hdl' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='947' column='1'/>
      <parameter type-id='type-id-4' name='fsname' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='947' column='1'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='libzfs_mnttab_add' mangled-name='libzfs_mnttab_add' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='917' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='libzfs_mnttab_add'>
      <parameter type-id='type-id-220' name='hdl' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='917' column='1'/>
      <parameter type-id='type-id-4' name='special' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='917' column='1'/>
      <parameter type-id='type-id-4' name='mountp' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='918' column='1'/>
      <parameter type-id='type-id-4' name='mntopts' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='918' column='1'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='libzfs_mnttab_find' mangled-name='libzfs_mnttab_find' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='871' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='libzfs_mnttab_find'>
      <parameter type-id='type-id-220' name='hdl' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='871' column='1'/>
      <parameter type-id='type-id-4' name='fsname' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='871' column='1'/>
      <parameter type-id='type-id-312' name='entry' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='872' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='libzfs_mnttab_cache' mangled-name='libzfs_mnttab_cache' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='865' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='libzfs_mnttab_cache'>
      <parameter type-id='type-id-220' name='hdl' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='865' column='1'/>
      <parameter type-id='type-id-31' name='enable' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='865' column='1'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='libzfs_mnttab_fini' mangled-name='libzfs_mnttab_fini' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='847' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='libzfs_mnttab_fini'>
      <parameter type-id='type-id-220' name='hdl' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='847' column='1'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='libzfs_mnttab_init' mangled-name='libzfs_mnttab_init' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='800' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='libzfs_mnttab_init'>
      <parameter type-id='type-id-220' name='hdl' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='800' column='1'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='zfs_close' mangled-name='zfs_close' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='772' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_close'>
      <parameter type-id='type-id-266' name='zhp' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='772' column='1'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='zfs_open' mangled-name='zfs_open' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='683' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_open'>
      <parameter type-id='type-id-220' name='hdl' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='683' column='1'/>
      <parameter type-id='type-id-4' name='path' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='683' column='1'/>
      <parameter type-id='type-id-6' name='types' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='683' column='1'/>
      <return type-id='type-id-266'/>
    </function-decl>
    <function-decl name='make_bookmark_handle' mangled-name='make_bookmark_handle' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='618' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='make_bookmark_handle'>
      <parameter type-id='type-id-266' name='parent' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='618' column='1'/>
      <parameter type-id='type-id-4' name='path' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='618' column='1'/>
      <parameter type-id='type-id-97' name='bmark_props' filepath='/home/ryan/zfs/lib/libzfs/libzfs_dataset.c' line='619' column='1'/>
      <return type-id='type-id-266'/>
    </function-decl>
