<abi-corpus version='2.0' path='libzfs.so' architecture='elf-amd-x86_64' soname='libzfs.so.4'>
  <elf-needed>
    <dependency name='libzfs_core.so.3'/>
    <dependency name='libuuid.so.1'/>
    <dependency name='libblkid.so.1'/>
    <dependency name='libudev.so.1'/>
    <dependency name='libnvpair.so.3'/>
    <dependency name='libtirpc.so.3'/>
    <dependency name='libuutil.so.3'/>
    <dependency name='libm.so.6'/>
    <dependency name='libcrypto.so.1.1'/>
    <dependency name='libz.so.1'/>
    <dependency name='libpthread.so.0'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='SHA256Init' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='SHA2Final' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='SHA2Init' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='SHA2Update' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='SHA384Init' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='SHA512Init' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='zprop_expand_list' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zprop_free_list' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zprop_get_list' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zprop_index_to_string' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zprop_iter' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zprop_iter_common' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zprop_name_to_prop' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zprop_parse_value' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zprop_print_one_property' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zprop_random_value' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zprop_register_hidden' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zprop_register_impl' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zprop_register_index' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zprop_register_number' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zprop_register_string' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zprop_string_to_index' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zprop_valid_for_type' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zprop_values' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zprop_width' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zvol_volsize_to_reservation' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <elf-variable-symbols>
    <elf-symbol name='fletcher_4_abd_ops' size='24' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fletcher_4_avx2_ops' size='64' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fletcher_4_avx512bw_ops' size='64' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fletcher_4_avx512f_ops' size='64' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fletcher_4_sse2_ops' size='64' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fletcher_4_ssse3_ops' size='64' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fletcher_4_superscalar4_ops' size='64' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fletcher_4_superscalar_ops' size='64' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='libzfs_config_ops' size='16' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nfs_only' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='proto_table' size='48' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='share_all_proto' size='12' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='smb_only' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='smb_shares' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spa_feature_table' size='1848' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zfeature_checks_disable' size='4' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zfs_deleg_perm_tab' size='512' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zfs_history_event_names' size='328' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zfs_max_dataset_nesting' size='4' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zfs_userquota_prop_prefixes' size='96' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-variable-symbols>
  <abi-instr address-size='64' path='libshare.c' comp-dir-path='/home/hutter2/release20/lib/libshare' language='LANG_C99'>
    <class-decl name='sa_share_fsinfo' size-in-bits='64' is-struct='yes' visibility='default' filepath='/home/hutter2/release20/lib/libshare/libshare_impl.h' line='28' column='1' id='type-id-1'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='shareopts' type-id='type-id-2' visibility='default' filepath='/home/hutter2/release20/lib/libshare/libshare_impl.h' line='29' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='sa_share_fsinfo_t' type-id='type-id-1' filepath='/home/hutter2/release20/lib/libshare/libshare_impl.h' line='30' column='1' id='type-id-3'/>
    <class-decl name='sa_share_impl' size-in-bits='192' is-struct='yes' visibility='default' filepath='/home/hutter2/release20/lib/libshare/libshare_impl.h' line='32' column='1' id='type-id-4'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sa_mountpoint' type-id='type-id-2' visibility='default' filepath='/home/hutter2/release20/lib/libshare/libshare_impl.h' line='33' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='sa_zfsname' type-id='type-id-2' visibility='default' filepath='/home/hutter2/release20/lib/libshare/libshare_impl.h' line='34' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='sa_fsinfo' type-id='type-id-5' visibility='default' filepath='/home/hutter2/release20/lib/libshare/libshare_impl.h' line='36' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='sa_share_impl_t' type-id='type-id-6' filepath='/home/hutter2/release20/lib/libshare/libshare_impl.h' line='37' column='1' id='type-id-7'/>
    <class-decl name='sa_share_ops' size-in-bits='448' is-struct='yes' visibility='default' filepath='/home/hutter2/release20/lib/libshare/libshare_impl.h' line='42' column='1' id='type-id-8'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='enable_share' type-id='type-id-9' visibility='default' filepath='/home/hutter2/release20/lib/libshare/libshare_impl.h' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='disable_share' type-id='type-id-9' visibility='default' filepath='/home/hutter2/release20/lib/libshare/libshare_impl.h' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='is_shared' type-id='type-id-10' visibility='default' filepath='/home/hutter2/release20/lib/libshare/libshare_impl.h' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='validate_shareopts' type-id='type-id-11' visibility='default' filepath='/home/hutter2/release20/lib/libshare/libshare_impl.h' line='46' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='update_shareopts' type-id='type-id-12' visibility='default' filepath='/home/hutter2/release20/lib/libshare/libshare_impl.h' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='clear_shareopts' type-id='type-id-13' visibility='default' filepath='/home/hutter2/release20/lib/libshare/libshare_impl.h' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='commit_shares' type-id='type-id-14' visibility='default' filepath='/home/hutter2/release20/lib/libshare/libshare_impl.h' line='50' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='sa_share_ops_t' type-id='type-id-8' filepath='/home/hutter2/release20/lib/libshare/libshare_impl.h' line='51' column='1' id='type-id-15'/>
    <class-decl name='sa_fstype' size-in-bits='256' is-struct='yes' visibility='default' filepath='/home/hutter2/release20/lib/libshare/libshare_impl.h' line='53' column='1' id='type-id-16'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-17' visibility='default' filepath='/home/hutter2/release20/lib/libshare/libshare_impl.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='name' type-id='type-id-18' visibility='default' filepath='/home/hutter2/release20/lib/libshare/libshare_impl.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ops' type-id='type-id-19' visibility='default' filepath='/home/hutter2/release20/lib/libshare/libshare_impl.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='fsinfo_index' type-id='type-id-20' visibility='default' filepath='/home/hutter2/release20/lib/libshare/libshare_impl.h' line='58' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='sa_fstype_t' type-id='type-id-16' filepath='/home/hutter2/release20/lib/libshare/libshare_impl.h' line='59' column='1' id='type-id-21'/>
    <qualified-type-def type-id='type-id-15' const='yes' id='type-id-22'/>
    <pointer-type-def type-id='type-id-22' size-in-bits='64' id='type-id-19'/>
    <pointer-type-def type-id='type-id-23' size-in-bits='64' id='type-id-14'/>
    <pointer-type-def type-id='type-id-24' size-in-bits='64' id='type-id-11'/>
    <pointer-type-def type-id='type-id-25' size-in-bits='64' id='type-id-9'/>
    <pointer-type-def type-id='type-id-26' size-in-bits='64' id='type-id-12'/>
    <pointer-type-def type-id='type-id-16' size-in-bits='64' id='type-id-17'/>
    <pointer-type-def type-id='type-id-21' size-in-bits='64' id='type-id-27'/>
    <pointer-type-def type-id='type-id-3' size-in-bits='64' id='type-id-5'/>
    <pointer-type-def type-id='type-id-4' size-in-bits='64' id='type-id-6'/>
    <pointer-type-def type-id='type-id-28' size-in-bits='64' id='type-id-10'/>
    <pointer-type-def type-id='type-id-29' size-in-bits='64' id='type-id-13'/>
    <function-decl name='register_fstype' mangled-name='register_fstype' filepath='/home/hutter2/release20/lib/libshare/libshare.c' line='51' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='register_fstype'>
      <parameter type-id='type-id-18' name='name' filepath='/home/hutter2/release20/lib/libshare/libshare.c' line='51' column='1'/>
      <parameter type-id='type-id-19' name='ops' filepath='/home/hutter2/release20/lib/libshare/libshare.c' line='51' column='1'/>
      <return type-id='type-id-27'/>
    </function-decl>
    <function-decl name='libshare_nfs_init' mangled-name='libshare_nfs_init' filepath='/home/hutter2/release20/lib/libshare/nfs.h' line='27' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='libshare_nfs_init'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='libshare_smb_init' mangled-name='libshare_smb_init' filepath='/home/hutter2/release20/lib/libshare/smb.h' line='49' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='libshare_smb_init'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-23'>
      <return type-id='type-id-20'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-24'>
      <parameter type-id='type-id-18'/>
      <return type-id='type-id-20'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-25'>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-20'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-26'>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-18'/>
      <return type-id='type-id-20'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-28'>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-31'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-29'>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-30'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='os/linux/nfs.c' comp-dir-path='/home/hutter2/release20/lib/libshare' language='LANG_C99'>
    <function-decl name='rename' filepath='/usr/include/stdio.h' line='148' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-18'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='fputs' filepath='/usr/include/stdio.h' line='631' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-32'/>
      <parameter type-id='type-id-33'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='flock' filepath='/usr/include/sys/file.h' line='50' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-20'/>
      <parameter type-id='type-id-20'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='mkdir' filepath='/usr/include/sys/stat.h' line='317' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-34'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='unlink' filepath='/usr/include/unistd.h' line='838' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-18'/>
      <return type-id='type-id-20'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='os/linux/smb.c' comp-dir-path='/home/hutter2/release20/lib/libshare' language='LANG_C99'>
    <array-type-def dimensions='1' type-id='type-id-35' size-in-bits='2040' id='type-id-36'>
      <subrange length='255' type-id='type-id-37' id='type-id-38'/>
    </array-type-def>
    <class-decl name='smb_share_s' size-in-bits='36992' is-struct='yes' visibility='default' filepath='./smb.h' line='38' column='1' id='type-id-39'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-36' visibility='default' filepath='./smb.h' line='39' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2040'>
        <var-decl name='path' type-id='type-id-40' visibility='default' filepath='./smb.h' line='40' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='34808'>
        <var-decl name='comment' type-id='type-id-36' visibility='default' filepath='./smb.h' line='41' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='36864'>
        <var-decl name='guest_ok' type-id='type-id-31' visibility='default' filepath='./smb.h' line='42' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='36928'>
        <var-decl name='next' type-id='type-id-41' visibility='default' filepath='./smb.h' line='44' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='smb_share_t' type-id='type-id-39' filepath='./smb.h' line='45' column='1' id='type-id-42'/>
    <class-decl name='dirent' size-in-bits='2240' is-struct='yes' visibility='default' filepath='/usr/include/bits/dirent.h' line='22' column='1' id='type-id-43'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='d_ino' type-id='type-id-44' visibility='default' filepath='/usr/include/bits/dirent.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='d_off' type-id='type-id-45' visibility='default' filepath='/usr/include/bits/dirent.h' line='29' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='d_reclen' type-id='type-id-46' visibility='default' filepath='/usr/include/bits/dirent.h' line='31' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='144'>
        <var-decl name='d_type' type-id='type-id-47' visibility='default' filepath='/usr/include/bits/dirent.h' line='32' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='152'>
        <var-decl name='d_name' type-id='type-id-48' visibility='default' filepath='/usr/include/bits/dirent.h' line='33' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-43' size-in-bits='64' id='type-id-49'/>
    <pointer-type-def type-id='type-id-39' size-in-bits='64' id='type-id-41'/>
    <pointer-type-def type-id='type-id-42' size-in-bits='64' id='type-id-50'/>
    <var-decl name='smb_shares' type-id='type-id-50' mangled-name='smb_shares' visibility='default' filepath='./smb.h' line='47' column='1' elf-symbol-id='smb_shares'/>
    <function-decl name='opendir' filepath='/usr/include/dirent.h' line='134' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-18'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='fgets' filepath='/usr/include/stdio.h' line='568' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-52'/>
      <parameter type-id='type-id-20'/>
      <parameter type-id='type-id-33'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-37'/>
    <type-decl name='unsigned short int' size-in-bits='16' id='type-id-46'/>
  </abi-instr>
  <abi-instr address-size='64' path='../../module/icp/algs/sha2/sha2.c' comp-dir-path='/home/hutter2/release20/lib/libzfs' language='LANG_C99'>
    <array-type-def dimensions='1' type-id='type-id-53' size-in-bits='64' id='type-id-54'>
      <subrange length='2' type-id='type-id-37' id='type-id-55'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-53' size-in-bits='1024' id='type-id-56'>
      <subrange length='32' type-id='type-id-37' id='type-id-57'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-53' size-in-bits='256' id='type-id-58'>
      <subrange length='8' type-id='type-id-37' id='type-id-59'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-60' size-in-bits='1024' id='type-id-61'>
      <subrange length='16' type-id='type-id-37' id='type-id-62'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-60' size-in-bits='512' id='type-id-63'>
      <subrange length='8' type-id='type-id-37' id='type-id-59'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-64' size-in-bits='1024' id='type-id-65'>
      <subrange length='128' type-id='type-id-37' id='type-id-66'/>
    </array-type-def>
    <class-decl name='SHA2_CTX' size-in-bits='1728' is-struct='yes' naming-typedef-id='type-id-67' visibility='default' filepath='../../lib/libspl/include/sys/sha2.h' line='69' column='1' id='type-id-68'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='algotype' type-id='type-id-53' visibility='default' filepath='../../lib/libspl/include/sys/sha2.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='state' type-id='type-id-69' visibility='default' filepath='../../lib/libspl/include/sys/sha2.h' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='count' type-id='type-id-70' visibility='default' filepath='../../lib/libspl/include/sys/sha2.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='buf_un' type-id='type-id-71' visibility='default' filepath='../../lib/libspl/include/sys/sha2.h' line='86' column='1'/>
      </data-member>
    </class-decl>
    <union-decl name='__anonymous_union__' size-in-bits='512' is-anonymous='yes' visibility='default' filepath='../../lib/libspl/include/sys/sha2.h' line='73' column='1' id='type-id-69'>
      <data-member access='public'>
        <var-decl name='s32' type-id='type-id-58' visibility='default' filepath='../../lib/libspl/include/sys/sha2.h' line='74' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='s64' type-id='type-id-63' visibility='default' filepath='../../lib/libspl/include/sys/sha2.h' line='75' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__1' size-in-bits='128' is-anonymous='yes' visibility='default' filepath='../../lib/libspl/include/sys/sha2.h' line='78' column='1' id='type-id-70'>
      <data-member access='public'>
        <var-decl name='c32' type-id='type-id-54' visibility='default' filepath='../../lib/libspl/include/sys/sha2.h' line='79' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='c64' type-id='type-id-72' visibility='default' filepath='../../lib/libspl/include/sys/sha2.h' line='80' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__2' size-in-bits='1024' is-anonymous='yes' visibility='default' filepath='../../lib/libspl/include/sys/sha2.h' line='82' column='1' id='type-id-71'>
      <data-member access='public'>
        <var-decl name='buf8' type-id='type-id-65' visibility='default' filepath='../../lib/libspl/include/sys/sha2.h' line='83' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='buf32' type-id='type-id-56' visibility='default' filepath='../../lib/libspl/include/sys/sha2.h' line='84' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='buf64' type-id='type-id-61' visibility='default' filepath='../../lib/libspl/include/sys/sha2.h' line='85' column='1'/>
      </data-member>
    </union-decl>
    <typedef-decl name='SHA2_CTX' type-id='type-id-68' filepath='../../lib/libspl/include/sys/sha2.h' line='87' column='1' id='type-id-67'/>
    <typedef-decl name='SHA256_CTX' type-id='type-id-67' filepath='../../lib/libspl/include/sys/sha2.h' line='89' column='1' id='type-id-73'/>
    <typedef-decl name='SHA384_CTX' type-id='type-id-67' filepath='../../lib/libspl/include/sys/sha2.h' line='90' column='1' id='type-id-74'/>
    <typedef-decl name='SHA512_CTX' type-id='type-id-67' filepath='../../lib/libspl/include/sys/sha2.h' line='91' column='1' id='type-id-75'/>
    <pointer-type-def type-id='type-id-73' size-in-bits='64' id='type-id-76'/>
    <pointer-type-def type-id='type-id-67' size-in-bits='64' id='type-id-77'/>
    <pointer-type-def type-id='type-id-74' size-in-bits='64' id='type-id-78'/>
    <pointer-type-def type-id='type-id-75' size-in-bits='64' id='type-id-79'/>
    <function-decl name='htonl' filepath='../../lib/libspl/include/os/linux/sys/byteorder.h' line='79' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-53'/>
      <return type-id='type-id-53'/>
    </function-decl>
    <function-decl name='SHA2Init' mangled-name='SHA2Init' filepath='../../module/icp/algs/sha2/sha2.c' line='674' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='SHA2Init'>
      <parameter type-id='type-id-60' name='mech' filepath='../../module/icp/algs/sha2/sha2.c' line='674' column='1'/>
      <parameter type-id='type-id-77' name='ctx' filepath='../../module/icp/algs/sha2/sha2.c' line='674' column='1'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='SHA256Init' mangled-name='SHA256Init' filepath='../../module/icp/algs/sha2/sha2.c' line='751' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='SHA256Init'>
      <parameter type-id='type-id-76' name='ctx' filepath='../../module/icp/algs/sha2/sha2.c' line='751' column='1'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='SHA384Init' mangled-name='SHA384Init' filepath='../../module/icp/algs/sha2/sha2.c' line='757' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='SHA384Init'>
      <parameter type-id='type-id-78' name='ctx' filepath='../../module/icp/algs/sha2/sha2.c' line='757' column='1'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='SHA512Init' mangled-name='SHA512Init' filepath='../../module/icp/algs/sha2/sha2.c' line='763' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='SHA512Init'>
      <parameter type-id='type-id-79' name='ctx' filepath='../../module/icp/algs/sha2/sha2.c' line='763' column='1'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='SHA2Update' mangled-name='SHA2Update' filepath='../../module/icp/algs/sha2/sha2.c' line='782' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='SHA2Update'>
      <parameter type-id='type-id-77' name='ctx' filepath='../../module/icp/algs/sha2/sha2.c' line='782' column='1'/>
      <parameter type-id='type-id-80' name='inptr' filepath='../../module/icp/algs/sha2/sha2.c' line='782' column='1'/>
      <parameter type-id='type-id-81' name='input_len' filepath='../../module/icp/algs/sha2/sha2.c' line='782' column='1'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='SHA2Final' mangled-name='SHA2Final' filepath='../../module/icp/algs/sha2/sha2.c' line='904' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='SHA2Final'>
      <parameter type-id='type-id-80' name='digest' filepath='../../module/icp/algs/sha2/sha2.c' line='904' column='1'/>
      <parameter type-id='type-id-77' name='ctx' filepath='../../module/icp/algs/sha2/sha2.c' line='904' column='1'/>
      <return type-id='type-id-30'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../../module/zcommon/cityhash.c' comp-dir-path='/home/hutter2/release20/lib/libzfs' language='LANG_C99'>
    <function-decl name='cityhash4' mangled-name='cityhash4' filepath='../../module/zcommon/cityhash.c' line='53' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='cityhash4'>
      <parameter type-id='type-id-60' name='w1' filepath='../../module/zcommon/cityhash.c' line='53' column='1'/>
      <parameter type-id='type-id-60' name='w2' filepath='../../module/zcommon/cityhash.c' line='53' column='1'/>
      <parameter type-id='type-id-60' name='w3' filepath='../../module/zcommon/cityhash.c' line='53' column='1'/>
      <parameter type-id='type-id-60' name='w4' filepath='../../module/zcommon/cityhash.c' line='53' column='1'/>
      <return type-id='type-id-60'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../../module/zcommon/zfeature_common.c' comp-dir-path='/home/hutter2/release20/lib/libzfs' language='LANG_C99'>
    <array-type-def dimensions='1' type-id='type-id-82' size-in-bits='14784' id='type-id-83'>
      <subrange length='33' type-id='type-id-37' id='type-id-84'/>
    </array-type-def>
    <enum-decl name='zfeature_flags' filepath='../../include/zfeature_common.h' line='84' column='1' id='type-id-85'>
      <underlying-type type-id='type-id-86'/>
      <enumerator name='ZFEATURE_FLAG_READONLY_COMPAT' value='1'/>
      <enumerator name='ZFEATURE_FLAG_MOS' value='2'/>
      <enumerator name='ZFEATURE_FLAG_ACTIVATE_ON_ENABLE' value='4'/>
      <enumerator name='ZFEATURE_FLAG_PER_DATASET' value='8'/>
    </enum-decl>
    <typedef-decl name='zfeature_flags_t' type-id='type-id-85' filepath='../../include/zfeature_common.h' line='96' column='1' id='type-id-87'/>
    <enum-decl name='zfeature_type' filepath='../../include/zfeature_common.h' line='98' column='1' id='type-id-88'>
      <underlying-type type-id='type-id-86'/>
      <enumerator name='ZFEATURE_TYPE_BOOLEAN' value='0'/>
      <enumerator name='ZFEATURE_TYPE_UINT64_ARRAY' value='1'/>
      <enumerator name='ZFEATURE_NUM_TYPES' value='2'/>
    </enum-decl>
    <typedef-decl name='zfeature_type_t' type-id='type-id-88' filepath='../../include/zfeature_common.h' line='102' column='1' id='type-id-89'/>
    <class-decl name='zfeature_info' size-in-bits='448' is-struct='yes' visibility='default' filepath='../../include/zfeature_common.h' line='104' column='1' id='type-id-90'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fi_feature' type-id='type-id-91' visibility='default' filepath='../../include/zfeature_common.h' line='105' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='fi_uname' type-id='type-id-18' visibility='default' filepath='../../include/zfeature_common.h' line='106' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='fi_guid' type-id='type-id-18' visibility='default' filepath='../../include/zfeature_common.h' line='107' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='fi_desc' type-id='type-id-18' visibility='default' filepath='../../include/zfeature_common.h' line='108' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='fi_flags' type-id='type-id-87' visibility='default' filepath='../../include/zfeature_common.h' line='109' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='fi_zfs_mod_supported' type-id='type-id-31' visibility='default' filepath='../../include/zfeature_common.h' line='110' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='fi_type' type-id='type-id-89' visibility='default' filepath='../../include/zfeature_common.h' line='111' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='fi_depends' type-id='type-id-92' visibility='default' filepath='../../include/zfeature_common.h' line='113' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='zfeature_info_t' type-id='type-id-90' filepath='../../include/zfeature_common.h' line='114' column='1' id='type-id-82'/>
    <qualified-type-def type-id='type-id-91' const='yes' id='type-id-93'/>
    <pointer-type-def type-id='type-id-93' size-in-bits='64' id='type-id-92'/>
    <var-decl name='spa_feature_table' type-id='type-id-83' mangled-name='spa_feature_table' visibility='default' filepath='../../include/zfeature_common.h' line='120' column='1' elf-symbol-id='spa_feature_table'/>
    <var-decl name='zfeature_checks_disable' type-id='type-id-31' mangled-name='zfeature_checks_disable' visibility='default' filepath='../../module/zcommon/zfeature_common.c' line='49' column='1' elf-symbol-id='zfeature_checks_disable'/>
    <function-decl name='zfeature_is_valid_guid' mangled-name='zfeature_is_valid_guid' filepath='../../module/zcommon/zfeature_common.c' line='74' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfeature_is_valid_guid'>
      <parameter type-id='type-id-18' name='name' filepath='../../module/zcommon/zfeature_common.c' line='74' column='1'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='zfeature_depends_on' mangled-name='zfeature_depends_on' filepath='../../module/zcommon/zfeature_common.c' line='144' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfeature_depends_on'>
      <parameter type-id='type-id-91' name='fid' filepath='../../module/zcommon/zfeature_common.c' line='144' column='1'/>
      <parameter type-id='type-id-91' name='check' filepath='../../module/zcommon/zfeature_common.c' line='144' column='1'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='zfs_mod_supported' mangled-name='zfs_mod_supported' filepath='../../module/zcommon/zfeature_common.c' line='185' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_mod_supported'>
      <parameter type-id='type-id-18' name='scope' filepath='../../module/zcommon/zfeature_common.c' line='185' column='1'/>
      <parameter type-id='type-id-18' name='name' filepath='../../module/zcommon/zfeature_common.c' line='185' column='1'/>
      <return type-id='type-id-31'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../../module/zcommon/zfs_comutil.c' comp-dir-path='/home/hutter2/release20/lib/libzfs' language='LANG_C99'>
    <array-type-def dimensions='1' type-id='type-id-18' size-in-bits='2624' id='type-id-94'>
      <subrange length='41' type-id='type-id-37' id='type-id-95'/>
    </array-type-def>
    <pointer-type-def type-id='type-id-53' size-in-bits='64' id='type-id-96'/>
    <function-decl name='nvpair_value_uint32' filepath='../../include/sys/nvpair.h' line='254' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-97'/>
      <parameter type-id='type-id-96'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <var-decl name='zfs_history_event_names' type-id='type-id-94' mangled-name='zfs_history_event_names' visibility='default' filepath='../../include/zfs_comutil.h' line='46' column='1' elf-symbol-id='zfs_history_event_names'/>
    <function-decl name='zfs_allocatable_devs' mangled-name='zfs_allocatable_devs' filepath='../../module/zcommon/zfs_comutil.c' line='46' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_allocatable_devs'>
      <parameter type-id='type-id-98' name='nv' filepath='../../module/zcommon/zfs_comutil.c' line='46' column='1'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='zfs_special_devs' mangled-name='zfs_special_devs' filepath='../../module/zcommon/zfs_comutil.c' line='71' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_special_devs'>
      <parameter type-id='type-id-98' name='nv' filepath='../../module/zcommon/zfs_comutil.c' line='71' column='1'/>
      <parameter type-id='type-id-2' name='type' filepath='../../module/zcommon/zfs_comutil.c' line='71' column='1'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='zfs_zpl_version_map' mangled-name='zfs_zpl_version_map' filepath='../../module/zcommon/zfs_comutil.c' line='159' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_zpl_version_map'>
      <parameter type-id='type-id-20' name='spa_version' filepath='../../module/zcommon/zfs_comutil.c' line='159' column='1'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='zfs_spa_version_map' mangled-name='zfs_spa_version_map' filepath='../../module/zcommon/zfs_comutil.c' line='177' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_spa_version_map'>
      <parameter type-id='type-id-20' name='zpl_version' filepath='../../module/zcommon/zfs_comutil.c' line='177' column='1'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='zfs_dataset_name_hidden' mangled-name='zfs_dataset_name_hidden' filepath='../../module/zcommon/zfs_comutil.c' line='239' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_dataset_name_hidden'>
      <parameter type-id='type-id-18' name='name' filepath='../../module/zcommon/zfs_comutil.c' line='239' column='1'/>
      <return type-id='type-id-31'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../../module/zcommon/zfs_deleg.c' comp-dir-path='/home/hutter2/release20/lib/libzfs' language='LANG_C99'>
    <array-type-def dimensions='1' type-id='type-id-99' size-in-bits='4096' id='type-id-100'>
      <subrange length='32' type-id='type-id-37' id='type-id-57'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-99' size-in-bits='infinite' id='type-id-101'>
      <subrange length='infinite' id='type-id-102'/>
    </array-type-def>
    <enum-decl name='zfs_deleg_who_type_t' naming-typedef-id='type-id-103' filepath='../../include/sys/fs/zfs.h' line='339' column='1' id='type-id-104'>
      <underlying-type type-id='type-id-86'/>
      <enumerator name='ZFS_DELEG_WHO_UNKNOWN' value='0'/>
      <enumerator name='ZFS_DELEG_USER' value='117'/>
      <enumerator name='ZFS_DELEG_USER_SETS' value='85'/>
      <enumerator name='ZFS_DELEG_GROUP' value='103'/>
      <enumerator name='ZFS_DELEG_GROUP_SETS' value='71'/>
      <enumerator name='ZFS_DELEG_EVERYONE' value='101'/>
      <enumerator name='ZFS_DELEG_EVERYONE_SETS' value='69'/>
      <enumerator name='ZFS_DELEG_CREATE' value='99'/>
      <enumerator name='ZFS_DELEG_CREATE_SETS' value='67'/>
      <enumerator name='ZFS_DELEG_NAMED_SET' value='115'/>
      <enumerator name='ZFS_DELEG_NAMED_SET_SETS' value='83'/>
    </enum-decl>
    <typedef-decl name='zfs_deleg_who_type_t' type-id='type-id-104' filepath='../../include/sys/fs/zfs.h' line='351' column='1' id='type-id-103'/>
    <enum-decl name='zfs_deleg_note_t' naming-typedef-id='type-id-105' filepath='../../include/zfs_deleg.h' line='48' column='1' id='type-id-106'>
      <underlying-type type-id='type-id-86'/>
      <enumerator name='ZFS_DELEG_NOTE_CREATE' value='0'/>
      <enumerator name='ZFS_DELEG_NOTE_DESTROY' value='1'/>
      <enumerator name='ZFS_DELEG_NOTE_SNAPSHOT' value='2'/>
      <enumerator name='ZFS_DELEG_NOTE_ROLLBACK' value='3'/>
      <enumerator name='ZFS_DELEG_NOTE_CLONE' value='4'/>
      <enumerator name='ZFS_DELEG_NOTE_PROMOTE' value='5'/>
      <enumerator name='ZFS_DELEG_NOTE_RENAME' value='6'/>
      <enumerator name='ZFS_DELEG_NOTE_SEND' value='7'/>
      <enumerator name='ZFS_DELEG_NOTE_RECEIVE' value='8'/>
      <enumerator name='ZFS_DELEG_NOTE_ALLOW' value='9'/>
      <enumerator name='ZFS_DELEG_NOTE_USERPROP' value='10'/>
      <enumerator name='ZFS_DELEG_NOTE_MOUNT' value='11'/>
      <enumerator name='ZFS_DELEG_NOTE_SHARE' value='12'/>
      <enumerator name='ZFS_DELEG_NOTE_USERQUOTA' value='13'/>
      <enumerator name='ZFS_DELEG_NOTE_GROUPQUOTA' value='14'/>
      <enumerator name='ZFS_DELEG_NOTE_USERUSED' value='15'/>
      <enumerator name='ZFS_DELEG_NOTE_GROUPUSED' value='16'/>
      <enumerator name='ZFS_DELEG_NOTE_USEROBJQUOTA' value='17'/>
      <enumerator name='ZFS_DELEG_NOTE_GROUPOBJQUOTA' value='18'/>
      <enumerator name='ZFS_DELEG_NOTE_USEROBJUSED' value='19'/>
      <enumerator name='ZFS_DELEG_NOTE_GROUPOBJUSED' value='20'/>
      <enumerator name='ZFS_DELEG_NOTE_HOLD' value='21'/>
      <enumerator name='ZFS_DELEG_NOTE_RELEASE' value='22'/>
      <enumerator name='ZFS_DELEG_NOTE_DIFF' value='23'/>
      <enumerator name='ZFS_DELEG_NOTE_BOOKMARK' value='24'/>
      <enumerator name='ZFS_DELEG_NOTE_LOAD_KEY' value='25'/>
      <enumerator name='ZFS_DELEG_NOTE_CHANGE_KEY' value='26'/>
      <enumerator name='ZFS_DELEG_NOTE_PROJECTUSED' value='27'/>
      <enumerator name='ZFS_DELEG_NOTE_PROJECTQUOTA' value='28'/>
      <enumerator name='ZFS_DELEG_NOTE_PROJECTOBJUSED' value='29'/>
      <enumerator name='ZFS_DELEG_NOTE_PROJECTOBJQUOTA' value='30'/>
      <enumerator name='ZFS_DELEG_NOTE_NONE' value='31'/>
    </enum-decl>
    <typedef-decl name='zfs_deleg_note_t' type-id='type-id-106' filepath='../../include/zfs_deleg.h' line='81' column='1' id='type-id-105'/>
    <class-decl name='zfs_deleg_perm_tab' size-in-bits='128' is-struct='yes' visibility='default' filepath='../../include/zfs_deleg.h' line='83' column='1' id='type-id-107'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='z_perm' type-id='type-id-2' visibility='default' filepath='../../include/zfs_deleg.h' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='z_note' type-id='type-id-105' visibility='default' filepath='../../include/zfs_deleg.h' line='85' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='zfs_deleg_perm_tab_t' type-id='type-id-107' filepath='../../include/zfs_deleg.h' line='86' column='1' id='type-id-99'/>
    <var-decl name='zfs_deleg_perm_tab' type-id='type-id-101' mangled-name='zfs_deleg_perm_tab' visibility='default' filepath='../../include/zfs_deleg.h' line='88' column='1' elf-symbol-id='zfs_deleg_perm_tab'/>
    <function-decl name='permset_namecheck' mangled-name='permset_namecheck' filepath='../../include/zfs_namecheck.h' line='65' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='permset_namecheck'>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-108'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='zfs_prop_delegatable' mangled-name='zfs_prop_delegatable' filepath='../../include/zfs_prop.h' line='92' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_delegatable'>
      <parameter type-id='type-id-109'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='zfs_deleg_canonicalize_perm' mangled-name='zfs_deleg_canonicalize_perm' filepath='../../module/zcommon/zfs_deleg.c' line='90' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_deleg_canonicalize_perm'>
      <parameter type-id='type-id-18' name='perm' filepath='../../module/zcommon/zfs_deleg.c' line='90' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='zfs_deleg_verify_nvlist' mangled-name='zfs_deleg_verify_nvlist' filepath='../../module/zcommon/zfs_deleg.c' line='157' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_deleg_verify_nvlist'>
      <parameter type-id='type-id-98' name='nvp' filepath='../../module/zcommon/zfs_deleg.c' line='157' column='1'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='zfs_deleg_whokey' mangled-name='zfs_deleg_whokey' filepath='../../module/zcommon/zfs_deleg.c' line='211' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_deleg_whokey'>
      <parameter type-id='type-id-2' name='attr' filepath='../../module/zcommon/zfs_deleg.c' line='211' column='1'/>
      <parameter type-id='type-id-103' name='type' filepath='../../module/zcommon/zfs_deleg.c' line='211' column='1'/>
      <parameter type-id='type-id-35' name='inheritchr' filepath='../../module/zcommon/zfs_deleg.c' line='212' column='1'/>
      <parameter type-id='type-id-80' name='data' filepath='../../module/zcommon/zfs_deleg.c' line='212' column='1'/>
      <return type-id='type-id-30'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../../module/zcommon/zfs_fletcher.c' comp-dir-path='/home/hutter2/release20/lib/libzfs' language='LANG_C99'>
    <array-type-def dimensions='1' type-id='type-id-110' size-in-bits='2048' id='type-id-111'>
      <subrange length='4' type-id='type-id-37' id='type-id-112'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-113' size-in-bits='1024' id='type-id-114'>
      <subrange length='4' type-id='type-id-37' id='type-id-112'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-115' size-in-bits='512' id='type-id-116'>
      <subrange length='4' type-id='type-id-37' id='type-id-112'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-117' size-in-bits='1024' id='type-id-118'>
      <subrange length='4' type-id='type-id-37' id='type-id-112'/>
    </array-type-def>
    <enum-decl name='zio_byteorder_t' naming-typedef-id='type-id-119' filepath='../../include/sys/zio_checksum.h' line='61' column='1' id='type-id-120'>
      <underlying-type type-id='type-id-86'/>
      <enumerator name='ZIO_CHECKSUM_NATIVE' value='0'/>
      <enumerator name='ZIO_CHECKSUM_BYTESWAP' value='1'/>
    </enum-decl>
    <typedef-decl name='zio_byteorder_t' type-id='type-id-120' filepath='../../include/sys/zio_checksum.h' line='64' column='1' id='type-id-119'/>
    <class-decl name='zio_abd_checksum_data' size-in-bits='256' is-struct='yes' visibility='default' filepath='../../include/sys/zio_checksum.h' line='66' column='1' id='type-id-121'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='acd_byteorder' type-id='type-id-119' visibility='default' filepath='../../include/sys/zio_checksum.h' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='acd_ctx' type-id='type-id-122' visibility='default' filepath='../../include/sys/zio_checksum.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='acd_zcp' type-id='type-id-123' visibility='default' filepath='../../include/sys/zio_checksum.h' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='acd_private' type-id='type-id-80' visibility='default' filepath='../../include/sys/zio_checksum.h' line='70' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='zio_abd_checksum_data_t' type-id='type-id-121' filepath='../../include/sys/zio_checksum.h' line='71' column='1' id='type-id-124'/>
    <typedef-decl name='zio_abd_checksum_init_t' type-id='type-id-125' filepath='../../include/sys/zio_checksum.h' line='73' column='1' id='type-id-126'/>
    <typedef-decl name='zio_abd_checksum_fini_t' type-id='type-id-125' filepath='../../include/sys/zio_checksum.h' line='74' column='1' id='type-id-127'/>
    <typedef-decl name='zio_abd_checksum_iter_t' type-id='type-id-128' filepath='../../include/sys/zio_checksum.h' line='75' column='1' id='type-id-129'/>
    <class-decl name='zio_abd_checksum_func' size-in-bits='192' is-struct='yes' visibility='default' filepath='../../include/sys/zio_checksum.h' line='77' column='1' id='type-id-130'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='acf_init' type-id='type-id-131' visibility='default' filepath='../../include/sys/zio_checksum.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='acf_fini' type-id='type-id-132' visibility='default' filepath='../../include/sys/zio_checksum.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='acf_iter' type-id='type-id-133' visibility='default' filepath='../../include/sys/zio_checksum.h' line='80' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='zio_abd_checksum_func_t' type-id='type-id-134' filepath='../../include/sys/zio_checksum.h' line='81' column='1' id='type-id-135'/>
    <class-decl name='zfs_fletcher_superscalar' size-in-bits='256' is-struct='yes' visibility='default' filepath='../../include/zfs_fletcher.h' line='69' column='1' id='type-id-136'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='v' type-id='type-id-137' visibility='default' filepath='../../include/zfs_fletcher.h' line='70' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='zfs_fletcher_superscalar_t' type-id='type-id-136' filepath='../../include/zfs_fletcher.h' line='71' column='1' id='type-id-117'/>
    <class-decl name='zfs_fletcher_sse' size-in-bits='128' is-struct='yes' visibility='default' filepath='../../include/zfs_fletcher.h' line='73' column='1' id='type-id-138'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='v' type-id='type-id-72' visibility='default' filepath='../../include/zfs_fletcher.h' line='74' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='zfs_fletcher_sse_t' type-id='type-id-138' filepath='../../include/zfs_fletcher.h' line='75' column='1' id='type-id-115'/>
    <class-decl name='zfs_fletcher_avx' size-in-bits='256' is-struct='yes' visibility='default' filepath='../../include/zfs_fletcher.h' line='77' column='1' id='type-id-139'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='v' type-id='type-id-137' visibility='default' filepath='../../include/zfs_fletcher.h' line='78' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='zfs_fletcher_avx_t' type-id='type-id-139' filepath='../../include/zfs_fletcher.h' line='79' column='1' id='type-id-113'/>
    <class-decl name='zfs_fletcher_avx512' size-in-bits='512' is-struct='yes' visibility='default' filepath='../../include/zfs_fletcher.h' line='81' column='1' id='type-id-140'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='v' type-id='type-id-63' visibility='default' filepath='../../include/zfs_fletcher.h' line='82' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='zfs_fletcher_avx512_t' type-id='type-id-140' filepath='../../include/zfs_fletcher.h' line='83' column='1' id='type-id-110'/>
    <union-decl name='fletcher_4_ctx' size-in-bits='2048' visibility='default' filepath='../../include/zfs_fletcher.h' line='90' column='1' id='type-id-141'>
      <data-member access='public'>
        <var-decl name='scalar' type-id='type-id-142' visibility='default' filepath='../../include/zfs_fletcher.h' line='91' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='superscalar' type-id='type-id-118' visibility='default' filepath='../../include/zfs_fletcher.h' line='92' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='sse' type-id='type-id-116' visibility='default' filepath='../../include/zfs_fletcher.h' line='95' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='avx' type-id='type-id-114' visibility='default' filepath='../../include/zfs_fletcher.h' line='98' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='avx512' type-id='type-id-111' visibility='default' filepath='../../include/zfs_fletcher.h' line='101' column='1'/>
      </data-member>
    </union-decl>
    <typedef-decl name='fletcher_4_ctx_t' type-id='type-id-141' filepath='../../include/zfs_fletcher.h' line='106' column='1' id='type-id-143'/>
    <qualified-type-def type-id='type-id-130' const='yes' id='type-id-134'/>
    <pointer-type-def type-id='type-id-143' size-in-bits='64' id='type-id-122'/>
    <qualified-type-def type-id='type-id-53' volatile='yes' id='type-id-144'/>
    <pointer-type-def type-id='type-id-144' size-in-bits='64' id='type-id-145'/>
    <pointer-type-def type-id='type-id-124' size-in-bits='64' id='type-id-146'/>
    <pointer-type-def type-id='type-id-127' size-in-bits='64' id='type-id-132'/>
    <pointer-type-def type-id='type-id-126' size-in-bits='64' id='type-id-131'/>
    <pointer-type-def type-id='type-id-129' size-in-bits='64' id='type-id-133'/>
    <var-decl name='fletcher_4_abd_ops' type-id='type-id-135' mangled-name='fletcher_4_abd_ops' visibility='default' filepath='../../include/sys/zio_checksum.h' line='125' column='1' elf-symbol-id='fletcher_4_abd_ops'/>
    <function-decl name='atomic_swap_32' filepath='../../lib/libspl/include/atomic.h' line='240' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-145'/>
      <parameter type-id='type-id-53'/>
      <return type-id='type-id-53'/>
    </function-decl>
    <function-decl name='membar_producer' filepath='../../lib/libspl/include/atomic.h' line='280' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='fletcher_init' mangled-name='fletcher_init' filepath='../../module/zcommon/zfs_fletcher.c' line='231' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fletcher_init'>
      <parameter type-id='type-id-123' name='zcp' filepath='../../module/zcommon/zfs_fletcher.c' line='231' column='1'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='fletcher_2_incremental_native' mangled-name='fletcher_2_incremental_native' filepath='../../module/zcommon/zfs_fletcher.c' line='237' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fletcher_2_incremental_native'>
      <parameter type-id='type-id-80' name='buf' filepath='../../module/zcommon/zfs_fletcher.c' line='237' column='1'/>
      <parameter type-id='type-id-81' name='size' filepath='../../module/zcommon/zfs_fletcher.c' line='237' column='1'/>
      <parameter type-id='type-id-80' name='data' filepath='../../module/zcommon/zfs_fletcher.c' line='237' column='1'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='fletcher_2_native' mangled-name='fletcher_2_native' filepath='../../module/zcommon/zfs_fletcher.c' line='263' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fletcher_2_native'>
      <parameter type-id='type-id-80' name='buf' filepath='../../module/zcommon/zfs_fletcher.c' line='263' column='1'/>
      <parameter type-id='type-id-60' name='size' filepath='../../module/zcommon/zfs_fletcher.c' line='263' column='1'/>
      <parameter type-id='type-id-80' name='ctx_template' filepath='../../module/zcommon/zfs_fletcher.c' line='264' column='1'/>
      <parameter type-id='type-id-123' name='zcp' filepath='../../module/zcommon/zfs_fletcher.c' line='264' column='1'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='fletcher_2_incremental_byteswap' mangled-name='fletcher_2_incremental_byteswap' filepath='../../module/zcommon/zfs_fletcher.c' line='271' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fletcher_2_incremental_byteswap'>
      <parameter type-id='type-id-80' name='buf' filepath='../../module/zcommon/zfs_fletcher.c' line='271' column='1'/>
      <parameter type-id='type-id-81' name='size' filepath='../../module/zcommon/zfs_fletcher.c' line='271' column='1'/>
      <parameter type-id='type-id-80' name='data' filepath='../../module/zcommon/zfs_fletcher.c' line='271' column='1'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='fletcher_2_byteswap' mangled-name='fletcher_2_byteswap' filepath='../../module/zcommon/zfs_fletcher.c' line='297' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fletcher_2_byteswap'>
      <parameter type-id='type-id-80' name='buf' filepath='../../module/zcommon/zfs_fletcher.c' line='297' column='1'/>
      <parameter type-id='type-id-60' name='size' filepath='../../module/zcommon/zfs_fletcher.c' line='297' column='1'/>
      <parameter type-id='type-id-80' name='ctx_template' filepath='../../module/zcommon/zfs_fletcher.c' line='298' column='1'/>
      <parameter type-id='type-id-123' name='zcp' filepath='../../module/zcommon/zfs_fletcher.c' line='298' column='1'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='fletcher_4_impl_set' mangled-name='fletcher_4_impl_set' filepath='../../module/zcommon/zfs_fletcher.c' line='369' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fletcher_4_impl_set'>
      <parameter type-id='type-id-18' name='val' filepath='../../module/zcommon/zfs_fletcher.c' line='369' column='1'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='fletcher_4_native' mangled-name='fletcher_4_native' filepath='../../module/zcommon/zfs_fletcher.c' line='465' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fletcher_4_native'>
      <parameter type-id='type-id-80' name='buf' filepath='../../module/zcommon/zfs_fletcher.c' line='465' column='1'/>
      <parameter type-id='type-id-60' name='size' filepath='../../module/zcommon/zfs_fletcher.c' line='465' column='1'/>
      <parameter type-id='type-id-80' name='ctx_template' filepath='../../module/zcommon/zfs_fletcher.c' line='466' column='1'/>
      <parameter type-id='type-id-123' name='zcp' filepath='../../module/zcommon/zfs_fletcher.c' line='466' column='1'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='fletcher_4_byteswap' mangled-name='fletcher_4_byteswap' filepath='../../module/zcommon/zfs_fletcher.c' line='507' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fletcher_4_byteswap'>
      <parameter type-id='type-id-80' name='buf' filepath='../../module/zcommon/zfs_fletcher.c' line='507' column='1'/>
      <parameter type-id='type-id-60' name='size' filepath='../../module/zcommon/zfs_fletcher.c' line='507' column='1'/>
      <parameter type-id='type-id-80' name='ctx_template' filepath='../../module/zcommon/zfs_fletcher.c' line='508' column='1'/>
      <parameter type-id='type-id-123' name='zcp' filepath='../../module/zcommon/zfs_fletcher.c' line='508' column='1'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-128'>
      <parameter type-id='type-id-80'/>
      <parameter type-id='type-id-81'/>
      <parameter type-id='type-id-80'/>
      <return type-id='type-id-20'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-125'>
      <parameter type-id='type-id-146'/>
      <return type-id='type-id-30'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='../../module/zcommon/zfs_fletcher_avx512.c' comp-dir-path='/home/hutter2/release20/lib/libzfs' language='LANG_C99'>
    <typedef-decl name='fletcher_4_init_f' type-id='type-id-147' filepath='../../include/zfs_fletcher.h' line='111' column='1' id='type-id-148'/>
    <typedef-decl name='fletcher_4_fini_f' type-id='type-id-149' filepath='../../include/zfs_fletcher.h' line='112' column='1' id='type-id-150'/>
    <typedef-decl name='fletcher_4_compute_f' type-id='type-id-151' filepath='../../include/zfs_fletcher.h' line='113' column='1' id='type-id-152'/>
    <class-decl name='fletcher_4_func' size-in-bits='512' is-struct='yes' visibility='default' filepath='../../include/zfs_fletcher.h' line='116' column='1' id='type-id-153'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='init_native' type-id='type-id-148' visibility='default' filepath='../../include/zfs_fletcher.h' line='117' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='fini_native' type-id='type-id-150' visibility='default' filepath='../../include/zfs_fletcher.h' line='118' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='compute_native' type-id='type-id-152' visibility='default' filepath='../../include/zfs_fletcher.h' line='119' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='init_byteswap' type-id='type-id-148' visibility='default' filepath='../../include/zfs_fletcher.h' line='120' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='fini_byteswap' type-id='type-id-150' visibility='default' filepath='../../include/zfs_fletcher.h' line='121' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='compute_byteswap' type-id='type-id-152' visibility='default' filepath='../../include/zfs_fletcher.h' line='122' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='valid' type-id='type-id-154' visibility='default' filepath='../../include/zfs_fletcher.h' line='123' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='name' type-id='type-id-18' visibility='default' filepath='../../include/zfs_fletcher.h' line='124' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='fletcher_4_ops_t' type-id='type-id-153' filepath='../../include/zfs_fletcher.h' line='125' column='1' id='type-id-155'/>
    <qualified-type-def type-id='type-id-155' const='yes' id='type-id-156'/>
    <pointer-type-def type-id='type-id-157' size-in-bits='64' id='type-id-154'/>
    <pointer-type-def type-id='type-id-158' size-in-bits='64' id='type-id-147'/>
    <pointer-type-def type-id='type-id-159' size-in-bits='64' id='type-id-151'/>
    <pointer-type-def type-id='type-id-160' size-in-bits='64' id='type-id-149'/>
    <var-decl name='fletcher_4_avx512f_ops' type-id='type-id-156' mangled-name='fletcher_4_avx512f_ops' visibility='default' filepath='../../include/zfs_fletcher.h' line='143' column='1' elf-symbol-id='fletcher_4_avx512f_ops'/>
    <var-decl name='fletcher_4_avx512bw_ops' type-id='type-id-156' mangled-name='fletcher_4_avx512bw_ops' visibility='default' filepath='../../include/zfs_fletcher.h' line='147' column='1' elf-symbol-id='fletcher_4_avx512bw_ops'/>
    <function-type size-in-bits='64' id='type-id-157'>
      <return type-id='type-id-31'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-158'>
      <parameter type-id='type-id-122'/>
      <return type-id='type-id-30'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-159'>
      <parameter type-id='type-id-122'/>
      <parameter type-id='type-id-80'/>
      <parameter type-id='type-id-60'/>
      <return type-id='type-id-30'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-160'>
      <parameter type-id='type-id-122'/>
      <parameter type-id='type-id-123'/>
      <return type-id='type-id-30'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='../../module/zcommon/zfs_fletcher_intel.c' comp-dir-path='/home/hutter2/release20/lib/libzfs' language='LANG_C99'>
    <var-decl name='fletcher_4_avx2_ops' type-id='type-id-156' mangled-name='fletcher_4_avx2_ops' visibility='default' filepath='../../include/zfs_fletcher.h' line='139' column='1' elf-symbol-id='fletcher_4_avx2_ops'/>
  </abi-instr>
  <abi-instr address-size='64' path='../../module/zcommon/zfs_fletcher_sse.c' comp-dir-path='/home/hutter2/release20/lib/libzfs' language='LANG_C99'>
    <var-decl name='fletcher_4_sse2_ops' type-id='type-id-156' mangled-name='fletcher_4_sse2_ops' visibility='default' filepath='../../include/zfs_fletcher.h' line='131' column='1' elf-symbol-id='fletcher_4_sse2_ops'/>
    <var-decl name='fletcher_4_ssse3_ops' type-id='type-id-156' mangled-name='fletcher_4_ssse3_ops' visibility='default' filepath='../../include/zfs_fletcher.h' line='135' column='1' elf-symbol-id='fletcher_4_ssse3_ops'/>
  </abi-instr>
  <abi-instr address-size='64' path='../../module/zcommon/zfs_fletcher_superscalar.c' comp-dir-path='/home/hutter2/release20/lib/libzfs' language='LANG_C99'>
    <var-decl name='fletcher_4_superscalar_ops' type-id='type-id-156' mangled-name='fletcher_4_superscalar_ops' visibility='default' filepath='../../include/zfs_fletcher.h' line='127' column='1' elf-symbol-id='fletcher_4_superscalar_ops'/>
  </abi-instr>
  <abi-instr address-size='64' path='../../module/zcommon/zfs_fletcher_superscalar4.c' comp-dir-path='/home/hutter2/release20/lib/libzfs' language='LANG_C99'>
    <var-decl name='fletcher_4_superscalar4_ops' type-id='type-id-156' mangled-name='fletcher_4_superscalar4_ops' visibility='default' filepath='../../include/zfs_fletcher.h' line='128' column='1' elf-symbol-id='fletcher_4_superscalar4_ops'/>
  </abi-instr>
  <abi-instr address-size='64' path='../../module/zcommon/zfs_namecheck.c' comp-dir-path='/home/hutter2/release20/lib/libzfs' language='LANG_C99'>
    <var-decl name='zfs_max_dataset_nesting' type-id='type-id-20' mangled-name='zfs_max_dataset_nesting' visibility='default' filepath='../../include/zfs_namecheck.h' line='54' column='1' elf-symbol-id='zfs_max_dataset_nesting'/>
    <function-decl name='get_dataset_depth' mangled-name='get_dataset_depth' filepath='../../module/zcommon/zfs_namecheck.c' line='70' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='get_dataset_depth'>
      <parameter type-id='type-id-18' name='path' filepath='../../module/zcommon/zfs_namecheck.c' line='70' column='1'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='zfs_component_namecheck' mangled-name='zfs_component_namecheck' filepath='../../module/zcommon/zfs_namecheck.c' line='98' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_component_namecheck'>
      <parameter type-id='type-id-18' name='path' filepath='../../module/zcommon/zfs_namecheck.c' line='98' column='1'/>
      <parameter type-id='type-id-108' name='why' filepath='../../module/zcommon/zfs_namecheck.c' line='98' column='1'/>
      <parameter type-id='type-id-2' name='what' filepath='../../module/zcommon/zfs_namecheck.c' line='98' column='1'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='dataset_namecheck' mangled-name='dataset_namecheck' filepath='../../module/zcommon/zfs_namecheck.c' line='300' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dataset_namecheck'>
      <parameter type-id='type-id-18' name='path' filepath='../../module/zcommon/zfs_namecheck.c' line='300' column='1'/>
      <parameter type-id='type-id-108' name='why' filepath='../../module/zcommon/zfs_namecheck.c' line='300' column='1'/>
      <parameter type-id='type-id-2' name='what' filepath='../../module/zcommon/zfs_namecheck.c' line='300' column='1'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='bookmark_namecheck' mangled-name='bookmark_namecheck' filepath='../../module/zcommon/zfs_namecheck.c' line='319' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='bookmark_namecheck'>
      <parameter type-id='type-id-18' name='path' filepath='../../module/zcommon/zfs_namecheck.c' line='319' column='1'/>
      <parameter type-id='type-id-108' name='why' filepath='../../module/zcommon/zfs_namecheck.c' line='319' column='1'/>
      <parameter type-id='type-id-2' name='what' filepath='../../module/zcommon/zfs_namecheck.c' line='319' column='1'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='snapshot_namecheck' mangled-name='snapshot_namecheck' filepath='../../module/zcommon/zfs_namecheck.c' line='338' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='snapshot_namecheck'>
      <parameter type-id='type-id-18' name='path' filepath='../../module/zcommon/zfs_namecheck.c' line='338' column='1'/>
      <parameter type-id='type-id-108' name='why' filepath='../../module/zcommon/zfs_namecheck.c' line='338' column='1'/>
      <parameter type-id='type-id-2' name='what' filepath='../../module/zcommon/zfs_namecheck.c' line='338' column='1'/>
      <return type-id='type-id-20'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../../module/zcommon/zfs_prop.c' comp-dir-path='/home/hutter2/release20/lib/libzfs' language='LANG_C99'>
    <array-type-def dimensions='1' type-id='type-id-18' size-in-bits='768' id='type-id-161'>
      <subrange length='12' type-id='type-id-37' id='type-id-162'/>
    </array-type-def>
    <var-decl name='zfs_userquota_prop_prefixes' type-id='type-id-161' mangled-name='zfs_userquota_prop_prefixes' visibility='default' filepath='../../include/sys/fs/zfs.h' line='208' column='1' elf-symbol-id='zfs_userquota_prop_prefixes'/>
    <function-decl name='zprop_register_impl' mangled-name='zprop_register_impl' filepath='../../include/zfs_prop.h' line='105' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zprop_register_impl'>
      <parameter type-id='type-id-20'/>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-163'/>
      <parameter type-id='type-id-60'/>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-164'/>
      <parameter type-id='type-id-20'/>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-31'/>
      <parameter type-id='type-id-31'/>
      <parameter type-id='type-id-165'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='zprop_register_string' mangled-name='zprop_register_string' filepath='../../include/zfs_prop.h' line='108' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zprop_register_string'>
      <parameter type-id='type-id-20'/>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-164'/>
      <parameter type-id='type-id-20'/>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-18'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='zprop_register_number' mangled-name='zprop_register_number' filepath='../../include/zfs_prop.h' line='110' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zprop_register_number'>
      <parameter type-id='type-id-20'/>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-60'/>
      <parameter type-id='type-id-164'/>
      <parameter type-id='type-id-20'/>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-18'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='zprop_register_index' mangled-name='zprop_register_index' filepath='../../include/zfs_prop.h' line='112' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zprop_register_index'>
      <parameter type-id='type-id-20'/>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-60'/>
      <parameter type-id='type-id-164'/>
      <parameter type-id='type-id-20'/>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-165'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='zprop_register_hidden' mangled-name='zprop_register_hidden' filepath='../../include/zfs_prop.h' line='114' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zprop_register_hidden'>
      <parameter type-id='type-id-20'/>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-163'/>
      <parameter type-id='type-id-164'/>
      <parameter type-id='type-id-20'/>
      <parameter type-id='type-id-18'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='zprop_index_to_string' mangled-name='zprop_index_to_string' filepath='../../include/zfs_prop.h' line='123' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zprop_index_to_string'>
      <parameter type-id='type-id-20'/>
      <parameter type-id='type-id-60'/>
      <parameter type-id='type-id-166'/>
      <parameter type-id='type-id-167'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='zprop_random_value' mangled-name='zprop_random_value' filepath='../../include/zfs_prop.h' line='124' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zprop_random_value'>
      <parameter type-id='type-id-20'/>
      <parameter type-id='type-id-60'/>
      <parameter type-id='type-id-167'/>
      <return type-id='type-id-60'/>
    </function-decl>
    <function-decl name='zfs_prop_string_to_index' mangled-name='zfs_prop_string_to_index' filepath='../../module/zcommon/zfs_prop.c' line='815' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_string_to_index'>
      <parameter type-id='type-id-109' name='prop' filepath='../../module/zcommon/zfs_prop.c' line='815' column='1'/>
      <parameter type-id='type-id-18' name='string' filepath='../../module/zcommon/zfs_prop.c' line='815' column='1'/>
      <parameter type-id='type-id-168' name='index' filepath='../../module/zcommon/zfs_prop.c' line='815' column='1'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='zfs_prop_random_value' mangled-name='zfs_prop_random_value' filepath='../../module/zcommon/zfs_prop.c' line='827' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_random_value'>
      <parameter type-id='type-id-109' name='prop' filepath='../../module/zcommon/zfs_prop.c' line='827' column='1'/>
      <parameter type-id='type-id-60' name='seed' filepath='../../module/zcommon/zfs_prop.c' line='827' column='1'/>
      <return type-id='type-id-60'/>
    </function-decl>
    <function-decl name='zfs_prop_visible' mangled-name='zfs_prop_visible' filepath='../../module/zcommon/zfs_prop.c' line='862' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_visible'>
      <parameter type-id='type-id-109' name='prop' filepath='../../module/zcommon/zfs_prop.c' line='862' column='1'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='zfs_prop_values' mangled-name='zfs_prop_values' filepath='../../module/zcommon/zfs_prop.c' line='952' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_values'>
      <parameter type-id='type-id-109' name='prop' filepath='../../module/zcommon/zfs_prop.c' line='952' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='zfs_prop_is_string' mangled-name='zfs_prop_is_string' filepath='../../module/zcommon/zfs_prop.c' line='963' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_is_string'>
      <parameter type-id='type-id-109' name='prop' filepath='../../module/zcommon/zfs_prop.c' line='963' column='1'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='zfs_prop_column_name' mangled-name='zfs_prop_column_name' filepath='../../module/zcommon/zfs_prop.c' line='974' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_column_name'>
      <parameter type-id='type-id-109' name='prop' filepath='../../module/zcommon/zfs_prop.c' line='974' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='zfs_prop_align_right' mangled-name='zfs_prop_align_right' filepath='../../module/zcommon/zfs_prop.c' line='984' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_align_right'>
      <parameter type-id='type-id-109' name='prop' filepath='../../module/zcommon/zfs_prop.c' line='984' column='1'/>
      <return type-id='type-id-31'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../../module/zcommon/zpool_prop.c' comp-dir-path='/home/hutter2/release20/lib/libzfs' language='LANG_C99'>
    <function-decl name='zpool_prop_string_to_index' mangled-name='zpool_prop_string_to_index' filepath='../../module/zcommon/zpool_prop.c' line='218' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_prop_string_to_index'>
      <parameter type-id='type-id-169' name='prop' filepath='../../module/zcommon/zpool_prop.c' line='218' column='1'/>
      <parameter type-id='type-id-18' name='string' filepath='../../module/zcommon/zpool_prop.c' line='218' column='1'/>
      <parameter type-id='type-id-168' name='index' filepath='../../module/zcommon/zpool_prop.c' line='219' column='1'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='zpool_prop_random_value' mangled-name='zpool_prop_random_value' filepath='../../module/zcommon/zpool_prop.c' line='232' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_prop_random_value'>
      <parameter type-id='type-id-169' name='prop' filepath='../../module/zcommon/zpool_prop.c' line='232' column='1'/>
      <parameter type-id='type-id-60' name='seed' filepath='../../module/zcommon/zpool_prop.c' line='232' column='1'/>
      <return type-id='type-id-60'/>
    </function-decl>
    <function-decl name='zpool_prop_values' mangled-name='zpool_prop_values' filepath='../../module/zcommon/zpool_prop.c' line='241' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_prop_values'>
      <parameter type-id='type-id-169' name='prop' filepath='../../module/zcommon/zpool_prop.c' line='241' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='zpool_prop_column_name' mangled-name='zpool_prop_column_name' filepath='../../module/zcommon/zpool_prop.c' line='247' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_prop_column_name'>
      <parameter type-id='type-id-169' name='prop' filepath='../../module/zcommon/zpool_prop.c' line='247' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='zpool_prop_align_right' mangled-name='zpool_prop_align_right' filepath='../../module/zcommon/zpool_prop.c' line='253' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_prop_align_right'>
      <parameter type-id='type-id-169' name='prop' filepath='../../module/zcommon/zpool_prop.c' line='253' column='1'/>
      <return type-id='type-id-31'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../../module/zcommon/zprop_common.c' comp-dir-path='/home/hutter2/release20/lib/libzfs' language='LANG_C99'>
    <function-decl name='__ctype_tolower_loc' filepath='/usr/include/ctype.h' line='81' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-170'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='libzfs_changelist.c' comp-dir-path='/home/hutter2/release20/lib/libzfs' language='LANG_C99'>
    <array-type-def dimensions='1' type-id='type-id-171' size-in-bits='128' id='type-id-172'>
      <subrange length='2' type-id='type-id-37' id='type-id-55'/>
    </array-type-def>
    <type-decl name='char' size-in-bits='8' id='type-id-35'/>
    <array-type-def dimensions='1' type-id='type-id-35' size-in-bits='8192' id='type-id-173'>
      <subrange length='1024' type-id='type-id-37' id='type-id-174'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-35' size-in-bits='8' id='type-id-175'>
      <subrange length='1' type-id='type-id-37' id='type-id-176'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-35' size-in-bits='160' id='type-id-177'>
      <subrange length='20' type-id='type-id-37' id='type-id-178'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-35' size-in-bits='2048' id='type-id-48'>
      <subrange length='256' type-id='type-id-37' id='type-id-179'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-35' size-in-bits='320' id='type-id-180'>
      <subrange length='40' type-id='type-id-37' id='type-id-181'/>
    </array-type-def>
    <class-decl name='_IO_codecvt' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-182'/>
    <class-decl name='_IO_marker' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-183'/>
    <class-decl name='_IO_wide_data' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-184'/>
    <class-decl name='re_dfa_t' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-185'/>
    <class-decl name='uu_avl' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-186'/>
    <class-decl name='uu_avl_pool' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-187'/>
    <class-decl name='uu_avl_walk' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-188'/>
    <type-decl name='int' size-in-bits='32' id='type-id-20'/>
    <type-decl name='long int' size-in-bits='64' id='type-id-189'/>
    <type-decl name='long long int' size-in-bits='64' id='type-id-190'/>
    <type-decl name='short int' size-in-bits='16' id='type-id-191'/>
    <type-decl name='signed char' size-in-bits='8' id='type-id-192'/>
    <array-type-def dimensions='1' type-id='type-id-193' size-in-bits='192' id='type-id-194'>
      <subrange length='3' type-id='type-id-37' id='type-id-195'/>
    </array-type-def>
    <type-decl name='unnamed-enum-underlying-type-32' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='type-id-86'/>
    <type-decl name='unsigned char' size-in-bits='8' id='type-id-47'/>
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-196'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-37'/>
    <type-decl name='unsigned short int' size-in-bits='16' id='type-id-46'/>
    <type-decl name='void' id='type-id-30'/>
    <typedef-decl name='uu_compare_fn_t' type-id='type-id-197' filepath='../../include/libuutil.h' line='159' column='1' id='type-id-198'/>
    <typedef-decl name='uu_avl_pool_t' type-id='type-id-187' filepath='../../include/libuutil.h' line='287' column='1' id='type-id-199'/>
    <typedef-decl name='uu_avl_t' type-id='type-id-186' filepath='../../include/libuutil.h' line='288' column='1' id='type-id-200'/>
    <class-decl name='uu_avl_node' size-in-bits='192' is-struct='yes' visibility='default' filepath='../../include/libuutil.h' line='290' column='1' id='type-id-201'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='uan_opaque' type-id='type-id-194' visibility='default' filepath='../../include/libuutil.h' line='292' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='uu_avl_node_t' type-id='type-id-201' filepath='../../include/libuutil.h' line='296' column='1' id='type-id-202'/>
    <typedef-decl name='uu_avl_walk_t' type-id='type-id-188' filepath='../../include/libuutil.h' line='298' column='1' id='type-id-203'/>
    <typedef-decl name='uu_avl_index_t' type-id='type-id-193' filepath='../../include/libuutil.h' line='300' column='1' id='type-id-204'/>
    <typedef-decl name='zfs_handle_t' type-id='type-id-205' filepath='../../include/libzfs.h' line='194' column='1' id='type-id-206'/>
    <typedef-decl name='zpool_handle_t' type-id='type-id-207' filepath='../../include/libzfs.h' line='195' column='1' id='type-id-208'/>
    <typedef-decl name='libzfs_handle_t' type-id='type-id-209' filepath='../../include/libzfs.h' line='196' column='1' id='type-id-210'/>
    <typedef-decl name='zfs_iter_f' type-id='type-id-211' filepath='../../include/libzfs.h' line='608' column='1' id='type-id-212'/>
    <class-decl name='libzfs_handle' size-in-bits='20224' is-struct='yes' visibility='default' filepath='../../include/libzfs_impl.h' line='48' column='1' id='type-id-209'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='libzfs_error' type-id='type-id-20' visibility='default' filepath='../../include/libzfs_impl.h' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='libzfs_fd' type-id='type-id-20' visibility='default' filepath='../../include/libzfs_impl.h' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='libzfs_mnttab' type-id='type-id-213' visibility='default' filepath='../../include/libzfs_impl.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='libzfs_pool_handles' type-id='type-id-214' visibility='default' filepath='../../include/libzfs_impl.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='libzfs_ns_avlpool' type-id='type-id-215' visibility='default' filepath='../../include/libzfs_impl.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='libzfs_ns_avl' type-id='type-id-216' visibility='default' filepath='../../include/libzfs_impl.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='libzfs_ns_gen' type-id='type-id-60' visibility='default' filepath='../../include/libzfs_impl.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='libzfs_desc_active' type-id='type-id-20' visibility='default' filepath='../../include/libzfs_impl.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='libzfs_action' type-id='type-id-173' visibility='default' filepath='../../include/libzfs_impl.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8608'>
        <var-decl name='libzfs_desc' type-id='type-id-173' visibility='default' filepath='../../include/libzfs_impl.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16800'>
        <var-decl name='libzfs_printerr' type-id='type-id-20' visibility='default' filepath='../../include/libzfs_impl.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16832'>
        <var-decl name='libzfs_storeerr' type-id='type-id-20' visibility='default' filepath='../../include/libzfs_impl.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16864'>
        <var-decl name='libzfs_mnttab_enable' type-id='type-id-31' visibility='default' filepath='../../include/libzfs_impl.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16896'>
        <var-decl name='libzfs_mnttab_cache_lock' type-id='type-id-217' visibility='default' filepath='../../include/libzfs_impl.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17216'>
        <var-decl name='libzfs_mnttab_cache' type-id='type-id-218' visibility='default' filepath='../../include/libzfs_impl.h' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17536'>
        <var-decl name='libzfs_pool_iter' type-id='type-id-20' visibility='default' filepath='../../include/libzfs_impl.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17568'>
        <var-decl name='libzfs_chassis_id' type-id='type-id-48' visibility='default' filepath='../../include/libzfs_impl.h' line='71' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='19616'>
        <var-decl name='libzfs_prop_debug' type-id='type-id-31' visibility='default' filepath='../../include/libzfs_impl.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='19648'>
        <var-decl name='libzfs_urire' type-id='type-id-219' visibility='default' filepath='../../include/libzfs_impl.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='20160'>
        <var-decl name='libzfs_max_nvlist' type-id='type-id-60' visibility='default' filepath='../../include/libzfs_impl.h' line='74' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='zfs_handle' size-in-bits='4928' is-struct='yes' visibility='default' filepath='../../include/libzfs_impl.h' line='77' column='1' id='type-id-205'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='zfs_hdl' type-id='type-id-220' visibility='default' filepath='../../include/libzfs_impl.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='zpool_hdl' type-id='type-id-214' visibility='default' filepath='../../include/libzfs_impl.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='zfs_name' type-id='type-id-48' visibility='default' filepath='../../include/libzfs_impl.h' line='80' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='zfs_type' type-id='type-id-167' visibility='default' filepath='../../include/libzfs_impl.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2208'>
        <var-decl name='zfs_head_type' type-id='type-id-167' visibility='default' filepath='../../include/libzfs_impl.h' line='82' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <var-decl name='zfs_dmustats' type-id='type-id-221' visibility='default' filepath='../../include/libzfs_impl.h' line='83' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4544'>
        <var-decl name='zfs_props' type-id='type-id-98' visibility='default' filepath='../../include/libzfs_impl.h' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4608'>
        <var-decl name='zfs_user_props' type-id='type-id-98' visibility='default' filepath='../../include/libzfs_impl.h' line='85' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4672'>
        <var-decl name='zfs_recvd_props' type-id='type-id-98' visibility='default' filepath='../../include/libzfs_impl.h' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4736'>
        <var-decl name='zfs_mntcheck' type-id='type-id-31' visibility='default' filepath='../../include/libzfs_impl.h' line='87' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4800'>
        <var-decl name='zfs_mntopts' type-id='type-id-2' visibility='default' filepath='../../include/libzfs_impl.h' line='88' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4864'>
        <var-decl name='zfs_props_table' type-id='type-id-222' visibility='default' filepath='../../include/libzfs_impl.h' line='89' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='zpool_handle' size-in-bits='2560' is-struct='yes' visibility='default' filepath='../../include/libzfs_impl.h' line='98' column='1' id='type-id-207'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='zpool_hdl' type-id='type-id-220' visibility='default' filepath='../../include/libzfs_impl.h' line='99' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='zpool_next' type-id='type-id-214' visibility='default' filepath='../../include/libzfs_impl.h' line='100' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='zpool_name' type-id='type-id-48' visibility='default' filepath='../../include/libzfs_impl.h' line='101' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='zpool_state' type-id='type-id-20' visibility='default' filepath='../../include/libzfs_impl.h' line='102' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <var-decl name='zpool_config_size' type-id='type-id-81' visibility='default' filepath='../../include/libzfs_impl.h' line='103' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2304'>
        <var-decl name='zpool_config' type-id='type-id-98' visibility='default' filepath='../../include/libzfs_impl.h' line='104' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2368'>
        <var-decl name='zpool_old_config' type-id='type-id-98' visibility='default' filepath='../../include/libzfs_impl.h' line='105' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2432'>
        <var-decl name='zpool_props' type-id='type-id-98' visibility='default' filepath='../../include/libzfs_impl.h' line='106' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2496'>
        <var-decl name='zpool_start_block' type-id='type-id-223' visibility='default' filepath='../../include/libzfs_impl.h' line='107' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='zfs_share_proto_t' naming-typedef-id='type-id-224' filepath='../../include/libzfs_impl.h' line='110' column='1' id='type-id-225'>
      <underlying-type type-id='type-id-86'/>
      <enumerator name='PROTO_NFS' value='0'/>
      <enumerator name='PROTO_SMB' value='1'/>
      <enumerator name='PROTO_END' value='2'/>
    </enum-decl>
    <typedef-decl name='zfs_share_proto_t' type-id='type-id-225' filepath='../../include/libzfs_impl.h' line='114' column='1' id='type-id-224'/>
    <typedef-decl name='prop_changelist_t' type-id='type-id-226' filepath='../../include/libzfs_impl.h' line='174' column='1' id='type-id-227'/>
    <typedef-decl name='avl_tree_t' type-id='type-id-228' filepath='../../include/sys/avl.h' line='119' column='1' id='type-id-218'/>
    <class-decl name='avl_node' size-in-bits='192' is-struct='yes' visibility='default' filepath='../../include/sys/avl_impl.h' line='90' column='1' id='type-id-229'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='avl_child' type-id='type-id-172' visibility='default' filepath='../../include/sys/avl_impl.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='avl_pcb' type-id='type-id-193' visibility='default' filepath='../../include/sys/avl_impl.h' line='92' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='avl_tree' size-in-bits='320' is-struct='yes' visibility='default' filepath='../../include/sys/avl_impl.h' line='146' column='1' id='type-id-228'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='avl_root' type-id='type-id-171' visibility='default' filepath='../../include/sys/avl_impl.h' line='147' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='avl_compar' type-id='type-id-230' visibility='default' filepath='../../include/sys/avl_impl.h' line='148' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='avl_offset' type-id='type-id-81' visibility='default' filepath='../../include/sys/avl_impl.h' line='149' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='avl_numnodes' type-id='type-id-231' visibility='default' filepath='../../include/sys/avl_impl.h' line='150' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='avl_size' type-id='type-id-81' visibility='default' filepath='../../include/sys/avl_impl.h' line='151' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='dmu_objset_stats' size-in-bits='2304' is-struct='yes' visibility='default' filepath='../../include/sys/dmu.h' line='934' column='1' id='type-id-232'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='dds_num_clones' type-id='type-id-60' visibility='default' filepath='../../include/sys/dmu.h' line='935' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='dds_creation_txg' type-id='type-id-60' visibility='default' filepath='../../include/sys/dmu.h' line='936' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='dds_guid' type-id='type-id-60' visibility='default' filepath='../../include/sys/dmu.h' line='937' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='dds_type' type-id='type-id-233' visibility='default' filepath='../../include/sys/dmu.h' line='938' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='dds_is_snapshot' type-id='type-id-64' visibility='default' filepath='../../include/sys/dmu.h' line='939' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='232'>
        <var-decl name='dds_inconsistent' type-id='type-id-64' visibility='default' filepath='../../include/sys/dmu.h' line='940' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='240'>
        <var-decl name='dds_redacted' type-id='type-id-64' visibility='default' filepath='../../include/sys/dmu.h' line='941' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='248'>
        <var-decl name='dds_origin' type-id='type-id-48' visibility='default' filepath='../../include/sys/dmu.h' line='942' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='dmu_objset_stats_t' type-id='type-id-232' filepath='../../include/sys/dmu.h' line='943' column='1' id='type-id-221'/>
    <enum-decl name='zfs_type_t' naming-typedef-id='type-id-167' filepath='../../include/sys/fs/zfs.h' line='52' column='1' id='type-id-234'>
      <underlying-type type-id='type-id-86'/>
      <enumerator name='ZFS_TYPE_FILESYSTEM' value='1'/>
      <enumerator name='ZFS_TYPE_SNAPSHOT' value='2'/>
      <enumerator name='ZFS_TYPE_VOLUME' value='4'/>
      <enumerator name='ZFS_TYPE_POOL' value='8'/>
      <enumerator name='ZFS_TYPE_BOOKMARK' value='16'/>
    </enum-decl>
    <typedef-decl name='zfs_type_t' type-id='type-id-234' filepath='../../include/sys/fs/zfs.h' line='58' column='1' id='type-id-167'/>
    <enum-decl name='dmu_objset_type' filepath='../../include/sys/fs/zfs.h' line='64' column='1' id='type-id-235'>
      <underlying-type type-id='type-id-86'/>
      <enumerator name='DMU_OST_NONE' value='0'/>
      <enumerator name='DMU_OST_META' value='1'/>
      <enumerator name='DMU_OST_ZFS' value='2'/>
      <enumerator name='DMU_OST_ZVOL' value='3'/>
      <enumerator name='DMU_OST_OTHER' value='4'/>
      <enumerator name='DMU_OST_ANY' value='5'/>
      <enumerator name='DMU_OST_NUMTYPES' value='6'/>
    </enum-decl>
    <typedef-decl name='dmu_objset_type_t' type-id='type-id-235' filepath='../../include/sys/fs/zfs.h' line='72' column='1' id='type-id-233'/>
    <enum-decl name='zfs_prop_t' naming-typedef-id='type-id-109' filepath='../../include/sys/fs/zfs.h' line='91' column='1' id='type-id-236'>
      <underlying-type type-id='type-id-86'/>
      <enumerator name='ZPROP_CONT' value='-2'/>
      <enumerator name='ZPROP_INVAL' value='-1'/>
      <enumerator name='ZFS_PROP_TYPE' value='0'/>
      <enumerator name='ZFS_PROP_CREATION' value='1'/>
      <enumerator name='ZFS_PROP_USED' value='2'/>
      <enumerator name='ZFS_PROP_AVAILABLE' value='3'/>
      <enumerator name='ZFS_PROP_REFERENCED' value='4'/>
      <enumerator name='ZFS_PROP_COMPRESSRATIO' value='5'/>
      <enumerator name='ZFS_PROP_MOUNTED' value='6'/>
      <enumerator name='ZFS_PROP_ORIGIN' value='7'/>
      <enumerator name='ZFS_PROP_QUOTA' value='8'/>
      <enumerator name='ZFS_PROP_RESERVATION' value='9'/>
      <enumerator name='ZFS_PROP_VOLSIZE' value='10'/>
      <enumerator name='ZFS_PROP_VOLBLOCKSIZE' value='11'/>
      <enumerator name='ZFS_PROP_RECORDSIZE' value='12'/>
      <enumerator name='ZFS_PROP_MOUNTPOINT' value='13'/>
      <enumerator name='ZFS_PROP_SHARENFS' value='14'/>
      <enumerator name='ZFS_PROP_CHECKSUM' value='15'/>
      <enumerator name='ZFS_PROP_COMPRESSION' value='16'/>
      <enumerator name='ZFS_PROP_ATIME' value='17'/>
      <enumerator name='ZFS_PROP_DEVICES' value='18'/>
      <enumerator name='ZFS_PROP_EXEC' value='19'/>
      <enumerator name='ZFS_PROP_SETUID' value='20'/>
      <enumerator name='ZFS_PROP_READONLY' value='21'/>
      <enumerator name='ZFS_PROP_ZONED' value='22'/>
      <enumerator name='ZFS_PROP_SNAPDIR' value='23'/>
      <enumerator name='ZFS_PROP_ACLMODE' value='24'/>
      <enumerator name='ZFS_PROP_ACLINHERIT' value='25'/>
      <enumerator name='ZFS_PROP_CREATETXG' value='26'/>
      <enumerator name='ZFS_PROP_NAME' value='27'/>
      <enumerator name='ZFS_PROP_CANMOUNT' value='28'/>
      <enumerator name='ZFS_PROP_ISCSIOPTIONS' value='29'/>
      <enumerator name='ZFS_PROP_XATTR' value='30'/>
      <enumerator name='ZFS_PROP_NUMCLONES' value='31'/>
      <enumerator name='ZFS_PROP_COPIES' value='32'/>
      <enumerator name='ZFS_PROP_VERSION' value='33'/>
      <enumerator name='ZFS_PROP_UTF8ONLY' value='34'/>
      <enumerator name='ZFS_PROP_NORMALIZE' value='35'/>
      <enumerator name='ZFS_PROP_CASE' value='36'/>
      <enumerator name='ZFS_PROP_VSCAN' value='37'/>
      <enumerator name='ZFS_PROP_NBMAND' value='38'/>
      <enumerator name='ZFS_PROP_SHARESMB' value='39'/>
      <enumerator name='ZFS_PROP_REFQUOTA' value='40'/>
      <enumerator name='ZFS_PROP_REFRESERVATION' value='41'/>
      <enumerator name='ZFS_PROP_GUID' value='42'/>
      <enumerator name='ZFS_PROP_PRIMARYCACHE' value='43'/>
      <enumerator name='ZFS_PROP_SECONDARYCACHE' value='44'/>
      <enumerator name='ZFS_PROP_USEDSNAP' value='45'/>
      <enumerator name='ZFS_PROP_USEDDS' value='46'/>
      <enumerator name='ZFS_PROP_USEDCHILD' value='47'/>
      <enumerator name='ZFS_PROP_USEDREFRESERV' value='48'/>
      <enumerator name='ZFS_PROP_USERACCOUNTING' value='49'/>
      <enumerator name='ZFS_PROP_STMF_SHAREINFO' value='50'/>
      <enumerator name='ZFS_PROP_DEFER_DESTROY' value='51'/>
      <enumerator name='ZFS_PROP_USERREFS' value='52'/>
      <enumerator name='ZFS_PROP_LOGBIAS' value='53'/>
      <enumerator name='ZFS_PROP_UNIQUE' value='54'/>
      <enumerator name='ZFS_PROP_OBJSETID' value='55'/>
      <enumerator name='ZFS_PROP_DEDUP' value='56'/>
      <enumerator name='ZFS_PROP_MLSLABEL' value='57'/>
      <enumerator name='ZFS_PROP_SYNC' value='58'/>
      <enumerator name='ZFS_PROP_DNODESIZE' value='59'/>
      <enumerator name='ZFS_PROP_REFRATIO' value='60'/>
      <enumerator name='ZFS_PROP_WRITTEN' value='61'/>
      <enumerator name='ZFS_PROP_CLONES' value='62'/>
      <enumerator name='ZFS_PROP_LOGICALUSED' value='63'/>
      <enumerator name='ZFS_PROP_LOGICALREFERENCED' value='64'/>
      <enumerator name='ZFS_PROP_INCONSISTENT' value='65'/>
      <enumerator name='ZFS_PROP_VOLMODE' value='66'/>
      <enumerator name='ZFS_PROP_FILESYSTEM_LIMIT' value='67'/>
      <enumerator name='ZFS_PROP_SNAPSHOT_LIMIT' value='68'/>
      <enumerator name='ZFS_PROP_FILESYSTEM_COUNT' value='69'/>
      <enumerator name='ZFS_PROP_SNAPSHOT_COUNT' value='70'/>
      <enumerator name='ZFS_PROP_SNAPDEV' value='71'/>
      <enumerator name='ZFS_PROP_ACLTYPE' value='72'/>
      <enumerator name='ZFS_PROP_SELINUX_CONTEXT' value='73'/>
      <enumerator name='ZFS_PROP_SELINUX_FSCONTEXT' value='74'/>
      <enumerator name='ZFS_PROP_SELINUX_DEFCONTEXT' value='75'/>
      <enumerator name='ZFS_PROP_SELINUX_ROOTCONTEXT' value='76'/>
      <enumerator name='ZFS_PROP_RELATIME' value='77'/>
      <enumerator name='ZFS_PROP_REDUNDANT_METADATA' value='78'/>
      <enumerator name='ZFS_PROP_OVERLAY' value='79'/>
      <enumerator name='ZFS_PROP_PREV_SNAP' value='80'/>
      <enumerator name='ZFS_PROP_RECEIVE_RESUME_TOKEN' value='81'/>
      <enumerator name='ZFS_PROP_ENCRYPTION' value='82'/>
      <enumerator name='ZFS_PROP_KEYLOCATION' value='83'/>
      <enumerator name='ZFS_PROP_KEYFORMAT' value='84'/>
      <enumerator name='ZFS_PROP_PBKDF2_SALT' value='85'/>
      <enumerator name='ZFS_PROP_PBKDF2_ITERS' value='86'/>
      <enumerator name='ZFS_PROP_ENCRYPTION_ROOT' value='87'/>
      <enumerator name='ZFS_PROP_KEY_GUID' value='88'/>
      <enumerator name='ZFS_PROP_KEYSTATUS' value='89'/>
      <enumerator name='ZFS_PROP_REMAPTXG' value='90'/>
      <enumerator name='ZFS_PROP_SPECIAL_SMALL_BLOCKS' value='91'/>
      <enumerator name='ZFS_PROP_IVSET_GUID' value='92'/>
      <enumerator name='ZFS_PROP_REDACTED' value='93'/>
      <enumerator name='ZFS_PROP_REDACT_SNAPS' value='94'/>
      <enumerator name='ZFS_NUM_PROPS' value='95'/>
    </enum-decl>
    <typedef-decl name='zfs_prop_t' type-id='type-id-236' filepath='../../include/sys/fs/zfs.h' line='190' column='1' id='type-id-109'/>
    <enum-decl name='zprop_source_t' naming-typedef-id='type-id-237' filepath='../../include/sys/fs/zfs.h' line='258' column='1' id='type-id-238'>
      <underlying-type type-id='type-id-86'/>
      <enumerator name='ZPROP_SRC_NONE' value='1'/>
      <enumerator name='ZPROP_SRC_DEFAULT' value='2'/>
      <enumerator name='ZPROP_SRC_TEMPORARY' value='4'/>
      <enumerator name='ZPROP_SRC_LOCAL' value='8'/>
      <enumerator name='ZPROP_SRC_INHERITED' value='16'/>
      <enumerator name='ZPROP_SRC_RECEIVED' value='32'/>
    </enum-decl>
    <typedef-decl name='zprop_source_t' type-id='type-id-238' filepath='../../include/sys/fs/zfs.h' line='265' column='1' id='type-id-237'/>
    <class-decl name='nvlist' size-in-bits='192' is-struct='yes' visibility='default' filepath='../../include/sys/nvpair.h' line='85' column='1' id='type-id-239'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nvl_version' type-id='type-id-240' visibility='default' filepath='../../include/sys/nvpair.h' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='nvl_nvflag' type-id='type-id-53' visibility='default' filepath='../../include/sys/nvpair.h' line='87' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='nvl_priv' type-id='type-id-60' visibility='default' filepath='../../include/sys/nvpair.h' line='88' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='nvl_flag' type-id='type-id-53' visibility='default' filepath='../../include/sys/nvpair.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='nvl_pad' type-id='type-id-240' visibility='default' filepath='../../include/sys/nvpair.h' line='90' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='nvlist_t' type-id='type-id-239' filepath='../../include/sys/nvpair.h' line='91' column='1' id='type-id-241'/>
    <enum-decl name='boolean_t' naming-typedef-id='type-id-31' filepath='../../lib/libspl/include/sys/stdtypes.h' line='26' column='1' id='type-id-242'>
      <underlying-type type-id='type-id-86'/>
      <enumerator name='B_FALSE' value='0'/>
      <enumerator name='B_TRUE' value='1'/>
    </enum-decl>
    <typedef-decl name='boolean_t' type-id='type-id-242' filepath='../../lib/libspl/include/sys/stdtypes.h' line='29' column='1' id='type-id-31'/>
    <typedef-decl name='ulong_t' type-id='type-id-37' filepath='../../lib/libspl/include/sys/stdtypes.h' line='34' column='1' id='type-id-231'/>
    <typedef-decl name='longlong_t' type-id='type-id-190' filepath='../../lib/libspl/include/sys/stdtypes.h' line='36' column='1' id='type-id-243'/>
    <typedef-decl name='diskaddr_t' type-id='type-id-243' filepath='../../lib/libspl/include/sys/stdtypes.h' line='41' column='1' id='type-id-223'/>
    <typedef-decl name='zoneid_t' type-id='type-id-20' filepath='../../lib/libspl/include/sys/types.h' line='47' column='1' id='type-id-244'/>
    <class-decl name='prop_changelist' size-in-bits='448' is-struct='yes' visibility='default' filepath='/home/hutter2/release20/lib/libzfs/libzfs_changelist.c' line='75' column='1' id='type-id-226'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cl_prop' type-id='type-id-109' visibility='default' filepath='/home/hutter2/release20/lib/libzfs/libzfs_changelist.c' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='cl_realprop' type-id='type-id-109' visibility='default' filepath='/home/hutter2/release20/lib/libzfs/libzfs_changelist.c' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='cl_shareprop' type-id='type-id-109' visibility='default' filepath='/home/hutter2/release20/lib/libzfs/libzfs_changelist.c' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='cl_pool' type-id='type-id-215' visibility='default' filepath='/home/hutter2/release20/lib/libzfs/libzfs_changelist.c' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='cl_tree' type-id='type-id-216' visibility='default' filepath='/home/hutter2/release20/lib/libzfs/libzfs_changelist.c' line='80' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='cl_waslegacy' type-id='type-id-31' visibility='default' filepath='/home/hutter2/release20/lib/libzfs/libzfs_changelist.c' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='cl_allchildren' type-id='type-id-31' visibility='default' filepath='/home/hutter2/release20/lib/libzfs/libzfs_changelist.c' line='82' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='cl_alldependents' type-id='type-id-31' visibility='default' filepath='/home/hutter2/release20/lib/libzfs/libzfs_changelist.c' line='83' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='cl_mflags' type-id='type-id-20' visibility='default' filepath='/home/hutter2/release20/lib/libzfs/libzfs_changelist.c' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='cl_gflags' type-id='type-id-20' visibility='default' filepath='/home/hutter2/release20/lib/libzfs/libzfs_changelist.c' line='85' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='cl_haszonedchild' type-id='type-id-31' visibility='default' filepath='/home/hutter2/release20/lib/libzfs/libzfs_changelist.c' line='86' column='1'/>
      </data-member>
    </class-decl>
    <union-decl name='pthread_mutex_t' size-in-bits='320' naming-typedef-id='type-id-217' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='67' column='1' id='type-id-245'>
      <data-member access='public'>
        <var-decl name='__data' type-id='type-id-246' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='69' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__size' type-id='type-id-180' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='70' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__align' type-id='type-id-189' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='71' column='1'/>
      </data-member>
    </union-decl>
    <typedef-decl name='pthread_mutex_t' type-id='type-id-245' filepath='/usr/include/bits/pthreadtypes.h' line='72' column='1' id='type-id-217'/>
    <typedef-decl name='int32_t' type-id='type-id-247' filepath='/usr/include/bits/stdint-intn.h' line='26' column='1' id='type-id-240'/>
    <typedef-decl name='uint8_t' type-id='type-id-248' filepath='/usr/include/bits/stdint-uintn.h' line='24' column='1' id='type-id-64'/>
    <typedef-decl name='uint32_t' type-id='type-id-249' filepath='/usr/include/bits/stdint-uintn.h' line='26' column='1' id='type-id-53'/>
    <typedef-decl name='uint64_t' type-id='type-id-250' filepath='/usr/include/bits/stdint-uintn.h' line='27' column='1' id='type-id-60'/>
    <class-decl name='__pthread_mutex_s' size-in-bits='320' is-struct='yes' visibility='default' filepath='/usr/include/bits/struct_mutex.h' line='22' column='1' id='type-id-246'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__lock' type-id='type-id-20' visibility='default' filepath='/usr/include/bits/struct_mutex.h' line='24' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='__count' type-id='type-id-196' visibility='default' filepath='/usr/include/bits/struct_mutex.h' line='25' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__owner' type-id='type-id-20' visibility='default' filepath='/usr/include/bits/struct_mutex.h' line='26' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='__nusers' type-id='type-id-196' visibility='default' filepath='/usr/include/bits/struct_mutex.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='__kind' type-id='type-id-20' visibility='default' filepath='/usr/include/bits/struct_mutex.h' line='32' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='__spins' type-id='type-id-191' visibility='default' filepath='/usr/include/bits/struct_mutex.h' line='34' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='176'>
        <var-decl name='__elision' type-id='type-id-191' visibility='default' filepath='/usr/include/bits/struct_mutex.h' line='35' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='__list' type-id='type-id-251' visibility='default' filepath='/usr/include/bits/struct_mutex.h' line='36' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__pthread_internal_list' size-in-bits='128' is-struct='yes' visibility='default' filepath='/usr/include/bits/thread-shared-types.h' line='49' column='1' id='type-id-252'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__prev' type-id='type-id-253' visibility='default' filepath='/usr/include/bits/thread-shared-types.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__next' type-id='type-id-253' visibility='default' filepath='/usr/include/bits/thread-shared-types.h' line='52' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__pthread_list_t' type-id='type-id-252' filepath='/usr/include/bits/thread-shared-types.h' line='53' column='1' id='type-id-251'/>
    <typedef-decl name='__uint8_t' type-id='type-id-47' filepath='/usr/include/bits/types.h' line='38' column='1' id='type-id-248'/>
    <typedef-decl name='__int32_t' type-id='type-id-20' filepath='/usr/include/bits/types.h' line='41' column='1' id='type-id-247'/>
    <typedef-decl name='__uint32_t' type-id='type-id-196' filepath='/usr/include/bits/types.h' line='42' column='1' id='type-id-249'/>
    <typedef-decl name='__uint64_t' type-id='type-id-37' filepath='/usr/include/bits/types.h' line='45' column='1' id='type-id-250'/>
    <typedef-decl name='__off_t' type-id='type-id-189' filepath='/usr/include/bits/types.h' line='152' column='1' id='type-id-254'/>
    <typedef-decl name='__off64_t' type-id='type-id-189' filepath='/usr/include/bits/types.h' line='153' column='1' id='type-id-45'/>
    <typedef-decl name='FILE' type-id='type-id-255' filepath='/usr/include/bits/types/FILE.h' line='7' column='1' id='type-id-256'/>
    <typedef-decl name='_IO_lock_t' type-id='type-id-30' filepath='/usr/include/bits/types/struct_FILE.h' line='43' column='1' id='type-id-257'/>
    <class-decl name='_IO_FILE' size-in-bits='1728' is-struct='yes' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='49' column='1' id='type-id-255'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_flags' type-id='type-id-20' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_IO_read_ptr' type-id='type-id-2' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_IO_read_end' type-id='type-id-2' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_IO_read_base' type-id='type-id-2' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='_IO_write_base' type-id='type-id-2' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='_IO_write_ptr' type-id='type-id-2' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_IO_write_end' type-id='type-id-2' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='_IO_buf_base' type-id='type-id-2' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='_IO_buf_end' type-id='type-id-2' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='_IO_save_base' type-id='type-id-2' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='_IO_backup_base' type-id='type-id-2' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='_IO_save_end' type-id='type-id-2' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='_markers' type-id='type-id-258' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='_chain' type-id='type-id-259' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='_fileno' type-id='type-id-20' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='_flags2' type-id='type-id-20' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='_old_offset' type-id='type-id-254' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='_cur_column' type-id='type-id-46' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1040'>
        <var-decl name='_vtable_offset' type-id='type-id-192' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1048'>
        <var-decl name='_shortbuf' type-id='type-id-175' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='_lock' type-id='type-id-260' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='_offset' type-id='type-id-45' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='_codecvt' type-id='type-id-261' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='_wide_data' type-id='type-id-262' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='_freeres_list' type-id='type-id-259' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='_freeres_buf' type-id='type-id-80' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='__pad5' type-id='type-id-81' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='_mode' type-id='type-id-20' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='_unused2' type-id='type-id-177' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='98' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__re_long_size_t' type-id='type-id-37' filepath='/usr/include/regex.h' line='56' column='1' id='type-id-263'/>
    <typedef-decl name='reg_syntax_t' type-id='type-id-37' filepath='/usr/include/regex.h' line='72' column='1' id='type-id-264'/>
    <class-decl name='re_pattern_buffer' size-in-bits='512' is-struct='yes' visibility='default' filepath='/usr/include/regex.h' line='413' column='1' id='type-id-265'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='buffer' type-id='type-id-266' visibility='default' filepath='/usr/include/regex.h' line='417' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='allocated' type-id='type-id-263' visibility='default' filepath='/usr/include/regex.h' line='420' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='used' type-id='type-id-263' visibility='default' filepath='/usr/include/regex.h' line='423' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='syntax' type-id='type-id-264' visibility='default' filepath='/usr/include/regex.h' line='426' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='fastmap' type-id='type-id-2' visibility='default' filepath='/usr/include/regex.h' line='431' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='translate' type-id='type-id-267' visibility='default' filepath='/usr/include/regex.h' line='437' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='re_nsub' type-id='type-id-81' visibility='default' filepath='/usr/include/regex.h' line='440' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='can_be_null' type-id='type-id-196' visibility='default' filepath='/usr/include/regex.h' line='446' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='449'>
        <var-decl name='regs_allocated' type-id='type-id-196' visibility='default' filepath='/usr/include/regex.h' line='457' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='451'>
        <var-decl name='fastmap_accurate' type-id='type-id-196' visibility='default' filepath='/usr/include/regex.h' line='461' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='452'>
        <var-decl name='no_sub' type-id='type-id-196' visibility='default' filepath='/usr/include/regex.h' line='465' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='453'>
        <var-decl name='not_bol' type-id='type-id-196' visibility='default' filepath='/usr/include/regex.h' line='469' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='454'>
        <var-decl name='not_eol' type-id='type-id-196' visibility='default' filepath='/usr/include/regex.h' line='472' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='455'>
        <var-decl name='newline_anchor' type-id='type-id-196' visibility='default' filepath='/usr/include/regex.h' line='475' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='regex_t' type-id='type-id-265' filepath='/usr/include/regex.h' line='478' column='1' id='type-id-219'/>
    <typedef-decl name='uintptr_t' type-id='type-id-37' filepath='/usr/include/stdint.h' line='90' column='1' id='type-id-193'/>
    <typedef-decl name='size_t' type-id='type-id-37' filepath='/usr/lib/gcc/x86_64-redhat-linux/10/include/stddef.h' line='209' column='1' id='type-id-81'/>
    <pointer-type-def type-id='type-id-256' size-in-bits='64' id='type-id-213'/>
    <pointer-type-def type-id='type-id-255' size-in-bits='64' id='type-id-259'/>
    <pointer-type-def type-id='type-id-182' size-in-bits='64' id='type-id-261'/>
    <pointer-type-def type-id='type-id-257' size-in-bits='64' id='type-id-260'/>
    <pointer-type-def type-id='type-id-183' size-in-bits='64' id='type-id-258'/>
    <pointer-type-def type-id='type-id-184' size-in-bits='64' id='type-id-262'/>
    <pointer-type-def type-id='type-id-252' size-in-bits='64' id='type-id-253'/>
    <pointer-type-def type-id='type-id-229' size-in-bits='64' id='type-id-171'/>
    <pointer-type-def type-id='type-id-35' size-in-bits='64' id='type-id-2'/>
    <pointer-type-def type-id='type-id-2' size-in-bits='64' id='type-id-268'/>
    <qualified-type-def type-id='type-id-35' const='yes' id='type-id-269'/>
    <pointer-type-def type-id='type-id-269' size-in-bits='64' id='type-id-18'/>
    <qualified-type-def type-id='type-id-206' const='yes' id='type-id-270'/>
    <pointer-type-def type-id='type-id-270' size-in-bits='64' id='type-id-271'/>
    <pointer-type-def type-id='type-id-272' size-in-bits='64' id='type-id-230'/>
    <pointer-type-def type-id='type-id-273' size-in-bits='64' id='type-id-211'/>
    <pointer-type-def type-id='type-id-210' size-in-bits='64' id='type-id-220'/>
    <pointer-type-def type-id='type-id-241' size-in-bits='64' id='type-id-98'/>
    <pointer-type-def type-id='type-id-227' size-in-bits='64' id='type-id-274'/>
    <pointer-type-def type-id='type-id-185' size-in-bits='64' id='type-id-266'/>
    <pointer-type-def type-id='type-id-64' size-in-bits='64' id='type-id-222'/>
    <pointer-type-def type-id='type-id-47' size-in-bits='64' id='type-id-267'/>
    <pointer-type-def type-id='type-id-204' size-in-bits='64' id='type-id-275'/>
    <pointer-type-def type-id='type-id-202' size-in-bits='64' id='type-id-276'/>
    <pointer-type-def type-id='type-id-199' size-in-bits='64' id='type-id-215'/>
    <pointer-type-def type-id='type-id-200' size-in-bits='64' id='type-id-216'/>
    <pointer-type-def type-id='type-id-203' size-in-bits='64' id='type-id-277'/>
    <pointer-type-def type-id='type-id-198' size-in-bits='64' id='type-id-278'/>
    <pointer-type-def type-id='type-id-30' size-in-bits='64' id='type-id-80'/>
    <pointer-type-def type-id='type-id-206' size-in-bits='64' id='type-id-279'/>
    <pointer-type-def type-id='type-id-224' size-in-bits='64' id='type-id-280'/>
    <pointer-type-def type-id='type-id-208' size-in-bits='64' id='type-id-214'/>
    <pointer-type-def type-id='type-id-237' size-in-bits='64' id='type-id-281'/>
    <class-decl name='_IO_codecvt' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-182'/>
    <class-decl name='_IO_marker' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-183'/>
    <class-decl name='_IO_wide_data' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-184'/>
    <class-decl name='re_dfa_t' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-185'/>
    <class-decl name='uu_avl' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-186'/>
    <class-decl name='uu_avl_pool' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-187'/>
    <class-decl name='uu_avl_walk' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-188'/>
    <function-decl name='uu_avl_pool_create' filepath='../../include/libuutil.h' line='332' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-81'/>
      <parameter type-id='type-id-81'/>
      <parameter type-id='type-id-278'/>
      <parameter type-id='type-id-53'/>
      <return type-id='type-id-215'/>
    </function-decl>
    <function-decl name='uu_avl_pool_destroy' filepath='../../include/libuutil.h' line='336' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-215'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='uu_avl_node_init' filepath='../../include/libuutil.h' line='348' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-80'/>
      <parameter type-id='type-id-276'/>
      <parameter type-id='type-id-215'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='uu_avl_create' filepath='../../include/libuutil.h' line='351' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-215'/>
      <parameter type-id='type-id-80'/>
      <parameter type-id='type-id-53'/>
      <return type-id='type-id-216'/>
    </function-decl>
    <function-decl name='uu_avl_destroy' filepath='../../include/libuutil.h' line='354' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-216'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='uu_avl_last' filepath='../../include/libuutil.h' line='359' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-216'/>
      <return type-id='type-id-80'/>
    </function-decl>
    <function-decl name='uu_avl_walk_start' filepath='../../include/libuutil.h' line='366' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-216'/>
      <parameter type-id='type-id-53'/>
      <return type-id='type-id-277'/>
    </function-decl>
    <function-decl name='uu_avl_walk_next' filepath='../../include/libuutil.h' line='367' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-277'/>
      <return type-id='type-id-80'/>
    </function-decl>
    <function-decl name='uu_avl_walk_end' filepath='../../include/libuutil.h' line='368' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-277'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='uu_avl_find' filepath='../../include/libuutil.h' line='370' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-216'/>
      <parameter type-id='type-id-80'/>
      <parameter type-id='type-id-80'/>
      <parameter type-id='type-id-275'/>
      <return type-id='type-id-80'/>
    </function-decl>
    <function-decl name='uu_avl_insert' filepath='../../include/libuutil.h' line='371' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-216'/>
      <parameter type-id='type-id-80'/>
      <parameter type-id='type-id-204'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='uu_avl_remove' filepath='../../include/libuutil.h' line='378' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-216'/>
      <parameter type-id='type-id-80'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='zfs_get_handle' mangled-name='zfs_get_handle' filepath='../../include/libzfs.h' line='209' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_get_handle'>
      <parameter type-id='type-id-279'/>
      <return type-id='type-id-220'/>
    </function-decl>
    <function-decl name='zfs_open' mangled-name='zfs_open' filepath='../../include/libzfs.h' line='463' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_open'>
      <parameter type-id='type-id-220'/>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-20'/>
      <return type-id='type-id-279'/>
    </function-decl>
    <function-decl name='zfs_close' mangled-name='zfs_close' filepath='../../include/libzfs.h' line='465' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_close'>
      <parameter type-id='type-id-279'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='zfs_get_name' mangled-name='zfs_get_name' filepath='../../include/libzfs.h' line='467' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_get_name'>
      <parameter type-id='type-id-271'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='zfs_prop_get' mangled-name='zfs_prop_get' filepath='../../include/libzfs.h' line='490' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_get'>
      <parameter type-id='type-id-279'/>
      <parameter type-id='type-id-109'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-81'/>
      <parameter type-id='type-id-281'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-81'/>
      <parameter type-id='type-id-31'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='zfs_prop_get_int' mangled-name='zfs_prop_get_int' filepath='../../include/libzfs.h' line='507' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_get_int'>
      <parameter type-id='type-id-279'/>
      <parameter type-id='type-id-109'/>
      <return type-id='type-id-60'/>
    </function-decl>
    <function-decl name='zfs_iter_children' mangled-name='zfs_iter_children' filepath='../../include/libzfs.h' line='610' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_iter_children'>
      <parameter type-id='type-id-279'/>
      <parameter type-id='type-id-212'/>
      <parameter type-id='type-id-80'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='zfs_iter_dependents' mangled-name='zfs_iter_dependents' filepath='../../include/libzfs.h' line='611' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_iter_dependents'>
      <parameter type-id='type-id-279'/>
      <parameter type-id='type-id-31'/>
      <parameter type-id='type-id-212'/>
      <parameter type-id='type-id-80'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='zfs_iter_mounted' mangled-name='zfs_iter_mounted' filepath='../../include/libzfs.h' line='619' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_iter_mounted'>
      <parameter type-id='type-id-279'/>
      <parameter type-id='type-id-212'/>
      <parameter type-id='type-id-80'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='zfs_refresh_properties' mangled-name='zfs_refresh_properties' filepath='../../include/libzfs.h' line='803' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_refresh_properties'>
      <parameter type-id='type-id-279'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='zfs_is_mounted' mangled-name='zfs_is_mounted' filepath='../../include/libzfs.h' line='817' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_is_mounted'>
      <parameter type-id='type-id-279'/>
      <parameter type-id='type-id-268'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='zfs_mount' mangled-name='zfs_mount' filepath='../../include/libzfs.h' line='818' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_mount'>
      <parameter type-id='type-id-279'/>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-20'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='zfs_unmount' mangled-name='zfs_unmount' filepath='../../include/libzfs.h' line='820' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_unmount'>
      <parameter type-id='type-id-279'/>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-20'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='zfs_is_shared' mangled-name='zfs_is_shared' filepath='../../include/libzfs.h' line='833' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_is_shared'>
      <parameter type-id='type-id-279'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='zfs_share_nfs' mangled-name='zfs_share_nfs' filepath='../../include/libzfs.h' line='842' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_share_nfs'>
      <parameter type-id='type-id-279'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='zfs_share_smb' mangled-name='zfs_share_smb' filepath='../../include/libzfs.h' line='843' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_share_smb'>
      <parameter type-id='type-id-279'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='zfs_unshare_nfs' mangled-name='zfs_unshare_nfs' filepath='../../include/libzfs.h' line='845' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_unshare_nfs'>
      <parameter type-id='type-id-279'/>
      <parameter type-id='type-id-18'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='zfs_unshare_smb' mangled-name='zfs_unshare_smb' filepath='../../include/libzfs.h' line='846' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_unshare_smb'>
      <parameter type-id='type-id-279'/>
      <parameter type-id='type-id-18'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='zfs_commit_nfs_shares' mangled-name='zfs_commit_nfs_shares' filepath='../../include/libzfs.h' line='854' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_commit_nfs_shares'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='zfs_commit_smb_shares' mangled-name='zfs_commit_smb_shares' filepath='../../include/libzfs.h' line='855' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_commit_smb_shares'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='zfs_error' mangled-name='zfs_error' filepath='../../include/libzfs_impl.h' line='136' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_error'>
      <parameter type-id='type-id-220'/>
      <parameter type-id='type-id-20'/>
      <parameter type-id='type-id-18'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='zfs_alloc' mangled-name='zfs_alloc' filepath='../../include/libzfs_impl.h' line='139' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_alloc'>
      <parameter type-id='type-id-220'/>
      <parameter type-id='type-id-81'/>
      <return type-id='type-id-80'/>
    </function-decl>
    <function-decl name='remove_mountpoint' mangled-name='remove_mountpoint' filepath='../../include/libzfs_impl.h' line='192' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='remove_mountpoint'>
      <parameter type-id='type-id-279'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='zfs_unshare_proto' mangled-name='zfs_unshare_proto' filepath='../../include/libzfs_impl.h' line='211' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_unshare_proto'>
      <parameter type-id='type-id-279'/>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-280'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='zfs_commit_proto' mangled-name='zfs_commit_proto' filepath='../../include/libzfs_impl.h' line='260' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_commit_proto'>
      <parameter type-id='type-id-280'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='getzoneid' filepath='../../include/sys/zfs_context.h' line='731' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-244'/>
    </function-decl>
    <function-decl name='strlcat' filepath='../../lib/libspl/include/string.h' line='33' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-81'/>
      <return type-id='type-id-81'/>
    </function-decl>
    <function-decl name='strlcpy' filepath='../../lib/libspl/include/string.h' line='37' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-81'/>
      <return type-id='type-id-81'/>
    </function-decl>
    <function-decl name='changelist_prefix' mangled-name='changelist_prefix' filepath='/home/hutter2/release20/lib/libzfs/libzfs_changelist.c' line='96' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='changelist_prefix'>
      <parameter type-id='type-id-274' name='clp' filepath='/home/hutter2/release20/lib/libzfs/libzfs_changelist.c' line='96' column='1'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='changelist_postfix' mangled-name='changelist_postfix' filepath='/home/hutter2/release20/lib/libzfs/libzfs_changelist.c' line='170' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='changelist_postfix'>
      <parameter type-id='type-id-274' name='clp' filepath='/home/hutter2/release20/lib/libzfs/libzfs_changelist.c' line='170' column='1'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='isa_child_of' mangled-name='isa_child_of' filepath='/home/hutter2/release20/lib/libzfs/libzfs_changelist.c' line='288' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='isa_child_of'>
      <parameter type-id='type-id-18' name='dataset' filepath='/home/hutter2/release20/lib/libzfs/libzfs_changelist.c' line='288' column='1'/>
      <parameter type-id='type-id-18' name='parent' filepath='/home/hutter2/release20/lib/libzfs/libzfs_changelist.c' line='288' column='1'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='changelist_rename' mangled-name='changelist_rename' filepath='/home/hutter2/release20/lib/libzfs/libzfs_changelist.c' line='311' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='changelist_rename'>
      <parameter type-id='type-id-274' name='clp' filepath='/home/hutter2/release20/lib/libzfs/libzfs_changelist.c' line='311' column='1'/>
      <parameter type-id='type-id-18' name='src' filepath='/home/hutter2/release20/lib/libzfs/libzfs_changelist.c' line='311' column='1'/>
      <parameter type-id='type-id-18' name='dst' filepath='/home/hutter2/release20/lib/libzfs/libzfs_changelist.c' line='311' column='1'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='changelist_unshare' mangled-name='changelist_unshare' filepath='/home/hutter2/release20/lib/libzfs/libzfs_changelist.c' line='348' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='changelist_unshare'>
      <parameter type-id='type-id-274' name='clp' filepath='/home/hutter2/release20/lib/libzfs/libzfs_changelist.c' line='348' column='1'/>
      <parameter type-id='type-id-280' name='proto' filepath='/home/hutter2/release20/lib/libzfs/libzfs_changelist.c' line='348' column='1'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='changelist_haszonedchild' mangled-name='changelist_haszonedchild' filepath='/home/hutter2/release20/lib/libzfs/libzfs_changelist.c' line='378' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='changelist_haszonedchild'>
      <parameter type-id='type-id-274' name='clp' filepath='/home/hutter2/release20/lib/libzfs/libzfs_changelist.c' line='378' column='1'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='changelist_remove' mangled-name='changelist_remove' filepath='/home/hutter2/release20/lib/libzfs/libzfs_changelist.c' line='387' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='changelist_remove'>
      <parameter type-id='type-id-274' name='clp' filepath='/home/hutter2/release20/lib/libzfs/libzfs_changelist.c' line='387' column='1'/>
      <parameter type-id='type-id-18' name='name' filepath='/home/hutter2/release20/lib/libzfs/libzfs_changelist.c' line='387' column='1'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='changelist_free' mangled-name='changelist_free' filepath='/home/hutter2/release20/lib/libzfs/libzfs_changelist.c' line='412' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='changelist_free'>
      <parameter type-id='type-id-274' name='clp' filepath='/home/hutter2/release20/lib/libzfs/libzfs_changelist.c' line='412' column='1'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='changelist_gather' mangled-name='changelist_gather' filepath='/home/hutter2/release20/lib/libzfs/libzfs_changelist.c' line='624' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='changelist_gather'>
      <parameter type-id='type-id-279' name='zhp' filepath='/home/hutter2/release20/lib/libzfs/libzfs_changelist.c' line='624' column='1'/>
      <parameter type-id='type-id-109' name='prop' filepath='/home/hutter2/release20/lib/libzfs/libzfs_changelist.c' line='624' column='1'/>
      <parameter type-id='type-id-20' name='gather_flags' filepath='/home/hutter2/release20/lib/libzfs/libzfs_changelist.c' line='624' column='1'/>
      <parameter type-id='type-id-20' name='mnt_flags' filepath='/home/hutter2/release20/lib/libzfs/libzfs_changelist.c' line='625' column='1'/>
      <return type-id='type-id-274'/>
    </function-decl>
    <function-decl name='free' filepath='/usr/include/stdlib.h' line='565' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-80'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='strcmp' filepath='/usr/include/string.h' line='140' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-18'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='strncmp' filepath='/usr/include/string.h' line='143' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-81'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='strlen' filepath='/usr/include/string.h' line='391' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-18'/>
      <return type-id='type-id-81'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-272'>
      <parameter type-id='type-id-80'/>
      <parameter type-id='type-id-80'/>
      <return type-id='type-id-20'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-197'>
      <parameter type-id='type-id-80'/>
      <parameter type-id='type-id-80'/>
      <parameter type-id='type-id-80'/>
      <return type-id='type-id-20'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-273'>
      <parameter type-id='type-id-279'/>
      <parameter type-id='type-id-80'/>
      <return type-id='type-id-20'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='libzfs_config.c' comp-dir-path='/home/hutter2/release20/lib/libzfs' language='LANG_C99'>
    <array-type-def dimensions='1' type-id='type-id-35' size-in-bits='32768' id='type-id-40'>
      <subrange length='4096' type-id='type-id-37' id='type-id-282'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-35' size-in-bits='65536' id='type-id-283'>
      <subrange length='8192' type-id='type-id-37' id='type-id-284'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-60' size-in-bits='128' id='type-id-72'>
      <subrange length='2' type-id='type-id-37' id='type-id-55'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-64' size-in-bits='24' id='type-id-285'>
      <subrange length='3' type-id='type-id-37' id='type-id-195'/>
    </array-type-def>
    <type-decl name='variadic parameter type' id='type-id-286'/>
    <typedef-decl name='zpool_iter_f' type-id='type-id-287' filepath='../../include/libzfs.h' line='245' column='1' id='type-id-288'/>
    <enum-decl name='data_type_t' naming-typedef-id='type-id-289' filepath='../../include/sys/nvpair.h' line='37' column='1' id='type-id-290'>
      <underlying-type type-id='type-id-86'/>
      <enumerator name='DATA_TYPE_DONTCARE' value='-1'/>
      <enumerator name='DATA_TYPE_UNKNOWN' value='0'/>
      <enumerator name='DATA_TYPE_BOOLEAN' value='1'/>
      <enumerator name='DATA_TYPE_BYTE' value='2'/>
      <enumerator name='DATA_TYPE_INT16' value='3'/>
      <enumerator name='DATA_TYPE_UINT16' value='4'/>
      <enumerator name='DATA_TYPE_INT32' value='5'/>
      <enumerator name='DATA_TYPE_UINT32' value='6'/>
      <enumerator name='DATA_TYPE_INT64' value='7'/>
      <enumerator name='DATA_TYPE_UINT64' value='8'/>
      <enumerator name='DATA_TYPE_STRING' value='9'/>
      <enumerator name='DATA_TYPE_BYTE_ARRAY' value='10'/>
      <enumerator name='DATA_TYPE_INT16_ARRAY' value='11'/>
      <enumerator name='DATA_TYPE_UINT16_ARRAY' value='12'/>
      <enumerator name='DATA_TYPE_INT32_ARRAY' value='13'/>
      <enumerator name='DATA_TYPE_UINT32_ARRAY' value='14'/>
      <enumerator name='DATA_TYPE_INT64_ARRAY' value='15'/>
      <enumerator name='DATA_TYPE_UINT64_ARRAY' value='16'/>
      <enumerator name='DATA_TYPE_STRING_ARRAY' value='17'/>
      <enumerator name='DATA_TYPE_HRTIME' value='18'/>
      <enumerator name='DATA_TYPE_NVLIST' value='19'/>
      <enumerator name='DATA_TYPE_NVLIST_ARRAY' value='20'/>
      <enumerator name='DATA_TYPE_BOOLEAN_VALUE' value='21'/>
      <enumerator name='DATA_TYPE_INT8' value='22'/>
      <enumerator name='DATA_TYPE_UINT8' value='23'/>
      <enumerator name='DATA_TYPE_BOOLEAN_ARRAY' value='24'/>
      <enumerator name='DATA_TYPE_INT8_ARRAY' value='25'/>
      <enumerator name='DATA_TYPE_UINT8_ARRAY' value='26'/>
      <enumerator name='DATA_TYPE_DOUBLE' value='27'/>
    </enum-decl>
    <typedef-decl name='data_type_t' type-id='type-id-290' filepath='../../include/sys/nvpair.h' line='71' column='1' id='type-id-289'/>
    <class-decl name='nvpair' size-in-bits='128' is-struct='yes' visibility='default' filepath='../../include/sys/nvpair.h' line='73' column='1' id='type-id-291'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nvp_size' type-id='type-id-240' visibility='default' filepath='../../include/sys/nvpair.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='nvp_name_sz' type-id='type-id-292' visibility='default' filepath='../../include/sys/nvpair.h' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='nvp_reserve' type-id='type-id-292' visibility='default' filepath='../../include/sys/nvpair.h' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='nvp_value_elem' type-id='type-id-240' visibility='default' filepath='../../include/sys/nvpair.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='nvp_type' type-id='type-id-289' visibility='default' filepath='../../include/sys/nvpair.h' line='78' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='nvpair_t' type-id='type-id-291' filepath='../../include/sys/nvpair.h' line='82' column='1' id='type-id-293'/>
    <class-decl name='drr_begin' size-in-bits='2432' is-struct='yes' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='231' column='1' id='type-id-294'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='drr_magic' type-id='type-id-60' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='232' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='drr_versioninfo' type-id='type-id-60' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='233' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='drr_creation_time' type-id='type-id-60' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='234' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='drr_type' type-id='type-id-233' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='235' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='drr_flags' type-id='type-id-53' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='236' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='drr_toguid' type-id='type-id-60' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='237' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='drr_fromguid' type-id='type-id-60' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='238' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='drr_toname' type-id='type-id-48' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='239' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='zinject_record' size-in-bits='2816' is-struct='yes' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='403' column='1' id='type-id-295'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='zi_objset' type-id='type-id-60' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='404' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='zi_object' type-id='type-id-60' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='405' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='zi_start' type-id='type-id-60' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='406' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='zi_end' type-id='type-id-60' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='407' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='zi_guid' type-id='type-id-60' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='408' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='zi_level' type-id='type-id-53' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='409' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='zi_error' type-id='type-id-53' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='410' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='zi_type' type-id='type-id-60' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='411' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='zi_freq' type-id='type-id-53' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='412' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='zi_failfast' type-id='type-id-53' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='413' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='zi_func' type-id='type-id-48' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='414' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2560'>
        <var-decl name='zi_iotype' type-id='type-id-53' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='415' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2592'>
        <var-decl name='zi_duration' type-id='type-id-240' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='416' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2624'>
        <var-decl name='zi_timer' type-id='type-id-60' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='417' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2688'>
        <var-decl name='zi_nlanes' type-id='type-id-60' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='418' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2752'>
        <var-decl name='zi_cmd' type-id='type-id-53' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='419' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2784'>
        <var-decl name='zi_dvas' type-id='type-id-53' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='420' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='zinject_record_t' type-id='type-id-295' filepath='../../include/sys/zfs_ioctl.h' line='421' column='1' id='type-id-296'/>
    <class-decl name='zfs_share' size-in-bits='256' is-struct='yes' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='452' column='1' id='type-id-297'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='z_exportdata' type-id='type-id-60' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='453' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='z_sharedata' type-id='type-id-60' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='454' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='z_sharetype' type-id='type-id-60' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='455' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='z_sharemax' type-id='type-id-60' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='456' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='zfs_share_t' type-id='type-id-297' filepath='../../include/sys/zfs_ioctl.h' line='457' column='1' id='type-id-298'/>
    <class-decl name='zfs_cmd' size-in-bits='109952' is-struct='yes' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='477' column='1' id='type-id-299'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='zc_name' type-id='type-id-40' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='478' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32768'>
        <var-decl name='zc_nvlist_src' type-id='type-id-60' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='479' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32832'>
        <var-decl name='zc_nvlist_src_size' type-id='type-id-60' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='480' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32896'>
        <var-decl name='zc_nvlist_dst' type-id='type-id-60' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='481' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32960'>
        <var-decl name='zc_nvlist_dst_size' type-id='type-id-60' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='482' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='33024'>
        <var-decl name='zc_nvlist_dst_filled' type-id='type-id-31' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='483' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='33056'>
        <var-decl name='zc_pad2' type-id='type-id-20' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='484' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='33088'>
        <var-decl name='zc_history' type-id='type-id-60' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='490' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='33152'>
        <var-decl name='zc_value' type-id='type-id-283' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='491' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='98688'>
        <var-decl name='zc_string' type-id='type-id-48' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='492' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='100736'>
        <var-decl name='zc_guid' type-id='type-id-60' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='493' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='100800'>
        <var-decl name='zc_nvlist_conf' type-id='type-id-60' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='494' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='100864'>
        <var-decl name='zc_nvlist_conf_size' type-id='type-id-60' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='495' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='100928'>
        <var-decl name='zc_cookie' type-id='type-id-60' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='496' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='100992'>
        <var-decl name='zc_objset_type' type-id='type-id-60' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='497' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='101056'>
        <var-decl name='zc_perm_action' type-id='type-id-60' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='498' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='101120'>
        <var-decl name='zc_history_len' type-id='type-id-60' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='499' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='101184'>
        <var-decl name='zc_history_offset' type-id='type-id-60' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='500' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='101248'>
        <var-decl name='zc_obj' type-id='type-id-60' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='501' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='101312'>
        <var-decl name='zc_iflags' type-id='type-id-60' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='502' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='101376'>
        <var-decl name='zc_share' type-id='type-id-298' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='503' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='101632'>
        <var-decl name='zc_objset_stats' type-id='type-id-221' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='504' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='103936'>
        <var-decl name='zc_begin_record' type-id='type-id-294' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='505' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='106368'>
        <var-decl name='zc_inject_record' type-id='type-id-296' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='506' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109184'>
        <var-decl name='zc_defer_destroy' type-id='type-id-53' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='507' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109216'>
        <var-decl name='zc_flags' type-id='type-id-53' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='508' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109248'>
        <var-decl name='zc_action_handle' type-id='type-id-60' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='509' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109312'>
        <var-decl name='zc_cleanup_fd' type-id='type-id-20' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='510' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109344'>
        <var-decl name='zc_simple' type-id='type-id-64' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='511' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109352'>
        <var-decl name='zc_pad' type-id='type-id-285' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='512' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109376'>
        <var-decl name='zc_sendobj' type-id='type-id-60' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='513' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109440'>
        <var-decl name='zc_fromobj' type-id='type-id-60' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='514' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109504'>
        <var-decl name='zc_createtxg' type-id='type-id-60' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='515' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109568'>
        <var-decl name='zc_stat' type-id='type-id-300' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='516' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109888'>
        <var-decl name='zc_zoneid' type-id='type-id-60' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='517' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='zfs_cmd_t' type-id='type-id-299' filepath='../../include/sys/zfs_ioctl.h' line='518' column='1' id='type-id-301'/>
    <class-decl name='zfs_stat' size-in-bits='320' is-struct='yes' visibility='default' filepath='../../include/sys/zfs_stat.h' line='42' column='1' id='type-id-302'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='zs_gen' type-id='type-id-60' visibility='default' filepath='../../include/sys/zfs_stat.h' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='zs_mode' type-id='type-id-60' visibility='default' filepath='../../include/sys/zfs_stat.h' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='zs_links' type-id='type-id-60' visibility='default' filepath='../../include/sys/zfs_stat.h' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='zs_ctime' type-id='type-id-72' visibility='default' filepath='../../include/sys/zfs_stat.h' line='46' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='zfs_stat_t' type-id='type-id-302' filepath='../../include/sys/zfs_stat.h' line='47' column='1' id='type-id-300'/>
    <typedef-decl name='int16_t' type-id='type-id-303' filepath='/usr/include/bits/stdint-intn.h' line='25' column='1' id='type-id-292'/>
    <typedef-decl name='__int16_t' type-id='type-id-191' filepath='/usr/include/bits/types.h' line='39' column='1' id='type-id-303'/>
    <pointer-type-def type-id='type-id-31' size-in-bits='64' id='type-id-304'/>
    <pointer-type-def type-id='type-id-305' size-in-bits='64' id='type-id-287'/>
    <pointer-type-def type-id='type-id-20' size-in-bits='64' id='type-id-306'/>
    <pointer-type-def type-id='type-id-98' size-in-bits='64' id='type-id-307'/>
    <pointer-type-def type-id='type-id-293' size-in-bits='64' id='type-id-97'/>
    <pointer-type-def type-id='type-id-80' size-in-bits='64' id='type-id-308'/>
    <pointer-type-def type-id='type-id-299' size-in-bits='64' id='type-id-309'/>
    <pointer-type-def type-id='type-id-301' size-in-bits='64' id='type-id-310'/>
    <pointer-type-def type-id='type-id-214' size-in-bits='64' id='type-id-311'/>
    <function-decl name='uu_avl_first' filepath='../../include/libuutil.h' line='358' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-216'/>
      <return type-id='type-id-80'/>
    </function-decl>
    <function-decl name='uu_avl_next' filepath='../../include/libuutil.h' line='361' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-216'/>
      <parameter type-id='type-id-80'/>
      <return type-id='type-id-80'/>
    </function-decl>
    <function-decl name='uu_avl_teardown' filepath='../../include/libuutil.h' line='376' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-216'/>
      <parameter type-id='type-id-308'/>
      <return type-id='type-id-80'/>
    </function-decl>
    <function-decl name='zfs_ioctl' mangled-name='zfs_ioctl' filepath='../../include/libzfs.h' line='452' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_ioctl'>
      <parameter type-id='type-id-220'/>
      <parameter type-id='type-id-20'/>
      <parameter type-id='type-id-309'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='zfs_strdup' mangled-name='zfs_strdup' filepath='../../include/libzfs_impl.h' line='142' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_strdup'>
      <parameter type-id='type-id-220'/>
      <parameter type-id='type-id-18'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='no_memory' mangled-name='no_memory' filepath='../../include/libzfs_impl.h' line='143' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='no_memory'>
      <parameter type-id='type-id-220'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='zfs_standard_error' mangled-name='zfs_standard_error' filepath='../../include/libzfs_impl.h' line='145' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_standard_error'>
      <parameter type-id='type-id-220'/>
      <parameter type-id='type-id-20'/>
      <parameter type-id='type-id-18'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='zcmd_alloc_dst_nvlist' mangled-name='zcmd_alloc_dst_nvlist' filepath='../../include/libzfs_impl.h' line='176' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zcmd_alloc_dst_nvlist'>
      <parameter type-id='type-id-220'/>
      <parameter type-id='type-id-310'/>
      <parameter type-id='type-id-81'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='zcmd_expand_dst_nvlist' mangled-name='zcmd_expand_dst_nvlist' filepath='../../include/libzfs_impl.h' line='179' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zcmd_expand_dst_nvlist'>
      <parameter type-id='type-id-220'/>
      <parameter type-id='type-id-310'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='zcmd_read_dst_nvlist' mangled-name='zcmd_read_dst_nvlist' filepath='../../include/libzfs_impl.h' line='180' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zcmd_read_dst_nvlist'>
      <parameter type-id='type-id-220'/>
      <parameter type-id='type-id-310'/>
      <parameter type-id='type-id-307'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='zcmd_free_nvlists' mangled-name='zcmd_free_nvlists' filepath='../../include/libzfs_impl.h' line='181' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zcmd_free_nvlists'>
      <parameter type-id='type-id-310'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='make_dataset_handle' mangled-name='make_dataset_handle' filepath='../../include/libzfs_impl.h' line='196' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='make_dataset_handle'>
      <parameter type-id='type-id-220'/>
      <parameter type-id='type-id-18'/>
      <return type-id='type-id-279'/>
    </function-decl>
    <function-decl name='zpool_open_silent' mangled-name='zpool_open_silent' filepath='../../include/libzfs_impl.h' line='200' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_open_silent'>
      <parameter type-id='type-id-220'/>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-311'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='nvlist_free' filepath='../../include/sys/nvpair.h' line='152' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-98'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='nvlist_dup' filepath='../../include/sys/nvpair.h' line='156' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-98'/>
      <parameter type-id='type-id-307'/>
      <parameter type-id='type-id-20'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='nvlist_lookup_nvlist' filepath='../../include/sys/nvpair.h' line='214' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-98'/>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-307'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='nvlist_exists' filepath='../../include/sys/nvpair.h' line='238' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-98'/>
      <parameter type-id='type-id-18'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='nvlist_next_nvpair' filepath='../../include/sys/nvpair.h' line='242' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-98'/>
      <parameter type-id='type-id-97'/>
      <return type-id='type-id-97'/>
    </function-decl>
    <function-decl name='nvpair_name' filepath='../../include/sys/nvpair.h' line='244' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-97'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvpair_value_nvlist' filepath='../../include/sys/nvpair.h' line='258' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-97'/>
      <parameter type-id='type-id-307'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='libspl_assertf' filepath='../../lib/libspl/include/assert.h' line='40' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-20'/>
      <parameter type-id='type-id-18'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='namespace_clear' mangled-name='namespace_clear' filepath='/home/hutter2/release20/lib/libzfs/libzfs_config.c' line='79' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='namespace_clear'>
      <parameter type-id='type-id-220' name='hdl' filepath='/home/hutter2/release20/lib/libzfs/libzfs_config.c' line='79' column='1'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='zpool_get_config' mangled-name='zpool_get_config' filepath='/home/hutter2/release20/lib/libzfs/libzfs_config.c' line='220' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_get_config'>
      <parameter type-id='type-id-214' name='zhp' filepath='/home/hutter2/release20/lib/libzfs/libzfs_config.c' line='220' column='1'/>
      <parameter type-id='type-id-307' name='oldconfig' filepath='/home/hutter2/release20/lib/libzfs/libzfs_config.c' line='220' column='1'/>
      <return type-id='type-id-98'/>
    </function-decl>
    <function-decl name='zpool_get_features' mangled-name='zpool_get_features' filepath='/home/hutter2/release20/lib/libzfs/libzfs_config.c' line='232' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_get_features'>
      <parameter type-id='type-id-214' name='zhp' filepath='/home/hutter2/release20/lib/libzfs/libzfs_config.c' line='232' column='1'/>
      <return type-id='type-id-98'/>
    </function-decl>
    <function-decl name='zpool_refresh_stats' mangled-name='zpool_refresh_stats' filepath='/home/hutter2/release20/lib/libzfs/libzfs_config.c' line='265' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_refresh_stats'>
      <parameter type-id='type-id-214' name='zhp' filepath='/home/hutter2/release20/lib/libzfs/libzfs_config.c' line='265' column='1'/>
      <parameter type-id='type-id-304' name='missing' filepath='/home/hutter2/release20/lib/libzfs/libzfs_config.c' line='265' column='1'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='zpool_skip_pool' mangled-name='zpool_skip_pool' filepath='/home/hutter2/release20/lib/libzfs/libzfs_config.c' line='340' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_skip_pool'>
      <parameter type-id='type-id-18' name='poolname' filepath='/home/hutter2/release20/lib/libzfs/libzfs_config.c' line='340' column='1'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='zpool_iter' mangled-name='zpool_iter' filepath='/home/hutter2/release20/lib/libzfs/libzfs_config.c' line='389' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_iter'>
      <parameter type-id='type-id-220' name='hdl' filepath='/home/hutter2/release20/lib/libzfs/libzfs_config.c' line='389' column='1'/>
      <parameter type-id='type-id-288' name='func' filepath='/home/hutter2/release20/lib/libzfs/libzfs_config.c' line='389' column='1'/>
      <parameter type-id='type-id-80' name='data' filepath='/home/hutter2/release20/lib/libzfs/libzfs_config.c' line='389' column='1'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='zfs_iter_root' mangled-name='zfs_iter_root' filepath='/home/hutter2/release20/lib/libzfs/libzfs_config.c' line='434' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_iter_root'>
      <parameter type-id='type-id-220' name='hdl' filepath='/home/hutter2/release20/lib/libzfs/libzfs_config.c' line='434' column='1'/>
      <parameter type-id='type-id-212' name='func' filepath='/home/hutter2/release20/lib/libzfs/libzfs_config.c' line='434' column='1'/>
      <parameter type-id='type-id-80' name='data' filepath='/home/hutter2/release20/lib/libzfs/libzfs_config.c' line='434' column='1'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='__errno_location' filepath='/usr/include/errno.h' line='37' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-306'/>
    </function-decl>
    <function-decl name='dcgettext' filepath='/usr/include/libintl.h' line='51' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-20'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='getenv' filepath='/usr/include/stdlib.h' line='634' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-18'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='strcpy' filepath='/usr/include/string.h' line='125' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-18'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='strchr' filepath='/usr/include/string.h' line='230' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-20'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-305'>
      <parameter type-id='type-id-214'/>
      <parameter type-id='type-id-80'/>
      <return type-id='type-id-20'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='libzfs_crypto.c' comp-dir-path='/home/hutter2/release20/lib/libzfs' language='LANG_C99'>
    <array-type-def dimensions='1' type-id='type-id-312' size-in-bits='256' id='type-id-313'>
      <subrange length='32' type-id='type-id-37' id='type-id-57'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-20' size-in-bits='896' id='type-id-314'>
      <subrange length='28' type-id='type-id-37' id='type-id-315'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-37' size-in-bits='1024' id='type-id-316'>
      <subrange length='16' type-id='type-id-37' id='type-id-62'/>
    </array-type-def>
    <enum-decl name='zpool_prop_t' naming-typedef-id='type-id-169' filepath='../../include/sys/fs/zfs.h' line='215' column='1' id='type-id-317'>
      <underlying-type type-id='type-id-86'/>
      <enumerator name='ZPOOL_PROP_INVAL' value='-1'/>
      <enumerator name='ZPOOL_PROP_NAME' value='0'/>
      <enumerator name='ZPOOL_PROP_SIZE' value='1'/>
      <enumerator name='ZPOOL_PROP_CAPACITY' value='2'/>
      <enumerator name='ZPOOL_PROP_ALTROOT' value='3'/>
      <enumerator name='ZPOOL_PROP_HEALTH' value='4'/>
      <enumerator name='ZPOOL_PROP_GUID' value='5'/>
      <enumerator name='ZPOOL_PROP_VERSION' value='6'/>
      <enumerator name='ZPOOL_PROP_BOOTFS' value='7'/>
      <enumerator name='ZPOOL_PROP_DELEGATION' value='8'/>
      <enumerator name='ZPOOL_PROP_AUTOREPLACE' value='9'/>
      <enumerator name='ZPOOL_PROP_CACHEFILE' value='10'/>
      <enumerator name='ZPOOL_PROP_FAILUREMODE' value='11'/>
      <enumerator name='ZPOOL_PROP_LISTSNAPS' value='12'/>
      <enumerator name='ZPOOL_PROP_AUTOEXPAND' value='13'/>
      <enumerator name='ZPOOL_PROP_DEDUPDITTO' value='14'/>
      <enumerator name='ZPOOL_PROP_DEDUPRATIO' value='15'/>
      <enumerator name='ZPOOL_PROP_FREE' value='16'/>
      <enumerator name='ZPOOL_PROP_ALLOCATED' value='17'/>
      <enumerator name='ZPOOL_PROP_READONLY' value='18'/>
      <enumerator name='ZPOOL_PROP_ASHIFT' value='19'/>
      <enumerator name='ZPOOL_PROP_COMMENT' value='20'/>
      <enumerator name='ZPOOL_PROP_EXPANDSZ' value='21'/>
      <enumerator name='ZPOOL_PROP_FREEING' value='22'/>
      <enumerator name='ZPOOL_PROP_FRAGMENTATION' value='23'/>
      <enumerator name='ZPOOL_PROP_LEAKED' value='24'/>
      <enumerator name='ZPOOL_PROP_MAXBLOCKSIZE' value='25'/>
      <enumerator name='ZPOOL_PROP_TNAME' value='26'/>
      <enumerator name='ZPOOL_PROP_MAXDNODESIZE' value='27'/>
      <enumerator name='ZPOOL_PROP_MULTIHOST' value='28'/>
      <enumerator name='ZPOOL_PROP_CHECKPOINT' value='29'/>
      <enumerator name='ZPOOL_PROP_LOAD_GUID' value='30'/>
      <enumerator name='ZPOOL_PROP_AUTOTRIM' value='31'/>
      <enumerator name='ZPOOL_NUM_PROPS' value='32'/>
    </enum-decl>
    <typedef-decl name='zpool_prop_t' type-id='type-id-317' filepath='../../include/sys/fs/zfs.h' line='250' column='1' id='type-id-169'/>
    <typedef-decl name='uint_t' type-id='type-id-196' filepath='../../lib/libspl/include/sys/stdtypes.h' line='33' column='1' id='type-id-318'/>
    <class-decl name='sigaction' size-in-bits='1216' is-struct='yes' visibility='default' filepath='/usr/include/bits/sigaction.h' line='27' column='1' id='type-id-319'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__sigaction_handler' type-id='type-id-320' visibility='default' filepath='/usr/include/bits/sigaction.h' line='38' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='sa_mask' type-id='type-id-321' visibility='default' filepath='/usr/include/bits/sigaction.h' line='46' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='sa_flags' type-id='type-id-20' visibility='default' filepath='/usr/include/bits/sigaction.h' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='sa_restorer' type-id='type-id-322' visibility='default' filepath='/usr/include/bits/sigaction.h' line='52' column='1'/>
      </data-member>
    </class-decl>
    <union-decl name='__anonymous_union__' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='/usr/include/bits/sigaction.h' line='31' column='1' id='type-id-320'>
      <data-member access='public'>
        <var-decl name='sa_handler' type-id='type-id-323' visibility='default' filepath='/usr/include/bits/sigaction.h' line='34' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='sa_sigaction' type-id='type-id-324' visibility='default' filepath='/usr/include/bits/sigaction.h' line='36' column='1'/>
      </data-member>
    </union-decl>
    <class-decl name='termios' size-in-bits='480' is-struct='yes' visibility='default' filepath='/usr/include/bits/termios-struct.h' line='24' column='1' id='type-id-325'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='c_iflag' type-id='type-id-326' visibility='default' filepath='/usr/include/bits/termios-struct.h' line='26' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='c_oflag' type-id='type-id-326' visibility='default' filepath='/usr/include/bits/termios-struct.h' line='27' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='c_cflag' type-id='type-id-326' visibility='default' filepath='/usr/include/bits/termios-struct.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='c_lflag' type-id='type-id-326' visibility='default' filepath='/usr/include/bits/termios-struct.h' line='29' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='c_line' type-id='type-id-312' visibility='default' filepath='/usr/include/bits/termios-struct.h' line='30' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='136'>
        <var-decl name='c_cc' type-id='type-id-313' visibility='default' filepath='/usr/include/bits/termios-struct.h' line='31' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='c_ispeed' type-id='type-id-327' visibility='default' filepath='/usr/include/bits/termios-struct.h' line='32' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='c_ospeed' type-id='type-id-327' visibility='default' filepath='/usr/include/bits/termios-struct.h' line='33' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='cc_t' type-id='type-id-47' filepath='/usr/include/bits/termios.h' line='23' column='1' id='type-id-312'/>
    <typedef-decl name='speed_t' type-id='type-id-196' filepath='/usr/include/bits/termios.h' line='24' column='1' id='type-id-327'/>
    <typedef-decl name='tcflag_t' type-id='type-id-196' filepath='/usr/include/bits/termios.h' line='25' column='1' id='type-id-326'/>
    <typedef-decl name='__uid_t' type-id='type-id-196' filepath='/usr/include/bits/types.h' line='146' column='1' id='type-id-328'/>
    <typedef-decl name='__pid_t' type-id='type-id-20' filepath='/usr/include/bits/types.h' line='154' column='1' id='type-id-329'/>
    <typedef-decl name='__clock_t' type-id='type-id-189' filepath='/usr/include/bits/types.h' line='156' column='1' id='type-id-330'/>
    <typedef-decl name='__ssize_t' type-id='type-id-189' filepath='/usr/include/bits/types.h' line='194' column='1' id='type-id-331'/>
    <class-decl name='__sigset_t' size-in-bits='1024' is-struct='yes' naming-typedef-id='type-id-321' visibility='default' filepath='/usr/include/bits/types/__sigset_t.h' line='5' column='1' id='type-id-332'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__val' type-id='type-id-316' visibility='default' filepath='/usr/include/bits/types/__sigset_t.h' line='7' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__sigset_t' type-id='type-id-332' filepath='/usr/include/bits/types/__sigset_t.h' line='8' column='1' id='type-id-321'/>
    <union-decl name='sigval' size-in-bits='64' visibility='default' filepath='/usr/include/bits/types/__sigval_t.h' line='24' column='1' id='type-id-333'>
      <data-member access='public'>
        <var-decl name='sival_int' type-id='type-id-20' visibility='default' filepath='/usr/include/bits/types/__sigval_t.h' line='26' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='sival_ptr' type-id='type-id-80' visibility='default' filepath='/usr/include/bits/types/__sigval_t.h' line='27' column='1'/>
      </data-member>
    </union-decl>
    <typedef-decl name='__sigval_t' type-id='type-id-333' filepath='/usr/include/bits/types/__sigval_t.h' line='30' column='1' id='type-id-334'/>
    <class-decl name='siginfo_t' size-in-bits='1024' is-struct='yes' naming-typedef-id='type-id-335' visibility='default' filepath='/usr/include/bits/types/siginfo_t.h' line='36' column='1' id='type-id-336'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='si_signo' type-id='type-id-20' visibility='default' filepath='/usr/include/bits/types/siginfo_t.h' line='38' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='si_errno' type-id='type-id-20' visibility='default' filepath='/usr/include/bits/types/siginfo_t.h' line='40' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='si_code' type-id='type-id-20' visibility='default' filepath='/usr/include/bits/types/siginfo_t.h' line='42' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='__pad0' type-id='type-id-20' visibility='default' filepath='/usr/include/bits/types/siginfo_t.h' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_sifields' type-id='type-id-337' visibility='default' filepath='/usr/include/bits/types/siginfo_t.h' line='123' column='1'/>
      </data-member>
    </class-decl>
    <union-decl name='__anonymous_union__1' size-in-bits='896' is-anonymous='yes' visibility='default' filepath='/usr/include/bits/types/siginfo_t.h' line='51' column='1' id='type-id-337'>
      <data-member access='public'>
        <var-decl name='_pad' type-id='type-id-314' visibility='default' filepath='/usr/include/bits/types/siginfo_t.h' line='53' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='_kill' type-id='type-id-338' visibility='default' filepath='/usr/include/bits/types/siginfo_t.h' line='60' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='_timer' type-id='type-id-339' visibility='default' filepath='/usr/include/bits/types/siginfo_t.h' line='68' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='_rt' type-id='type-id-340' visibility='default' filepath='/usr/include/bits/types/siginfo_t.h' line='76' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='_sigchld' type-id='type-id-341' visibility='default' filepath='/usr/include/bits/types/siginfo_t.h' line='86' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='_sigfault' type-id='type-id-342' visibility='default' filepath='/usr/include/bits/types/siginfo_t.h' line='105' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='_sigpoll' type-id='type-id-343' visibility='default' filepath='/usr/include/bits/types/siginfo_t.h' line='112' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='_sigsys' type-id='type-id-344' visibility='default' filepath='/usr/include/bits/types/siginfo_t.h' line='121' column='1'/>
      </data-member>
    </union-decl>
    <class-decl name='__anonymous_struct__1' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/bits/types/siginfo_t.h' line='56' column='1' id='type-id-338'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='si_pid' type-id='type-id-329' visibility='default' filepath='/usr/include/bits/types/siginfo_t.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='si_uid' type-id='type-id-328' visibility='default' filepath='/usr/include/bits/types/siginfo_t.h' line='59' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__2' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/bits/types/siginfo_t.h' line='63' column='1' id='type-id-339'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='si_tid' type-id='type-id-20' visibility='default' filepath='/usr/include/bits/types/siginfo_t.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='si_overrun' type-id='type-id-20' visibility='default' filepath='/usr/include/bits/types/siginfo_t.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='si_sigval' type-id='type-id-334' visibility='default' filepath='/usr/include/bits/types/siginfo_t.h' line='67' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__3' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/bits/types/siginfo_t.h' line='71' column='1' id='type-id-340'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='si_pid' type-id='type-id-329' visibility='default' filepath='/usr/include/bits/types/siginfo_t.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='si_uid' type-id='type-id-328' visibility='default' filepath='/usr/include/bits/types/siginfo_t.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='si_sigval' type-id='type-id-334' visibility='default' filepath='/usr/include/bits/types/siginfo_t.h' line='75' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__4' size-in-bits='256' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/bits/types/siginfo_t.h' line='79' column='1' id='type-id-341'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='si_pid' type-id='type-id-329' visibility='default' filepath='/usr/include/bits/types/siginfo_t.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='si_uid' type-id='type-id-328' visibility='default' filepath='/usr/include/bits/types/siginfo_t.h' line='82' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='si_status' type-id='type-id-20' visibility='default' filepath='/usr/include/bits/types/siginfo_t.h' line='83' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='si_utime' type-id='type-id-330' visibility='default' filepath='/usr/include/bits/types/siginfo_t.h' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='si_stime' type-id='type-id-330' visibility='default' filepath='/usr/include/bits/types/siginfo_t.h' line='85' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__5' size-in-bits='256' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/bits/types/siginfo_t.h' line='89' column='1' id='type-id-342'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='si_addr' type-id='type-id-80' visibility='default' filepath='/usr/include/bits/types/siginfo_t.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='si_addr_lsb' type-id='type-id-191' visibility='default' filepath='/usr/include/bits/types/siginfo_t.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_bounds' type-id='type-id-345' visibility='default' filepath='/usr/include/bits/types/siginfo_t.h' line='104' column='1'/>
      </data-member>
    </class-decl>
    <union-decl name='__anonymous_union__2' size-in-bits='128' is-anonymous='yes' visibility='default' filepath='/usr/include/bits/types/siginfo_t.h' line='94' column='1' id='type-id-345'>
      <data-member access='public'>
        <var-decl name='_addr_bnd' type-id='type-id-346' visibility='default' filepath='/usr/include/bits/types/siginfo_t.h' line='101' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='_pkey' type-id='type-id-249' visibility='default' filepath='/usr/include/bits/types/siginfo_t.h' line='103' column='1'/>
      </data-member>
    </union-decl>
    <class-decl name='__anonymous_struct__6' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/bits/types/siginfo_t.h' line='97' column='1' id='type-id-346'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_lower' type-id='type-id-80' visibility='default' filepath='/usr/include/bits/types/siginfo_t.h' line='99' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_upper' type-id='type-id-80' visibility='default' filepath='/usr/include/bits/types/siginfo_t.h' line='100' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__7' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/bits/types/siginfo_t.h' line='108' column='1' id='type-id-343'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='si_band' type-id='type-id-189' visibility='default' filepath='/usr/include/bits/types/siginfo_t.h' line='110' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='si_fd' type-id='type-id-20' visibility='default' filepath='/usr/include/bits/types/siginfo_t.h' line='111' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__8' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/bits/types/siginfo_t.h' line='116' column='1' id='type-id-344'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_call_addr' type-id='type-id-80' visibility='default' filepath='/usr/include/bits/types/siginfo_t.h' line='118' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_syscall' type-id='type-id-20' visibility='default' filepath='/usr/include/bits/types/siginfo_t.h' line='119' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='_arch' type-id='type-id-196' visibility='default' filepath='/usr/include/bits/types/siginfo_t.h' line='120' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='siginfo_t' type-id='type-id-336' filepath='/usr/include/bits/types/siginfo_t.h' line='124' column='1' id='type-id-335'/>
    <typedef-decl name='sigset_t' type-id='type-id-321' filepath='/usr/include/bits/types/sigset_t.h' line='7' column='1' id='type-id-347'/>
    <typedef-decl name='regoff_t' type-id='type-id-20' filepath='/usr/include/regex.h' line='490' column='1' id='type-id-348'/>
    <class-decl name='regmatch_t' size-in-bits='64' is-struct='yes' naming-typedef-id='type-id-349' visibility='default' filepath='/usr/include/regex.h' line='517' column='1' id='type-id-350'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='rm_so' type-id='type-id-348' visibility='default' filepath='/usr/include/regex.h' line='519' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='rm_eo' type-id='type-id-348' visibility='default' filepath='/usr/include/regex.h' line='520' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='regmatch_t' type-id='type-id-350' filepath='/usr/include/regex.h' line='521' column='1' id='type-id-349'/>
    <typedef-decl name='__sighandler_t' type-id='type-id-351' filepath='/usr/include/signal.h' line='72' column='1' id='type-id-323'/>
    <typedef-decl name='ssize_t' type-id='type-id-331' filepath='/usr/include/stdio.h' line='77' column='1' id='type-id-352'/>
    <qualified-type-def type-id='type-id-213' restrict='yes' id='type-id-33'/>
    <qualified-type-def type-id='type-id-268' restrict='yes' id='type-id-353'/>
    <qualified-type-def type-id='type-id-18' restrict='yes' id='type-id-32'/>
    <qualified-type-def type-id='type-id-219' const='yes' id='type-id-354'/>
    <pointer-type-def type-id='type-id-354' size-in-bits='64' id='type-id-355'/>
    <qualified-type-def type-id='type-id-355' restrict='yes' id='type-id-356'/>
    <qualified-type-def type-id='type-id-319' const='yes' id='type-id-357'/>
    <pointer-type-def type-id='type-id-357' size-in-bits='64' id='type-id-358'/>
    <qualified-type-def type-id='type-id-358' restrict='yes' id='type-id-359'/>
    <qualified-type-def type-id='type-id-325' const='yes' id='type-id-360'/>
    <pointer-type-def type-id='type-id-360' size-in-bits='64' id='type-id-361'/>
    <qualified-type-def type-id='type-id-47' const='yes' id='type-id-362'/>
    <pointer-type-def type-id='type-id-362' size-in-bits='64' id='type-id-363'/>
    <qualified-type-def type-id='type-id-46' const='yes' id='type-id-364'/>
    <pointer-type-def type-id='type-id-364' size-in-bits='64' id='type-id-365'/>
    <pointer-type-def type-id='type-id-365' size-in-bits='64' id='type-id-366'/>
    <pointer-type-def type-id='type-id-349' size-in-bits='64' id='type-id-367'/>
    <qualified-type-def type-id='type-id-367' restrict='yes' id='type-id-368'/>
    <pointer-type-def type-id='type-id-319' size-in-bits='64' id='type-id-369'/>
    <qualified-type-def type-id='type-id-369' restrict='yes' id='type-id-370'/>
    <pointer-type-def type-id='type-id-335' size-in-bits='64' id='type-id-371'/>
    <pointer-type-def type-id='type-id-347' size-in-bits='64' id='type-id-372'/>
    <pointer-type-def type-id='type-id-81' size-in-bits='64' id='type-id-373'/>
    <qualified-type-def type-id='type-id-373' restrict='yes' id='type-id-374'/>
    <pointer-type-def type-id='type-id-325' size-in-bits='64' id='type-id-375'/>
    <pointer-type-def type-id='type-id-60' size-in-bits='64' id='type-id-168'/>
    <pointer-type-def type-id='type-id-222' size-in-bits='64' id='type-id-376'/>
    <pointer-type-def type-id='type-id-318' size-in-bits='64' id='type-id-377'/>
    <pointer-type-def type-id='type-id-378' size-in-bits='64' id='type-id-322'/>
    <pointer-type-def type-id='type-id-379' size-in-bits='64' id='type-id-351'/>
    <pointer-type-def type-id='type-id-380' size-in-bits='64' id='type-id-324'/>
    <qualified-type-def type-id='type-id-80' restrict='yes' id='type-id-381'/>
    <function-decl name='zpool_get_prop_int' mangled-name='zpool_get_prop_int' filepath='../../include/libzfs.h' line='328' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_get_prop_int'>
      <parameter type-id='type-id-214'/>
      <parameter type-id='type-id-169'/>
      <parameter type-id='type-id-281'/>
      <return type-id='type-id-60'/>
    </function-decl>
    <function-decl name='zfs_handle_dup' mangled-name='zfs_handle_dup' filepath='../../include/libzfs.h' line='464' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_handle_dup'>
      <parameter type-id='type-id-279'/>
      <return type-id='type-id-279'/>
    </function-decl>
    <function-decl name='zfs_valid_proplist' mangled-name='zfs_valid_proplist' filepath='../../include/libzfs.h' line='484' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_valid_proplist'>
      <parameter type-id='type-id-220'/>
      <parameter type-id='type-id-167'/>
      <parameter type-id='type-id-98'/>
      <parameter type-id='type-id-60'/>
      <parameter type-id='type-id-279'/>
      <parameter type-id='type-id-214'/>
      <parameter type-id='type-id-31'/>
      <parameter type-id='type-id-18'/>
      <return type-id='type-id-98'/>
    </function-decl>
    <function-decl name='zfs_prop_to_name' mangled-name='zfs_prop_to_name' filepath='../../include/libzfs.h' line='487' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_to_name'>
      <parameter type-id='type-id-109'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='zfs_iter_filesystems' mangled-name='zfs_iter_filesystems' filepath='../../include/libzfs.h' line='612' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_iter_filesystems'>
      <parameter type-id='type-id-279'/>
      <parameter type-id='type-id-212'/>
      <parameter type-id='type-id-80'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='zfs_parent_name' mangled-name='zfs_parent_name' filepath='../../include/libzfs.h' line='807' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_parent_name'>
      <parameter type-id='type-id-279'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-81'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='lzc_load_key' filepath='../../include/libzfs_core.h' line='62' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-31'/>
      <parameter type-id='type-id-222'/>
      <parameter type-id='type-id-318'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='lzc_unload_key' filepath='../../include/libzfs_core.h' line='63' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-18'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='lzc_change_key' filepath='../../include/libzfs_core.h' line='64' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-60'/>
      <parameter type-id='type-id-98'/>
      <parameter type-id='type-id-222'/>
      <parameter type-id='type-id-318'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='zfs_error_aux' mangled-name='zfs_error_aux' filepath='../../include/libzfs_impl.h' line='138' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_error_aux'>
      <parameter type-id='type-id-220'/>
      <parameter type-id='type-id-18'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='zfs_name_to_prop' mangled-name='zfs_name_to_prop' filepath='../../include/sys/fs/zfs.h' line='312' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_name_to_prop'>
      <parameter type-id='type-id-18'/>
      <return type-id='type-id-109'/>
    </function-decl>
    <function-decl name='nvlist_add_uint64' filepath='../../include/sys/nvpair.h' line='178' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-98'/>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-60'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='nvlist_add_string' filepath='../../include/sys/nvpair.h' line='179' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-98'/>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-18'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='nvlist_lookup_uint64' filepath='../../include/sys/nvpair.h' line='212' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-98'/>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-168'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='nvlist_lookup_string' filepath='../../include/sys/nvpair.h' line='213' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-98'/>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-268'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='fnvlist_alloc' filepath='../../include/sys/nvpair.h' line='276' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-98'/>
    </function-decl>
    <function-decl name='zfs_crypto_get_encryption_root' mangled-name='zfs_crypto_get_encryption_root' filepath='/home/hutter2/release20/lib/libzfs/libzfs_crypto.c' line='785' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_crypto_get_encryption_root'>
      <parameter type-id='type-id-279' name='zhp' filepath='/home/hutter2/release20/lib/libzfs/libzfs_crypto.c' line='785' column='1'/>
      <parameter type-id='type-id-304' name='is_encroot' filepath='/home/hutter2/release20/lib/libzfs/libzfs_crypto.c' line='785' column='1'/>
      <parameter type-id='type-id-2' name='buf' filepath='/home/hutter2/release20/lib/libzfs/libzfs_crypto.c' line='786' column='1'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='zfs_crypto_create' mangled-name='zfs_crypto_create' filepath='/home/hutter2/release20/lib/libzfs/libzfs_crypto.c' line='816' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_crypto_create'>
      <parameter type-id='type-id-220' name='hdl' filepath='/home/hutter2/release20/lib/libzfs/libzfs_crypto.c' line='816' column='1'/>
      <parameter type-id='type-id-2' name='parent_name' filepath='/home/hutter2/release20/lib/libzfs/libzfs_crypto.c' line='816' column='1'/>
      <parameter type-id='type-id-98' name='props' filepath='/home/hutter2/release20/lib/libzfs/libzfs_crypto.c' line='816' column='1'/>
      <parameter type-id='type-id-98' name='pool_props' filepath='/home/hutter2/release20/lib/libzfs/libzfs_crypto.c' line='817' column='1'/>
      <parameter type-id='type-id-31' name='stdin_available' filepath='/home/hutter2/release20/lib/libzfs/libzfs_crypto.c' line='817' column='1'/>
      <parameter type-id='type-id-376' name='wkeydata_out' filepath='/home/hutter2/release20/lib/libzfs/libzfs_crypto.c' line='817' column='1'/>
      <parameter type-id='type-id-377' name='wkeylen_out' filepath='/home/hutter2/release20/lib/libzfs/libzfs_crypto.c' line='818' column='1'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='zfs_crypto_clone_check' mangled-name='zfs_crypto_clone_check' filepath='/home/hutter2/release20/lib/libzfs/libzfs_crypto.c' line='988' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_crypto_clone_check'>
      <parameter type-id='type-id-220' name='hdl' filepath='/home/hutter2/release20/lib/libzfs/libzfs_crypto.c' line='988' column='1'/>
      <parameter type-id='type-id-279' name='origin_zhp' filepath='/home/hutter2/release20/lib/libzfs/libzfs_crypto.c' line='988' column='1'/>
      <parameter type-id='type-id-2' name='parent_name' filepath='/home/hutter2/release20/lib/libzfs/libzfs_crypto.c' line='989' column='1'/>
      <parameter type-id='type-id-98' name='props' filepath='/home/hutter2/release20/lib/libzfs/libzfs_crypto.c' line='989' column='1'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='zfs_crypto_attempt_load_keys' mangled-name='zfs_crypto_attempt_load_keys' filepath='/home/hutter2/release20/lib/libzfs/libzfs_crypto.c' line='1054' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_crypto_attempt_load_keys'>
      <parameter type-id='type-id-220' name='hdl' filepath='/home/hutter2/release20/lib/libzfs/libzfs_crypto.c' line='1054' column='1'/>
      <parameter type-id='type-id-2' name='fsname' filepath='/home/hutter2/release20/lib/libzfs/libzfs_crypto.c' line='1054' column='1'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='zfs_crypto_load_key' mangled-name='zfs_crypto_load_key' filepath='/home/hutter2/release20/lib/libzfs/libzfs_crypto.c' line='1089' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_crypto_load_key'>
      <parameter type-id='type-id-279' name='zhp' filepath='/home/hutter2/release20/lib/libzfs/libzfs_crypto.c' line='1089' column='1'/>
      <parameter type-id='type-id-31' name='noop' filepath='/home/hutter2/release20/lib/libzfs/libzfs_crypto.c' line='1089' column='1'/>
      <parameter type-id='type-id-2' name='alt_keylocation' filepath='/home/hutter2/release20/lib/libzfs/libzfs_crypto.c' line='1089' column='1'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='zfs_crypto_unload_key' mangled-name='zfs_crypto_unload_key' filepath='/home/hutter2/release20/lib/libzfs/libzfs_crypto.c' line='1257' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_crypto_unload_key'>
      <parameter type-id='type-id-279' name='zhp' filepath='/home/hutter2/release20/lib/libzfs/libzfs_crypto.c' line='1257' column='1'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='zfs_crypto_rewrap' mangled-name='zfs_crypto_rewrap' filepath='/home/hutter2/release20/lib/libzfs/libzfs_crypto.c' line='1393' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_crypto_rewrap'>
      <parameter type-id='type-id-279' name='zhp' filepath='/home/hutter2/release20/lib/libzfs/libzfs_crypto.c' line='1393' column='1'/>
      <parameter type-id='type-id-98' name='raw_props' filepath='/home/hutter2/release20/lib/libzfs/libzfs_crypto.c' line='1393' column='1'/>
      <parameter type-id='type-id-31' name='inheritkey' filepath='/home/hutter2/release20/lib/libzfs/libzfs_crypto.c' line='1393' column='1'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='__ctype_b_loc' filepath='/usr/include/ctype.h' line='79' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-366'/>
    </function-decl>
    <function-decl name='PKCS5_PBKDF2_HMAC_SHA1' filepath='/usr/include/openssl/evp.h' line='1087' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-20'/>
      <parameter type-id='type-id-363'/>
      <parameter type-id='type-id-20'/>
      <parameter type-id='type-id-20'/>
      <parameter type-id='type-id-20'/>
      <parameter type-id='type-id-267'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='regexec' filepath='/usr/include/regex.h' line='643' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-356'/>
      <parameter type-id='type-id-32'/>
      <parameter type-id='type-id-81'/>
      <parameter type-id='type-id-368'/>
      <parameter type-id='type-id-20'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='kill' filepath='/usr/include/signal.h' line='112' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-329'/>
      <parameter type-id='type-id-20'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='sigemptyset' filepath='/usr/include/signal.h' line='199' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-372'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='sigaction' filepath='/usr/include/signal.h' line='243' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-20'/>
      <parameter type-id='type-id-359'/>
      <parameter type-id='type-id-370'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='fclose' filepath='/usr/include/stdio.h' line='213' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-213'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='fflush' filepath='/usr/include/stdio.h' line='218' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-213'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='printf' filepath='/usr/include/stdio.h' line='332' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-18'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='snprintf' filepath='/usr/include/stdio.h' line='354' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-81'/>
      <parameter type-id='type-id-18'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='fputc' filepath='/usr/include/stdio.h' line='525' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-20'/>
      <parameter type-id='type-id-213'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='__getdelim' filepath='/usr/include/stdio.h' line='608' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-353'/>
      <parameter type-id='type-id-374'/>
      <parameter type-id='type-id-20'/>
      <parameter type-id='type-id-33'/>
      <return type-id='type-id-331'/>
    </function-decl>
    <function-decl name='fread' filepath='/usr/include/stdio.h' line='651' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-381'/>
      <parameter type-id='type-id-81'/>
      <parameter type-id='type-id-81'/>
      <parameter type-id='type-id-33'/>
      <return type-id='type-id-81'/>
    </function-decl>
    <function-decl name='ferror' filepath='/usr/include/stdio.h' line='766' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-213'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='fileno' filepath='/usr/include/stdio.h' line='785' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-213'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='malloc' filepath='/usr/include/stdlib.h' line='539' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-81'/>
      <return type-id='type-id-80'/>
    </function-decl>
    <function-decl name='calloc' filepath='/usr/include/stdlib.h' line='542' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-81'/>
      <parameter type-id='type-id-81'/>
      <return type-id='type-id-80'/>
    </function-decl>
    <function-decl name='memcpy' filepath='/usr/include/string.h' line='43' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-80'/>
      <parameter type-id='type-id-80'/>
      <parameter type-id='type-id-81'/>
      <return type-id='type-id-80'/>
    </function-decl>
    <function-decl name='tcgetattr' filepath='/usr/include/termios.h' line='66' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-20'/>
      <parameter type-id='type-id-375'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='tcsetattr' filepath='/usr/include/termios.h' line='70' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-20'/>
      <parameter type-id='type-id-20'/>
      <parameter type-id='type-id-361'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='close' filepath='/usr/include/unistd.h' line='353' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-20'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='read' filepath='/usr/include/unistd.h' line='360' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-20'/>
      <parameter type-id='type-id-80'/>
      <parameter type-id='type-id-81'/>
      <return type-id='type-id-352'/>
    </function-decl>
    <function-decl name='getpid' filepath='/usr/include/unistd.h' line='640' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-329'/>
    </function-decl>
    <function-decl name='isatty' filepath='/usr/include/unistd.h' line='791' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-20'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-378'>
      <return type-id='type-id-30'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-379'>
      <parameter type-id='type-id-20'/>
      <return type-id='type-id-30'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-380'>
      <parameter type-id='type-id-20'/>
      <parameter type-id='type-id-371'/>
      <parameter type-id='type-id-80'/>
      <return type-id='type-id-30'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='libzfs_dataset.c' comp-dir-path='/home/hutter2/release20/lib/libzfs' language='LANG_C99'>
    <array-type-def dimensions='1' type-id='type-id-35' size-in-bits='32' id='type-id-382'>
      <subrange length='4' type-id='type-id-37' id='type-id-112'/>
    </array-type-def>
    <class-decl name='zprop_list' size-in-bits='448' is-struct='yes' visibility='default' filepath='../../include/libzfs.h' line='532' column='1' id='type-id-383'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='pl_prop' type-id='type-id-20' visibility='default' filepath='../../include/libzfs.h' line='533' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='pl_user_prop' type-id='type-id-2' visibility='default' filepath='../../include/libzfs.h' line='534' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='pl_next' type-id='type-id-384' visibility='default' filepath='../../include/libzfs.h' line='535' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='pl_all' type-id='type-id-31' visibility='default' filepath='../../include/libzfs.h' line='536' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='pl_width' type-id='type-id-81' visibility='default' filepath='../../include/libzfs.h' line='537' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='pl_recvd_width' type-id='type-id-81' visibility='default' filepath='../../include/libzfs.h' line='538' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='pl_fixed' type-id='type-id-31' visibility='default' filepath='../../include/libzfs.h' line='539' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='zprop_list_t' type-id='type-id-383' filepath='../../include/libzfs.h' line='540' column='1' id='type-id-385'/>
    <class-decl name='renameflags' size-in-bits='32' is-struct='yes' visibility='default' filepath='../../include/libzfs.h' line='646' column='1' id='type-id-386'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='recursive' type-id='type-id-20' visibility='default' filepath='../../include/libzfs.h' line='648' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='nounmount' type-id='type-id-20' visibility='default' filepath='../../include/libzfs.h' line='651' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='forceunmount' type-id='type-id-20' visibility='default' filepath='../../include/libzfs.h' line='654' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='renameflags_t' type-id='type-id-386' filepath='../../include/libzfs.h' line='655' column='1' id='type-id-387'/>
    <typedef-decl name='zfs_userspace_cb_t' type-id='type-id-388' filepath='../../include/libzfs.h' line='731' column='1' id='type-id-389'/>
    <enum-decl name='lzc_dataset_type' filepath='../../include/libzfs_core.h' line='47' column='1' id='type-id-390'>
      <underlying-type type-id='type-id-86'/>
      <enumerator name='LZC_DATSET_TYPE_ZFS' value='2'/>
      <enumerator name='LZC_DATSET_TYPE_ZVOL' value='3'/>
    </enum-decl>
    <typedef-decl name='avl_index_t' type-id='type-id-193' filepath='../../include/sys/avl.h' line='130' column='1' id='type-id-391'/>
    <enum-decl name='zfs_userquota_prop_t' naming-typedef-id='type-id-392' filepath='../../include/sys/fs/zfs.h' line='192' column='1' id='type-id-393'>
      <underlying-type type-id='type-id-86'/>
      <enumerator name='ZFS_PROP_USERUSED' value='0'/>
      <enumerator name='ZFS_PROP_USERQUOTA' value='1'/>
      <enumerator name='ZFS_PROP_GROUPUSED' value='2'/>
      <enumerator name='ZFS_PROP_GROUPQUOTA' value='3'/>
      <enumerator name='ZFS_PROP_USEROBJUSED' value='4'/>
      <enumerator name='ZFS_PROP_USEROBJQUOTA' value='5'/>
      <enumerator name='ZFS_PROP_GROUPOBJUSED' value='6'/>
      <enumerator name='ZFS_PROP_GROUPOBJQUOTA' value='7'/>
      <enumerator name='ZFS_PROP_PROJECTUSED' value='8'/>
      <enumerator name='ZFS_PROP_PROJECTQUOTA' value='9'/>
      <enumerator name='ZFS_PROP_PROJECTOBJUSED' value='10'/>
      <enumerator name='ZFS_PROP_PROJECTOBJQUOTA' value='11'/>
      <enumerator name='ZFS_NUM_USERQUOTA_PROPS' value='12'/>
    </enum-decl>
    <typedef-decl name='zfs_userquota_prop_t' type-id='type-id-393' filepath='../../include/sys/fs/zfs.h' line='206' column='1' id='type-id-392'/>
    <enum-decl name='zfs_wait_activity_t' naming-typedef-id='type-id-394' filepath='../../include/sys/fs/zfs.h' line='1410' column='1' id='type-id-395'>
      <underlying-type type-id='type-id-86'/>
      <enumerator name='ZFS_WAIT_DELETEQ' value='0'/>
      <enumerator name='ZFS_WAIT_NUM_ACTIVITIES' value='1'/>
    </enum-decl>
    <typedef-decl name='zfs_wait_activity_t' type-id='type-id-395' filepath='../../include/sys/fs/zfs.h' line='1413' column='1' id='type-id-394'/>
    <enum-decl name='namecheck_err_t' naming-typedef-id='type-id-396' filepath='../../include/zfs_namecheck.h' line='36' column='1' id='type-id-397'>
      <underlying-type type-id='type-id-86'/>
      <enumerator name='NAME_ERR_LEADING_SLASH' value='0'/>
      <enumerator name='NAME_ERR_EMPTY_COMPONENT' value='1'/>
      <enumerator name='NAME_ERR_TRAILING_SLASH' value='2'/>
      <enumerator name='NAME_ERR_INVALCHAR' value='3'/>
      <enumerator name='NAME_ERR_MULTIPLE_DELIMITERS' value='4'/>
      <enumerator name='NAME_ERR_NOLETTER' value='5'/>
      <enumerator name='NAME_ERR_RESERVED' value='6'/>
      <enumerator name='NAME_ERR_DISKLIKE' value='7'/>
      <enumerator name='NAME_ERR_TOOLONG' value='8'/>
      <enumerator name='NAME_ERR_SELF_REF' value='9'/>
      <enumerator name='NAME_ERR_PARENT_REF' value='10'/>
      <enumerator name='NAME_ERR_NO_AT' value='11'/>
      <enumerator name='NAME_ERR_NO_POUND' value='12'/>
    </enum-decl>
    <typedef-decl name='namecheck_err_t' type-id='type-id-397' filepath='../../include/zfs_namecheck.h' line='50' column='1' id='type-id-396'/>
    <enum-decl name='zprop_type_t' naming-typedef-id='type-id-163' filepath='../../include/zfs_prop.h' line='40' column='1' id='type-id-398'>
      <underlying-type type-id='type-id-86'/>
      <enumerator name='PROP_TYPE_NUMBER' value='0'/>
      <enumerator name='PROP_TYPE_STRING' value='1'/>
      <enumerator name='PROP_TYPE_INDEX' value='2'/>
    </enum-decl>
    <typedef-decl name='zprop_type_t' type-id='type-id-398' filepath='../../include/zfs_prop.h' line='44' column='1' id='type-id-163'/>
    <class-decl name='mnttab' size-in-bits='256' is-struct='yes' visibility='default' filepath='../../lib/libspl/include/os/linux/sys/mnttab.h' line='49' column='1' id='type-id-399'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mnt_special' type-id='type-id-2' visibility='default' filepath='../../lib/libspl/include/os/linux/sys/mnttab.h' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='mnt_mountp' type-id='type-id-2' visibility='default' filepath='../../lib/libspl/include/os/linux/sys/mnttab.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='mnt_fstype' type-id='type-id-2' visibility='default' filepath='../../lib/libspl/include/os/linux/sys/mnttab.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='mnt_mntopts' type-id='type-id-2' visibility='default' filepath='../../lib/libspl/include/os/linux/sys/mnttab.h' line='53' column='1'/>
      </data-member>
    </class-decl>
    <union-decl name='pthread_mutexattr_t' size-in-bits='32' naming-typedef-id='type-id-400' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='32' column='1' id='type-id-401'>
      <data-member access='public'>
        <var-decl name='__size' type-id='type-id-382' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='34' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__align' type-id='type-id-20' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='35' column='1'/>
      </data-member>
    </union-decl>
    <typedef-decl name='pthread_mutexattr_t' type-id='type-id-401' filepath='/usr/include/bits/pthreadtypes.h' line='36' column='1' id='type-id-400'/>
    <typedef-decl name='int64_t' type-id='type-id-402' filepath='/usr/include/bits/stdint-intn.h' line='27' column='1' id='type-id-403'/>
    <typedef-decl name='__int64_t' type-id='type-id-189' filepath='/usr/include/bits/types.h' line='44' column='1' id='type-id-402'/>
    <typedef-decl name='__gid_t' type-id='type-id-196' filepath='/usr/include/bits/types.h' line='147' column='1' id='type-id-404'/>
    <typedef-decl name='__time_t' type-id='type-id-189' filepath='/usr/include/bits/types.h' line='160' column='1' id='type-id-405'/>
    <class-decl name='tm' size-in-bits='448' is-struct='yes' visibility='default' filepath='/usr/include/bits/types/struct_tm.h' line='7' column='1' id='type-id-406'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tm_sec' type-id='type-id-20' visibility='default' filepath='/usr/include/bits/types/struct_tm.h' line='9' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='tm_min' type-id='type-id-20' visibility='default' filepath='/usr/include/bits/types/struct_tm.h' line='10' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tm_hour' type-id='type-id-20' visibility='default' filepath='/usr/include/bits/types/struct_tm.h' line='11' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='tm_mday' type-id='type-id-20' visibility='default' filepath='/usr/include/bits/types/struct_tm.h' line='12' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='tm_mon' type-id='type-id-20' visibility='default' filepath='/usr/include/bits/types/struct_tm.h' line='13' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='tm_year' type-id='type-id-20' visibility='default' filepath='/usr/include/bits/types/struct_tm.h' line='14' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='tm_wday' type-id='type-id-20' visibility='default' filepath='/usr/include/bits/types/struct_tm.h' line='15' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='tm_yday' type-id='type-id-20' visibility='default' filepath='/usr/include/bits/types/struct_tm.h' line='16' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='tm_isdst' type-id='type-id-20' visibility='default' filepath='/usr/include/bits/types/struct_tm.h' line='17' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='tm_gmtoff' type-id='type-id-189' visibility='default' filepath='/usr/include/bits/types/struct_tm.h' line='20' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='tm_zone' type-id='type-id-18' visibility='default' filepath='/usr/include/bits/types/struct_tm.h' line='21' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='time_t' type-id='type-id-405' filepath='/usr/include/bits/types/time_t.h' line='7' column='1' id='type-id-407'/>
    <class-decl name='group' size-in-bits='256' is-struct='yes' visibility='default' filepath='/usr/include/grp.h' line='42' column='1' id='type-id-408'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='gr_name' type-id='type-id-2' visibility='default' filepath='/usr/include/grp.h' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='gr_passwd' type-id='type-id-2' visibility='default' filepath='/usr/include/grp.h' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='gr_gid' type-id='type-id-404' visibility='default' filepath='/usr/include/grp.h' line='46' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='gr_mem' type-id='type-id-268' visibility='default' filepath='/usr/include/grp.h' line='47' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='mntent' size-in-bits='320' is-struct='yes' visibility='default' filepath='/usr/include/mntent.h' line='51' column='1' id='type-id-409'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mnt_fsname' type-id='type-id-2' visibility='default' filepath='/usr/include/mntent.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='mnt_dir' type-id='type-id-2' visibility='default' filepath='/usr/include/mntent.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='mnt_type' type-id='type-id-2' visibility='default' filepath='/usr/include/mntent.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='mnt_opts' type-id='type-id-2' visibility='default' filepath='/usr/include/mntent.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='mnt_freq' type-id='type-id-20' visibility='default' filepath='/usr/include/mntent.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='mnt_passno' type-id='type-id-20' visibility='default' filepath='/usr/include/mntent.h' line='58' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='passwd' size-in-bits='384' is-struct='yes' visibility='default' filepath='/usr/include/pwd.h' line='49' column='1' id='type-id-410'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='pw_name' type-id='type-id-2' visibility='default' filepath='/usr/include/pwd.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='pw_passwd' type-id='type-id-2' visibility='default' filepath='/usr/include/pwd.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='pw_uid' type-id='type-id-328' visibility='default' filepath='/usr/include/pwd.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='pw_gid' type-id='type-id-404' visibility='default' filepath='/usr/include/pwd.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='pw_gecos' type-id='type-id-2' visibility='default' filepath='/usr/include/pwd.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='pw_dir' type-id='type-id-2' visibility='default' filepath='/usr/include/pwd.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='pw_shell' type-id='type-id-2' visibility='default' filepath='/usr/include/pwd.h' line='58' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='uid_t' type-id='type-id-328' filepath='/usr/include/sys/types.h' line='79' column='1' id='type-id-411'/>
    <pointer-type-def type-id='type-id-391' size-in-bits='64' id='type-id-412'/>
    <pointer-type-def type-id='type-id-218' size-in-bits='64' id='type-id-413'/>
    <qualified-type-def type-id='type-id-2' restrict='yes' id='type-id-52'/>
    <pointer-type-def type-id='type-id-18' size-in-bits='64' id='type-id-166'/>
    <qualified-type-def type-id='type-id-409' const='yes' id='type-id-414'/>
    <pointer-type-def type-id='type-id-414' size-in-bits='64' id='type-id-415'/>
    <qualified-type-def type-id='type-id-400' const='yes' id='type-id-416'/>
    <pointer-type-def type-id='type-id-416' size-in-bits='64' id='type-id-417'/>
    <qualified-type-def type-id='type-id-407' const='yes' id='type-id-418'/>
    <pointer-type-def type-id='type-id-418' size-in-bits='64' id='type-id-419'/>
    <qualified-type-def type-id='type-id-419' restrict='yes' id='type-id-420'/>
    <qualified-type-def type-id='type-id-406' const='yes' id='type-id-421'/>
    <pointer-type-def type-id='type-id-421' size-in-bits='64' id='type-id-422'/>
    <qualified-type-def type-id='type-id-422' restrict='yes' id='type-id-423'/>
    <pointer-type-def type-id='type-id-408' size-in-bits='64' id='type-id-424'/>
    <pointer-type-def type-id='type-id-425' size-in-bits='64' id='type-id-388'/>
    <pointer-type-def type-id='type-id-403' size-in-bits='64' id='type-id-426'/>
    <pointer-type-def type-id='type-id-399' size-in-bits='64' id='type-id-427'/>
    <pointer-type-def type-id='type-id-396' size-in-bits='64' id='type-id-108'/>
    <pointer-type-def type-id='type-id-307' size-in-bits='64' id='type-id-428'/>
    <pointer-type-def type-id='type-id-410' size-in-bits='64' id='type-id-429'/>
    <pointer-type-def type-id='type-id-217' size-in-bits='64' id='type-id-430'/>
    <pointer-type-def type-id='type-id-406' size-in-bits='64' id='type-id-431'/>
    <qualified-type-def type-id='type-id-431' restrict='yes' id='type-id-432'/>
    <pointer-type-def type-id='type-id-168' size-in-bits='64' id='type-id-433'/>
    <pointer-type-def type-id='type-id-383' size-in-bits='64' id='type-id-384'/>
    <pointer-type-def type-id='type-id-385' size-in-bits='64' id='type-id-434'/>
    <pointer-type-def type-id='type-id-434' size-in-bits='64' id='type-id-435'/>
    <function-decl name='zpool_open' mangled-name='zpool_open' filepath='../../include/libzfs.h' line='233' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_open'>
      <parameter type-id='type-id-220'/>
      <parameter type-id='type-id-18'/>
      <return type-id='type-id-214'/>
    </function-decl>
    <function-decl name='zpool_open_canfail' mangled-name='zpool_open_canfail' filepath='../../include/libzfs.h' line='234' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_open_canfail'>
      <parameter type-id='type-id-220'/>
      <parameter type-id='type-id-18'/>
      <return type-id='type-id-214'/>
    </function-decl>
    <function-decl name='zpool_close' mangled-name='zpool_close' filepath='../../include/libzfs.h' line='235' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_close'>
      <parameter type-id='type-id-214'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='zpool_get_name' mangled-name='zpool_get_name' filepath='../../include/libzfs.h' line='236' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_get_name'>
      <parameter type-id='type-id-214'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='zpool_get_prop' mangled-name='zpool_get_prop' filepath='../../include/libzfs.h' line='326' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_get_prop'>
      <parameter type-id='type-id-214'/>
      <parameter type-id='type-id-169'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-81'/>
      <parameter type-id='type-id-281'/>
      <parameter type-id='type-id-31'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='zfs_prop_default_string' mangled-name='zfs_prop_default_string' filepath='../../include/libzfs.h' line='479' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_default_string'>
      <parameter type-id='type-id-109'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='zfs_prop_default_numeric' mangled-name='zfs_prop_default_numeric' filepath='../../include/libzfs.h' line='480' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_default_numeric'>
      <parameter type-id='type-id-109'/>
      <return type-id='type-id-60'/>
    </function-decl>
    <function-decl name='zpool_prop_get_feature' mangled-name='zpool_prop_get_feature' filepath='../../include/libzfs.h' line='560' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_prop_get_feature'>
      <parameter type-id='type-id-214'/>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-81'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='zfs_iter_snapshots' mangled-name='zfs_iter_snapshots' filepath='../../include/libzfs.h' line='613' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_iter_snapshots'>
      <parameter type-id='type-id-279'/>
      <parameter type-id='type-id-31'/>
      <parameter type-id='type-id-212'/>
      <parameter type-id='type-id-80'/>
      <parameter type-id='type-id-60'/>
      <parameter type-id='type-id-60'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='zfs_iter_bookmarks' mangled-name='zfs_iter_bookmarks' filepath='../../include/libzfs.h' line='618' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_iter_bookmarks'>
      <parameter type-id='type-id-279'/>
      <parameter type-id='type-id-212'/>
      <parameter type-id='type-id-80'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='zfs_share' mangled-name='zfs_share' filepath='../../include/libzfs.h' line='834' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_share'>
      <parameter type-id='type-id-279'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='zfs_commit_all_shares' mangled-name='zfs_commit_all_shares' filepath='../../include/libzfs.h' line='856' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_commit_all_shares'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='zfs_nicestrtonum' mangled-name='zfs_nicestrtonum' filepath='../../include/libzfs.h' line='859' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_nicestrtonum'>
      <parameter type-id='type-id-220'/>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-168'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='lzc_snapshot' filepath='../../include/libzfs_core.h' line='52' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-98'/>
      <parameter type-id='type-id-98'/>
      <parameter type-id='type-id-307'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='lzc_create' filepath='../../include/libzfs_core.h' line='53' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-390'/>
      <parameter type-id='type-id-98'/>
      <parameter type-id='type-id-222'/>
      <parameter type-id='type-id-318'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='lzc_clone' filepath='../../include/libzfs_core.h' line='55' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-98'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='lzc_promote' filepath='../../include/libzfs_core.h' line='56' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-20'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='lzc_destroy_snaps' filepath='../../include/libzfs_core.h' line='57' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-98'/>
      <parameter type-id='type-id-31'/>
      <parameter type-id='type-id-307'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='lzc_get_bookmarks' filepath='../../include/libzfs_core.h' line='59' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-98'/>
      <parameter type-id='type-id-307'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='lzc_destroy_bookmarks' filepath='../../include/libzfs_core.h' line='61' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-98'/>
      <parameter type-id='type-id-307'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='lzc_hold' filepath='../../include/libzfs_core.h' line='73' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-98'/>
      <parameter type-id='type-id-20'/>
      <parameter type-id='type-id-307'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='lzc_release' filepath='../../include/libzfs_core.h' line='74' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-98'/>
      <parameter type-id='type-id-307'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='lzc_get_holds' filepath='../../include/libzfs_core.h' line='75' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-307'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='lzc_exists' filepath='../../include/libzfs_core.h' line='115' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-18'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='lzc_rollback_to' filepath='../../include/libzfs_core.h' line='118' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-18'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='lzc_destroy' filepath='../../include/libzfs_core.h' line='121' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-18'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='lzc_channel_program_nosync' filepath='../../include/libzfs_core.h' line='125' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-60'/>
      <parameter type-id='type-id-60'/>
      <parameter type-id='type-id-98'/>
      <parameter type-id='type-id-307'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='lzc_wait_fs' filepath='../../include/libzfs_core.h' line='136' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-394'/>
      <parameter type-id='type-id-304'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='zfs_error_fmt' mangled-name='zfs_error_fmt' filepath='../../include/libzfs_impl.h' line='137' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_error_fmt'>
      <parameter type-id='type-id-220'/>
      <parameter type-id='type-id-20'/>
      <parameter type-id='type-id-18'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='zfs_standard_error_fmt' mangled-name='zfs_standard_error_fmt' filepath='../../include/libzfs_impl.h' line='146' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_standard_error_fmt'>
      <parameter type-id='type-id-220'/>
      <parameter type-id='type-id-20'/>
      <parameter type-id='type-id-18'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='zfs_setprop_error' mangled-name='zfs_setprop_error' filepath='../../include/libzfs_impl.h' line='147' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_setprop_error'>
      <parameter type-id='type-id-220'/>
      <parameter type-id='type-id-109'/>
      <parameter type-id='type-id-20'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='zprop_parse_value' mangled-name='zprop_parse_value' filepath='../../include/libzfs_impl.h' line='154' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zprop_parse_value'>
      <parameter type-id='type-id-220'/>
      <parameter type-id='type-id-97'/>
      <parameter type-id='type-id-20'/>
      <parameter type-id='type-id-167'/>
      <parameter type-id='type-id-98'/>
      <parameter type-id='type-id-268'/>
      <parameter type-id='type-id-168'/>
      <parameter type-id='type-id-18'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='zprop_expand_list' mangled-name='zprop_expand_list' filepath='../../include/libzfs_impl.h' line='156' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zprop_expand_list'>
      <parameter type-id='type-id-220'/>
      <parameter type-id='type-id-435'/>
      <parameter type-id='type-id-167'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='zcmd_write_src_nvlist' mangled-name='zcmd_write_src_nvlist' filepath='../../include/libzfs_impl.h' line='177' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zcmd_write_src_nvlist'>
      <parameter type-id='type-id-220'/>
      <parameter type-id='type-id-310'/>
      <parameter type-id='type-id-98'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='zpool_name_valid' mangled-name='zpool_name_valid' filepath='../../include/libzfs_impl.h' line='202' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_name_valid'>
      <parameter type-id='type-id-220'/>
      <parameter type-id='type-id-31'/>
      <parameter type-id='type-id-18'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='zfs_parse_options' mangled-name='zfs_parse_options' filepath='../../include/libzfs_impl.h' line='209' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_parse_options'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-224'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='zfs_nicebytes' filepath='../../include/libzutil.h' line='134' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-60'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-81'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='zfs_nicenum' filepath='../../include/libzutil.h' line='135' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-60'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-81'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='avl_create' filepath='../../include/sys/avl.h' line='163' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-413'/>
      <parameter type-id='type-id-230'/>
      <parameter type-id='type-id-81'/>
      <parameter type-id='type-id-81'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='avl_find' filepath='../../include/sys/avl.h' line='175' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-413'/>
      <parameter type-id='type-id-80'/>
      <parameter type-id='type-id-412'/>
      <return type-id='type-id-80'/>
    </function-decl>
    <function-decl name='avl_add' filepath='../../include/sys/avl.h' line='252' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-413'/>
      <parameter type-id='type-id-80'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='avl_remove' filepath='../../include/sys/avl.h' line='260' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-413'/>
      <parameter type-id='type-id-80'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='avl_numnodes' filepath='../../include/sys/avl.h' line='281' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-413'/>
      <return type-id='type-id-231'/>
    </function-decl>
    <function-decl name='avl_destroy_nodes' filepath='../../include/sys/avl.h' line='309' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-413'/>
      <parameter type-id='type-id-308'/>
      <return type-id='type-id-80'/>
    </function-decl>
    <function-decl name='avl_destroy' filepath='../../include/sys/avl.h' line='317' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-413'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='zfs_prop_readonly' mangled-name='zfs_prop_readonly' filepath='../../include/sys/fs/zfs.h' line='305' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_readonly'>
      <parameter type-id='type-id-109'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='zfs_prop_inheritable' mangled-name='zfs_prop_inheritable' filepath='../../include/sys/fs/zfs.h' line='307' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_inheritable'>
      <parameter type-id='type-id-109'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='zfs_prop_setonce' mangled-name='zfs_prop_setonce' filepath='../../include/sys/fs/zfs.h' line='308' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_setonce'>
      <parameter type-id='type-id-109'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='zfs_prop_encryption_key_param' mangled-name='zfs_prop_encryption_key_param' filepath='../../include/sys/fs/zfs.h' line='309' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_encryption_key_param'>
      <parameter type-id='type-id-109'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='zfs_prop_valid_keylocation' mangled-name='zfs_prop_valid_keylocation' filepath='../../include/sys/fs/zfs.h' line='310' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_valid_keylocation'>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-31'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='zfs_prop_user' mangled-name='zfs_prop_user' filepath='../../include/sys/fs/zfs.h' line='313' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_user'>
      <parameter type-id='type-id-18'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='zfs_prop_userquota' mangled-name='zfs_prop_userquota' filepath='../../include/sys/fs/zfs.h' line='314' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_userquota'>
      <parameter type-id='type-id-18'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='zfs_prop_written' mangled-name='zfs_prop_written' filepath='../../include/sys/fs/zfs.h' line='315' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_written'>
      <parameter type-id='type-id-18'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='zfs_prop_index_to_string' mangled-name='zfs_prop_index_to_string' filepath='../../include/sys/fs/zfs.h' line='316' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_index_to_string'>
      <parameter type-id='type-id-109'/>
      <parameter type-id='type-id-60'/>
      <parameter type-id='type-id-166'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='zfs_prop_valid_for_type' mangled-name='zfs_prop_valid_for_type' filepath='../../include/sys/fs/zfs.h' line='319' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_valid_for_type'>
      <parameter type-id='type-id-20'/>
      <parameter type-id='type-id-167'/>
      <parameter type-id='type-id-31'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='nvlist_alloc' filepath='../../include/sys/nvpair.h' line='151' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-307'/>
      <parameter type-id='type-id-318'/>
      <parameter type-id='type-id-20'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='nvlist_size' filepath='../../include/sys/nvpair.h' line='153' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-98'/>
      <parameter type-id='type-id-373'/>
      <parameter type-id='type-id-20'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='nvlist_pack' filepath='../../include/sys/nvpair.h' line='154' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-98'/>
      <parameter type-id='type-id-268'/>
      <parameter type-id='type-id-373'/>
      <parameter type-id='type-id-20'/>
      <parameter type-id='type-id-20'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='nvlist_unpack' filepath='../../include/sys/nvpair.h' line='155' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-81'/>
      <parameter type-id='type-id-307'/>
      <parameter type-id='type-id-20'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='nvlist_add_boolean' filepath='../../include/sys/nvpair.h' line='168' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-98'/>
      <parameter type-id='type-id-18'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='nvlist_add_nvlist' filepath='../../include/sys/nvpair.h' line='180' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-98'/>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-98'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='nvlist_add_uint64_array' filepath='../../include/sys/nvpair.h' line='190' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-98'/>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-168'/>
      <parameter type-id='type-id-318'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='nvlist_remove' filepath='../../include/sys/nvpair.h' line='198' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-98'/>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-289'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='nvlist_remove_all' filepath='../../include/sys/nvpair.h' line='199' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-98'/>
      <parameter type-id='type-id-18'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='nvlist_lookup_int64' filepath='../../include/sys/nvpair.h' line='211' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-98'/>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-426'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='nvlist_lookup_uint64_array' filepath='../../include/sys/nvpair.h' line='225' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-98'/>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-433'/>
      <parameter type-id='type-id-377'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='nvlist_lookup_nvlist_array' filepath='../../include/sys/nvpair.h' line='227' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-98'/>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-428'/>
      <parameter type-id='type-id-377'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='nvlist_empty' filepath='../../include/sys/nvpair.h' line='239' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-98'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='nvpair_type' filepath='../../include/sys/nvpair.h' line='245' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-97'/>
      <return type-id='type-id-289'/>
    </function-decl>
    <function-decl name='nvpair_value_uint64' filepath='../../include/sys/nvpair.h' line='256' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-97'/>
      <parameter type-id='type-id-168'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='nvpair_value_string' filepath='../../include/sys/nvpair.h' line='257' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-97'/>
      <parameter type-id='type-id-268'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='fnvlist_free' filepath='../../include/sys/nvpair.h' line='277' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-98'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='fnvlist_add_boolean' filepath='../../include/sys/nvpair.h' line='286' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-98'/>
      <parameter type-id='type-id-18'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='fnvlist_add_uint64' filepath='../../include/sys/nvpair.h' line='296' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-98'/>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-60'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='fnvlist_add_string' filepath='../../include/sys/nvpair.h' line='297' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-98'/>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-18'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='fnvlist_add_nvlist' filepath='../../include/sys/nvpair.h' line='298' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-98'/>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-98'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_string' filepath='../../include/sys/nvpair.h' line='328' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-98'/>
      <parameter type-id='type-id-18'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_nvlist' filepath='../../include/sys/nvpair.h' line='329' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-98'/>
      <parameter type-id='type-id-18'/>
      <return type-id='type-id-98'/>
    </function-decl>
    <function-decl name='fnvpair_value_int32' filepath='../../include/sys/nvpair.h' line='345' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-97'/>
      <return type-id='type-id-240'/>
    </function-decl>
    <function-decl name='fnvpair_value_uint64' filepath='../../include/sys/nvpair.h' line='350' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-97'/>
      <return type-id='type-id-60'/>
    </function-decl>
    <function-decl name='entity_namecheck' mangled-name='entity_namecheck' filepath='../../include/zfs_namecheck.h' line='58' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='entity_namecheck'>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-108'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='dataset_nestcheck' mangled-name='dataset_nestcheck' filepath='../../include/zfs_namecheck.h' line='62' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dataset_nestcheck'>
      <parameter type-id='type-id-18'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='mountpoint_namecheck' mangled-name='mountpoint_namecheck' filepath='../../include/zfs_namecheck.h' line='63' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='mountpoint_namecheck'>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-108'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='zfs_prop_get_type' mangled-name='zfs_prop_get_type' filepath='../../include/zfs_prop.h' line='91' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_get_type'>
      <parameter type-id='type-id-109'/>
      <return type-id='type-id-163'/>
    </function-decl>
    <function-decl name='getmntany' filepath='../../lib/libspl/include/os/linux/sys/mnttab.h' line='73' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-213'/>
      <parameter type-id='type-id-427'/>
      <parameter type-id='type-id-427'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='_sol_getmntent' filepath='../../lib/libspl/include/os/linux/sys/mnttab.h' line='74' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-213'/>
      <parameter type-id='type-id-427'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='zfs_type_to_name' mangled-name='zfs_type_to_name' filepath='/home/hutter2/release20/lib/libzfs/libzfs_dataset.c' line='81' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_type_to_name'>
      <parameter type-id='type-id-167' name='type' filepath='/home/hutter2/release20/lib/libzfs/libzfs_dataset.c' line='81' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='zfs_validate_name' mangled-name='zfs_validate_name' filepath='/home/hutter2/release20/lib/libzfs/libzfs_dataset.c' line='107' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_validate_name'>
      <parameter type-id='type-id-220' name='hdl' filepath='/home/hutter2/release20/lib/libzfs/libzfs_dataset.c' line='107' column='1'/>
      <parameter type-id='type-id-18' name='path' filepath='/home/hutter2/release20/lib/libzfs/libzfs_dataset.c' line='107' column='1'/>
      <parameter type-id='type-id-20' name='type' filepath='/home/hutter2/release20/lib/libzfs/libzfs_dataset.c' line='107' column='1'/>
      <parameter type-id='type-id-31' name='modifying' filepath='/home/hutter2/release20/lib/libzfs/libzfs_dataset.c' line='108' column='1'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='zfs_name_valid' mangled-name='zfs_name_valid' filepath='/home/hutter2/release20/lib/libzfs/libzfs_dataset.c' line='223' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_name_valid'>
      <parameter type-id='type-id-18' name='name' filepath='/home/hutter2/release20/lib/libzfs/libzfs_dataset.c' line='223' column='1'/>
      <parameter type-id='type-id-167' name='type' filepath='/home/hutter2/release20/lib/libzfs/libzfs_dataset.c' line='223' column='1'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='zpool_free_handles' mangled-name='zpool_free_handles' filepath='/home/hutter2/release20/lib/libzfs/libzfs_dataset.c' line='314' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_free_handles'>
      <parameter type-id='type-id-220' name='hdl' filepath='/home/hutter2/release20/lib/libzfs/libzfs_dataset.c' line='314' column='1'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='make_dataset_handle_zc' mangled-name='make_dataset_handle_zc' filepath='/home/hutter2/release20/lib/libzfs/libzfs_dataset.c' line='508' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='make_dataset_handle_zc'>
      <parameter type-id='type-id-220' name='hdl' filepath='/home/hutter2/release20/lib/libzfs/libzfs_dataset.c' line='508' column='1'/>
      <parameter type-id='type-id-310' name='zc' filepath='/home/hutter2/release20/lib/libzfs/libzfs_dataset.c' line='508' column='1'/>
      <return type-id='type-id-279'/>
    </function-decl>
    <function-decl name='make_dataset_simple_handle_zc' mangled-name='make_dataset_simple_handle_zc' filepath='/home/hutter2/release20/lib/libzfs/libzfs_dataset.c' line='525' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='make_dataset_simple_handle_zc'>
      <parameter type-id='type-id-279' name='pzhp' filepath='/home/hutter2/release20/lib/libzfs/libzfs_dataset.c' line='525' column='1'/>
      <parameter type-id='type-id-310' name='zc' filepath='/home/hutter2/release20/lib/libzfs/libzfs_dataset.c' line='525' column='1'/>
      <return type-id='type-id-279'/>
    </function-decl>
    <function-decl name='zfs_bookmark_exists' mangled-name='zfs_bookmark_exists' filepath='/home/hutter2/release20/lib/libzfs/libzfs_dataset.c' line='589' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_bookmark_exists'>
      <parameter type-id='type-id-18' name='path' filepath='/home/hutter2/release20/lib/libzfs/libzfs_dataset.c' line='589' column='1'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='make_bookmark_handle' mangled-name='make_bookmark_handle' filepath='/home/hutter2/release20/lib/libzfs/libzfs_dataset.c' line='620' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='make_bookmark_handle'>
      <parameter type-id='type-id-279' name='parent' filepath='/home/hutter2/release20/lib/libzfs/libzfs_dataset.c' line='620' column='1'/>
      <parameter type-id='type-id-18' name='path' filepath='/home/hutter2/release20/lib/libzfs/libzfs_dataset.c' line='620' column='1'/>
      <parameter type-id='type-id-98' name='bmark_props' filepath='/home/hutter2/release20/lib/libzfs/libzfs_dataset.c' line='621' column='1'/>
      <return type-id='type-id-279'/>
    </function-decl>
    <function-decl name='libzfs_mnttab_init' mangled-name='libzfs_mnttab_init' filepath='/home/hutter2/release20/lib/libzfs/libzfs_dataset.c' line='802' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='libzfs_mnttab_init'>
      <parameter type-id='type-id-220' name='hdl' filepath='/home/hutter2/release20/lib/libzfs/libzfs_dataset.c' line='802' column='1'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='libzfs_mnttab_fini' mangled-name='libzfs_mnttab_fini' filepath='/home/hutter2/release20/lib/libzfs/libzfs_dataset.c' line='849' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='libzfs_mnttab_fini'>
      <parameter type-id='type-id-220' name='hdl' filepath='/home/hutter2/release20/lib/libzfs/libzfs_dataset.c' line='849' column='1'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='libzfs_mnttab_cache' mangled-name='libzfs_mnttab_cache' filepath='/home/hutter2/release20/lib/libzfs/libzfs_dataset.c' line='867' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='libzfs_mnttab_cache'>
      <parameter type-id='type-id-220' name='hdl' filepath='/home/hutter2/release20/lib/libzfs/libzfs_dataset.c' line='867' column='1'/>
      <parameter type-id='type-id-31' name='enable' filepath='/home/hutter2/release20/lib/libzfs/libzfs_dataset.c' line='867' column='1'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='libzfs_mnttab_find' mangled-name='libzfs_mnttab_find' filepath='/home/hutter2/release20/lib/libzfs/libzfs_dataset.c' line='873' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='libzfs_mnttab_find'>
      <parameter type-id='type-id-220' name='hdl' filepath='/home/hutter2/release20/lib/libzfs/libzfs_dataset.c' line='873' column='1'/>
      <parameter type-id='type-id-18' name='fsname' filepath='/home/hutter2/release20/lib/libzfs/libzfs_dataset.c' line='873' column='1'/>
      <parameter type-id='type-id-427' name='entry' filepath='/home/hutter2/release20/lib/libzfs/libzfs_dataset.c' line='874' column='1'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='libzfs_mnttab_add' mangled-name='libzfs_mnttab_add' filepath='/home/hutter2/release20/lib/libzfs/libzfs_dataset.c' line='919' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='libzfs_mnttab_add'>
      <parameter type-id='type-id-220' name='hdl' filepath='/home/hutter2/release20/lib/libzfs/libzfs_dataset.c' line='919' column='1'/>
      <parameter type-id='type-id-18' name='special' filepath='/home/hutter2/release20/lib/libzfs/libzfs_dataset.c' line='919' column='1'/>
      <parameter type-id='type-id-18' name='mountp' filepath='/home/hutter2/release20/lib/libzfs/libzfs_dataset.c' line='920' column='1'/>
      <parameter type-id='type-id-18' name='mntopts' filepath='/home/hutter2/release20/lib/libzfs/libzfs_dataset.c' line='920' column='1'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='libzfs_mnttab_remove' mangled-name='libzfs_mnttab_remove' filepath='/home/hutter2/release20/lib/libzfs/libzfs_dataset.c' line='949' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='libzfs_mnttab_remove'>
      <parameter type-id='type-id-220' name='hdl' filepath='/home/hutter2/release20/lib/libzfs/libzfs_dataset.c' line='949' column='1'/>
      <parameter type-id='type-id-18' name='fsname' filepath='/home/hutter2/release20/lib/libzfs/libzfs_dataset.c' line='949' column='1'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='zfs_spa_version' mangled-name='zfs_spa_version' filepath='/home/hutter2/release20/lib/libzfs/libzfs_dataset.c' line='969' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_spa_version'>
      <parameter type-id='type-id-279' name='zhp' filepath='/home/hutter2/release20/lib/libzfs/libzfs_dataset.c' line='969' column='1'/>
      <parameter type-id='type-id-306' name='spa_version' filepath='/home/hutter2/release20/lib/libzfs/libzfs_dataset.c' line='969' column='1'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='zfs_prop_set' mangled-name='zfs_prop_set' filepath='/home/hutter2/release20/lib/libzfs/libzfs_dataset.c' line='1714' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_set'>
      <parameter type-id='type-id-279' name='zhp' filepath='/home/hutter2/release20/lib/libzfs/libzfs_dataset.c' line='1714' column='1'/>
      <parameter type-id='type-id-18' name='propname' filepath='/home/hutter2/release20/lib/libzfs/libzfs_dataset.c' line='1714' column='1'/>
      <parameter type-id='type-id-18' name='propval' filepath='/home/hutter2/release20/lib/libzfs/libzfs_dataset.c' line='1714' column='1'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='zfs_prop_set_list' mangled-name='zfs_prop_set_list' filepath='/home/hutter2/release20/lib/libzfs/libzfs_dataset.c' line='1745' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_set_list'>
      <parameter type-id='type-id-279' name='zhp' filepath='/home/hutter2/release20/lib/libzfs/libzfs_dataset.c' line='1745' column='1'/>
      <parameter type-id='type-id-98' name='props' filepath='/home/hutter2/release20/lib/libzfs/libzfs_dataset.c' line='1745' column='1'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='zfs_prop_inherit' mangled-name='zfs_prop_inherit' filepath='/home/hutter2/release20/lib/libzfs/libzfs_dataset.c' line='1927' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_inherit'>
      <parameter type-id='type-id-279' name='zhp' filepath='/home/hutter2/release20/lib/libzfs/libzfs_dataset.c' line='1927' column='1'/>
      <parameter type-id='type-id-18' name='propname' filepath='/home/hutter2/release20/lib/libzfs/libzfs_dataset.c' line='1927' column='1'/>
      <parameter type-id='type-id-31' name='received' filepath='/home/hutter2/release20/lib/libzfs/libzfs_dataset.c' line='1927' column='1'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='getprop_uint64' mangled-name='getprop_uint64' filepath='/home/hutter2/release20/lib/libzfs/libzfs_dataset.c' line='2039' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getprop_uint64'>
      <parameter type-id='type-id-279' name='zhp' filepath='/home/hutter2/release20/lib/libzfs/libzfs_dataset.c' line='2039' column='1'/>
      <parameter type-id='type-id-109' name='prop' filepath='/home/hutter2/release20/lib/libzfs/libzfs_dataset.c' line='2039' column='1'/>
      <parameter type-id='type-id-268' name='source' filepath='/home/hutter2/release20/lib/libzfs/libzfs_dataset.c' line='2039' column='1'/>
      <return type-id='type-id-60'/>
    </function-decl>
    <function-decl name='zfs_prop_get_recvd' mangled-name='zfs_prop_get_recvd' filepath='/home/hutter2/release20/lib/libzfs/libzfs_dataset.c' line='2350' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_get_recvd'>
      <parameter type-id='type-id-279' name='zhp' filepath='/home/hutter2/release20/lib/libzfs/libzfs_dataset.c' line='2350' column='1'/>
      <parameter type-id='type-id-18' name='propname' filepath='/home/hutter2/release20/lib/libzfs/libzfs_dataset.c' line='2350' column='1'/>
      <parameter type-id='type-id-2' name='propbuf' filepath='/home/hutter2/release20/lib/libzfs/libzfs_dataset.c' line='2350' column='1'/>
      <parameter type-id='type-id-81' name='proplen' filepath='/home/hutter2/release20/lib/libzfs/libzfs_dataset.c' line='2351' column='1'/>
      <parameter type-id='type-id-31' name='literal' filepath='/home/hutter2/release20/lib/libzfs/libzfs_dataset.c' line='2351' column='1'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='zfs_get_clones_nvl' mangled-name='zfs_get_clones_nvl' filepath='/home/hutter2/release20/lib/libzfs/libzfs_dataset.c' line='2437' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_get_clones_nvl'>
      <parameter type-id='type-id-279' name='zhp' filepath='/home/hutter2/release20/lib/libzfs/libzfs_dataset.c' line='2437' column='1'/>
      <return type-id='type-id-98'/>
    </function-decl>
    <function-decl name='zfs_prop_get_numeric' mangled-name='zfs_prop_get_numeric' filepath='/home/hutter2/release20/lib/libzfs/libzfs_dataset.c' line='3004' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_get_numeric'>
      <parameter type-id='type-id-279' name='zhp' filepath='/home/hutter2/release20/lib/libzfs/libzfs_dataset.c' line='3004' column='1'/>
      <parameter type-id='type-id-109' name='prop' filepath='/home/hutter2/release20/lib/libzfs/libzfs_dataset.c' line='3004' column='1'/>
      <parameter type-id='type-id-168' name='value' filepath='/home/hutter2/release20/lib/libzfs/libzfs_dataset.c' line='3004' column='1'/>
      <parameter type-id='type-id-281' name='src' filepath='/home/hutter2/release20/lib/libzfs/libzfs_dataset.c' line='3005' column='1'/>
      <parameter type-id='type-id-2' name='statbuf' filepath='/home/hutter2/release20/lib/libzfs/libzfs_dataset.c' line='3005' column='1'/>
      <parameter type-id='type-id-81' name='statlen' filepath='/home/hutter2/release20/lib/libzfs/libzfs_dataset.c' line='3005' column='1'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='zfs_prop_get_userquota_int' mangled-name='zfs_prop_get_userquota_int' filepath='/home/hutter2/release20/lib/libzfs/libzfs_dataset.c' line='3208' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_get_userquota_int'>
      <parameter type-id='type-id-279' name='zhp' filepath='/home/hutter2/release20/lib/libzfs/libzfs_dataset.c' line='3208' column='1'/>
      <parameter type-id='type-id-18' name='propname' filepath='/home/hutter2/release20/lib/libzfs/libzfs_dataset.c' line='3208' column='1'/>
      <parameter type-id='type-id-168' name='propvalue' filepath='/home/hutter2/release20/lib/libzfs/libzfs_dataset.c' line='3209' column='1'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='zfs_prop_get_userquota' mangled-name='zfs_prop_get_userquota' filepath='/home/hutter2/release20/lib/libzfs/libzfs_dataset.c' line='3218' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_get_userquota'>
      <parameter type-id='type-id-279' name='zhp' filepath='/home/hutter2/release20/lib/libzfs/libzfs_dataset.c' line='3218' column='1'/>
      <parameter type-id='type-id-18' name='propname' filepath='/home/hutter2/release20/lib/libzfs/libzfs_dataset.c' line='3218' column='1'/>
      <parameter type-id='type-id-2' name='propbuf' filepath='/home/hutter2/release20/lib/libzfs/libzfs_dataset.c' line='3219' column='1'/>
      <parameter type-id='type-id-20' name='proplen' filepath='/home/hutter2/release20/lib/libzfs/libzfs_dataset.c' line='3219' column='1'/>
      <parameter type-id='type-id-31' name='literal' filepath='/home/hutter2/release20/lib/libzfs/libzfs_dataset.c' line='3219' column='1'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='zfs_prop_get_written_int' mangled-name='zfs_prop_get_written_int' filepath='/home/hutter2/release20/lib/libzfs/libzfs_dataset.c' line='3254' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_get_written_int'>
      <parameter type-id='type-id-279' name='zhp' filepath='/home/hutter2/release20/lib/libzfs/libzfs_dataset.c' line='3254' column='1'/>
      <parameter type-id='type-id-18' name='propname' filepath='/home/hutter2/release20/lib/libzfs/libzfs_dataset.c' line='3254' column='1'/>
      <parameter type-id='type-id-168' name='propvalue' filepath='/home/hutter2/release20/lib/libzfs/libzfs_dataset.c' line='3255' column='1'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='zfs_prop_get_written' mangled-name='zfs_prop_get_written' filepath='/home/hutter2/release20/lib/libzfs/libzfs_dataset.c' line='3289' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_get_written'>
      <parameter type-id='type-id-279' name='zhp' filepath='/home/hutter2/release20/lib/libzfs/libzfs_dataset.c' line='3289' column='1'/>
      <parameter type-id='type-id-18' name='propname' filepath='/home/hutter2/release20/lib/libzfs/libzfs_dataset.c' line='3289' column='1'/>
      <parameter type-id='type-id-2' name='propbuf' filepath='/home/hutter2/release20/lib/libzfs/libzfs_dataset.c' line='3290' column='1'/>
      <parameter type-id='type-id-20' name='proplen' filepath='/home/hutter2/release20/lib/libzfs/libzfs_dataset.c' line='3290' column='1'/>
      <parameter type-id='type-id-31' name='literal' filepath='/home/hutter2/release20/lib/libzfs/libzfs_dataset.c' line='3290' column='1'/>
      <return type-id='type-id-20'/>
    </function-decl>
