<abi-corpus path='libzfs.so' architecture='elf-amd-x86_64' soname='libzfs.so.4'>
  <elf-needed>
    <dependency name='libzfs_core.so.3'/>
    <dependency name='libnvpair.so.3'/>
    <dependency name='libuutil.so.3'/>
    <dependency name='libm.so.6'/>
    <dependency name='libcrypto.so.1.1'/>
    <dependency name='libz.so.1'/>
    <dependency name='libdl.so.2'/>
    <dependency name='libpthread.so.0'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='SHA256Init' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='SHA2Final' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='SHA2Init' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='SHA2Update' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='SHA384Init' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='SHA512Init' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='bookmark_namecheck' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='zprop_free_list' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zprop_get_list' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zprop_index_to_string' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zprop_iter' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zprop_iter_common' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zprop_name_to_prop' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zprop_parse_value' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zprop_print_one_property' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zprop_random_value' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zprop_register_hidden' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zprop_register_impl' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zprop_register_index' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zprop_register_number' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zprop_register_string' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zprop_string_to_index' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zprop_valid_for_type' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zprop_values' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zprop_width' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zvol_volsize_to_reservation' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <elf-variable-symbols>
    <elf-symbol name='fletcher_4_abd_ops' size='24' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fletcher_4_avx2_ops' size='64' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fletcher_4_avx512bw_ops' size='64' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fletcher_4_avx512f_ops' size='64' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fletcher_4_sse2_ops' size='64' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fletcher_4_ssse3_ops' size='64' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fletcher_4_superscalar4_ops' size='64' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fletcher_4_superscalar_ops' size='64' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='libzfs_config_ops' size='16' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nfs_only' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='proto_table' size='48' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='share_all_proto' size='12' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='smb_only' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='smb_shares' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spa_feature_table' size='1904' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zfeature_checks_disable' size='4' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zfs_deleg_perm_tab' size='512' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zfs_history_event_names' size='328' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zfs_max_dataset_nesting' size='4' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zfs_userquota_prop_prefixes' size='96' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-variable-symbols>
  <abi-instr version='1.0' address-size='64' path='libzfs_changelist.c' comp-dir-path='/home/nabijaczleweli/store/code/zfs/lib/libzfs' language='LANG_C99'>
    <type-decl name='int' size-in-bits='32' id='type-id-1'/>
    <class-decl name='prop_changelist' size-in-bits='448' is-struct='yes' visibility='default' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_changelist.c' line='75' column='1' id='type-id-2'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cl_prop' type-id='type-id-3' visibility='default' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_changelist.c' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='cl_realprop' type-id='type-id-3' visibility='default' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_changelist.c' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='cl_shareprop' type-id='type-id-3' visibility='default' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_changelist.c' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='cl_pool' type-id='type-id-4' visibility='default' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_changelist.c' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='cl_tree' type-id='type-id-5' visibility='default' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_changelist.c' line='80' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='cl_waslegacy' type-id='type-id-6' visibility='default' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_changelist.c' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='cl_allchildren' type-id='type-id-6' visibility='default' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_changelist.c' line='82' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='cl_alldependents' type-id='type-id-6' visibility='default' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_changelist.c' line='83' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='cl_mflags' type-id='type-id-1' visibility='default' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_changelist.c' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='cl_gflags' type-id='type-id-1' visibility='default' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_changelist.c' line='85' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='cl_haszonedchild' type-id='type-id-6' visibility='default' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_changelist.c' line='86' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='unnamed-enum-underlying-type' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='type-id-7'/>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' filepath='../../include/sys/fs/zfs.h' line='91' column='1' id='type-id-8'>
      <underlying-type type-id='type-id-7'/>
      <enumerator name='ZPROP_CONT' value='-2'/>
      <enumerator name='ZPROP_INVAL' value='-1'/>
      <enumerator name='ZFS_PROP_TYPE' value='0'/>
      <enumerator name='ZFS_PROP_CREATION' value='1'/>
      <enumerator name='ZFS_PROP_USED' value='2'/>
      <enumerator name='ZFS_PROP_AVAILABLE' value='3'/>
      <enumerator name='ZFS_PROP_REFERENCED' value='4'/>
      <enumerator name='ZFS_PROP_COMPRESSRATIO' value='5'/>
      <enumerator name='ZFS_PROP_MOUNTED' value='6'/>
      <enumerator name='ZFS_PROP_ORIGIN' value='7'/>
      <enumerator name='ZFS_PROP_QUOTA' value='8'/>
      <enumerator name='ZFS_PROP_RESERVATION' value='9'/>
      <enumerator name='ZFS_PROP_VOLSIZE' value='10'/>
      <enumerator name='ZFS_PROP_VOLBLOCKSIZE' value='11'/>
      <enumerator name='ZFS_PROP_RECORDSIZE' value='12'/>
      <enumerator name='ZFS_PROP_MOUNTPOINT' value='13'/>
      <enumerator name='ZFS_PROP_SHARENFS' value='14'/>
      <enumerator name='ZFS_PROP_CHECKSUM' value='15'/>
      <enumerator name='ZFS_PROP_COMPRESSION' value='16'/>
      <enumerator name='ZFS_PROP_ATIME' value='17'/>
      <enumerator name='ZFS_PROP_DEVICES' value='18'/>
      <enumerator name='ZFS_PROP_EXEC' value='19'/>
      <enumerator name='ZFS_PROP_SETUID' value='20'/>
      <enumerator name='ZFS_PROP_READONLY' value='21'/>
      <enumerator name='ZFS_PROP_ZONED' value='22'/>
      <enumerator name='ZFS_PROP_SNAPDIR' value='23'/>
      <enumerator name='ZFS_PROP_ACLMODE' value='24'/>
      <enumerator name='ZFS_PROP_ACLINHERIT' value='25'/>
      <enumerator name='ZFS_PROP_CREATETXG' value='26'/>
      <enumerator name='ZFS_PROP_NAME' value='27'/>
      <enumerator name='ZFS_PROP_CANMOUNT' value='28'/>
      <enumerator name='ZFS_PROP_ISCSIOPTIONS' value='29'/>
      <enumerator name='ZFS_PROP_XATTR' value='30'/>
      <enumerator name='ZFS_PROP_NUMCLONES' value='31'/>
      <enumerator name='ZFS_PROP_COPIES' value='32'/>
      <enumerator name='ZFS_PROP_VERSION' value='33'/>
      <enumerator name='ZFS_PROP_UTF8ONLY' value='34'/>
      <enumerator name='ZFS_PROP_NORMALIZE' value='35'/>
      <enumerator name='ZFS_PROP_CASE' value='36'/>
      <enumerator name='ZFS_PROP_VSCAN' value='37'/>
      <enumerator name='ZFS_PROP_NBMAND' value='38'/>
      <enumerator name='ZFS_PROP_SHARESMB' value='39'/>
      <enumerator name='ZFS_PROP_REFQUOTA' value='40'/>
      <enumerator name='ZFS_PROP_REFRESERVATION' value='41'/>
      <enumerator name='ZFS_PROP_GUID' value='42'/>
      <enumerator name='ZFS_PROP_PRIMARYCACHE' value='43'/>
      <enumerator name='ZFS_PROP_SECONDARYCACHE' value='44'/>
      <enumerator name='ZFS_PROP_USEDSNAP' value='45'/>
      <enumerator name='ZFS_PROP_USEDDS' value='46'/>
      <enumerator name='ZFS_PROP_USEDCHILD' value='47'/>
      <enumerator name='ZFS_PROP_USEDREFRESERV' value='48'/>
      <enumerator name='ZFS_PROP_USERACCOUNTING' value='49'/>
      <enumerator name='ZFS_PROP_STMF_SHAREINFO' value='50'/>
      <enumerator name='ZFS_PROP_DEFER_DESTROY' value='51'/>
      <enumerator name='ZFS_PROP_USERREFS' value='52'/>
      <enumerator name='ZFS_PROP_LOGBIAS' value='53'/>
      <enumerator name='ZFS_PROP_UNIQUE' value='54'/>
      <enumerator name='ZFS_PROP_OBJSETID' value='55'/>
      <enumerator name='ZFS_PROP_DEDUP' value='56'/>
      <enumerator name='ZFS_PROP_MLSLABEL' value='57'/>
      <enumerator name='ZFS_PROP_SYNC' value='58'/>
      <enumerator name='ZFS_PROP_DNODESIZE' value='59'/>
      <enumerator name='ZFS_PROP_REFRATIO' value='60'/>
      <enumerator name='ZFS_PROP_WRITTEN' value='61'/>
      <enumerator name='ZFS_PROP_CLONES' value='62'/>
      <enumerator name='ZFS_PROP_LOGICALUSED' value='63'/>
      <enumerator name='ZFS_PROP_LOGICALREFERENCED' value='64'/>
      <enumerator name='ZFS_PROP_INCONSISTENT' value='65'/>
      <enumerator name='ZFS_PROP_VOLMODE' value='66'/>
      <enumerator name='ZFS_PROP_FILESYSTEM_LIMIT' value='67'/>
      <enumerator name='ZFS_PROP_SNAPSHOT_LIMIT' value='68'/>
      <enumerator name='ZFS_PROP_FILESYSTEM_COUNT' value='69'/>
      <enumerator name='ZFS_PROP_SNAPSHOT_COUNT' value='70'/>
      <enumerator name='ZFS_PROP_SNAPDEV' value='71'/>
      <enumerator name='ZFS_PROP_ACLTYPE' value='72'/>
      <enumerator name='ZFS_PROP_SELINUX_CONTEXT' value='73'/>
      <enumerator name='ZFS_PROP_SELINUX_FSCONTEXT' value='74'/>
      <enumerator name='ZFS_PROP_SELINUX_DEFCONTEXT' value='75'/>
      <enumerator name='ZFS_PROP_SELINUX_ROOTCONTEXT' value='76'/>
      <enumerator name='ZFS_PROP_RELATIME' value='77'/>
      <enumerator name='ZFS_PROP_REDUNDANT_METADATA' value='78'/>
      <enumerator name='ZFS_PROP_OVERLAY' value='79'/>
      <enumerator name='ZFS_PROP_PREV_SNAP' value='80'/>
      <enumerator name='ZFS_PROP_RECEIVE_RESUME_TOKEN' value='81'/>
      <enumerator name='ZFS_PROP_ENCRYPTION' value='82'/>
      <enumerator name='ZFS_PROP_KEYLOCATION' value='83'/>
      <enumerator name='ZFS_PROP_KEYFORMAT' value='84'/>
      <enumerator name='ZFS_PROP_PBKDF2_SALT' value='85'/>
      <enumerator name='ZFS_PROP_PBKDF2_ITERS' value='86'/>
      <enumerator name='ZFS_PROP_ENCRYPTION_ROOT' value='87'/>
      <enumerator name='ZFS_PROP_KEY_GUID' value='88'/>
      <enumerator name='ZFS_PROP_KEYSTATUS' value='89'/>
      <enumerator name='ZFS_PROP_REMAPTXG' value='90'/>
      <enumerator name='ZFS_PROP_SPECIAL_SMALL_BLOCKS' value='91'/>
      <enumerator name='ZFS_PROP_IVSET_GUID' value='92'/>
      <enumerator name='ZFS_PROP_REDACTED' value='93'/>
      <enumerator name='ZFS_PROP_REDACT_SNAPS' value='94'/>
      <enumerator name='ZFS_NUM_PROPS' value='95'/>
    </enum-decl>
    <typedef-decl name='zfs_prop_t' type-id='type-id-8' filepath='../../include/sys/fs/zfs.h' line='190' column='1' id='type-id-3'/>
    <class-decl name='uu_avl_pool' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-9'/>
    <typedef-decl name='uu_avl_pool_t' type-id='type-id-9' filepath='../../include/libuutil.h' line='259' column='1' id='type-id-10'/>
    <pointer-type-def type-id='type-id-10' size-in-bits='64' id='type-id-4'/>
    <class-decl name='uu_avl' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-11'/>
    <typedef-decl name='uu_avl_t' type-id='type-id-11' filepath='../../include/libuutil.h' line='260' column='1' id='type-id-12'/>
    <pointer-type-def type-id='type-id-12' size-in-bits='64' id='type-id-5'/>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' filepath='../../lib/libspl/include/sys/stdtypes.h' line='26' column='1' id='type-id-13'>
      <underlying-type type-id='type-id-7'/>
      <enumerator name='B_FALSE' value='0'/>
      <enumerator name='B_TRUE' value='1'/>
    </enum-decl>
    <typedef-decl name='boolean_t' type-id='type-id-13' filepath='../../lib/libspl/include/sys/stdtypes.h' line='29' column='1' id='type-id-6'/>
    <typedef-decl name='prop_changelist_t' type-id='type-id-2' filepath='../../include/libzfs_impl.h' line='173' column='1' id='type-id-14'/>
    <pointer-type-def type-id='type-id-14' size-in-bits='64' id='type-id-15'/>
    <function-decl name='changelist_prefix' mangled-name='changelist_prefix' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_changelist.c' line='96' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='changelist_prefix'>
      <parameter type-id='type-id-15' name='clp' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_changelist.c' line='96' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <class-decl name='uu_avl_walk' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-16'/>
    <pointer-type-def type-id='type-id-16' size-in-bits='64' id='type-id-17'/>
    <pointer-type-def type-id='type-id-11' size-in-bits='64' id='type-id-18'/>
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-19'/>
    <function-decl name='uu_avl_walk_start' filepath='../../include/libuutil.h' line='338' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <type-decl name='void' id='type-id-20'/>
    <pointer-type-def type-id='type-id-20' size-in-bits='64' id='type-id-21'/>
    <function-decl name='uu_avl_walk_next' filepath='../../include/libuutil.h' line='339' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-17'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='getzoneid' filepath='../../include/sys/zfs_context.h' line='732' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-1'/>
    </function-decl>
    <class-decl name='zfs_handle' size-in-bits='4928' is-struct='yes' visibility='default' filepath='../../include/libzfs_impl.h' line='76' column='1' id='type-id-22'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='zfs_hdl' type-id='type-id-23' visibility='default' filepath='../../include/libzfs_impl.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='zpool_hdl' type-id='type-id-24' visibility='default' filepath='../../include/libzfs_impl.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='zfs_name' type-id='type-id-25' visibility='default' filepath='../../include/libzfs_impl.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='zfs_type' type-id='type-id-26' visibility='default' filepath='../../include/libzfs_impl.h' line='80' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2208'>
        <var-decl name='zfs_head_type' type-id='type-id-26' visibility='default' filepath='../../include/libzfs_impl.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <var-decl name='zfs_dmustats' type-id='type-id-27' visibility='default' filepath='../../include/libzfs_impl.h' line='82' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4544'>
        <var-decl name='zfs_props' type-id='type-id-28' visibility='default' filepath='../../include/libzfs_impl.h' line='83' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4608'>
        <var-decl name='zfs_user_props' type-id='type-id-28' visibility='default' filepath='../../include/libzfs_impl.h' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4672'>
        <var-decl name='zfs_recvd_props' type-id='type-id-28' visibility='default' filepath='../../include/libzfs_impl.h' line='85' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4736'>
        <var-decl name='zfs_mntcheck' type-id='type-id-6' visibility='default' filepath='../../include/libzfs_impl.h' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4800'>
        <var-decl name='zfs_mntopts' type-id='type-id-29' visibility='default' filepath='../../include/libzfs_impl.h' line='87' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4864'>
        <var-decl name='zfs_props_table' type-id='type-id-30' visibility='default' filepath='../../include/libzfs_impl.h' line='88' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='libzfs_handle' size-in-bits='18240' is-struct='yes' visibility='default' filepath='../../include/libzfs_impl.h' line='48' column='1' id='type-id-31'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='libzfs_error' type-id='type-id-1' visibility='default' filepath='../../include/libzfs_impl.h' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='libzfs_fd' type-id='type-id-1' visibility='default' filepath='../../include/libzfs_impl.h' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='libzfs_pool_handles' type-id='type-id-24' visibility='default' filepath='../../include/libzfs_impl.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='libzfs_ns_avlpool' type-id='type-id-4' visibility='default' filepath='../../include/libzfs_impl.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='libzfs_ns_avl' type-id='type-id-5' visibility='default' filepath='../../include/libzfs_impl.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='libzfs_ns_gen' type-id='type-id-32' visibility='default' filepath='../../include/libzfs_impl.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='libzfs_desc_active' type-id='type-id-1' visibility='default' filepath='../../include/libzfs_impl.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='libzfs_action' type-id='type-id-33' visibility='default' filepath='../../include/libzfs_impl.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8544'>
        <var-decl name='libzfs_desc' type-id='type-id-33' visibility='default' filepath='../../include/libzfs_impl.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16736'>
        <var-decl name='libzfs_printerr' type-id='type-id-1' visibility='default' filepath='../../include/libzfs_impl.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16768'>
        <var-decl name='libzfs_mnttab_enable' type-id='type-id-6' visibility='default' filepath='../../include/libzfs_impl.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16832'>
        <var-decl name='libzfs_mnttab_cache_lock' type-id='type-id-34' visibility='default' filepath='../../include/libzfs_impl.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17152'>
        <var-decl name='libzfs_mnttab_cache' type-id='type-id-35' visibility='default' filepath='../../include/libzfs_impl.h' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17472'>
        <var-decl name='libzfs_pool_iter' type-id='type-id-1' visibility='default' filepath='../../include/libzfs_impl.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17504'>
        <var-decl name='libzfs_prop_debug' type-id='type-id-6' visibility='default' filepath='../../include/libzfs_impl.h' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17536'>
        <var-decl name='libzfs_urire' type-id='type-id-36' visibility='default' filepath='../../include/libzfs_impl.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='18048'>
        <var-decl name='libzfs_max_nvlist' type-id='type-id-32' visibility='default' filepath='../../include/libzfs_impl.h' line='71' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='18112'>
        <var-decl name='libfetch' type-id='type-id-21' visibility='default' filepath='../../include/libzfs_impl.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='18176'>
        <var-decl name='libfetch_load_error' type-id='type-id-29' visibility='default' filepath='../../include/libzfs_impl.h' line='73' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='zpool_handle' size-in-bits='2560' is-struct='yes' visibility='default' filepath='../../include/libzfs_impl.h' line='97' column='1' id='type-id-37'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='zpool_hdl' type-id='type-id-23' visibility='default' filepath='../../include/libzfs_impl.h' line='98' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='zpool_next' type-id='type-id-24' visibility='default' filepath='../../include/libzfs_impl.h' line='99' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='zpool_name' type-id='type-id-25' visibility='default' filepath='../../include/libzfs_impl.h' line='100' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='zpool_state' type-id='type-id-1' visibility='default' filepath='../../include/libzfs_impl.h' line='101' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <var-decl name='zpool_config_size' type-id='type-id-38' visibility='default' filepath='../../include/libzfs_impl.h' line='102' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2304'>
        <var-decl name='zpool_config' type-id='type-id-28' visibility='default' filepath='../../include/libzfs_impl.h' line='103' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2368'>
        <var-decl name='zpool_old_config' type-id='type-id-28' visibility='default' filepath='../../include/libzfs_impl.h' line='104' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2432'>
        <var-decl name='zpool_props' type-id='type-id-28' visibility='default' filepath='../../include/libzfs_impl.h' line='105' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2496'>
        <var-decl name='zpool_start_block' type-id='type-id-39' visibility='default' filepath='../../include/libzfs_impl.h' line='106' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='libzfs_handle_t' type-id='type-id-31' filepath='../../include/libzfs.h' line='197' column='1' id='type-id-40'/>
    <pointer-type-def type-id='type-id-40' size-in-bits='64' id='type-id-23'/>
    <typedef-decl name='zpool_handle_t' type-id='type-id-37' filepath='../../include/libzfs.h' line='196' column='1' id='type-id-41'/>
    <pointer-type-def type-id='type-id-41' size-in-bits='64' id='type-id-24'/>
    <type-decl name='char' size-in-bits='8' id='type-id-42'/>
    <type-decl name='__ARRAY_SIZE_TYPE__' size-in-bits='64' id='type-id-43'/>

    <array-type-def dimensions='1' type-id='type-id-42' size-in-bits='2048' id='type-id-25'>
      <subrange length='256' type-id='type-id-43' id='type-id-44'/>

    </array-type-def>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-45'/>
    <typedef-decl name='size_t' type-id='type-id-45' filepath='/usr/lib/llvm-13/lib/clang/13.0.0/include/stddef.h' line='46' column='1' id='type-id-38'/>
    <class-decl name='nvlist' size-in-bits='192' is-struct='yes' visibility='default' filepath='../../include/sys/nvpair.h' line='85' column='1' id='type-id-46'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nvl_version' type-id='type-id-47' visibility='default' filepath='../../include/sys/nvpair.h' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='nvl_nvflag' type-id='type-id-48' visibility='default' filepath='../../include/sys/nvpair.h' line='87' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='nvl_priv' type-id='type-id-32' visibility='default' filepath='../../include/sys/nvpair.h' line='88' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='nvl_flag' type-id='type-id-48' visibility='default' filepath='../../include/sys/nvpair.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='nvl_pad' type-id='type-id-47' visibility='default' filepath='../../include/sys/nvpair.h' line='90' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__int32_t' type-id='type-id-1' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='40' column='1' id='type-id-49'/>
    <typedef-decl name='int32_t' type-id='type-id-49' filepath='/usr/include/x86_64-linux-gnu/bits/stdint-intn.h' line='26' column='1' id='type-id-47'/>
    <typedef-decl name='__uint32_t' type-id='type-id-19' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='41' column='1' id='type-id-50'/>
    <typedef-decl name='uint32_t' type-id='type-id-50' filepath='/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h' line='26' column='1' id='type-id-48'/>
    <typedef-decl name='__uint64_t' type-id='type-id-45' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='44' column='1' id='type-id-51'/>
    <typedef-decl name='uint64_t' type-id='type-id-51' filepath='/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h' line='27' column='1' id='type-id-32'/>
    <typedef-decl name='nvlist_t' type-id='type-id-46' filepath='../../include/sys/nvpair.h' line='91' column='1' id='type-id-52'/>
    <pointer-type-def type-id='type-id-52' size-in-bits='64' id='type-id-28'/>
    <type-decl name='long long int' size-in-bits='64' id='type-id-53'/>
    <typedef-decl name='longlong_t' type-id='type-id-53' filepath='../../lib/libspl/include/sys/stdtypes.h' line='36' column='1' id='type-id-54'/>
    <typedef-decl name='diskaddr_t' type-id='type-id-54' filepath='../../lib/libspl/include/sys/stdtypes.h' line='41' column='1' id='type-id-39'/>

    <array-type-def dimensions='1' type-id='type-id-42' size-in-bits='8192' id='type-id-33'>
      <subrange length='1024' type-id='type-id-43' id='type-id-55'/>

    </array-type-def>
    <union-decl name='__anonymous_union__' size-in-bits='320' is-anonymous='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='67' column='1' id='type-id-56'>
      <data-member access='private'>
        <var-decl name='__data' type-id='type-id-57' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='69' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='__size' type-id='type-id-58' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='70' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='__align' type-id='type-id-59' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='71' column='1'/>
      </data-member>
    </union-decl>
    <class-decl name='__pthread_mutex_s' size-in-bits='320' is-struct='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='118' column='1' id='type-id-57'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__lock' type-id='type-id-1' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='120' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='__count' type-id='type-id-19' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='121' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__owner' type-id='type-id-1' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='122' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='__nusers' type-id='type-id-19' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='124' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='__kind' type-id='type-id-1' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='148' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='__spins' type-id='type-id-60' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='154' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='176'>
        <var-decl name='__elision' type-id='type-id-60' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='154' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='__list' type-id='type-id-61' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='155' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='short int' size-in-bits='16' id='type-id-60'/>
    <class-decl name='__pthread_internal_list' size-in-bits='128' is-struct='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='82' column='1' id='type-id-62'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__prev' type-id='type-id-63' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__next' type-id='type-id-63' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='85' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-62' size-in-bits='64' id='type-id-63'/>
    <typedef-decl name='__pthread_list_t' type-id='type-id-62' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='86' column='1' id='type-id-61'/>

    <array-type-def dimensions='1' type-id='type-id-42' size-in-bits='320' id='type-id-58'>
      <subrange length='40' type-id='type-id-43' id='type-id-64'/>

    </array-type-def>
    <type-decl name='long int' size-in-bits='64' id='type-id-59'/>
    <typedef-decl name='pthread_mutex_t' type-id='type-id-56' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='72' column='1' id='type-id-34'/>
    <class-decl name='avl_tree' size-in-bits='320' is-struct='yes' visibility='default' filepath='../../include/sys/avl_impl.h' line='146' column='1' id='type-id-65'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='avl_root' type-id='type-id-66' visibility='default' filepath='../../include/sys/avl_impl.h' line='147' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='avl_compar' type-id='type-id-67' visibility='default' filepath='../../include/sys/avl_impl.h' line='148' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='avl_offset' type-id='type-id-38' visibility='default' filepath='../../include/sys/avl_impl.h' line='149' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='avl_numnodes' type-id='type-id-68' visibility='default' filepath='../../include/sys/avl_impl.h' line='150' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='avl_size' type-id='type-id-38' visibility='default' filepath='../../include/sys/avl_impl.h' line='151' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='avl_node' size-in-bits='192' is-struct='yes' visibility='default' filepath='../../include/sys/avl_impl.h' line='90' column='1' id='type-id-69'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='avl_child' type-id='type-id-70' visibility='default' filepath='../../include/sys/avl_impl.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='avl_pcb' type-id='type-id-71' visibility='default' filepath='../../include/sys/avl_impl.h' line='92' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-69' size-in-bits='64' id='type-id-66'/>

    <array-type-def dimensions='1' type-id='type-id-66' size-in-bits='128' id='type-id-70'>
      <subrange length='2' type-id='type-id-43' id='type-id-72'/>

    </array-type-def>
    <typedef-decl name='uintptr_t' type-id='type-id-45' filepath='/usr/include/stdint.h' line='90' column='1' id='type-id-71'/>
    <pointer-type-def type-id='type-id-73' size-in-bits='64' id='type-id-67'/>
    <typedef-decl name='ulong_t' type-id='type-id-45' filepath='../../lib/libspl/include/sys/stdtypes.h' line='34' column='1' id='type-id-68'/>
    <typedef-decl name='avl_tree_t' type-id='type-id-65' filepath='../../include/sys/avl.h' line='119' column='1' id='type-id-35'/>
    <class-decl name='re_pattern_buffer' size-in-bits='512' is-struct='yes' visibility='default' filepath='/usr/include/regex.h' line='413' column='1' id='type-id-74'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='buffer' type-id='type-id-75' visibility='default' filepath='/usr/include/regex.h' line='417' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='allocated' type-id='type-id-76' visibility='default' filepath='/usr/include/regex.h' line='420' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='used' type-id='type-id-76' visibility='default' filepath='/usr/include/regex.h' line='423' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='syntax' type-id='type-id-77' visibility='default' filepath='/usr/include/regex.h' line='426' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='fastmap' type-id='type-id-29' visibility='default' filepath='/usr/include/regex.h' line='431' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='translate' type-id='type-id-78' visibility='default' filepath='/usr/include/regex.h' line='437' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='re_nsub' type-id='type-id-38' visibility='default' filepath='/usr/include/regex.h' line='440' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31'>
        <var-decl name='can_be_null' type-id='type-id-19' visibility='default' filepath='/usr/include/regex.h' line='446' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='29'>
        <var-decl name='regs_allocated' type-id='type-id-19' visibility='default' filepath='/usr/include/regex.h' line='457' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='28'>
        <var-decl name='fastmap_accurate' type-id='type-id-19' visibility='default' filepath='/usr/include/regex.h' line='461' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='27'>
        <var-decl name='no_sub' type-id='type-id-19' visibility='default' filepath='/usr/include/regex.h' line='465' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='26'>
        <var-decl name='not_bol' type-id='type-id-19' visibility='default' filepath='/usr/include/regex.h' line='469' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='25'>
        <var-decl name='not_eol' type-id='type-id-19' visibility='default' filepath='/usr/include/regex.h' line='472' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='newline_anchor' type-id='type-id-19' visibility='default' filepath='/usr/include/regex.h' line='475' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='re_dfa_t' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-79'/>
    <pointer-type-def type-id='type-id-79' size-in-bits='64' id='type-id-75'/>
    <typedef-decl name='__re_long_size_t' type-id='type-id-45' filepath='/usr/include/regex.h' line='56' column='1' id='type-id-76'/>
    <typedef-decl name='reg_syntax_t' type-id='type-id-45' filepath='/usr/include/regex.h' line='72' column='1' id='type-id-77'/>
    <pointer-type-def type-id='type-id-42' size-in-bits='64' id='type-id-29'/>
    <type-decl name='unsigned char' size-in-bits='8' id='type-id-80'/>
    <pointer-type-def type-id='type-id-80' size-in-bits='64' id='type-id-78'/>
    <typedef-decl name='regex_t' type-id='type-id-74' filepath='/usr/include/regex.h' line='478' column='1' id='type-id-36'/>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' filepath='../../include/sys/fs/zfs.h' line='52' column='1' id='type-id-81'>
      <underlying-type type-id='type-id-7'/>
      <enumerator name='ZFS_TYPE_FILESYSTEM' value='1'/>
      <enumerator name='ZFS_TYPE_SNAPSHOT' value='2'/>
      <enumerator name='ZFS_TYPE_VOLUME' value='4'/>
      <enumerator name='ZFS_TYPE_POOL' value='8'/>
      <enumerator name='ZFS_TYPE_BOOKMARK' value='16'/>
    </enum-decl>
    <typedef-decl name='zfs_type_t' type-id='type-id-81' filepath='../../include/sys/fs/zfs.h' line='58' column='1' id='type-id-26'/>
    <class-decl name='dmu_objset_stats' size-in-bits='2304' is-struct='yes' visibility='default' filepath='../../include/sys/dmu.h' line='931' column='1' id='type-id-82'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='dds_num_clones' type-id='type-id-32' visibility='default' filepath='../../include/sys/dmu.h' line='932' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='dds_creation_txg' type-id='type-id-32' visibility='default' filepath='../../include/sys/dmu.h' line='933' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='dds_guid' type-id='type-id-32' visibility='default' filepath='../../include/sys/dmu.h' line='934' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='dds_type' type-id='type-id-83' visibility='default' filepath='../../include/sys/dmu.h' line='935' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='dds_is_snapshot' type-id='type-id-84' visibility='default' filepath='../../include/sys/dmu.h' line='936' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='232'>
        <var-decl name='dds_inconsistent' type-id='type-id-84' visibility='default' filepath='../../include/sys/dmu.h' line='937' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='240'>
        <var-decl name='dds_redacted' type-id='type-id-84' visibility='default' filepath='../../include/sys/dmu.h' line='938' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='248'>
        <var-decl name='dds_origin' type-id='type-id-25' visibility='default' filepath='../../include/sys/dmu.h' line='939' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='dmu_objset_type' filepath='../../include/sys/fs/zfs.h' line='64' column='1' id='type-id-85'>
      <underlying-type type-id='type-id-7'/>
      <enumerator name='DMU_OST_NONE' value='0'/>
      <enumerator name='DMU_OST_META' value='1'/>
      <enumerator name='DMU_OST_ZFS' value='2'/>
      <enumerator name='DMU_OST_ZVOL' value='3'/>
      <enumerator name='DMU_OST_OTHER' value='4'/>
      <enumerator name='DMU_OST_ANY' value='5'/>
      <enumerator name='DMU_OST_NUMTYPES' value='6'/>
    </enum-decl>
    <typedef-decl name='dmu_objset_type_t' type-id='type-id-85' filepath='../../include/sys/fs/zfs.h' line='72' column='1' id='type-id-83'/>
    <typedef-decl name='__uint8_t' type-id='type-id-80' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='37' column='1' id='type-id-86'/>
    <typedef-decl name='uint8_t' type-id='type-id-86' filepath='/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h' line='24' column='1' id='type-id-84'/>
    <typedef-decl name='dmu_objset_stats_t' type-id='type-id-82' filepath='../../include/sys/dmu.h' line='940' column='1' id='type-id-27'/>
    <pointer-type-def type-id='type-id-84' size-in-bits='64' id='type-id-30'/>
    <pointer-type-def type-id='type-id-22' size-in-bits='64' id='type-id-87'/>
    <qualified-type-def type-id='type-id-42' const='yes' id='type-id-88'/>
    <pointer-type-def type-id='type-id-88' size-in-bits='64' id='type-id-89'/>
    <function-decl name='zfs_unmount' filepath='../../include/libzfs.h' line='827' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-87'/>
      <parameter type-id='type-id-89'/>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='zfs_unshare_smb' filepath='../../include/libzfs.h' line='853' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-87'/>
      <parameter type-id='type-id-89'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='zfs_commit_smb_shares' filepath='../../include/libzfs.h' line='862' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='uu_avl_walk_end' filepath='../../include/libuutil.h' line='340' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-17'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='changelist_postfix' mangled-name='changelist_postfix' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_changelist.c' line='170' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='changelist_postfix'>
      <parameter type-id='type-id-15' name='clp' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_changelist.c' line='170' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='uu_avl_last' filepath='../../include/libuutil.h' line='331' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-18'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='remove_mountpoint' filepath='../../include/libzfs_impl.h' line='191' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-87'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='zfs_share_smb' filepath='../../include/libzfs.h' line='850' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-87'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='zfs_refresh_properties' filepath='../../include/libzfs.h' line='810' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-87'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' filepath='../../include/sys/fs/zfs.h' line='259' column='1' id='type-id-90'>
      <underlying-type type-id='type-id-7'/>
      <enumerator name='ZPROP_SRC_NONE' value='1'/>
      <enumerator name='ZPROP_SRC_DEFAULT' value='2'/>
      <enumerator name='ZPROP_SRC_TEMPORARY' value='4'/>
      <enumerator name='ZPROP_SRC_LOCAL' value='8'/>
      <enumerator name='ZPROP_SRC_INHERITED' value='16'/>
      <enumerator name='ZPROP_SRC_RECEIVED' value='32'/>
    </enum-decl>
    <pointer-type-def type-id='type-id-90' size-in-bits='64' id='type-id-91'/>
    <function-decl name='zfs_prop_get' filepath='../../include/libzfs.h' line='494' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-87'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-29'/>
      <parameter type-id='type-id-45'/>
      <parameter type-id='type-id-91'/>
      <parameter type-id='type-id-29'/>
      <parameter type-id='type-id-45'/>
      <parameter type-id='type-id-13'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='zfs_prop_get_int' filepath='../../include/libzfs.h' line='511' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-87'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-45'/>
    </function-decl>
    <pointer-type-def type-id='type-id-29' size-in-bits='64' id='type-id-92'/>
    <function-decl name='zfs_is_mounted' filepath='../../include/libzfs.h' line='824' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-87'/>
      <parameter type-id='type-id-92'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='zfs_mount' filepath='../../include/libzfs.h' line='825' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-87'/>
      <parameter type-id='type-id-89'/>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='zfs_share_nfs' filepath='../../include/libzfs.h' line='849' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-87'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='zfs_unshare_nfs' filepath='../../include/libzfs.h' line='852' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-87'/>
      <parameter type-id='type-id-89'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='zfs_commit_nfs_shares' filepath='../../include/libzfs.h' line='861' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='isa_child_of' mangled-name='isa_child_of' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_changelist.c' line='288' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='isa_child_of'>
      <parameter type-id='type-id-89' name='dataset' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_changelist.c' line='288' column='1'/>
      <parameter type-id='type-id-89' name='parent' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_changelist.c' line='288' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='changelist_rename' mangled-name='changelist_rename' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_changelist.c' line='311' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='changelist_rename'>
      <parameter type-id='type-id-15' name='clp' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_changelist.c' line='311' column='1'/>
      <parameter type-id='type-id-89' name='src' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_changelist.c' line='311' column='1'/>
      <parameter type-id='type-id-89' name='dst' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_changelist.c' line='311' column='1'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='strlcpy' filepath='../../lib/libspl/include/string.h' line='37' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-29'/>
      <parameter type-id='type-id-89'/>
      <parameter type-id='type-id-45'/>
      <return type-id='type-id-45'/>
    </function-decl>
    <function-decl name='strlcat' filepath='../../lib/libspl/include/string.h' line='33' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-29'/>
      <parameter type-id='type-id-89'/>
      <parameter type-id='type-id-45'/>
      <return type-id='type-id-45'/>
    </function-decl>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' filepath='../../include/libzfs_impl.h' line='109' column='1' id='type-id-93'>
      <underlying-type type-id='type-id-7'/>
      <enumerator name='PROTO_NFS' value='0'/>
      <enumerator name='PROTO_SMB' value='1'/>
      <enumerator name='PROTO_END' value='2'/>
    </enum-decl>
    <typedef-decl name='zfs_share_proto_t' type-id='type-id-93' filepath='../../include/libzfs_impl.h' line='113' column='1' id='type-id-94'/>
    <pointer-type-def type-id='type-id-94' size-in-bits='64' id='type-id-95'/>
    <function-decl name='changelist_unshare' mangled-name='changelist_unshare' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_changelist.c' line='348' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='changelist_unshare'>
      <parameter type-id='type-id-15' name='clp' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_changelist.c' line='348' column='1'/>
      <parameter type-id='type-id-95' name='proto' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_changelist.c' line='348' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='zfs_unshare_proto' filepath='../../include/libzfs_impl.h' line='210' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-87'/>
      <parameter type-id='type-id-89'/>
      <parameter type-id='type-id-91'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='zfs_commit_proto' filepath='../../include/libzfs_impl.h' line='259' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-91'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='changelist_haszonedchild' mangled-name='changelist_haszonedchild' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_changelist.c' line='378' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='changelist_haszonedchild'>
      <parameter type-id='type-id-15' name='clp' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_changelist.c' line='378' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='changelist_remove' mangled-name='changelist_remove' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_changelist.c' line='387' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='changelist_remove'>
      <parameter type-id='type-id-15' name='clp' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_changelist.c' line='387' column='1'/>
      <parameter type-id='type-id-89' name='name' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_changelist.c' line='387' column='1'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='uu_avl_remove' filepath='../../include/libuutil.h' line='350' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-21'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='zfs_close' filepath='../../include/libzfs.h' line='469' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-87'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='changelist_free' mangled-name='changelist_free' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_changelist.c' line='412' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='changelist_free'>
      <parameter type-id='type-id-15' name='clp' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_changelist.c' line='412' column='1'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='uu_avl_destroy' filepath='../../include/libuutil.h' line='326' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-18'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <pointer-type-def type-id='type-id-9' size-in-bits='64' id='type-id-96'/>
    <function-decl name='uu_avl_pool_destroy' filepath='../../include/libuutil.h' line='308' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-96'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <typedef-decl name='zfs_handle_t' type-id='type-id-22' filepath='../../include/libzfs.h' line='195' column='1' id='type-id-97'/>
    <pointer-type-def type-id='type-id-97' size-in-bits='64' id='type-id-98'/>
    <function-decl name='changelist_gather' mangled-name='changelist_gather' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_changelist.c' line='624' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='changelist_gather'>
      <parameter type-id='type-id-98' name='zhp' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_changelist.c' line='624' column='1'/>
      <parameter type-id='type-id-3' name='prop' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_changelist.c' line='624' column='1'/>
      <parameter type-id='type-id-1' name='gather_flags' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_changelist.c' line='624' column='1'/>
      <parameter type-id='type-id-1' name='mnt_flags' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_changelist.c' line='625' column='1'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <pointer-type-def type-id='type-id-31' size-in-bits='64' id='type-id-99'/>
    <function-decl name='zfs_alloc' filepath='../../include/libzfs_impl.h' line='138' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-99'/>
      <parameter type-id='type-id-45'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <pointer-type-def type-id='type-id-100' size-in-bits='64' id='type-id-101'/>
    <function-decl name='uu_avl_pool_create' filepath='../../include/libuutil.h' line='304' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-89'/>
      <parameter type-id='type-id-45'/>
      <parameter type-id='type-id-45'/>
      <parameter type-id='type-id-101'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-96'/>
    </function-decl>
    <function-decl name='uu_avl_create' filepath='../../include/libuutil.h' line='323' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-96'/>
      <parameter type-id='type-id-21'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='zfs_error' filepath='../../include/libzfs_impl.h' line='135' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-99'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-89'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <pointer-type-def type-id='type-id-102' size-in-bits='64' id='type-id-103'/>
    <function-decl name='zfs_iter_dependents' filepath='../../include/libzfs.h' line='615' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-87'/>
      <parameter type-id='type-id-13'/>
      <parameter type-id='type-id-103'/>
      <parameter type-id='type-id-21'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='zfs_iter_mounted' filepath='../../include/libzfs.h' line='623' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-87'/>
      <parameter type-id='type-id-103'/>
      <parameter type-id='type-id-21'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='zfs_iter_children' filepath='../../include/libzfs.h' line='614' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-87'/>
      <parameter type-id='type-id-103'/>
      <parameter type-id='type-id-21'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <qualified-type-def type-id='type-id-22' const='yes' id='type-id-104'/>
    <pointer-type-def type-id='type-id-104' size-in-bits='64' id='type-id-105'/>
    <function-decl name='zfs_get_name' filepath='../../include/libzfs.h' line='471' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-105'/>
      <return type-id='type-id-89'/>
    </function-decl>
    <function-decl name='zfs_open' filepath='../../include/libzfs.h' line='467' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-99'/>
      <parameter type-id='type-id-89'/>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-87'/>
    </function-decl>
    <function-decl name='zfs_is_shared' filepath='../../include/libzfs.h' line='840' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-87'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <class-decl name='uu_avl_node' size-in-bits='192' is-struct='yes' visibility='default' filepath='../../include/libuutil.h' line='262' column='1' id='type-id-106'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='uan_opaque' type-id='type-id-107' visibility='default' filepath='../../include/libuutil.h' line='264' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-71' size-in-bits='192' id='type-id-107'>
      <subrange length='3' type-id='type-id-43' id='type-id-108'/>

    </array-type-def>
    <pointer-type-def type-id='type-id-106' size-in-bits='64' id='type-id-109'/>
    <function-decl name='uu_avl_node_init' filepath='../../include/libuutil.h' line='320' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-21'/>
      <parameter type-id='type-id-109'/>
      <parameter type-id='type-id-96'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <pointer-type-def type-id='type-id-45' size-in-bits='64' id='type-id-110'/>
    <function-decl name='uu_avl_find' filepath='../../include/libuutil.h' line='342' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-21'/>
      <parameter type-id='type-id-21'/>
      <parameter type-id='type-id-110'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='uu_avl_insert' filepath='../../include/libuutil.h' line='343' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-21'/>
      <parameter type-id='type-id-45'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='zfs_get_handle' filepath='../../include/libzfs.h' line='210' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-87'/>
      <return type-id='type-id-99'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-73'>
      <parameter type-id='type-id-21'/>
      <parameter type-id='type-id-21'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-100'>
      <parameter type-id='type-id-21'/>
      <parameter type-id='type-id-21'/>
      <parameter type-id='type-id-21'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-102'>
      <parameter type-id='type-id-87'/>
      <parameter type-id='type-id-21'/>
      <return type-id='type-id-1'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='libzfs_config.c' comp-dir-path='/home/nabijaczleweli/store/code/zfs/lib/libzfs' language='LANG_C99'>
    <function-decl name='zpool_skip_pool' mangled-name='zpool_skip_pool' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_config.c' line='340' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_skip_pool'>
      <parameter type-id='type-id-89' name='poolname' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_config.c' line='340' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='namespace_clear' mangled-name='namespace_clear' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_config.c' line='79' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='namespace_clear'>
      <parameter type-id='type-id-23' name='hdl' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_config.c' line='79' column='1'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <pointer-type-def type-id='type-id-21' size-in-bits='64' id='type-id-111'/>
    <function-decl name='uu_avl_teardown' filepath='../../include/libuutil.h' line='348' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-111'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <pointer-type-def type-id='type-id-46' size-in-bits='64' id='type-id-112'/>
    <function-decl name='nvlist_free' filepath='../../include/sys/nvpair.h' line='152' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-112'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <pointer-type-def type-id='type-id-28' size-in-bits='64' id='type-id-113'/>
    <function-decl name='zpool_get_config' mangled-name='zpool_get_config' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_config.c' line='220' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_get_config'>
      <parameter type-id='type-id-24' name='zhp' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_config.c' line='220' column='1'/>
      <parameter type-id='type-id-113' name='oldconfig' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_config.c' line='220' column='1'/>
      <return type-id='type-id-28'/>
    </function-decl>
    <function-decl name='zpool_get_features' mangled-name='zpool_get_features' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_config.c' line='232' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_get_features'>
      <parameter type-id='type-id-24' name='zhp' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_config.c' line='232' column='1'/>
      <return type-id='type-id-28'/>
    </function-decl>
    <function-decl name='nvlist_exists' filepath='../../include/sys/nvpair.h' line='238' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-112'/>
      <parameter type-id='type-id-89'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <pointer-type-def type-id='type-id-6' size-in-bits='64' id='type-id-114'/>
    <function-decl name='zpool_refresh_stats' mangled-name='zpool_refresh_stats' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_config.c' line='265' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_refresh_stats'>
      <parameter type-id='type-id-24' name='zhp' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_config.c' line='265' column='1'/>
      <parameter type-id='type-id-114' name='missing' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_config.c' line='265' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <pointer-type-def type-id='type-id-112' size-in-bits='64' id='type-id-115'/>
    <function-decl name='nvlist_lookup_nvlist' filepath='../../include/sys/nvpair.h' line='214' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-112'/>
      <parameter type-id='type-id-89'/>
      <parameter type-id='type-id-115'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <class-decl name='zfs_cmd' size-in-bits='109952' is-struct='yes' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='477' column='1' id='type-id-116'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='zc_name' type-id='type-id-117' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='478' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32768'>
        <var-decl name='zc_nvlist_src' type-id='type-id-32' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='479' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32832'>
        <var-decl name='zc_nvlist_src_size' type-id='type-id-32' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='480' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32896'>
        <var-decl name='zc_nvlist_dst' type-id='type-id-32' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='481' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32960'>
        <var-decl name='zc_nvlist_dst_size' type-id='type-id-32' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='482' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='33024'>
        <var-decl name='zc_nvlist_dst_filled' type-id='type-id-6' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='483' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='33056'>
        <var-decl name='zc_pad2' type-id='type-id-1' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='484' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='33088'>
        <var-decl name='zc_history' type-id='type-id-32' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='490' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='33152'>
        <var-decl name='zc_value' type-id='type-id-118' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='491' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='98688'>
        <var-decl name='zc_string' type-id='type-id-25' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='492' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='100736'>
        <var-decl name='zc_guid' type-id='type-id-32' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='493' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='100800'>
        <var-decl name='zc_nvlist_conf' type-id='type-id-32' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='494' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='100864'>
        <var-decl name='zc_nvlist_conf_size' type-id='type-id-32' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='495' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='100928'>
        <var-decl name='zc_cookie' type-id='type-id-32' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='496' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='100992'>
        <var-decl name='zc_objset_type' type-id='type-id-32' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='497' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='101056'>
        <var-decl name='zc_perm_action' type-id='type-id-32' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='498' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='101120'>
        <var-decl name='zc_history_len' type-id='type-id-32' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='499' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='101184'>
        <var-decl name='zc_history_offset' type-id='type-id-32' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='500' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='101248'>
        <var-decl name='zc_obj' type-id='type-id-32' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='501' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='101312'>
        <var-decl name='zc_iflags' type-id='type-id-32' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='502' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='101376'>
        <var-decl name='zc_share' type-id='type-id-119' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='503' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='101632'>
        <var-decl name='zc_objset_stats' type-id='type-id-27' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='504' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='103936'>
        <var-decl name='zc_begin_record' type-id='type-id-120' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='505' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='106368'>
        <var-decl name='zc_inject_record' type-id='type-id-121' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='506' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109184'>
        <var-decl name='zc_defer_destroy' type-id='type-id-48' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='507' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109216'>
        <var-decl name='zc_flags' type-id='type-id-48' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='508' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109248'>
        <var-decl name='zc_action_handle' type-id='type-id-32' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='509' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109312'>
        <var-decl name='zc_cleanup_fd' type-id='type-id-1' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='510' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109344'>
        <var-decl name='zc_simple' type-id='type-id-84' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='511' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109352'>
        <var-decl name='zc_pad' type-id='type-id-122' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='512' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109376'>
        <var-decl name='zc_sendobj' type-id='type-id-32' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='513' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109440'>
        <var-decl name='zc_fromobj' type-id='type-id-32' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='514' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109504'>
        <var-decl name='zc_createtxg' type-id='type-id-32' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='515' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109568'>
        <var-decl name='zc_stat' type-id='type-id-123' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='516' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109888'>
        <var-decl name='zc_zoneid' type-id='type-id-32' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='517' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-42' size-in-bits='32768' id='type-id-117'>
      <subrange length='4096' type-id='type-id-43' id='type-id-124'/>

    </array-type-def>

    <array-type-def dimensions='1' type-id='type-id-42' size-in-bits='65536' id='type-id-118'>
      <subrange length='8192' type-id='type-id-43' id='type-id-125'/>

    </array-type-def>
    <class-decl name='zfs_share' size-in-bits='256' is-struct='yes' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='452' column='1' id='type-id-126'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='z_exportdata' type-id='type-id-32' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='453' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='z_sharedata' type-id='type-id-32' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='454' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='z_sharetype' type-id='type-id-32' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='455' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='z_sharemax' type-id='type-id-32' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='456' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='zfs_share_t' type-id='type-id-126' filepath='../../include/sys/zfs_ioctl.h' line='457' column='1' id='type-id-119'/>
    <class-decl name='drr_begin' size-in-bits='2432' is-struct='yes' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='231' column='1' id='type-id-120'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='drr_magic' type-id='type-id-32' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='232' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='drr_versioninfo' type-id='type-id-32' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='233' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='drr_creation_time' type-id='type-id-32' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='234' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='drr_type' type-id='type-id-83' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='235' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='drr_flags' type-id='type-id-48' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='236' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='drr_toguid' type-id='type-id-32' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='237' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='drr_fromguid' type-id='type-id-32' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='238' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='drr_toname' type-id='type-id-25' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='239' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='zinject_record' size-in-bits='2816' is-struct='yes' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='403' column='1' id='type-id-127'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='zi_objset' type-id='type-id-32' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='404' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='zi_object' type-id='type-id-32' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='405' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='zi_start' type-id='type-id-32' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='406' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='zi_end' type-id='type-id-32' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='407' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='zi_guid' type-id='type-id-32' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='408' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='zi_level' type-id='type-id-48' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='409' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='zi_error' type-id='type-id-48' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='410' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='zi_type' type-id='type-id-32' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='411' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='zi_freq' type-id='type-id-48' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='412' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='zi_failfast' type-id='type-id-48' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='413' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='zi_func' type-id='type-id-25' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='414' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2560'>
        <var-decl name='zi_iotype' type-id='type-id-48' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='415' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2592'>
        <var-decl name='zi_duration' type-id='type-id-47' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='416' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2624'>
        <var-decl name='zi_timer' type-id='type-id-32' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='417' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2688'>
        <var-decl name='zi_nlanes' type-id='type-id-32' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='418' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2752'>
        <var-decl name='zi_cmd' type-id='type-id-48' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='419' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2784'>
        <var-decl name='zi_dvas' type-id='type-id-48' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='420' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='zinject_record_t' type-id='type-id-127' filepath='../../include/sys/zfs_ioctl.h' line='421' column='1' id='type-id-121'/>

    <array-type-def dimensions='1' type-id='type-id-84' size-in-bits='24' id='type-id-122'>
      <subrange length='3' type-id='type-id-43' id='type-id-108'/>

    </array-type-def>
    <class-decl name='zfs_stat' size-in-bits='320' is-struct='yes' visibility='default' filepath='../../include/sys/zfs_stat.h' line='42' column='1' id='type-id-128'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='zs_gen' type-id='type-id-32' visibility='default' filepath='../../include/sys/zfs_stat.h' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='zs_mode' type-id='type-id-32' visibility='default' filepath='../../include/sys/zfs_stat.h' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='zs_links' type-id='type-id-32' visibility='default' filepath='../../include/sys/zfs_stat.h' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='zs_ctime' type-id='type-id-129' visibility='default' filepath='../../include/sys/zfs_stat.h' line='46' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-32' size-in-bits='128' id='type-id-129'>
      <subrange length='2' type-id='type-id-43' id='type-id-72'/>

    </array-type-def>
    <typedef-decl name='zfs_stat_t' type-id='type-id-128' filepath='../../include/sys/zfs_stat.h' line='47' column='1' id='type-id-123'/>
    <pointer-type-def type-id='type-id-116' size-in-bits='64' id='type-id-130'/>
    <function-decl name='zcmd_alloc_dst_nvlist' filepath='../../include/libzfs_impl.h' line='175' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-99'/>
      <parameter type-id='type-id-130'/>
      <parameter type-id='type-id-45'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='zfs_ioctl' filepath='../../include/libzfs.h' line='455' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-99'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-130'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='zcmd_expand_dst_nvlist' filepath='../../include/libzfs_impl.h' line='178' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-99'/>
      <parameter type-id='type-id-130'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='zcmd_free_nvlists' filepath='../../include/libzfs_impl.h' line='180' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-130'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='zcmd_read_dst_nvlist' filepath='../../include/libzfs_impl.h' line='179' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-99'/>
      <parameter type-id='type-id-130'/>
      <parameter type-id='type-id-115'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='getenv' filepath='/usr/include/stdlib.h' line='631' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-89'/>
      <return type-id='type-id-29'/>
    </function-decl>
    <pointer-type-def type-id='type-id-131' size-in-bits='64' id='type-id-132'/>
    <typedef-decl name='zpool_iter_f' type-id='type-id-132' filepath='../../include/libzfs.h' line='246' column='1' id='type-id-133'/>
    <function-decl name='zpool_iter' mangled-name='zpool_iter' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_config.c' line='389' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_iter'>
      <parameter type-id='type-id-23' name='hdl' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_config.c' line='389' column='1'/>
      <parameter type-id='type-id-133' name='func' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_config.c' line='389' column='1'/>
      <parameter type-id='type-id-21' name='data' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_config.c' line='389' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='uu_avl_first' filepath='../../include/libuutil.h' line='330' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-18'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='uu_avl_next' filepath='../../include/libuutil.h' line='333' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-21'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <pointer-type-def type-id='type-id-37' size-in-bits='64' id='type-id-134'/>
    <pointer-type-def type-id='type-id-134' size-in-bits='64' id='type-id-135'/>
    <function-decl name='zpool_open_silent' filepath='../../include/libzfs_impl.h' line='199' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-99'/>
      <parameter type-id='type-id-89'/>
      <parameter type-id='type-id-135'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='no_memory' filepath='../../include/libzfs_impl.h' line='142' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-99'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <class-decl name='nvpair' size-in-bits='128' is-struct='yes' visibility='default' filepath='../../include/sys/nvpair.h' line='73' column='1' id='type-id-136'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nvp_size' type-id='type-id-47' visibility='default' filepath='../../include/sys/nvpair.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='nvp_name_sz' type-id='type-id-137' visibility='default' filepath='../../include/sys/nvpair.h' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='nvp_reserve' type-id='type-id-137' visibility='default' filepath='../../include/sys/nvpair.h' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='nvp_value_elem' type-id='type-id-47' visibility='default' filepath='../../include/sys/nvpair.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='nvp_type' type-id='type-id-138' visibility='default' filepath='../../include/sys/nvpair.h' line='78' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__int16_t' type-id='type-id-60' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='38' column='1' id='type-id-139'/>
    <typedef-decl name='int16_t' type-id='type-id-139' filepath='/usr/include/x86_64-linux-gnu/bits/stdint-intn.h' line='25' column='1' id='type-id-137'/>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' filepath='../../include/sys/nvpair.h' line='37' column='1' id='type-id-140'>
      <underlying-type type-id='type-id-7'/>
      <enumerator name='DATA_TYPE_DONTCARE' value='-1'/>
      <enumerator name='DATA_TYPE_UNKNOWN' value='0'/>
      <enumerator name='DATA_TYPE_BOOLEAN' value='1'/>
      <enumerator name='DATA_TYPE_BYTE' value='2'/>
      <enumerator name='DATA_TYPE_INT16' value='3'/>
      <enumerator name='DATA_TYPE_UINT16' value='4'/>
      <enumerator name='DATA_TYPE_INT32' value='5'/>
      <enumerator name='DATA_TYPE_UINT32' value='6'/>
      <enumerator name='DATA_TYPE_INT64' value='7'/>
      <enumerator name='DATA_TYPE_UINT64' value='8'/>
      <enumerator name='DATA_TYPE_STRING' value='9'/>
      <enumerator name='DATA_TYPE_BYTE_ARRAY' value='10'/>
      <enumerator name='DATA_TYPE_INT16_ARRAY' value='11'/>
      <enumerator name='DATA_TYPE_UINT16_ARRAY' value='12'/>
      <enumerator name='DATA_TYPE_INT32_ARRAY' value='13'/>
      <enumerator name='DATA_TYPE_UINT32_ARRAY' value='14'/>
      <enumerator name='DATA_TYPE_INT64_ARRAY' value='15'/>
      <enumerator name='DATA_TYPE_UINT64_ARRAY' value='16'/>
      <enumerator name='DATA_TYPE_STRING_ARRAY' value='17'/>
      <enumerator name='DATA_TYPE_HRTIME' value='18'/>
      <enumerator name='DATA_TYPE_NVLIST' value='19'/>
      <enumerator name='DATA_TYPE_NVLIST_ARRAY' value='20'/>
      <enumerator name='DATA_TYPE_BOOLEAN_VALUE' value='21'/>
      <enumerator name='DATA_TYPE_INT8' value='22'/>
      <enumerator name='DATA_TYPE_UINT8' value='23'/>
      <enumerator name='DATA_TYPE_BOOLEAN_ARRAY' value='24'/>
      <enumerator name='DATA_TYPE_INT8_ARRAY' value='25'/>
      <enumerator name='DATA_TYPE_UINT8_ARRAY' value='26'/>
      <enumerator name='DATA_TYPE_DOUBLE' value='27'/>
    </enum-decl>
    <typedef-decl name='data_type_t' type-id='type-id-140' filepath='../../include/sys/nvpair.h' line='71' column='1' id='type-id-138'/>
    <pointer-type-def type-id='type-id-136' size-in-bits='64' id='type-id-141'/>
    <function-decl name='nvlist_next_nvpair' filepath='../../include/sys/nvpair.h' line='242' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-112'/>
      <parameter type-id='type-id-141'/>
      <return type-id='type-id-141'/>
    </function-decl>
    <function-decl name='nvpair_name' filepath='../../include/sys/nvpair.h' line='244' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-141'/>
      <return type-id='type-id-29'/>
    </function-decl>
    <function-decl name='zfs_strdup' filepath='../../include/libzfs_impl.h' line='141' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-99'/>
      <parameter type-id='type-id-89'/>
      <return type-id='type-id-29'/>
    </function-decl>
    <function-decl name='nvpair_value_nvlist' filepath='../../include/sys/nvpair.h' line='258' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-141'/>
      <parameter type-id='type-id-115'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='libspl_assertf' filepath='../../lib/libspl/include/assert.h' line='40' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-89'/>
      <parameter type-id='type-id-89'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-89'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='nvlist_dup' filepath='../../include/sys/nvpair.h' line='156' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-112'/>
      <parameter type-id='type-id-115'/>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='dcgettext' filepath='/usr/include/libintl.h' line='51' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-89'/>
      <parameter type-id='type-id-89'/>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-29'/>
    </function-decl>
    <function-decl name='zfs_standard_error' filepath='../../include/libzfs_impl.h' line='144' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-99'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-89'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <pointer-type-def type-id='type-id-142' size-in-bits='64' id='type-id-143'/>
    <typedef-decl name='zfs_iter_f' type-id='type-id-143' filepath='../../include/libzfs.h' line='612' column='1' id='type-id-144'/>
    <function-decl name='zfs_iter_root' mangled-name='zfs_iter_root' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_config.c' line='434' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_iter_root'>
      <parameter type-id='type-id-23' name='hdl' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_config.c' line='434' column='1'/>
      <parameter type-id='type-id-144' name='func' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_config.c' line='434' column='1'/>
      <parameter type-id='type-id-21' name='data' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_config.c' line='434' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='make_dataset_handle' filepath='../../include/libzfs_impl.h' line='195' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-99'/>
      <parameter type-id='type-id-89'/>
      <return type-id='type-id-87'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-142'>
      <parameter type-id='type-id-98'/>
      <parameter type-id='type-id-21'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-131'>
      <parameter type-id='type-id-24'/>
      <parameter type-id='type-id-21'/>
      <return type-id='type-id-1'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='libzfs_crypto.c' comp-dir-path='/home/nabijaczleweli/store/code/zfs/lib/libzfs' language='LANG_C99'>
    <function-decl name='zfs_crypto_get_encryption_root' mangled-name='zfs_crypto_get_encryption_root' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_crypto.c' line='962' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_crypto_get_encryption_root'>
      <parameter type-id='type-id-98' name='zhp' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_crypto.c' line='962' column='1'/>
      <parameter type-id='type-id-114' name='is_encroot' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_crypto.c' line='962' column='1'/>
      <parameter type-id='type-id-29' name='buf' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_crypto.c' line='963' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <pointer-type-def type-id='type-id-30' size-in-bits='64' id='type-id-145'/>
    <typedef-decl name='uint_t' type-id='type-id-19' filepath='../../lib/libspl/include/sys/stdtypes.h' line='33' column='1' id='type-id-146'/>
    <pointer-type-def type-id='type-id-146' size-in-bits='64' id='type-id-147'/>
    <function-decl name='zfs_crypto_create' mangled-name='zfs_crypto_create' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_crypto.c' line='993' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_crypto_create'>
      <parameter type-id='type-id-23' name='hdl' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_crypto.c' line='993' column='1'/>
      <parameter type-id='type-id-29' name='parent_name' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_crypto.c' line='993' column='1'/>
      <parameter type-id='type-id-28' name='props' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_crypto.c' line='993' column='1'/>
      <parameter type-id='type-id-28' name='pool_props' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_crypto.c' line='994' column='1'/>
      <parameter type-id='type-id-6' name='stdin_available' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_crypto.c' line='994' column='1'/>
      <parameter type-id='type-id-145' name='wkeydata_out' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_crypto.c' line='994' column='1'/>
      <parameter type-id='type-id-147' name='wkeylen_out' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_crypto.c' line='995' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='zfs_prop_to_name' filepath='../../include/libzfs.h' line='491' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-89'/>
    </function-decl>
    <function-decl name='nvlist_lookup_uint64' filepath='../../include/sys/nvpair.h' line='212' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-112'/>
      <parameter type-id='type-id-89'/>
      <parameter type-id='type-id-110'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='nvlist_lookup_string' filepath='../../include/sys/nvpair.h' line='213' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-112'/>
      <parameter type-id='type-id-89'/>
      <parameter type-id='type-id-92'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' filepath='../../include/sys/fs/zfs.h' line='215' column='1' id='type-id-148'>
      <underlying-type type-id='type-id-7'/>
      <enumerator name='ZPOOL_PROP_INVAL' value='-1'/>
      <enumerator name='ZPOOL_PROP_NAME' value='0'/>
      <enumerator name='ZPOOL_PROP_SIZE' value='1'/>
      <enumerator name='ZPOOL_PROP_CAPACITY' value='2'/>
      <enumerator name='ZPOOL_PROP_ALTROOT' value='3'/>
      <enumerator name='ZPOOL_PROP_HEALTH' value='4'/>
      <enumerator name='ZPOOL_PROP_GUID' value='5'/>
      <enumerator name='ZPOOL_PROP_VERSION' value='6'/>
      <enumerator name='ZPOOL_PROP_BOOTFS' value='7'/>
      <enumerator name='ZPOOL_PROP_DELEGATION' value='8'/>
      <enumerator name='ZPOOL_PROP_AUTOREPLACE' value='9'/>
      <enumerator name='ZPOOL_PROP_CACHEFILE' value='10'/>
      <enumerator name='ZPOOL_PROP_FAILUREMODE' value='11'/>
      <enumerator name='ZPOOL_PROP_LISTSNAPS' value='12'/>
      <enumerator name='ZPOOL_PROP_AUTOEXPAND' value='13'/>
      <enumerator name='ZPOOL_PROP_DEDUPDITTO' value='14'/>
      <enumerator name='ZPOOL_PROP_DEDUPRATIO' value='15'/>
      <enumerator name='ZPOOL_PROP_FREE' value='16'/>
      <enumerator name='ZPOOL_PROP_ALLOCATED' value='17'/>
      <enumerator name='ZPOOL_PROP_READONLY' value='18'/>
      <enumerator name='ZPOOL_PROP_ASHIFT' value='19'/>
      <enumerator name='ZPOOL_PROP_COMMENT' value='20'/>
      <enumerator name='ZPOOL_PROP_EXPANDSZ' value='21'/>
      <enumerator name='ZPOOL_PROP_FREEING' value='22'/>
      <enumerator name='ZPOOL_PROP_FRAGMENTATION' value='23'/>
      <enumerator name='ZPOOL_PROP_LEAKED' value='24'/>
      <enumerator name='ZPOOL_PROP_MAXBLOCKSIZE' value='25'/>
      <enumerator name='ZPOOL_PROP_TNAME' value='26'/>
      <enumerator name='ZPOOL_PROP_MAXDNODESIZE' value='27'/>
      <enumerator name='ZPOOL_PROP_MULTIHOST' value='28'/>
      <enumerator name='ZPOOL_PROP_CHECKPOINT' value='29'/>
      <enumerator name='ZPOOL_PROP_LOAD_GUID' value='30'/>
      <enumerator name='ZPOOL_PROP_AUTOTRIM' value='31'/>
      <enumerator name='ZPOOL_PROP_COMPATIBILITY' value='32'/>
      <enumerator name='ZPOOL_NUM_PROPS' value='33'/>
    </enum-decl>
    <function-decl name='zpool_get_prop_int' filepath='../../include/libzfs.h' line='329' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-134'/>
      <parameter type-id='type-id-148'/>
      <parameter type-id='type-id-91'/>
      <return type-id='type-id-45'/>
    </function-decl>
    <function-decl name='zpool_get_features' filepath='../../include/libzfs.h' line='413' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-134'/>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='zfs_error_aux' filepath='../../include/libzfs_impl.h' line='137' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-99'/>
      <parameter type-id='type-id-89'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='nvlist_add_string' filepath='../../include/sys/nvpair.h' line='179' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-112'/>
      <parameter type-id='type-id-89'/>
      <parameter type-id='type-id-89'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='open' mangled-name='open64' filepath='/usr/include/fcntl.h' line='171' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-89'/>
      <parameter type-id='type-id-1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='read' filepath='/usr/include/unistd.h' line='360' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-21'/>
      <parameter type-id='type-id-45'/>
      <return type-id='type-id-59'/>
    </function-decl>
    <function-decl name='close' filepath='/usr/include/unistd.h' line='353' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='nvlist_add_uint64' filepath='../../include/sys/nvpair.h' line='178' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-112'/>
      <parameter type-id='type-id-89'/>
      <parameter type-id='type-id-45'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='zfs_crypto_clone_check' mangled-name='zfs_crypto_clone_check' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_crypto.c' line='1165' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_crypto_clone_check'>
      <parameter type-id='type-id-23' name='hdl' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_crypto.c' line='1165' column='1'/>
      <parameter type-id='type-id-98' name='origin_zhp' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_crypto.c' line='1165' column='1'/>
      <parameter type-id='type-id-29' name='parent_name' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_crypto.c' line='1166' column='1'/>
      <parameter type-id='type-id-28' name='props' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_crypto.c' line='1166' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='zfs_crypto_attempt_load_keys' mangled-name='zfs_crypto_attempt_load_keys' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_crypto.c' line='1231' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_crypto_attempt_load_keys'>
      <parameter type-id='type-id-23' name='hdl' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_crypto.c' line='1231' column='1'/>
      <parameter type-id='type-id-29' name='fsname' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_crypto.c' line='1231' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='zfs_handle_dup' filepath='../../include/libzfs.h' line='468' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-87'/>
      <return type-id='type-id-87'/>
    </function-decl>
    <function-decl name='zfs_iter_filesystems' filepath='../../include/libzfs.h' line='616' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-87'/>
      <parameter type-id='type-id-103'/>
      <parameter type-id='type-id-21'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='zfs_crypto_load_key' mangled-name='zfs_crypto_load_key' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_crypto.c' line='1266' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_crypto_load_key'>
      <parameter type-id='type-id-98' name='zhp' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_crypto.c' line='1266' column='1'/>
      <parameter type-id='type-id-6' name='noop' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_crypto.c' line='1266' column='1'/>
      <parameter type-id='type-id-29' name='alt_keylocation' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_crypto.c' line='1266' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='lzc_load_key' filepath='../../include/libzfs_core.h' line='62' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-89'/>
      <parameter type-id='type-id-13'/>
      <parameter type-id='type-id-78'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <qualified-type-def type-id='type-id-74' const='yes' id='type-id-149'/>
    <pointer-type-def type-id='type-id-149' size-in-bits='64' id='type-id-150'/>
    <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/regex.h' line='517' column='1' id='type-id-151'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='rm_so' type-id='type-id-152' visibility='default' filepath='/usr/include/regex.h' line='519' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='rm_eo' type-id='type-id-152' visibility='default' filepath='/usr/include/regex.h' line='520' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='regoff_t' type-id='type-id-1' filepath='/usr/include/regex.h' line='490' column='1' id='type-id-152'/>
    <pointer-type-def type-id='type-id-151' size-in-bits='64' id='type-id-153'/>
    <function-decl name='regexec' filepath='/usr/include/regex.h' line='643' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-150'/>
      <parameter type-id='type-id-89'/>
      <parameter type-id='type-id-45'/>
      <parameter type-id='type-id-153'/>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <class-decl name='_IO_FILE' size-in-bits='1728' is-struct='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='49' column='1' id='type-id-154'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_flags' type-id='type-id-1' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_IO_read_ptr' type-id='type-id-29' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_IO_read_end' type-id='type-id-29' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_IO_read_base' type-id='type-id-29' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='_IO_write_base' type-id='type-id-29' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='_IO_write_ptr' type-id='type-id-29' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_IO_write_end' type-id='type-id-29' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='_IO_buf_base' type-id='type-id-29' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='_IO_buf_end' type-id='type-id-29' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='_IO_save_base' type-id='type-id-29' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='_IO_backup_base' type-id='type-id-29' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='_IO_save_end' type-id='type-id-29' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='_markers' type-id='type-id-155' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='_chain' type-id='type-id-156' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='_fileno' type-id='type-id-1' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='_flags2' type-id='type-id-1' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='_old_offset' type-id='type-id-157' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='_cur_column' type-id='type-id-158' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1040'>
        <var-decl name='_vtable_offset' type-id='type-id-159' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1048'>
        <var-decl name='_shortbuf' type-id='type-id-160' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='_offset' type-id='type-id-161' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='_codecvt' type-id='type-id-162' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='_wide_data' type-id='type-id-163' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='_freeres_list' type-id='type-id-156' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='_freeres_buf' type-id='type-id-21' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='__pad5' type-id='type-id-38' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='_mode' type-id='type-id-1' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='_unused2' type-id='type-id-164' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='98' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_IO_marker' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-165'/>
    <pointer-type-def type-id='type-id-165' size-in-bits='64' id='type-id-155'/>
    <pointer-type-def type-id='type-id-154' size-in-bits='64' id='type-id-156'/>
    <typedef-decl name='__off_t' type-id='type-id-59' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='150' column='1' id='type-id-157'/>
    <type-decl name='unsigned short int' size-in-bits='16' id='type-id-158'/>
    <type-decl name='signed char' size-in-bits='8' id='type-id-159'/>

    <array-type-def dimensions='1' type-id='type-id-42' size-in-bits='8' id='type-id-160'>
      <subrange length='1' type-id='type-id-43' id='type-id-166'/>

    </array-type-def>
    <typedef-decl name='__off64_t' type-id='type-id-59' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='151' column='1' id='type-id-161'/>
    <class-decl name='_IO_codecvt' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-167'/>
    <pointer-type-def type-id='type-id-167' size-in-bits='64' id='type-id-162'/>
    <class-decl name='_IO_wide_data' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-168'/>
    <pointer-type-def type-id='type-id-168' size-in-bits='64' id='type-id-163'/>

    <array-type-def dimensions='1' type-id='type-id-42' size-in-bits='160' id='type-id-164'>
      <subrange length='20' type-id='type-id-43' id='type-id-169'/>

    </array-type-def>
    <function-decl name='fileno' filepath='/usr/include/stdio.h' line='792' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-156'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='isatty' filepath='/usr/include/unistd.h' line='779' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <qualified-type-def type-id='type-id-80' const='yes' id='type-id-170'/>
    <pointer-type-def type-id='type-id-170' size-in-bits='64' id='type-id-171'/>
    <function-decl name='PKCS5_PBKDF2_HMAC_SHA1' filepath='/usr/include/openssl/evp.h' line='1087' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-89'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-171'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-78'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='zfs_crypto_unload_key' mangled-name='zfs_crypto_unload_key' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_crypto.c' line='1434' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_crypto_unload_key'>
      <parameter type-id='type-id-98' name='zhp' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_crypto.c' line='1434' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='lzc_unload_key' filepath='../../include/libzfs_core.h' line='63' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-89'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='zfs_crypto_rewrap' mangled-name='zfs_crypto_rewrap' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_crypto.c' line='1570' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_crypto_rewrap'>
      <parameter type-id='type-id-98' name='zhp' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_crypto.c' line='1570' column='1'/>
      <parameter type-id='type-id-28' name='raw_props' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_crypto.c' line='1570' column='1'/>
      <parameter type-id='type-id-6' name='inheritkey' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_crypto.c' line='1570' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='zfs_parent_name' filepath='../../include/libzfs.h' line='814' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-87'/>
      <parameter type-id='type-id-29'/>
      <parameter type-id='type-id-45'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='fnvlist_alloc' filepath='../../include/sys/nvpair.h' line='276' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='zfs_name_to_prop' filepath='../../include/sys/fs/zfs.h' line='313' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-89'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zfs_valid_proplist' filepath='../../include/libzfs.h' line='488' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-99'/>
      <parameter type-id='type-id-81'/>
      <parameter type-id='type-id-112'/>
      <parameter type-id='type-id-45'/>
      <parameter type-id='type-id-87'/>
      <parameter type-id='type-id-134'/>
      <parameter type-id='type-id-13'/>
      <parameter type-id='type-id-89'/>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='lzc_change_key' filepath='../../include/libzfs_core.h' line='64' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-89'/>
      <parameter type-id='type-id-45'/>
      <parameter type-id='type-id-112'/>
      <parameter type-id='type-id-78'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='ferror' filepath='/usr/include/stdio.h' line='767' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-156'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='1024' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-172' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/__sigset_t.h' line='5' column='1' id='type-id-173'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__val' type-id='type-id-174' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/__sigset_t.h' line='7' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-45' size-in-bits='1024' id='type-id-174'>
      <subrange length='16' type-id='type-id-43' id='type-id-175'/>

    </array-type-def>
    <pointer-type-def type-id='type-id-173' size-in-bits='64' id='type-id-176'/>
    <function-decl name='sigemptyset' filepath='/usr/include/signal.h' line='196' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-176'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <class-decl name='sigaction' size-in-bits='1216' is-struct='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/sigaction.h' line='27' column='1' id='type-id-177'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__sigaction_handler' type-id='type-id-178' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/sigaction.h' line='38' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='sa_mask' type-id='type-id-172' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/sigaction.h' line='46' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='sa_flags' type-id='type-id-1' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/sigaction.h' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='sa_restorer' type-id='type-id-179' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/sigaction.h' line='52' column='1'/>
      </data-member>
    </class-decl>
    <union-decl name='__anonymous_union__' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/sigaction.h' line='31' column='1' id='type-id-178'>
      <data-member access='private'>
        <var-decl name='sa_handler' type-id='type-id-180' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/sigaction.h' line='34' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='sa_sigaction' type-id='type-id-181' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/sigaction.h' line='36' column='1'/>
      </data-member>
    </union-decl>
    <pointer-type-def type-id='type-id-182' size-in-bits='64' id='type-id-183'/>
    <typedef-decl name='__sighandler_t' type-id='type-id-183' filepath='/usr/include/signal.h' line='72' column='1' id='type-id-180'/>
    <class-decl name='__anonymous_struct__' size-in-bits='1024' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-184' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/siginfo_t.h' line='36' column='1' id='type-id-185'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='si_signo' type-id='type-id-1' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/siginfo_t.h' line='38' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='si_errno' type-id='type-id-1' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/siginfo_t.h' line='40' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='si_code' type-id='type-id-1' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/siginfo_t.h' line='42' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='__pad0' type-id='type-id-1' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/siginfo_t.h' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_sifields' type-id='type-id-186' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/siginfo_t.h' line='123' column='1'/>
      </data-member>
    </class-decl>
    <union-decl name='__anonymous_union__' size-in-bits='896' is-anonymous='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/siginfo_t.h' line='51' column='1' id='type-id-186'>
      <data-member access='private'>
        <var-decl name='_pad' type-id='type-id-187' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/siginfo_t.h' line='53' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='_kill' type-id='type-id-188' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/siginfo_t.h' line='60' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='_timer' type-id='type-id-189' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/siginfo_t.h' line='68' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='_rt' type-id='type-id-190' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/siginfo_t.h' line='76' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='_sigchld' type-id='type-id-191' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/siginfo_t.h' line='86' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='_sigfault' type-id='type-id-192' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/siginfo_t.h' line='105' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='_sigpoll' type-id='type-id-193' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/siginfo_t.h' line='112' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='_sigsys' type-id='type-id-194' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/siginfo_t.h' line='121' column='1'/>
      </data-member>
    </union-decl>

    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='896' id='type-id-187'>
      <subrange length='28' type-id='type-id-43' id='type-id-195'/>

    </array-type-def>
    <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/siginfo_t.h' line='56' column='1' id='type-id-188'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='si_pid' type-id='type-id-196' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/siginfo_t.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='si_uid' type-id='type-id-197' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/siginfo_t.h' line='59' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__pid_t' type-id='type-id-1' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='152' column='1' id='type-id-196'/>
    <typedef-decl name='__uid_t' type-id='type-id-19' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='144' column='1' id='type-id-197'/>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/siginfo_t.h' line='63' column='1' id='type-id-189'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='si_tid' type-id='type-id-1' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/siginfo_t.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='si_overrun' type-id='type-id-1' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/siginfo_t.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='si_sigval' type-id='type-id-198' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/siginfo_t.h' line='67' column='1'/>
      </data-member>
    </class-decl>
    <union-decl name='sigval' size-in-bits='64' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/__sigval_t.h' line='24' column='1' id='type-id-199'>
      <data-member access='private'>
        <var-decl name='sival_int' type-id='type-id-1' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/__sigval_t.h' line='26' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='sival_ptr' type-id='type-id-21' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/__sigval_t.h' line='27' column='1'/>
      </data-member>
    </union-decl>
    <typedef-decl name='__sigval_t' type-id='type-id-199' filepath='/usr/include/x86_64-linux-gnu/bits/types/__sigval_t.h' line='30' column='1' id='type-id-198'/>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/siginfo_t.h' line='71' column='1' id='type-id-190'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='si_pid' type-id='type-id-196' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/siginfo_t.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='si_uid' type-id='type-id-197' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/siginfo_t.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='si_sigval' type-id='type-id-198' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/siginfo_t.h' line='75' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='256' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/siginfo_t.h' line='79' column='1' id='type-id-191'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='si_pid' type-id='type-id-196' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/siginfo_t.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='si_uid' type-id='type-id-197' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/siginfo_t.h' line='82' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='si_status' type-id='type-id-1' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/siginfo_t.h' line='83' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='si_utime' type-id='type-id-200' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/siginfo_t.h' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='si_stime' type-id='type-id-200' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/siginfo_t.h' line='85' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__clock_t' type-id='type-id-59' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='154' column='1' id='type-id-200'/>
    <class-decl name='__anonymous_struct__' size-in-bits='256' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/siginfo_t.h' line='89' column='1' id='type-id-192'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='si_addr' type-id='type-id-21' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/siginfo_t.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='si_addr_lsb' type-id='type-id-60' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/siginfo_t.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_bounds' type-id='type-id-201' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/siginfo_t.h' line='104' column='1'/>
      </data-member>
    </class-decl>
    <union-decl name='__anonymous_union__' size-in-bits='128' is-anonymous='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/siginfo_t.h' line='94' column='1' id='type-id-201'>
      <data-member access='private'>
        <var-decl name='_addr_bnd' type-id='type-id-202' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/siginfo_t.h' line='101' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='_pkey' type-id='type-id-50' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/siginfo_t.h' line='103' column='1'/>
      </data-member>
    </union-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/siginfo_t.h' line='97' column='1' id='type-id-202'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_lower' type-id='type-id-21' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/siginfo_t.h' line='99' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_upper' type-id='type-id-21' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/siginfo_t.h' line='100' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/siginfo_t.h' line='108' column='1' id='type-id-193'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='si_band' type-id='type-id-59' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/siginfo_t.h' line='110' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='si_fd' type-id='type-id-1' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/siginfo_t.h' line='111' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/siginfo_t.h' line='116' column='1' id='type-id-194'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_call_addr' type-id='type-id-21' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/siginfo_t.h' line='118' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_syscall' type-id='type-id-1' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/siginfo_t.h' line='119' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='_arch' type-id='type-id-19' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/siginfo_t.h' line='120' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='siginfo_t' type-id='type-id-185' filepath='/usr/include/x86_64-linux-gnu/bits/types/siginfo_t.h' line='124' column='1' id='type-id-184'/>
    <pointer-type-def type-id='type-id-184' size-in-bits='64' id='type-id-203'/>
    <pointer-type-def type-id='type-id-204' size-in-bits='64' id='type-id-181'/>
    <typedef-decl name='__sigset_t' type-id='type-id-173' filepath='/usr/include/x86_64-linux-gnu/bits/types/__sigset_t.h' line='8' column='1' id='type-id-172'/>
    <pointer-type-def type-id='type-id-205' size-in-bits='64' id='type-id-179'/>
    <qualified-type-def type-id='type-id-177' const='yes' id='type-id-206'/>
    <pointer-type-def type-id='type-id-206' size-in-bits='64' id='type-id-207'/>
    <pointer-type-def type-id='type-id-177' size-in-bits='64' id='type-id-208'/>
    <function-decl name='sigaction' filepath='/usr/include/signal.h' line='240' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-207'/>
      <parameter type-id='type-id-208'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='fputc' filepath='/usr/include/stdio.h' line='527' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-156'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='fflush' filepath='/usr/include/stdio.h' line='218' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-156'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <class-decl name='termios' size-in-bits='480' is-struct='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/termios.h' line='28' column='1' id='type-id-209'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='c_iflag' type-id='type-id-210' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/termios.h' line='30' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='c_oflag' type-id='type-id-210' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/termios.h' line='31' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='c_cflag' type-id='type-id-210' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/termios.h' line='32' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='c_lflag' type-id='type-id-210' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/termios.h' line='33' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='c_line' type-id='type-id-211' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/termios.h' line='34' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='136'>
        <var-decl name='c_cc' type-id='type-id-212' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/termios.h' line='35' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='c_ispeed' type-id='type-id-213' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/termios.h' line='36' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='c_ospeed' type-id='type-id-213' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/termios.h' line='37' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='tcflag_t' type-id='type-id-19' filepath='/usr/include/x86_64-linux-gnu/bits/termios.h' line='25' column='1' id='type-id-210'/>
    <typedef-decl name='cc_t' type-id='type-id-80' filepath='/usr/include/x86_64-linux-gnu/bits/termios.h' line='23' column='1' id='type-id-211'/>

    <array-type-def dimensions='1' type-id='type-id-211' size-in-bits='256' id='type-id-212'>
      <subrange length='32' type-id='type-id-43' id='type-id-214'/>

    </array-type-def>
    <typedef-decl name='speed_t' type-id='type-id-19' filepath='/usr/include/x86_64-linux-gnu/bits/termios.h' line='24' column='1' id='type-id-213'/>
    <pointer-type-def type-id='type-id-209' size-in-bits='64' id='type-id-215'/>
    <function-decl name='tcgetattr' filepath='/usr/include/termios.h' line='66' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-215'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <qualified-type-def type-id='type-id-209' const='yes' id='type-id-216'/>
    <pointer-type-def type-id='type-id-216' size-in-bits='64' id='type-id-217'/>
    <function-decl name='tcsetattr' filepath='/usr/include/termios.h' line='70' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-217'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='getpid' filepath='/usr/include/unistd.h' line='628' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='kill' filepath='/usr/include/signal.h' line='112' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='fclose' filepath='/usr/include/stdio.h' line='213' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-156'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='dlopen' filepath='/usr/include/dlfcn.h' line='56' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-89'/>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='dlsym' filepath='/usr/include/dlfcn.h' line='64' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-21'/>
      <parameter type-id='type-id-89'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='fdopen' filepath='/usr/include/stdio.h' line='279' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-89'/>
      <return type-id='type-id-156'/>
    </function-decl>
    <function-decl name='dlerror' filepath='/usr/include/dlfcn.h' line='82' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-29'/>
    </function-decl>
    <function-decl name='asprintf' filepath='/usr/include/stdio.h' line='372' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-92'/>
      <parameter type-id='type-id-89'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='mkostemps' mangled-name='mkostemps64' filepath='/usr/include/stdlib.h' line='763' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-29'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='unlink' filepath='/usr/include/unistd.h' line='825' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-89'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rewind' filepath='/usr/include/stdio.h' line='700' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-156'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-205'>
      <return type-id='type-id-20'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-182'>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-20'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-204'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-203'/>
      <parameter type-id='type-id-21'/>
      <return type-id='type-id-20'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='libzfs_dataset.c' comp-dir-path='/home/nabijaczleweli/store/code/zfs/lib/libzfs' language='LANG_C99'>
    <function-decl name='zfs_type_to_name' mangled-name='zfs_type_to_name' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='79' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_type_to_name'>
      <parameter type-id='type-id-26' name='type' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='79' column='1'/>
      <return type-id='type-id-89'/>
    </function-decl>
    <function-decl name='zfs_validate_name' mangled-name='zfs_validate_name' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='105' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_validate_name'>
      <parameter type-id='type-id-23' name='hdl' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='105' column='1'/>
      <parameter type-id='type-id-89' name='path' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='105' column='1'/>
      <parameter type-id='type-id-1' name='type' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='105' column='1'/>
      <parameter type-id='type-id-6' name='modifying' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='106' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' filepath='../../include/zfs_namecheck.h' line='36' column='1' id='type-id-218'>
      <underlying-type type-id='type-id-7'/>
      <enumerator name='NAME_ERR_LEADING_SLASH' value='0'/>
      <enumerator name='NAME_ERR_EMPTY_COMPONENT' value='1'/>
      <enumerator name='NAME_ERR_TRAILING_SLASH' value='2'/>
      <enumerator name='NAME_ERR_INVALCHAR' value='3'/>
      <enumerator name='NAME_ERR_MULTIPLE_DELIMITERS' value='4'/>
      <enumerator name='NAME_ERR_NOLETTER' value='5'/>
      <enumerator name='NAME_ERR_RESERVED' value='6'/>
      <enumerator name='NAME_ERR_DISKLIKE' value='7'/>
      <enumerator name='NAME_ERR_TOOLONG' value='8'/>
      <enumerator name='NAME_ERR_SELF_REF' value='9'/>
      <enumerator name='NAME_ERR_PARENT_REF' value='10'/>
      <enumerator name='NAME_ERR_NO_AT' value='11'/>
      <enumerator name='NAME_ERR_NO_POUND' value='12'/>
    </enum-decl>
    <pointer-type-def type-id='type-id-218' size-in-bits='64' id='type-id-219'/>
    <function-decl name='entity_namecheck' filepath='../../include/zfs_namecheck.h' line='58' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-89'/>
      <parameter type-id='type-id-219'/>
      <parameter type-id='type-id-29'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='zfs_name_valid' mangled-name='zfs_name_valid' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='221' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_name_valid'>
      <parameter type-id='type-id-89' name='name' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='221' column='1'/>
      <parameter type-id='type-id-26' name='type' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='221' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='zpool_name_valid' filepath='../../include/libzfs_impl.h' line='201' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-99'/>
      <parameter type-id='type-id-13'/>
      <parameter type-id='type-id-89'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='zpool_free_handles' mangled-name='zpool_free_handles' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='312' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_free_handles'>
      <parameter type-id='type-id-23' name='hdl' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='312' column='1'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='zpool_close' filepath='../../include/libzfs.h' line='236' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-134'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='zfs_refresh_properties' mangled-name='zfs_refresh_properties' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='433' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_refresh_properties'>
      <parameter type-id='type-id-98' name='zhp' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='433' column='1'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='make_dataset_handle' mangled-name='make_dataset_handle' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='477' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='make_dataset_handle'>
      <parameter type-id='type-id-23' name='hdl' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='477' column='1'/>
      <parameter type-id='type-id-89' name='path' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='477' column='1'/>
      <return type-id='type-id-98'/>
    </function-decl>
    <typedef-decl name='zfs_cmd_t' type-id='type-id-116' filepath='../../include/sys/zfs_ioctl.h' line='518' column='1' id='type-id-220'/>
    <pointer-type-def type-id='type-id-220' size-in-bits='64' id='type-id-221'/>
    <function-decl name='make_dataset_handle_zc' mangled-name='make_dataset_handle_zc' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='506' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='make_dataset_handle_zc'>
      <parameter type-id='type-id-23' name='hdl' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='506' column='1'/>
      <parameter type-id='type-id-221' name='zc' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='506' column='1'/>
      <return type-id='type-id-98'/>
    </function-decl>
    <function-decl name='make_dataset_simple_handle_zc' mangled-name='make_dataset_simple_handle_zc' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='523' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='make_dataset_simple_handle_zc'>
      <parameter type-id='type-id-98' name='pzhp' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='523' column='1'/>
      <parameter type-id='type-id-221' name='zc' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='523' column='1'/>
      <return type-id='type-id-98'/>
    </function-decl>
    <function-decl name='zpool_get_name' filepath='../../include/libzfs.h' line='237' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-134'/>
      <return type-id='type-id-89'/>
    </function-decl>
    <function-decl name='zpool_open_canfail' filepath='../../include/libzfs.h' line='235' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-99'/>
      <parameter type-id='type-id-89'/>
      <return type-id='type-id-134'/>
    </function-decl>
    <function-decl name='zfs_handle_dup' mangled-name='zfs_handle_dup' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='540' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_handle_dup'>
      <parameter type-id='type-id-98' name='zhp_orig' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='540' column='1'/>
      <return type-id='type-id-98'/>
    </function-decl>
    <function-decl name='zfs_close' mangled-name='zfs_close' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='772' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_close'>
      <parameter type-id='type-id-98' name='zhp' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='772' column='1'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='zfs_bookmark_exists' mangled-name='zfs_bookmark_exists' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='587' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_bookmark_exists'>
      <parameter type-id='type-id-89' name='path' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='587' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='lzc_get_bookmarks' filepath='../../include/libzfs_core.h' line='59' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-89'/>
      <parameter type-id='type-id-112'/>
      <parameter type-id='type-id-115'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='make_bookmark_handle' mangled-name='make_bookmark_handle' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='618' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='make_bookmark_handle'>
      <parameter type-id='type-id-98' name='parent' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='618' column='1'/>
      <parameter type-id='type-id-89' name='path' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='618' column='1'/>
      <parameter type-id='type-id-28' name='bmark_props' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='619' column='1'/>
      <return type-id='type-id-98'/>
    </function-decl>
    <function-decl name='zfs_open' mangled-name='zfs_open' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='683' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_open'>
      <parameter type-id='type-id-23' name='hdl' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='683' column='1'/>
      <parameter type-id='type-id-89' name='path' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='683' column='1'/>
      <parameter type-id='type-id-1' name='types' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='683' column='1'/>
      <return type-id='type-id-98'/>
    </function-decl>
    <function-decl name='zfs_iter_bookmarks' filepath='../../include/libzfs.h' line='622' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-87'/>
      <parameter type-id='type-id-103'/>
      <parameter type-id='type-id-21'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='libzfs_mnttab_init' mangled-name='libzfs_mnttab_init' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='800' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='libzfs_mnttab_init'>
      <parameter type-id='type-id-23' name='hdl' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='800' column='1'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <pointer-type-def type-id='type-id-56' size-in-bits='64' id='type-id-222'/>
    <union-decl name='__anonymous_union__' size-in-bits='32' is-anonymous='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='32' column='1' id='type-id-223'>
      <data-member access='private'>
        <var-decl name='__size' type-id='type-id-224' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='34' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='__align' type-id='type-id-1' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='35' column='1'/>
      </data-member>
    </union-decl>

    <array-type-def dimensions='1' type-id='type-id-42' size-in-bits='32' id='type-id-224'>
      <subrange length='4' type-id='type-id-43' id='type-id-225'/>

    </array-type-def>
    <qualified-type-def type-id='type-id-223' const='yes' id='type-id-226'/>
    <pointer-type-def type-id='type-id-226' size-in-bits='64' id='type-id-227'/>
    <function-decl name='pthread_mutex_init' filepath='/usr/include/pthread.h' line='750' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-222'/>
      <parameter type-id='type-id-227'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <pointer-type-def type-id='type-id-65' size-in-bits='64' id='type-id-228'/>
    <function-decl name='avl_create' filepath='../../include/sys/avl.h' line='163' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-228'/>
      <parameter type-id='type-id-67'/>
      <parameter type-id='type-id-45'/>
      <parameter type-id='type-id-45'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='libzfs_mnttab_fini' mangled-name='libzfs_mnttab_fini' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='848' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='libzfs_mnttab_fini'>
      <parameter type-id='type-id-23' name='hdl' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='848' column='1'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='avl_destroy_nodes' filepath='../../include/sys/avl.h' line='309' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-228'/>
      <parameter type-id='type-id-111'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='avl_destroy' filepath='../../include/sys/avl.h' line='317' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-228'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='pthread_mutex_destroy' filepath='/usr/include/pthread.h' line='755' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-222'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='libzfs_mnttab_cache' mangled-name='libzfs_mnttab_cache' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='866' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='libzfs_mnttab_cache'>
      <parameter type-id='type-id-23' name='hdl' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='866' column='1'/>
      <parameter type-id='type-id-6' name='enable' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='866' column='1'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <class-decl name='mnttab' size-in-bits='256' is-struct='yes' visibility='default' filepath='../../lib/libspl/include/os/linux/sys/mnttab.h' line='49' column='1' id='type-id-229'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mnt_special' type-id='type-id-29' visibility='default' filepath='../../lib/libspl/include/os/linux/sys/mnttab.h' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='mnt_mountp' type-id='type-id-29' visibility='default' filepath='../../lib/libspl/include/os/linux/sys/mnttab.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='mnt_fstype' type-id='type-id-29' visibility='default' filepath='../../lib/libspl/include/os/linux/sys/mnttab.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='mnt_mntopts' type-id='type-id-29' visibility='default' filepath='../../lib/libspl/include/os/linux/sys/mnttab.h' line='53' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-229' size-in-bits='64' id='type-id-230'/>
    <function-decl name='libzfs_mnttab_find' mangled-name='libzfs_mnttab_find' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='872' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='libzfs_mnttab_find'>
      <parameter type-id='type-id-23' name='hdl' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='872' column='1'/>
      <parameter type-id='type-id-89' name='fsname' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='872' column='1'/>
      <parameter type-id='type-id-230' name='entry' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='873' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='pthread_mutex_lock' filepath='/usr/include/pthread.h' line='763' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-222'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='avl_numnodes' filepath='../../include/sys/avl.h' line='281' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-228'/>
      <return type-id='type-id-45'/>
    </function-decl>
    <function-decl name='avl_find' filepath='../../include/sys/avl.h' line='175' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-228'/>
      <parameter type-id='type-id-21'/>
      <parameter type-id='type-id-110'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='getmntany' filepath='../../lib/libspl/include/os/linux/sys/mnttab.h' line='73' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-156'/>
      <parameter type-id='type-id-230'/>
      <parameter type-id='type-id-230'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='pthread_mutex_unlock' filepath='/usr/include/pthread.h' line='774' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-222'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='avl_add' filepath='../../include/sys/avl.h' line='252' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-228'/>
      <parameter type-id='type-id-21'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='libzfs_mnttab_add' mangled-name='libzfs_mnttab_add' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='917' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='libzfs_mnttab_add'>
      <parameter type-id='type-id-23' name='hdl' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='917' column='1'/>
      <parameter type-id='type-id-89' name='special' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='917' column='1'/>
      <parameter type-id='type-id-89' name='mountp' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='918' column='1'/>
      <parameter type-id='type-id-89' name='mntopts' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='918' column='1'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='libzfs_mnttab_remove' mangled-name='libzfs_mnttab_remove' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='947' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='libzfs_mnttab_remove'>
      <parameter type-id='type-id-23' name='hdl' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='947' column='1'/>
      <parameter type-id='type-id-89' name='fsname' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='947' column='1'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='avl_remove' filepath='../../include/sys/avl.h' line='260' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-228'/>
      <parameter type-id='type-id-21'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <pointer-type-def type-id='type-id-1' size-in-bits='64' id='type-id-231'/>
    <function-decl name='zfs_spa_version' mangled-name='zfs_spa_version' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='967' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_spa_version'>
      <parameter type-id='type-id-98' name='zhp' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='967' column='1'/>
      <parameter type-id='type-id-231' name='spa_version' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='967' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='zfs_valid_proplist' mangled-name='zfs_valid_proplist' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='1004' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_valid_proplist'>
      <parameter type-id='type-id-23' name='hdl' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='1004' column='1'/>
      <parameter type-id='type-id-26' name='type' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='1004' column='1'/>
      <parameter type-id='type-id-28' name='nvl' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='1004' column='1'/>
      <parameter type-id='type-id-32' name='zoned' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='1005' column='1'/>
      <parameter type-id='type-id-98' name='zhp' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='1005' column='1'/>
      <parameter type-id='type-id-24' name='zpool_hdl' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='1005' column='1'/>
      <parameter type-id='type-id-6' name='key_params_ok' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='1006' column='1'/>
      <parameter type-id='type-id-89' name='errbuf' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='1006' column='1'/>
      <return type-id='type-id-28'/>
    </function-decl>
    <function-decl name='nvlist_alloc' filepath='../../include/sys/nvpair.h' line='151' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-115'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='zfs_prop_valid_for_type' filepath='../../include/sys/fs/zfs.h' line='320' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-81'/>
      <parameter type-id='type-id-13'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='zfs_prop_readonly' filepath='../../include/sys/fs/zfs.h' line='306' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='zfs_prop_setonce' filepath='../../include/sys/fs/zfs.h' line='309' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='zfs_prop_encryption_key_param' filepath='../../include/sys/fs/zfs.h' line='310' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='zprop_parse_value' filepath='../../include/libzfs_impl.h' line='153' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-99'/>
      <parameter type-id='type-id-141'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-81'/>
      <parameter type-id='type-id-112'/>
      <parameter type-id='type-id-92'/>
      <parameter type-id='type-id-110'/>
      <parameter type-id='type-id-89'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='zfs_prop_user' filepath='../../include/sys/fs/zfs.h' line='314' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-89'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='nvpair_type' filepath='../../include/sys/nvpair.h' line='245' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-141'/>
      <return type-id='type-id-140'/>
    </function-decl>
    <function-decl name='nvpair_value_string' filepath='../../include/sys/nvpair.h' line='257' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-141'/>
      <parameter type-id='type-id-92'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='zfs_prop_userquota' filepath='../../include/sys/fs/zfs.h' line='315' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-89'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='zfs_nicestrtonum' filepath='../../include/libzfs.h' line='866' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-99'/>
      <parameter type-id='type-id-89'/>
      <parameter type-id='type-id-110'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='nvpair_value_uint64' filepath='../../include/sys/nvpair.h' line='256' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-141'/>
      <parameter type-id='type-id-110'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='mountpoint_namecheck' filepath='../../include/zfs_namecheck.h' line='63' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-89'/>
      <parameter type-id='type-id-219'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='zfs_prop_valid_keylocation' filepath='../../include/sys/fs/zfs.h' line='311' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-89'/>
      <parameter type-id='type-id-13'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='zpool_prop_get_feature' filepath='../../include/libzfs.h' line='564' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-134'/>
      <parameter type-id='type-id-89'/>
      <parameter type-id='type-id-29'/>
      <parameter type-id='type-id-45'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='zfs_parse_options' filepath='../../include/libzfs_impl.h' line='208' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-29'/>
      <parameter type-id='type-id-93'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='nvlist_add_uint64_array' filepath='../../include/sys/nvpair.h' line='190' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-112'/>
      <parameter type-id='type-id-89'/>
      <parameter type-id='type-id-110'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='zfs_prop_written' filepath='../../include/sys/fs/zfs.h' line='316' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-89'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='zfs_nicebytes' filepath='../../include/libzutil.h' line='134' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-45'/>
      <parameter type-id='type-id-29'/>
      <parameter type-id='type-id-45'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <class-decl name='passwd' size-in-bits='384' is-struct='yes' visibility='default' filepath='/usr/include/pwd.h' line='49' column='1' id='type-id-232'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='pw_name' type-id='type-id-29' visibility='default' filepath='/usr/include/pwd.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='pw_passwd' type-id='type-id-29' visibility='default' filepath='/usr/include/pwd.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='pw_uid' type-id='type-id-197' visibility='default' filepath='/usr/include/pwd.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='pw_gid' type-id='type-id-233' visibility='default' filepath='/usr/include/pwd.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='pw_gecos' type-id='type-id-29' visibility='default' filepath='/usr/include/pwd.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='pw_dir' type-id='type-id-29' visibility='default' filepath='/usr/include/pwd.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='pw_shell' type-id='type-id-29' visibility='default' filepath='/usr/include/pwd.h' line='58' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__gid_t' type-id='type-id-19' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='145' column='1' id='type-id-233'/>
    <pointer-type-def type-id='type-id-232' size-in-bits='64' id='type-id-234'/>
    <function-decl name='getpwnam' filepath='/usr/include/pwd.h' line='116' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-89'/>
      <return type-id='type-id-234'/>
    </function-decl>
    <class-decl name='group' size-in-bits='256' is-struct='yes' visibility='default' filepath='/usr/include/grp.h' line='42' column='1' id='type-id-235'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='gr_name' type-id='type-id-29' visibility='default' filepath='/usr/include/grp.h' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='gr_passwd' type-id='type-id-29' visibility='default' filepath='/usr/include/grp.h' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='gr_gid' type-id='type-id-233' visibility='default' filepath='/usr/include/grp.h' line='46' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='gr_mem' type-id='type-id-92' visibility='default' filepath='/usr/include/grp.h' line='47' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-235' size-in-bits='64' id='type-id-236'/>
    <function-decl name='getgrnam' filepath='/usr/include/grp.h' line='107' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-89'/>
      <return type-id='type-id-236'/>
    </function-decl>
    <function-decl name='zfs_prop_get_int' mangled-name='zfs_prop_get_int' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='2980' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_get_int'>
      <parameter type-id='type-id-98' name='zhp' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='2980' column='1'/>
      <parameter type-id='type-id-3' name='prop' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='2980' column='1'/>
      <return type-id='type-id-32'/>
    </function-decl>
    <function-decl name='zfs_prop_set' mangled-name='zfs_prop_set' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='1713' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_set'>
      <parameter type-id='type-id-98' name='zhp' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='1713' column='1'/>
      <parameter type-id='type-id-89' name='propname' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='1713' column='1'/>
      <parameter type-id='type-id-89' name='propval' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='1713' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='zfs_prop_set_list' mangled-name='zfs_prop_set_list' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='1744' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_set_list'>
      <parameter type-id='type-id-98' name='zhp' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='1744' column='1'/>
      <parameter type-id='type-id-28' name='props' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='1744' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='fnvlist_free' filepath='../../include/sys/nvpair.h' line='277' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-112'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='fnvlist_add_uint64' filepath='../../include/sys/nvpair.h' line='296' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-112'/>
      <parameter type-id='type-id-89'/>
      <parameter type-id='type-id-45'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='zvol_volsize_to_reservation' mangled-name='zvol_volsize_to_reservation' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='5491' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zvol_volsize_to_reservation'>
      <parameter type-id='type-id-24' name='zph' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='5491' column='1'/>
      <parameter type-id='type-id-32' name='volsize' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='5491' column='1'/>
      <parameter type-id='type-id-28' name='props' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='5492' column='1'/>
      <return type-id='type-id-32'/>
    </function-decl>
    <function-decl name='fnvpair_value_uint64' filepath='../../include/sys/nvpair.h' line='350' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-141'/>
      <return type-id='type-id-45'/>
    </function-decl>
    <pointer-type-def type-id='type-id-2' size-in-bits='64' id='type-id-237'/>
    <function-decl name='changelist_gather' filepath='../../include/libzfs_impl.h' line='187' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-87'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-237'/>
    </function-decl>
    <function-decl name='changelist_haszonedchild' filepath='../../include/libzfs_impl.h' line='189' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-237'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='changelist_prefix' filepath='../../include/libzfs_impl.h' line='182' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-237'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='zcmd_write_src_nvlist' filepath='../../include/libzfs_impl.h' line='176' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-99'/>
      <parameter type-id='type-id-130'/>
      <parameter type-id='type-id-112'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='zfs_setprop_error' filepath='../../include/libzfs_impl.h' line='146' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-99'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-29'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='changelist_free' filepath='../../include/libzfs_impl.h' line='186' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-237'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='changelist_postfix' filepath='../../include/libzfs_impl.h' line='183' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-237'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='nvlist_remove_all' filepath='../../include/sys/nvpair.h' line='199' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-112'/>
      <parameter type-id='type-id-89'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='zfs_prop_inherit' mangled-name='zfs_prop_inherit' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='1926' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_inherit'>
      <parameter type-id='type-id-98' name='zhp' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='1926' column='1'/>
      <parameter type-id='type-id-89' name='propname' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='1926' column='1'/>
      <parameter type-id='type-id-6' name='received' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='1926' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='zfs_prop_inheritable' filepath='../../include/sys/fs/zfs.h' line='308' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='getprop_uint64' mangled-name='getprop_uint64' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='2038' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getprop_uint64'>
      <parameter type-id='type-id-98' name='zhp' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='2038' column='1'/>
      <parameter type-id='type-id-3' name='prop' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='2038' column='1'/>
      <parameter type-id='type-id-92' name='source' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='2038' column='1'/>
      <return type-id='type-id-32'/>
    </function-decl>
    <function-decl name='zfs_prop_default_numeric' filepath='../../include/libzfs.h' line='484' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-45'/>
    </function-decl>
    <function-decl name='zfs_prop_get_recvd' mangled-name='zfs_prop_get_recvd' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='2349' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_get_recvd'>
      <parameter type-id='type-id-98' name='zhp' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='2349' column='1'/>
      <parameter type-id='type-id-89' name='propname' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='2349' column='1'/>
      <parameter type-id='type-id-29' name='propbuf' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='2349' column='1'/>
      <parameter type-id='type-id-38' name='proplen' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='2350' column='1'/>
      <parameter type-id='type-id-6' name='literal' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='2350' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <typedef-decl name='zprop_source_t' type-id='type-id-90' filepath='../../include/sys/fs/zfs.h' line='266' column='1' id='type-id-238'/>
    <pointer-type-def type-id='type-id-238' size-in-bits='64' id='type-id-239'/>
    <function-decl name='zfs_prop_get' mangled-name='zfs_prop_get' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='2605' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_get'>
      <parameter type-id='type-id-98' name='zhp' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='2605' column='1'/>
      <parameter type-id='type-id-3' name='prop' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='2605' column='1'/>
      <parameter type-id='type-id-29' name='propbuf' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='2605' column='1'/>
      <parameter type-id='type-id-38' name='proplen' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='2605' column='1'/>
      <parameter type-id='type-id-239' name='src' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='2606' column='1'/>
      <parameter type-id='type-id-29' name='statbuf' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='2606' column='1'/>
      <parameter type-id='type-id-38' name='statlen' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='2606' column='1'/>
      <parameter type-id='type-id-6' name='literal' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='2606' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' filepath='../../include/zfs_prop.h' line='40' column='1' id='type-id-240'>
      <underlying-type type-id='type-id-7'/>
      <enumerator name='PROP_TYPE_NUMBER' value='0'/>
      <enumerator name='PROP_TYPE_STRING' value='1'/>
      <enumerator name='PROP_TYPE_INDEX' value='2'/>
    </enum-decl>
    <function-decl name='zfs_prop_get_type' filepath='../../include/zfs_prop.h' line='91' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-240'/>
    </function-decl>
    <function-decl name='zfs_nicenum' filepath='../../include/libzutil.h' line='135' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-45'/>
      <parameter type-id='type-id-29'/>
      <parameter type-id='type-id-45'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <class-decl name='tm' size-in-bits='448' is-struct='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h' line='7' column='1' id='type-id-241'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tm_sec' type-id='type-id-1' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h' line='9' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='tm_min' type-id='type-id-1' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h' line='10' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tm_hour' type-id='type-id-1' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h' line='11' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='tm_mday' type-id='type-id-1' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h' line='12' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='tm_mon' type-id='type-id-1' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h' line='13' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='tm_year' type-id='type-id-1' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h' line='14' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='tm_wday' type-id='type-id-1' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h' line='15' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='tm_yday' type-id='type-id-1' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h' line='16' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='tm_isdst' type-id='type-id-1' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h' line='17' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='tm_gmtoff' type-id='type-id-59' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h' line='20' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='tm_zone' type-id='type-id-89' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h' line='21' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-241' size-in-bits='64' id='type-id-242'/>
    <qualified-type-def type-id='type-id-59' const='yes' id='type-id-243'/>
    <pointer-type-def type-id='type-id-243' size-in-bits='64' id='type-id-244'/>
    <function-decl name='localtime_r' filepath='/usr/include/time.h' line='133' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-244'/>
      <parameter type-id='type-id-242'/>
      <return type-id='type-id-242'/>
    </function-decl>
    <qualified-type-def type-id='type-id-241' const='yes' id='type-id-245'/>
    <pointer-type-def type-id='type-id-245' size-in-bits='64' id='type-id-246'/>
    <function-decl name='strftime' filepath='/usr/include/time.h' line='88' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-29'/>
      <parameter type-id='type-id-45'/>
      <parameter type-id='type-id-89'/>
      <parameter type-id='type-id-246'/>
      <return type-id='type-id-45'/>
    </function-decl>
    <function-decl name='zpool_get_prop' filepath='../../include/libzfs.h' line='327' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-134'/>
      <parameter type-id='type-id-148'/>
      <parameter type-id='type-id-29'/>
      <parameter type-id='type-id-45'/>
      <parameter type-id='type-id-91'/>
      <parameter type-id='type-id-13'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <pointer-type-def type-id='type-id-89' size-in-bits='64' id='type-id-247'/>
    <function-decl name='zfs_prop_index_to_string' filepath='../../include/sys/fs/zfs.h' line='317' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-45'/>
      <parameter type-id='type-id-247'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='zfs_get_clones_nvl' mangled-name='zfs_get_clones_nvl' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='2436' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_get_clones_nvl'>
      <parameter type-id='type-id-98' name='zhp' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='2436' column='1'/>
      <return type-id='type-id-28'/>
    </function-decl>
    <function-decl name='strsep' filepath='/usr/include/string.h' line='439' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-92'/>
      <parameter type-id='type-id-89'/>
      <return type-id='type-id-29'/>
    </function-decl>
    <function-decl name='nvlist_add_nvlist' filepath='../../include/sys/nvpair.h' line='180' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-112'/>
      <parameter type-id='type-id-89'/>
      <parameter type-id='type-id-112'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='fnvlist_add_boolean' filepath='../../include/sys/nvpair.h' line='286' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-112'/>
      <parameter type-id='type-id-89'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='fnvlist_add_string' filepath='../../include/sys/nvpair.h' line='297' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-112'/>
      <parameter type-id='type-id-89'/>
      <parameter type-id='type-id-89'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='lzc_channel_program_nosync' filepath='../../include/libzfs_core.h' line='125' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-89'/>
      <parameter type-id='type-id-89'/>
      <parameter type-id='type-id-45'/>
      <parameter type-id='type-id-45'/>
      <parameter type-id='type-id-112'/>
      <parameter type-id='type-id-115'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_nvlist' filepath='../../include/sys/nvpair.h' line='329' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-112'/>
      <parameter type-id='type-id-89'/>
      <return type-id='type-id-112'/>
    </function-decl>
    <pointer-type-def type-id='type-id-59' size-in-bits='64' id='type-id-248'/>
    <function-decl name='nvlist_lookup_int64' filepath='../../include/sys/nvpair.h' line='211' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-112'/>
      <parameter type-id='type-id-89'/>
      <parameter type-id='type-id-248'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='zfs_prop_default_string' filepath='../../include/libzfs.h' line='483' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-89'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_string' filepath='../../include/sys/nvpair.h' line='328' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-112'/>
      <parameter type-id='type-id-89'/>
      <return type-id='type-id-29'/>
    </function-decl>
    <pointer-type-def type-id='type-id-110' size-in-bits='64' id='type-id-249'/>
    <pointer-type-def type-id='type-id-19' size-in-bits='64' id='type-id-250'/>
    <function-decl name='nvlist_lookup_uint64_array' filepath='../../include/sys/nvpair.h' line='225' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-112'/>
      <parameter type-id='type-id-89'/>
      <parameter type-id='type-id-249'/>
      <parameter type-id='type-id-250'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='nvlist_empty' filepath='../../include/sys/nvpair.h' line='239' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-112'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <class-decl name='mntent' size-in-bits='320' is-struct='yes' visibility='default' filepath='/usr/include/mntent.h' line='51' column='1' id='type-id-251'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mnt_fsname' type-id='type-id-29' visibility='default' filepath='/usr/include/mntent.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='mnt_dir' type-id='type-id-29' visibility='default' filepath='/usr/include/mntent.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='mnt_type' type-id='type-id-29' visibility='default' filepath='/usr/include/mntent.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='mnt_opts' type-id='type-id-29' visibility='default' filepath='/usr/include/mntent.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='mnt_freq' type-id='type-id-1' visibility='default' filepath='/usr/include/mntent.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='mnt_passno' type-id='type-id-1' visibility='default' filepath='/usr/include/mntent.h' line='58' column='1'/>
      </data-member>
    </class-decl>
    <qualified-type-def type-id='type-id-251' const='yes' id='type-id-252'/>
    <pointer-type-def type-id='type-id-252' size-in-bits='64' id='type-id-253'/>
    <function-decl name='hasmntopt' filepath='/usr/include/mntent.h' line='89' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-253'/>
      <parameter type-id='type-id-89'/>
      <return type-id='type-id-29'/>
    </function-decl>
    <pointer-type-def type-id='type-id-32' size-in-bits='64' id='type-id-254'/>
    <function-decl name='zfs_prop_get_numeric' mangled-name='zfs_prop_get_numeric' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='3003' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_get_numeric'>
      <parameter type-id='type-id-98' name='zhp' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='3003' column='1'/>
      <parameter type-id='type-id-3' name='prop' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='3003' column='1'/>
      <parameter type-id='type-id-254' name='value' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='3003' column='1'/>
      <parameter type-id='type-id-239' name='src' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='3004' column='1'/>
      <parameter type-id='type-id-29' name='statbuf' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='3004' column='1'/>
      <parameter type-id='type-id-38' name='statlen' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='3004' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='zfs_error_fmt' filepath='../../include/libzfs_impl.h' line='136' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-99'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-89'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='zfs_prop_get_userquota_int' mangled-name='zfs_prop_get_userquota_int' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='3207' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_get_userquota_int'>
      <parameter type-id='type-id-98' name='zhp' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='3207' column='1'/>
      <parameter type-id='type-id-89' name='propname' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='3207' column='1'/>
      <parameter type-id='type-id-254' name='propvalue' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='3208' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='zfs_prop_get_userquota' mangled-name='zfs_prop_get_userquota' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='3217' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_get_userquota'>
      <parameter type-id='type-id-98' name='zhp' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='3217' column='1'/>
      <parameter type-id='type-id-89' name='propname' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='3217' column='1'/>
      <parameter type-id='type-id-29' name='propbuf' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='3218' column='1'/>
      <parameter type-id='type-id-1' name='proplen' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='3218' column='1'/>
      <parameter type-id='type-id-6' name='literal' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='3218' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='zfs_prop_get_written_int' mangled-name='zfs_prop_get_written_int' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='3253' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_get_written_int'>
      <parameter type-id='type-id-98' name='zhp' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='3253' column='1'/>
      <parameter type-id='type-id-89' name='propname' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='3253' column='1'/>
      <parameter type-id='type-id-254' name='propvalue' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='3254' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='zfs_prop_get_written' mangled-name='zfs_prop_get_written' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='3288' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_get_written'>
      <parameter type-id='type-id-98' name='zhp' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='3288' column='1'/>
      <parameter type-id='type-id-89' name='propname' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='3288' column='1'/>
      <parameter type-id='type-id-29' name='propbuf' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='3289' column='1'/>
      <parameter type-id='type-id-1' name='proplen' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='3289' column='1'/>
      <parameter type-id='type-id-6' name='literal' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='3289' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <qualified-type-def type-id='type-id-97' const='yes' id='type-id-255'/>
    <pointer-type-def type-id='type-id-255' size-in-bits='64' id='type-id-256'/>
    <function-decl name='zfs_get_name' mangled-name='zfs_get_name' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='3313' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_get_name'>
      <parameter type-id='type-id-256' name='zhp' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='3313' column='1'/>
      <return type-id='type-id-89'/>
    </function-decl>
    <function-decl name='zfs_get_pool_name' mangled-name='zfs_get_pool_name' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='3322' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_get_pool_name'>
      <parameter type-id='type-id-256' name='zhp' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='3313' column='1'/>
      <return type-id='type-id-89'/>
    </function-decl>
    <function-decl name='zfs_get_type' mangled-name='zfs_get_type' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='3331' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_get_type'>
      <parameter type-id='type-id-256' name='zhp' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='3331' column='1'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='zfs_parent_name' mangled-name='zfs_parent_name' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='3377' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_parent_name'>
      <parameter type-id='type-id-98' name='zhp' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='3377' column='1'/>
      <parameter type-id='type-id-29' name='buf' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='3377' column='1'/>
      <parameter type-id='type-id-38' name='buflen' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='3377' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='zfs_dataset_exists' mangled-name='zfs_dataset_exists' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='3472' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_dataset_exists'>
      <parameter type-id='type-id-23' name='hdl' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='3472' column='1'/>
      <parameter type-id='type-id-89' name='path' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='3472' column='1'/>
      <parameter type-id='type-id-26' name='types' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='3472' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='create_parents' mangled-name='create_parents' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='3498' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='create_parents'>
      <parameter type-id='type-id-23' name='hdl' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='3498' column='1'/>
      <parameter type-id='type-id-29' name='target' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='3498' column='1'/>
      <parameter type-id='type-id-1' name='prefixlen' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='3498' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='zfs_create' mangled-name='zfs_create' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='3609' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_create'>
      <parameter type-id='type-id-23' name='hdl' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='3609' column='1'/>
      <parameter type-id='type-id-89' name='path' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='3609' column='1'/>
      <parameter type-id='type-id-26' name='type' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='3609' column='1'/>
      <parameter type-id='type-id-28' name='props' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='3610' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='zfs_share' filepath='../../include/libzfs.h' line='841' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-87'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='zfs_commit_all_shares' filepath='../../include/libzfs.h' line='863' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='dataset_nestcheck' filepath='../../include/zfs_namecheck.h' line='62' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-89'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='zpool_open' filepath='../../include/libzfs.h' line='234' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-99'/>
      <parameter type-id='type-id-89'/>
      <return type-id='type-id-134'/>
    </function-decl>
    <pointer-type-def type-id='type-id-78' size-in-bits='64' id='type-id-257'/>
    <function-decl name='zfs_crypto_create' filepath='../../include/libzfs.h' line='527' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-99'/>
      <parameter type-id='type-id-29'/>
      <parameter type-id='type-id-112'/>
      <parameter type-id='type-id-112'/>
      <parameter type-id='type-id-13'/>
      <parameter type-id='type-id-257'/>
      <parameter type-id='type-id-250'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <enum-decl name='lzc_dataset_type' filepath='../../include/libzfs_core.h' line='47' column='1' id='type-id-258'>
      <underlying-type type-id='type-id-7'/>
      <enumerator name='LZC_DATSET_TYPE_ZFS' value='2'/>
      <enumerator name='LZC_DATSET_TYPE_ZVOL' value='3'/>
    </enum-decl>
    <function-decl name='lzc_create' filepath='../../include/libzfs_core.h' line='53' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-89'/>
      <parameter type-id='type-id-258'/>
      <parameter type-id='type-id-112'/>
      <parameter type-id='type-id-78'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='zfs_create_ancestors' mangled-name='zfs_create_ancestors' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='3572' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_create_ancestors'>
      <parameter type-id='type-id-23' name='hdl' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='3572' column='1'/>
      <parameter type-id='type-id-89' name='path' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='3572' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='zfs_destroy' mangled-name='zfs_destroy' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='3784' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_destroy'>
      <parameter type-id='type-id-98' name='zhp' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='3784' column='1'/>
      <parameter type-id='type-id-6' name='defer' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='3784' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='lzc_destroy_bookmarks' filepath='../../include/libzfs_core.h' line='61' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-112'/>
      <parameter type-id='type-id-115'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='lzc_destroy_snaps' filepath='../../include/libzfs_core.h' line='57' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-112'/>
      <parameter type-id='type-id-13'/>
      <parameter type-id='type-id-115'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='zfs_standard_error_fmt' filepath='../../include/libzfs_impl.h' line='145' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-99'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-89'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='lzc_destroy' filepath='../../include/libzfs_core.h' line='121' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-89'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='zfs_destroy_snaps' mangled-name='zfs_destroy_snaps' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='3852' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_destroy_snaps'>
      <parameter type-id='type-id-98' name='zhp' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='3852' column='1'/>
      <parameter type-id='type-id-29' name='snapname' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='3852' column='1'/>
      <parameter type-id='type-id-6' name='defer' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='3852' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='zfs_destroy_snaps_nvl' mangled-name='zfs_destroy_snaps_nvl' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='3876' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_destroy_snaps_nvl'>
      <parameter type-id='type-id-23' name='hdl' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='3876' column='1'/>
      <parameter type-id='type-id-28' name='snaps' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='3876' column='1'/>
      <parameter type-id='type-id-6' name='defer' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='3876' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='lzc_exists' filepath='../../include/libzfs_core.h' line='115' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-89'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='nvlist_add_boolean' filepath='../../include/sys/nvpair.h' line='168' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-112'/>
      <parameter type-id='type-id-89'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='fnvpair_value_int32' filepath='../../include/sys/nvpair.h' line='345' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-141'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='zfs_clone' mangled-name='zfs_clone' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='3923' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_clone'>
      <parameter type-id='type-id-98' name='zhp' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='3923' column='1'/>
      <parameter type-id='type-id-89' name='target' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='3923' column='1'/>
      <parameter type-id='type-id-28' name='props' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='3923' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='zfs_crypto_clone_check' filepath='../../include/libzfs.h' line='529' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-99'/>
      <parameter type-id='type-id-87'/>
      <parameter type-id='type-id-29'/>
      <parameter type-id='type-id-112'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='lzc_clone' filepath='../../include/libzfs_core.h' line='55' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-89'/>
      <parameter type-id='type-id-89'/>
      <parameter type-id='type-id-112'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='zfs_promote' mangled-name='zfs_promote' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='4009' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_promote'>
      <parameter type-id='type-id-98' name='zhp' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='4009' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='lzc_promote' filepath='../../include/libzfs_core.h' line='56' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-89'/>
      <parameter type-id='type-id-29'/>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='zfs_snapshot_nvl' mangled-name='zfs_snapshot_nvl' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='4093' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_snapshot_nvl'>
      <parameter type-id='type-id-23' name='hdl' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='4093' column='1'/>
      <parameter type-id='type-id-28' name='snaps' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='4093' column='1'/>
      <parameter type-id='type-id-28' name='props' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='4093' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='lzc_snapshot' filepath='../../include/libzfs_core.h' line='52' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-112'/>
      <parameter type-id='type-id-112'/>
      <parameter type-id='type-id-115'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='zfs_snapshot' mangled-name='zfs_snapshot' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='4173' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_snapshot'>
      <parameter type-id='type-id-23' name='hdl' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='4173' column='1'/>
      <parameter type-id='type-id-89' name='path' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='4173' column='1'/>
      <parameter type-id='type-id-6' name='recursive' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='4173' column='1'/>
      <parameter type-id='type-id-28' name='props' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='4174' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='zfs_rollback' mangled-name='zfs_rollback' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='4274' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_rollback'>
      <parameter type-id='type-id-98' name='zhp' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='4274' column='1'/>
      <parameter type-id='type-id-98' name='snap' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='4274' column='1'/>
      <parameter type-id='type-id-6' name='force' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='4274' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='zfs_iter_snapshots' filepath='../../include/libzfs.h' line='617' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-87'/>
      <parameter type-id='type-id-13'/>
      <parameter type-id='type-id-103'/>
      <parameter type-id='type-id-21'/>
      <parameter type-id='type-id-45'/>
      <parameter type-id='type-id-45'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='lzc_rollback_to' filepath='../../include/libzfs_core.h' line='118' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-89'/>
      <parameter type-id='type-id-89'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <class-decl name='renameflags' size-in-bits='32' is-struct='yes' visibility='default' filepath='../../include/libzfs.h' line='650' column='1' id='type-id-259'>
      <data-member access='public' layout-offset-in-bits='31'>
        <var-decl name='recursive' type-id='type-id-1' visibility='default' filepath='../../include/libzfs.h' line='652' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='30'>
        <var-decl name='nounmount' type-id='type-id-1' visibility='default' filepath='../../include/libzfs.h' line='655' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='29'>
        <var-decl name='forceunmount' type-id='type-id-1' visibility='default' filepath='../../include/libzfs.h' line='658' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='renameflags_t' type-id='type-id-259' filepath='../../include/libzfs.h' line='659' column='1' id='type-id-260'/>
    <function-decl name='zfs_rename' mangled-name='zfs_rename' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='4374' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_rename'>
      <parameter type-id='type-id-98' name='zhp' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='4374' column='1'/>
      <parameter type-id='type-id-89' name='target' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='4374' column='1'/>
      <parameter type-id='type-id-260' name='flags' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='4374' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='changelist_rename' filepath='../../include/libzfs_impl.h' line='184' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-237'/>
      <parameter type-id='type-id-89'/>
      <parameter type-id='type-id-89'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='zfs_get_all_props' mangled-name='zfs_get_all_props' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='4576' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_get_all_props'>
      <parameter type-id='type-id-98' name='zhp' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='4576' column='1'/>
      <return type-id='type-id-28'/>
    </function-decl>
    <function-decl name='zfs_get_recvd_props' mangled-name='zfs_get_recvd_props' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='4582' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_get_recvd_props'>
      <parameter type-id='type-id-98' name='zhp' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='4582' column='1'/>
      <return type-id='type-id-28'/>
    </function-decl>
    <function-decl name='zfs_get_user_props' mangled-name='zfs_get_user_props' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='4591' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_get_user_props'>
      <parameter type-id='type-id-98' name='zhp' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='4576' column='1'/>
      <return type-id='type-id-28'/>
    </function-decl>
    <class-decl name='zprop_list' size-in-bits='448' is-struct='yes' visibility='default' filepath='../../include/libzfs.h' line='536' column='1' id='type-id-261'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='pl_prop' type-id='type-id-1' visibility='default' filepath='../../include/libzfs.h' line='537' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='pl_user_prop' type-id='type-id-29' visibility='default' filepath='../../include/libzfs.h' line='538' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='pl_next' type-id='type-id-262' visibility='default' filepath='../../include/libzfs.h' line='539' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='pl_all' type-id='type-id-6' visibility='default' filepath='../../include/libzfs.h' line='540' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='pl_width' type-id='type-id-38' visibility='default' filepath='../../include/libzfs.h' line='541' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='pl_recvd_width' type-id='type-id-38' visibility='default' filepath='../../include/libzfs.h' line='542' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='pl_fixed' type-id='type-id-6' visibility='default' filepath='../../include/libzfs.h' line='543' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-261' size-in-bits='64' id='type-id-262'/>
    <typedef-decl name='zprop_list_t' type-id='type-id-261' filepath='../../include/libzfs.h' line='544' column='1' id='type-id-263'/>
    <pointer-type-def type-id='type-id-263' size-in-bits='64' id='type-id-264'/>
    <pointer-type-def type-id='type-id-264' size-in-bits='64' id='type-id-265'/>
    <function-decl name='zfs_expand_proplist' mangled-name='zfs_expand_proplist' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='4610' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_expand_proplist'>
      <parameter type-id='type-id-98' name='zhp' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='4610' column='1'/>
      <parameter type-id='type-id-265' name='plp' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='4610' column='1'/>
      <parameter type-id='type-id-6' name='received' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='4610' column='1'/>
      <parameter type-id='type-id-6' name='literal' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='4611' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <pointer-type-def type-id='type-id-262' size-in-bits='64' id='type-id-266'/>
    <function-decl name='zprop_expand_list' filepath='../../include/libzfs_impl.h' line='155' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-99'/>
      <parameter type-id='type-id-266'/>
      <parameter type-id='type-id-81'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='zfs_prune_proplist' mangled-name='zfs_prune_proplist' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='4707' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prune_proplist'>
      <parameter type-id='type-id-98' name='zhp' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='4707' column='1'/>
      <parameter type-id='type-id-30' name='props' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='4707' column='1'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='nvlist_remove' filepath='../../include/sys/nvpair.h' line='198' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-112'/>
      <parameter type-id='type-id-89'/>
      <parameter type-id='type-id-140'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='zfs_smb_acl_add' mangled-name='zfs_smb_acl_add' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='4789' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_smb_acl_add'>
      <parameter type-id='type-id-23' name='hdl' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='4789' column='1'/>
      <parameter type-id='type-id-29' name='dataset' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='4789' column='1'/>
      <parameter type-id='type-id-29' name='path' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='4790' column='1'/>
      <parameter type-id='type-id-29' name='resource' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='4790' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='ioctl' filepath='/usr/include/x86_64-linux-gnu/sys/ioctl.h' line='41' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-45'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='zfs_smb_acl_remove' mangled-name='zfs_smb_acl_remove' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='4797' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_smb_acl_remove'>
      <parameter type-id='type-id-23' name='hdl' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='4789' column='1'/>
      <parameter type-id='type-id-29' name='dataset' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='4789' column='1'/>
      <parameter type-id='type-id-29' name='path' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='4790' column='1'/>
      <parameter type-id='type-id-29' name='resource' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='4790' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='zfs_smb_acl_purge' mangled-name='zfs_smb_acl_purge' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='4805' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_smb_acl_purge'>
      <parameter type-id='type-id-23' name='hdl' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='4805' column='1'/>
      <parameter type-id='type-id-29' name='dataset' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='4805' column='1'/>
      <parameter type-id='type-id-29' name='path' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='4805' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='zfs_smb_acl_rename' mangled-name='zfs_smb_acl_rename' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='4812' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_smb_acl_rename'>
      <parameter type-id='type-id-23' name='hdl' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='4812' column='1'/>
      <parameter type-id='type-id-29' name='dataset' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='4812' column='1'/>
      <parameter type-id='type-id-29' name='path' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='4812' column='1'/>
      <parameter type-id='type-id-29' name='oldname' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='4813' column='1'/>
      <parameter type-id='type-id-29' name='newname' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='4813' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' filepath='../../include/sys/fs/zfs.h' line='192' column='1' id='type-id-267'>
      <underlying-type type-id='type-id-7'/>
      <enumerator name='ZFS_PROP_USERUSED' value='0'/>
      <enumerator name='ZFS_PROP_USERQUOTA' value='1'/>
      <enumerator name='ZFS_PROP_GROUPUSED' value='2'/>
      <enumerator name='ZFS_PROP_GROUPQUOTA' value='3'/>
      <enumerator name='ZFS_PROP_USEROBJUSED' value='4'/>
      <enumerator name='ZFS_PROP_USEROBJQUOTA' value='5'/>
      <enumerator name='ZFS_PROP_GROUPOBJUSED' value='6'/>
      <enumerator name='ZFS_PROP_GROUPOBJQUOTA' value='7'/>
      <enumerator name='ZFS_PROP_PROJECTUSED' value='8'/>
      <enumerator name='ZFS_PROP_PROJECTQUOTA' value='9'/>
      <enumerator name='ZFS_PROP_PROJECTOBJUSED' value='10'/>
      <enumerator name='ZFS_PROP_PROJECTOBJQUOTA' value='11'/>
      <enumerator name='ZFS_NUM_USERQUOTA_PROPS' value='12'/>
    </enum-decl>
    <typedef-decl name='zfs_userquota_prop_t' type-id='type-id-267' filepath='../../include/sys/fs/zfs.h' line='206' column='1' id='type-id-268'/>
    <typedef-decl name='uid_t' type-id='type-id-197' filepath='/usr/include/x86_64-linux-gnu/sys/types.h' line='79' column='1' id='type-id-269'/>
    <pointer-type-def type-id='type-id-270' size-in-bits='64' id='type-id-271'/>
    <typedef-decl name='zfs_userspace_cb_t' type-id='type-id-271' filepath='../../include/libzfs.h' line='738' column='1' id='type-id-272'/>
    <function-decl name='zfs_userspace' mangled-name='zfs_userspace' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='4820' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_userspace'>
      <parameter type-id='type-id-98' name='zhp' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='4820' column='1'/>
      <parameter type-id='type-id-268' name='type' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='4820' column='1'/>
      <parameter type-id='type-id-272' name='func' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='4821' column='1'/>
      <parameter type-id='type-id-21' name='arg' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='4821' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='zfs_hold' mangled-name='zfs_hold' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='4900' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_hold'>
      <parameter type-id='type-id-98' name='zhp' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='4900' column='1'/>
      <parameter type-id='type-id-89' name='snapname' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='4900' column='1'/>
      <parameter type-id='type-id-89' name='tag' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='4900' column='1'/>
      <parameter type-id='type-id-6' name='recursive' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='4901' column='1'/>
      <parameter type-id='type-id-1' name='cleanup_fd' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='4901' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='zfs_hold_nvl' mangled-name='zfs_hold_nvl' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='4932' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_hold_nvl'>
      <parameter type-id='type-id-98' name='zhp' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='4932' column='1'/>
      <parameter type-id='type-id-1' name='cleanup_fd' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='4932' column='1'/>
      <parameter type-id='type-id-28' name='holds' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='4932' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='lzc_hold' filepath='../../include/libzfs_core.h' line='73' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-112'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-115'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='zfs_release' mangled-name='zfs_release' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='5031' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_release'>
      <parameter type-id='type-id-98' name='zhp' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='5031' column='1'/>
      <parameter type-id='type-id-89' name='snapname' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='5031' column='1'/>
      <parameter type-id='type-id-89' name='tag' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='5031' column='1'/>
      <parameter type-id='type-id-6' name='recursive' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='5032' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='lzc_release' filepath='../../include/libzfs_core.h' line='74' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-112'/>
      <parameter type-id='type-id-115'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='lzc_get_holds' filepath='../../include/libzfs_core.h' line='75' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-89'/>
      <parameter type-id='type-id-115'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='fnvlist_add_nvlist' filepath='../../include/sys/nvpair.h' line='298' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-112'/>
      <parameter type-id='type-id-89'/>
      <parameter type-id='type-id-112'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='zfs_get_fsacl' mangled-name='zfs_get_fsacl' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='5112' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_get_fsacl'>
      <parameter type-id='type-id-98' name='zhp' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='5112' column='1'/>
      <parameter type-id='type-id-113' name='nvl' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='5112' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='nvlist_unpack' filepath='../../include/sys/nvpair.h' line='155' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-29'/>
      <parameter type-id='type-id-45'/>
      <parameter type-id='type-id-115'/>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='zfs_set_fsacl' mangled-name='zfs_set_fsacl' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='5179' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_set_fsacl'>
      <parameter type-id='type-id-98' name='zhp' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='5179' column='1'/>
      <parameter type-id='type-id-6' name='un' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='5179' column='1'/>
      <parameter type-id='type-id-28' name='nvl' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='5179' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='nvlist_size' filepath='../../include/sys/nvpair.h' line='153' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-112'/>
      <parameter type-id='type-id-110'/>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='nvlist_pack' filepath='../../include/sys/nvpair.h' line='154' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-112'/>
      <parameter type-id='type-id-92'/>
      <parameter type-id='type-id-110'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='zfs_get_holds' mangled-name='zfs_get_holds' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='5233' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_get_holds'>
      <parameter type-id='type-id-98' name='zhp' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='5233' column='1'/>
      <parameter type-id='type-id-113' name='nvl' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='5233' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='zpool_get_config' filepath='../../include/libzfs.h' line='412' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-134'/>
      <parameter type-id='type-id-115'/>
      <return type-id='type-id-112'/>
    </function-decl>
    <pointer-type-def type-id='type-id-115' size-in-bits='64' id='type-id-273'/>
    <function-decl name='nvlist_lookup_nvlist_array' filepath='../../include/sys/nvpair.h' line='227' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-112'/>
      <parameter type-id='type-id-89'/>
      <parameter type-id='type-id-273'/>
      <parameter type-id='type-id-250'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' filepath='../../include/sys/fs/zfs.h' line='1439' column='1' id='type-id-274'>
      <underlying-type type-id='type-id-7'/>
      <enumerator name='ZFS_WAIT_DELETEQ' value='0'/>
      <enumerator name='ZFS_WAIT_NUM_ACTIVITIES' value='1'/>
    </enum-decl>
    <typedef-decl name='zfs_wait_activity_t' type-id='type-id-274' filepath='../../include/sys/fs/zfs.h' line='1442' column='1' id='type-id-275'/>
    <function-decl name='zfs_wait_status' mangled-name='zfs_wait_status' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='5547' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_wait_status'>
      <parameter type-id='type-id-98' name='zhp' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='5547' column='1'/>
      <parameter type-id='type-id-275' name='activity' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='5547' column='1'/>
      <parameter type-id='type-id-114' name='missing' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='5548' column='1'/>
      <parameter type-id='type-id-114' name='waited' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_dataset.c' line='5548' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='lzc_wait_fs' filepath='../../include/libzfs_core.h' line='136' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-89'/>
      <parameter type-id='type-id-274'/>
      <parameter type-id='type-id-219'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='changelist_remove' filepath='../../include/libzfs_impl.h' line='185' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-237'/>
      <parameter type-id='type-id-89'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-270'>
      <parameter type-id='type-id-21'/>
      <parameter type-id='type-id-89'/>
      <parameter type-id='type-id-269'/>
      <parameter type-id='type-id-32'/>
      <return type-id='type-id-1'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='libzfs_diff.c' comp-dir-path='/home/nabijaczleweli/store/code/zfs/lib/libzfs' language='LANG_C99'>
    <function-decl name='zfs_show_diffs' mangled-name='zfs_show_diffs' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_diff.c' line='716' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_show_diffs'>
      <parameter type-id='type-id-98' name='zhp' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_diff.c' line='716' column='1'/>
      <parameter type-id='type-id-1' name='outfd' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_diff.c' line='716' column='1'/>
      <parameter type-id='type-id-89' name='fromsnap' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_diff.c' line='716' column='1'/>
      <parameter type-id='type-id-89' name='tosnap' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_diff.c' line='717' column='1'/>
      <parameter type-id='type-id-1' name='flags' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_diff.c' line='717' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='zfs_validate_name' filepath='../../include/libzfs_impl.h' line='203' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-99'/>
      <parameter type-id='type-id-89'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-13'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='zfs_asprintf' filepath='../../include/libzfs_impl.h' line='140' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-99'/>
      <parameter type-id='type-id-89'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-29'/>
    </function-decl>
    <function-decl name='is_mounted' filepath='../../include/libzfs.h' line='823' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-99'/>
      <parameter type-id='type-id-89'/>
      <parameter type-id='type-id-92'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <class-decl name='differ_info' size-in-bits='9024' is-struct='yes' visibility='default' filepath='../../include/libzfs_impl.h' line='220' column='1' id='type-id-276'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='zhp' type-id='type-id-98' visibility='default' filepath='../../include/libzfs_impl.h' line='221' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='fromsnap' type-id='type-id-29' visibility='default' filepath='../../include/libzfs_impl.h' line='222' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='frommnt' type-id='type-id-29' visibility='default' filepath='../../include/libzfs_impl.h' line='223' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='tosnap' type-id='type-id-29' visibility='default' filepath='../../include/libzfs_impl.h' line='224' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='tomnt' type-id='type-id-29' visibility='default' filepath='../../include/libzfs_impl.h' line='225' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='ds' type-id='type-id-29' visibility='default' filepath='../../include/libzfs_impl.h' line='226' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='dsmnt' type-id='type-id-29' visibility='default' filepath='../../include/libzfs_impl.h' line='227' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='tmpsnap' type-id='type-id-29' visibility='default' filepath='../../include/libzfs_impl.h' line='228' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='errbuf' type-id='type-id-33' visibility='default' filepath='../../include/libzfs_impl.h' line='229' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8704'>
        <var-decl name='isclone' type-id='type-id-6' visibility='default' filepath='../../include/libzfs_impl.h' line='230' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8736'>
        <var-decl name='scripted' type-id='type-id-6' visibility='default' filepath='../../include/libzfs_impl.h' line='231' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8768'>
        <var-decl name='classify' type-id='type-id-6' visibility='default' filepath='../../include/libzfs_impl.h' line='232' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8800'>
        <var-decl name='timestamped' type-id='type-id-6' visibility='default' filepath='../../include/libzfs_impl.h' line='233' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8832'>
        <var-decl name='shares' type-id='type-id-32' visibility='default' filepath='../../include/libzfs_impl.h' line='234' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8896'>
        <var-decl name='zerr' type-id='type-id-1' visibility='default' filepath='../../include/libzfs_impl.h' line='235' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8928'>
        <var-decl name='cleanupfd' type-id='type-id-1' visibility='default' filepath='../../include/libzfs_impl.h' line='236' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8960'>
        <var-decl name='outputfd' type-id='type-id-1' visibility='default' filepath='../../include/libzfs_impl.h' line='237' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8992'>
        <var-decl name='datafd' type-id='type-id-1' visibility='default' filepath='../../include/libzfs_impl.h' line='238' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-276' size-in-bits='64' id='type-id-277'/>
    <function-decl name='find_shares_object' filepath='../../include/libzfs_impl.h' line='257' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-277'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='pipe2' filepath='/usr/include/unistd.h' line='422' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-231'/>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <union-decl name='pthread_attr_t' size-in-bits='448' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='56' column='1' id='type-id-278'>
      <data-member access='private'>
        <var-decl name='__size' type-id='type-id-279' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='58' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='__align' type-id='type-id-59' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='59' column='1'/>
      </data-member>
    </union-decl>

    <array-type-def dimensions='1' type-id='type-id-42' size-in-bits='448' id='type-id-279'>
      <subrange length='56' type-id='type-id-43' id='type-id-280'/>

    </array-type-def>
    <qualified-type-def type-id='type-id-278' const='yes' id='type-id-281'/>
    <pointer-type-def type-id='type-id-281' size-in-bits='64' id='type-id-282'/>
    <pointer-type-def type-id='type-id-283' size-in-bits='64' id='type-id-284'/>
    <function-decl name='pthread_create' filepath='/usr/include/pthread.h' line='234' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-110'/>
      <parameter type-id='type-id-282'/>
      <parameter type-id='type-id-284'/>
      <parameter type-id='type-id-21'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='pthread_join' filepath='/usr/include/pthread.h' line='251' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-45'/>
      <parameter type-id='type-id-111'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='pthread_cancel' filepath='/usr/include/pthread.h' line='514' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-45'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-283'>
      <parameter type-id='type-id-21'/>
      <return type-id='type-id-21'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='libzfs_import.c' comp-dir-path='/home/nabijaczleweli/store/code/zfs/lib/libzfs' language='LANG_C99'>
    <class-decl name='pool_config_ops' size-in-bits='128' is-struct='yes' visibility='default' filepath='../../include/libzutil.h' line='51' column='1' id='type-id-285'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='pco_refresh_config' type-id='type-id-286' visibility='default' filepath='../../include/libzutil.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='pco_pool_active' type-id='type-id-287' visibility='default' filepath='../../include/libzutil.h' line='53' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='refresh_config_func_t' type-id='type-id-288' filepath='../../include/libzutil.h' line='47' column='1' id='type-id-289'/>
    <pointer-type-def type-id='type-id-289' size-in-bits='64' id='type-id-286'/>
    <typedef-decl name='pool_active_func_t' type-id='type-id-290' filepath='../../include/libzutil.h' line='49' column='1' id='type-id-291'/>
    <pointer-type-def type-id='type-id-291' size-in-bits='64' id='type-id-287'/>
    <qualified-type-def type-id='type-id-285' const='yes' id='type-id-292'/>
    <typedef-decl name='pool_config_ops_t' type-id='type-id-292' filepath='../../include/libzutil.h' line='54' column='1' id='type-id-293'/>
    <var-decl name='libzfs_config_ops' type-id='type-id-293' mangled-name='libzfs_config_ops' visibility='default' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_import.c' line='122' column='1' elf-symbol-id='libzfs_config_ops'/>
    <function-decl name='zcmd_write_conf_nvlist' filepath='../../include/libzfs_impl.h' line='177' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-99'/>
      <parameter type-id='type-id-130'/>
      <parameter type-id='type-id-112'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='zpool_clear_label' mangled-name='zpool_clear_label' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_import.c' line='144' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_clear_label'>
      <parameter type-id='type-id-1' name='fd' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_import.c' line='144' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='pread64' filepath='/usr/include/unistd.h' line='404' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-21'/>
      <parameter type-id='type-id-45'/>
      <parameter type-id='type-id-59'/>
      <return type-id='type-id-59'/>
    </function-decl>
    <function-decl name='pwrite64' filepath='/usr/include/unistd.h' line='408' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-21'/>
      <parameter type-id='type-id-45'/>
      <parameter type-id='type-id-59'/>
      <return type-id='type-id-59'/>
    </function-decl>
    <enum-decl name='pool_state' filepath='../../include/sys/fs/zfs.h' line='914' column='1' id='type-id-295'>
      <underlying-type type-id='type-id-7'/>
      <enumerator name='POOL_STATE_ACTIVE' value='0'/>
      <enumerator name='POOL_STATE_EXPORTED' value='1'/>
      <enumerator name='POOL_STATE_DESTROYED' value='2'/>
      <enumerator name='POOL_STATE_SPARE' value='3'/>
      <enumerator name='POOL_STATE_L2CACHE' value='4'/>
      <enumerator name='POOL_STATE_UNINITIALIZED' value='5'/>
      <enumerator name='POOL_STATE_UNAVAIL' value='6'/>
      <enumerator name='POOL_STATE_POTENTIALLY_ACTIVE' value='7'/>
    </enum-decl>
    <typedef-decl name='pool_state_t' type-id='type-id-295' filepath='../../include/sys/fs/zfs.h' line='923' column='1' id='type-id-296'/>
    <pointer-type-def type-id='type-id-296' size-in-bits='64' id='type-id-297'/>
    <function-decl name='zpool_in_use' mangled-name='zpool_in_use' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_import.c' line='300' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_in_use'>
      <parameter type-id='type-id-23' name='hdl' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_import.c' line='300' column='1'/>
      <parameter type-id='type-id-1' name='fd' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_import.c' line='300' column='1'/>
      <parameter type-id='type-id-297' name='state' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_import.c' line='300' column='1'/>
      <parameter type-id='type-id-92' name='namestr' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_import.c' line='300' column='1'/>
      <parameter type-id='type-id-114' name='inuse' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_import.c' line='301' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='zpool_read_label' filepath='../../include/libzutil.h' line='79' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-115'/>
      <parameter type-id='type-id-231'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <pointer-type-def type-id='type-id-298' size-in-bits='64' id='type-id-299'/>
    <function-decl name='zpool_iter' filepath='../../include/libzfs.h' line='247' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-99'/>
      <parameter type-id='type-id-299'/>
      <parameter type-id='type-id-21'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-290'>
      <parameter type-id='type-id-21'/>
      <parameter type-id='type-id-89'/>
      <parameter type-id='type-id-32'/>
      <parameter type-id='type-id-114'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-298'>
      <parameter type-id='type-id-134'/>
      <parameter type-id='type-id-21'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-288'>
      <parameter type-id='type-id-21'/>
      <parameter type-id='type-id-28'/>
      <return type-id='type-id-28'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='libzfs_iter.c' comp-dir-path='/home/nabijaczleweli/store/code/zfs/lib/libzfs' language='LANG_C99'>
    <function-decl name='zfs_iter_filesystems' mangled-name='zfs_iter_filesystems' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_iter.c' line='107' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_iter_filesystems'>
      <parameter type-id='type-id-98' name='zhp' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_iter.c' line='107' column='1'/>
      <parameter type-id='type-id-144' name='func' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_iter.c' line='107' column='1'/>
      <parameter type-id='type-id-21' name='data' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_iter.c' line='107' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='make_dataset_handle_zc' filepath='../../include/libzfs_impl.h' line='150' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-99'/>
      <parameter type-id='type-id-130'/>
      <return type-id='type-id-87'/>
    </function-decl>
    <function-decl name='zfs_iter_snapshots' mangled-name='zfs_iter_snapshots' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_iter.c' line='143' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_iter_snapshots'>
      <parameter type-id='type-id-98' name='zhp' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_iter.c' line='143' column='1'/>
      <parameter type-id='type-id-6' name='simple' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_iter.c' line='143' column='1'/>
      <parameter type-id='type-id-144' name='func' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_iter.c' line='143' column='1'/>
      <parameter type-id='type-id-21' name='data' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_iter.c' line='144' column='1'/>
      <parameter type-id='type-id-32' name='min_txg' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_iter.c' line='144' column='1'/>
      <parameter type-id='type-id-32' name='max_txg' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_iter.c' line='144' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='make_dataset_simple_handle_zc' filepath='../../include/libzfs_impl.h' line='151' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-87'/>
      <parameter type-id='type-id-130'/>
      <return type-id='type-id-87'/>
    </function-decl>
    <function-decl name='zfs_iter_bookmarks' mangled-name='zfs_iter_bookmarks' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_iter.c' line='202' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_iter_bookmarks'>
      <parameter type-id='type-id-98' name='zhp' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_iter.c' line='202' column='1'/>
      <parameter type-id='type-id-144' name='func' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_iter.c' line='202' column='1'/>
      <parameter type-id='type-id-21' name='data' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_iter.c' line='202' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='zfs_get_type' filepath='../../include/libzfs.h' line='470' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-105'/>
      <return type-id='type-id-81'/>
    </function-decl>
    <function-decl name='fnvpair_value_nvlist' filepath='../../include/sys/nvpair.h' line='352' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-141'/>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='make_bookmark_handle' filepath='../../include/libzfs_impl.h' line='196' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-87'/>
      <parameter type-id='type-id-89'/>
      <parameter type-id='type-id-112'/>
      <return type-id='type-id-87'/>
    </function-decl>
    <function-decl name='zfs_iter_snapshots_sorted' mangled-name='zfs_iter_snapshots_sorted' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_iter.c' line='309' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_iter_snapshots_sorted'>
      <parameter type-id='type-id-98' name='zhp' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_iter.c' line='309' column='1'/>
      <parameter type-id='type-id-144' name='callback' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_iter.c' line='309' column='1'/>
      <parameter type-id='type-id-21' name='data' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_iter.c' line='309' column='1'/>
      <parameter type-id='type-id-32' name='min_txg' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_iter.c' line='310' column='1'/>
      <parameter type-id='type-id-32' name='max_txg' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_iter.c' line='310' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='avl_first' filepath='../../include/sys/avl.h' line='205' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-228'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='avl_walk' filepath='../../include/sys/avl_impl.h' line='158' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-228'/>
      <parameter type-id='type-id-21'/>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='zfs_iter_snapspec' mangled-name='zfs_iter_snapspec' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_iter.c' line='383' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_iter_snapspec'>
      <parameter type-id='type-id-98' name='fs_zhp' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_iter.c' line='383' column='1'/>
      <parameter type-id='type-id-89' name='spec_orig' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_iter.c' line='383' column='1'/>
      <parameter type-id='type-id-144' name='func' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_iter.c' line='384' column='1'/>
      <parameter type-id='type-id-21' name='arg' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_iter.c' line='384' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='zfs_dataset_exists' filepath='../../include/libzfs.h' line='815' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-99'/>
      <parameter type-id='type-id-89'/>
      <parameter type-id='type-id-81'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='zfs_iter_children' mangled-name='zfs_iter_children' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_iter.c' line='460' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_iter_children'>
      <parameter type-id='type-id-98' name='zhp' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_iter.c' line='460' column='1'/>
      <parameter type-id='type-id-144' name='func' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_iter.c' line='460' column='1'/>
      <parameter type-id='type-id-21' name='data' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_iter.c' line='460' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='zfs_iter_dependents' mangled-name='zfs_iter_dependents' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_iter.c' line='543' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_iter_dependents'>
      <parameter type-id='type-id-98' name='zhp' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_iter.c' line='543' column='1'/>
      <parameter type-id='type-id-6' name='allowrecursion' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_iter.c' line='543' column='1'/>
      <parameter type-id='type-id-144' name='func' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_iter.c' line='544' column='1'/>
      <parameter type-id='type-id-21' name='data' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_iter.c' line='544' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='zfs_get_clones_nvl' filepath='../../include/libzfs.h' line='518' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-87'/>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='zfs_iter_mounted' mangled-name='zfs_iter_mounted' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_iter.c' line='559' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_iter_mounted'>
      <parameter type-id='type-id-98' name='zhp' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_iter.c' line='559' column='1'/>
      <parameter type-id='type-id-144' name='func' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_iter.c' line='559' column='1'/>
      <parameter type-id='type-id-21' name='data' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_iter.c' line='559' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='libzfs_mount.c' comp-dir-path='/home/nabijaczleweli/store/code/zfs/lib/libzfs' language='LANG_C99'>
    <class-decl name='__anonymous_struct__' size-in-bits='192' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-300' visibility='default' filepath='../../include/libzfs_impl.h' line='213' column='1' id='type-id-301'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='p_prop' type-id='type-id-3' visibility='default' filepath='../../include/libzfs_impl.h' line='214' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='p_name' type-id='type-id-29' visibility='default' filepath='../../include/libzfs_impl.h' line='215' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='p_share_err' type-id='type-id-1' visibility='default' filepath='../../include/libzfs_impl.h' line='216' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='p_unshare_err' type-id='type-id-1' visibility='default' filepath='../../include/libzfs_impl.h' line='217' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='proto_table_t' type-id='type-id-301' filepath='../../include/libzfs_impl.h' line='218' column='1' id='type-id-300'/>

    <array-type-def dimensions='1' type-id='type-id-300' size-in-bits='384' id='type-id-302'>
      <subrange length='2' type-id='type-id-43' id='type-id-72'/>

    </array-type-def>
    <var-decl name='proto_table' type-id='type-id-302' mangled-name='proto_table' visibility='default' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_mount.c' line='105' column='1' elf-symbol-id='proto_table'/>

    <array-type-def dimensions='1' type-id='type-id-94' size-in-bits='64' alignment-in-bits='32' id='type-id-303'>
      <subrange length='2' type-id='type-id-43' id='type-id-72'/>

    </array-type-def>
    <var-decl name='nfs_only' type-id='type-id-303' mangled-name='nfs_only' visibility='default' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_mount.c' line='110' column='1' elf-symbol-id='nfs_only'/>
    <var-decl name='smb_only' type-id='type-id-303' mangled-name='smb_only' visibility='default' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_mount.c' line='115' column='1' elf-symbol-id='smb_only'/>

    <array-type-def dimensions='1' type-id='type-id-94' size-in-bits='96' alignment-in-bits='32' id='type-id-304'>
      <subrange length='3' type-id='type-id-43' id='type-id-108'/>

    </array-type-def>
    <var-decl name='share_all_proto' type-id='type-id-304' mangled-name='share_all_proto' visibility='default' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_mount.c' line='119' column='1' elf-symbol-id='share_all_proto'/>
    <function-decl name='is_mounted' mangled-name='is_mounted' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_mount.c' line='224' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='is_mounted'>
      <parameter type-id='type-id-23' name='zfs_hdl' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_mount.c' line='224' column='1'/>
      <parameter type-id='type-id-89' name='special' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_mount.c' line='224' column='1'/>
      <parameter type-id='type-id-92' name='where' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_mount.c' line='224' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='libzfs_mnttab_find' filepath='../../include/libzfs.h' line='225' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-99'/>
      <parameter type-id='type-id-89'/>
      <parameter type-id='type-id-230'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='zfs_is_mounted' mangled-name='zfs_is_mounted' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_mount.c' line='238' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_is_mounted'>
      <parameter type-id='type-id-98' name='zhp' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_mount.c' line='238' column='1'/>
      <parameter type-id='type-id-92' name='where' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_mount.c' line='238' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_is_mountable' mangled-name='zfs_is_mountable' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_mount.c' line='265' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_is_mountable'>
      <parameter type-id='type-id-98' name='zhp' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_mount.c' line='265' column='1'/>
      <parameter type-id='type-id-29' name='buf' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_mount.c' line='265' column='1'/>
      <parameter type-id='type-id-38' name='buflen' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_mount.c' line='265' column='1'/>
      <parameter type-id='type-id-239' name='source' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_mount.c' line='266' column='1'/>
      <parameter type-id='type-id-1' name='flags' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_mount.c' line='266' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_mount' mangled-name='zfs_mount' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_mount.c' line='367' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_mount'>
      <parameter type-id='type-id-98' name='zhp' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_mount.c' line='367' column='1'/>
      <parameter type-id='type-id-89' name='options' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_mount.c' line='367' column='1'/>
      <parameter type-id='type-id-1' name='flags' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_mount.c' line='367' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='zfs_mount_at' mangled-name='zfs_mount_at' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_mount.c' line='382' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_mount_at'>
      <parameter type-id='type-id-98' name='zhp' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_mount.c' line='382' column='1'/>
      <parameter type-id='type-id-89' name='options' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_mount.c' line='382' column='1'/>
      <parameter type-id='type-id-1' name='flags' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_mount.c' line='382' column='1'/>
      <parameter type-id='type-id-89' name='mountpoint' filepath='/home/nabijaczleweli/store/code/zfs/lib/libzfs/libzfs_mount.c' line='383' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='getprop_uint64' filepath='../../include/libzfs.h' line='510' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-87'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-92'/>
      <return type-id='type-id-45'/>
    </function-decl>
    <pointer-type-def type-id='type-id-13' size-in-bits='64' id='type-id-305'/>
    <function-decl name='zfs_crypto_get_encryption_root' filepath='../../include/libzfs.h' line='526' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-87'/>
      <parameter type-id='type-id-305'/>
      <parameter type-id='type-id-29'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='zfs_crypto_load_key' filepath='../../include/libzfs.h' line='532' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-87'/>
      <parameter type-id='type-id-13'/>
      <parameter type-id='type-id-29'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='mkdirp' filepath='../../lib/libspl/include/libgen.h' line='33' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-89'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <class-decl name='statfs64' size-in-bits='960' is-struct='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/statfs.h' line='49' column='1' id='type-id-306'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='f_type' type-id='type-id-307' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/statfs.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='f_bsize' type-id='type-id-307' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/statfs.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='f_blocks' type-id='type-id-308' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/statfs.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='f_bfree' type-id='type-id-308' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/statfs.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='f_bavail' type-id='type-id-308' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/statfs.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='f_files' type-id='type-id-309' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/statfs.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='f_ffree' type-id='type-id-309' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/statfs.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='f_fsid' type-id='type-id-310' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/statfs.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='f_namelen' type-id='type-id-307' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/statfs.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='f_frsize' type-id='type-id-307' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/statfs.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='f_flags' type-id='type-id-307' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/statfs.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='f_spare' type-id='type-id-311' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/statfs.h' line='62' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__fsword_t' type-id='type-id-59' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='189' column='1' id='type-id-307'/>
    <typedef-decl name='__fsblkcnt64_t' type-id='type-id-45' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='182' column='1' id='type-id-308'/>
    <typedef-decl name='__fsfilcnt64_t' type-id='type-id-45' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='186' column='1' id='type-id-309'/>
    <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-310' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='153' column='1' id='type-id-312'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__val' type-id='type-id-313' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='153' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='64' id='type-id-313'>
      <subrange length='2' type-id='type-id-43' id='type-id-72'/>

    </array-type-def>
    <typedef-decl name='__fsid_t' type-id='type-id-312' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='153' column='1' id='type-id-310'/>

    <array-type-def dimensions='1' type-id='type-id-307' size-in-bits='256' id='type-id-311'>
      <subrange length='4' type-id='type-id-43' id='type-id-225'/>

    </array-type-def>
    <pointer-type-def type-id='type-id-306' size-in-bits='64' id='type-id-314'/>
    <function-decl name='statfs64' filepath='/usr/include/x86_64-linux-gnu/sys/statfs.h' line='43' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-89'/>
      <parameter type-id='type-id-314'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='openat' mangled-name='openat64' filepath='/usr/include/fcntl.h' line='196' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-89'/>
      <parameter type-id='type-id-1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-315'/>
    <pointer-type-def type-id='type-id-315' size-in-bits='64' id='type-id-316'/>
    <function-decl name='fdopendir' filepath='/usr/include/dirent.h' line='141' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-316'/>
    </function-decl>
    <class-decl name='dirent64' size-in-bits='2240' is-struct='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/dirent.h' line='37' column='1' id='type-id-317'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='d_ino' type-id='type-id-318' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/dirent.h' line='39' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='d_off' type-id='type-id-161' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/dirent.h' line='40' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='d_reclen' type-id='type-id-158' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/dirent.h' line='41' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='144'>
        <var-decl name='d_type' type-id='type-id-80' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/dirent.h' line='42' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='152'>
        <var-decl name='d_name' type-id='type-id-25' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/dirent.h' line='43' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__ino64_t' type-id='type-id-45' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='147' column='1' id='type-id-318'/>
    <pointer-type-def type-id='type-id-317' size-in-bits='64' id='type-id-319'/>
    <function-decl name='readdir64' filepath='/usr/include/dirent.h' line='173' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-316'/>
      <return type-id='type-id-319'/>
    </function-decl>
    <function-decl name='closedir' filepath='/usr/include/dirent.h' line='149' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-316'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='do_mount' filepath='../../include/libzfs_impl.h' line='243' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-87'/>
      <parameter type-id='type-id-89'/>
      <parameter type-id='type-id-29'/>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-1'/>
    </function-decl>
