<abi-corpus path='libzfs.so' architecture='elf-amd-x86_64' soname='libzfs.so.4'>
  <elf-needed>
    <dependency name='libzfs_core.so.3'/>
    <dependency name='libnvpair.so.3'/>
    <dependency name='libuutil.so.3'/>
    <dependency name='libm.so.6'/>
    <dependency name='libcrypto.so.1.1'/>
    <dependency name='libz.so.1'/>
    <dependency name='libdl.so.2'/>
    <dependency name='libpthread.so.0'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='bookmark_namecheck' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='cityhash4' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='color_end' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='color_start' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='dataset_namecheck' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='dataset_nestcheck' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='entity_namecheck' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='zprop_index_to_string' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zprop_iter' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zprop_iter_common' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zprop_name_to_prop' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zprop_print_one_property' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zprop_random_value' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zprop_register_hidden' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zprop_register_impl' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zprop_register_index' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zprop_register_number' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zprop_register_string' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zprop_string_to_index' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zprop_valid_for_type' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zprop_values' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zprop_width' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zvol_volsize_to_reservation' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <elf-variable-symbols>
    <elf-symbol name='fletcher_4_abd_ops' size='24' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fletcher_4_avx2_ops' size='64' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fletcher_4_avx512bw_ops' size='64' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fletcher_4_avx512f_ops' size='64' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fletcher_4_sse2_ops' size='64' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fletcher_4_ssse3_ops' size='64' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fletcher_4_superscalar4_ops' size='64' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fletcher_4_superscalar_ops' size='64' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='libzfs_config_ops' size='16' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spa_feature_table' size='1904' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zfeature_checks_disable' size='4' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zfs_deleg_perm_tab' size='512' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zfs_history_event_names' size='328' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zfs_max_dataset_nesting' size='4' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zfs_userquota_prop_prefixes' size='96' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-variable-symbols>
  <abi-instr version='1.0' address-size='64' path='libzfs_changelist.c' comp-dir-path='/home/nabijaczleweli/store/code/zfs/lib/libzfs' language='LANG_C99'>
    <class-decl name='uu_avl_walk' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-1'/>
    <pointer-type-def type-id='type-id-1' size-in-bits='64' id='type-id-2'/>
    <class-decl name='uu_avl' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-3'/>
    <pointer-type-def type-id='type-id-3' size-in-bits='64' id='type-id-4'/>
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-5'/>
    <function-decl name='uu_avl_walk_start' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <type-decl name='void' id='type-id-6'/>
    <pointer-type-def type-id='type-id-6' size-in-bits='64' id='type-id-7'/>
    <function-decl name='uu_avl_walk_next' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <type-decl name='int' size-in-bits='32' id='type-id-8'/>
    <function-decl name='getzoneid' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <class-decl name='zfs_handle' size-in-bits='4928' is-struct='yes' visibility='default' id='type-id-9'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='zfs_hdl' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='zpool_hdl' type-id='type-id-11' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='zfs_name' type-id='type-id-12' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='zfs_type' type-id='type-id-13' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2208'>
        <var-decl name='zfs_head_type' type-id='type-id-13' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <var-decl name='zfs_dmustats' type-id='type-id-14' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4544'>
        <var-decl name='zfs_props' type-id='type-id-15' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4608'>
        <var-decl name='zfs_user_props' type-id='type-id-15' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4672'>
        <var-decl name='zfs_recvd_props' type-id='type-id-15' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4736'>
        <var-decl name='zfs_mntcheck' type-id='type-id-16' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4800'>
        <var-decl name='zfs_mntopts' type-id='type-id-17' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4864'>
        <var-decl name='zfs_props_table' type-id='type-id-18' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='libzfs_handle' size-in-bits='18240' is-struct='yes' visibility='default' id='type-id-19'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='libzfs_error' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='libzfs_fd' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='libzfs_pool_handles' type-id='type-id-11' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='libzfs_ns_avlpool' type-id='type-id-20' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='libzfs_ns_avl' type-id='type-id-21' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='libzfs_ns_gen' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='libzfs_desc_active' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='libzfs_action' type-id='type-id-23' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8544'>
        <var-decl name='libzfs_desc' type-id='type-id-23' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16736'>
        <var-decl name='libzfs_printerr' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16768'>
        <var-decl name='libzfs_mnttab_enable' type-id='type-id-16' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16832'>
        <var-decl name='libzfs_mnttab_cache_lock' type-id='type-id-24' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17152'>
        <var-decl name='libzfs_mnttab_cache' type-id='type-id-25' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17472'>
        <var-decl name='libzfs_pool_iter' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17504'>
        <var-decl name='libzfs_prop_debug' type-id='type-id-16' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17536'>
        <var-decl name='libzfs_urire' type-id='type-id-26' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='18048'>
        <var-decl name='libzfs_max_nvlist' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='18112'>
        <var-decl name='libfetch' type-id='type-id-7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='18176'>
        <var-decl name='libfetch_load_error' type-id='type-id-17' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='zpool_handle' size-in-bits='2560' is-struct='yes' visibility='default' id='type-id-27'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='zpool_hdl' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='zpool_next' type-id='type-id-11' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='zpool_name' type-id='type-id-12' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='zpool_state' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <var-decl name='zpool_config_size' type-id='type-id-28' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2304'>
        <var-decl name='zpool_config' type-id='type-id-15' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2368'>
        <var-decl name='zpool_old_config' type-id='type-id-15' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2432'>
        <var-decl name='zpool_props' type-id='type-id-15' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2496'>
        <var-decl name='zpool_start_block' type-id='type-id-29' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='libzfs_handle_t' type-id='type-id-19' id='type-id-30'/>
    <pointer-type-def type-id='type-id-30' size-in-bits='64' id='type-id-10'/>
    <typedef-decl name='zpool_handle_t' type-id='type-id-27' id='type-id-31'/>
    <pointer-type-def type-id='type-id-31' size-in-bits='64' id='type-id-11'/>
    <type-decl name='char' size-in-bits='8' id='type-id-32'/>
    <type-decl name='__ARRAY_SIZE_TYPE__' size-in-bits='64' id='type-id-33'/>

    <array-type-def dimensions='1' type-id='type-id-32' size-in-bits='2048' id='type-id-12'>
      <subrange length='256' type-id='type-id-33' id='type-id-34'/>

    </array-type-def>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-35'/>
    <typedef-decl name='size_t' type-id='type-id-35' id='type-id-28'/>
    <class-decl name='nvlist' size-in-bits='192' is-struct='yes' visibility='default' id='type-id-36'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nvl_version' type-id='type-id-37' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='nvl_nvflag' type-id='type-id-38' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='nvl_priv' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='nvl_flag' type-id='type-id-38' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='nvl_pad' type-id='type-id-37' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__int32_t' type-id='type-id-8' id='type-id-39'/>
    <typedef-decl name='int32_t' type-id='type-id-39' id='type-id-37'/>
    <typedef-decl name='__uint32_t' type-id='type-id-5' id='type-id-40'/>
    <typedef-decl name='uint32_t' type-id='type-id-40' id='type-id-38'/>
    <typedef-decl name='__uint64_t' type-id='type-id-35' id='type-id-41'/>
    <typedef-decl name='uint64_t' type-id='type-id-41' id='type-id-22'/>
    <typedef-decl name='nvlist_t' type-id='type-id-36' id='type-id-42'/>
    <pointer-type-def type-id='type-id-42' size-in-bits='64' id='type-id-15'/>
    <type-decl name='long long int' size-in-bits='64' id='type-id-43'/>
    <typedef-decl name='longlong_t' type-id='type-id-43' id='type-id-44'/>
    <typedef-decl name='diskaddr_t' type-id='type-id-44' id='type-id-29'/>
    <class-decl name='uu_avl_pool' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-45'/>
    <typedef-decl name='uu_avl_pool_t' type-id='type-id-45' id='type-id-46'/>
    <pointer-type-def type-id='type-id-46' size-in-bits='64' id='type-id-20'/>
    <typedef-decl name='uu_avl_t' type-id='type-id-3' id='type-id-47'/>
    <pointer-type-def type-id='type-id-47' size-in-bits='64' id='type-id-21'/>

    <array-type-def dimensions='1' type-id='type-id-32' size-in-bits='8192' id='type-id-23'>
      <subrange length='1024' type-id='type-id-33' id='type-id-48'/>

    </array-type-def>
    <type-decl name='unnamed-enum-underlying-type' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='type-id-49'/>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' id='type-id-50'>
      <underlying-type type-id='type-id-49'/>
      <enumerator name='B_FALSE' value='0'/>
      <enumerator name='B_TRUE' value='1'/>
    </enum-decl>
    <typedef-decl name='boolean_t' type-id='type-id-50' id='type-id-16'/>
    <union-decl name='__anonymous_union__' size-in-bits='320' is-anonymous='yes' visibility='default' id='type-id-51'>
      <data-member access='private'>
        <var-decl name='__data' type-id='type-id-52' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='__size' type-id='type-id-53' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='__align' type-id='type-id-54' visibility='default'/>
      </data-member>
    </union-decl>
    <class-decl name='__pthread_mutex_s' size-in-bits='320' is-struct='yes' visibility='default' id='type-id-52'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__lock' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='__count' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__owner' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='__nusers' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='__kind' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='__spins' type-id='type-id-55' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='176'>
        <var-decl name='__elision' type-id='type-id-55' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='__list' type-id='type-id-56' visibility='default'/>
      </data-member>
    </class-decl>
    <type-decl name='short int' size-in-bits='16' id='type-id-55'/>
    <class-decl name='__pthread_internal_list' size-in-bits='128' is-struct='yes' visibility='default' id='type-id-57'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__prev' type-id='type-id-58' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__next' type-id='type-id-58' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-57' size-in-bits='64' id='type-id-58'/>
    <typedef-decl name='__pthread_list_t' type-id='type-id-57' id='type-id-56'/>

    <array-type-def dimensions='1' type-id='type-id-32' size-in-bits='320' id='type-id-53'>
      <subrange length='40' type-id='type-id-33' id='type-id-59'/>

    </array-type-def>
    <type-decl name='long int' size-in-bits='64' id='type-id-54'/>
    <typedef-decl name='pthread_mutex_t' type-id='type-id-51' id='type-id-24'/>
    <class-decl name='avl_tree' size-in-bits='320' is-struct='yes' visibility='default' id='type-id-60'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='avl_root' type-id='type-id-61' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='avl_compar' type-id='type-id-62' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='avl_offset' type-id='type-id-28' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='avl_numnodes' type-id='type-id-63' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='avl_size' type-id='type-id-28' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='avl_node' size-in-bits='192' is-struct='yes' visibility='default' id='type-id-64'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='avl_child' type-id='type-id-65' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='avl_pcb' type-id='type-id-66' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-64' size-in-bits='64' id='type-id-61'/>

    <array-type-def dimensions='1' type-id='type-id-61' size-in-bits='128' id='type-id-65'>
      <subrange length='2' type-id='type-id-33' id='type-id-67'/>

    </array-type-def>
    <typedef-decl name='uintptr_t' type-id='type-id-35' id='type-id-66'/>
    <pointer-type-def type-id='type-id-68' size-in-bits='64' id='type-id-62'/>
    <typedef-decl name='ulong_t' type-id='type-id-35' id='type-id-63'/>
    <typedef-decl name='avl_tree_t' type-id='type-id-60' id='type-id-25'/>
    <class-decl name='re_pattern_buffer' size-in-bits='512' is-struct='yes' visibility='default' id='type-id-69'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='buffer' type-id='type-id-70' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='allocated' type-id='type-id-71' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='used' type-id='type-id-71' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='syntax' type-id='type-id-72' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='fastmap' type-id='type-id-17' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='translate' type-id='type-id-73' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='re_nsub' type-id='type-id-28' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31'>
        <var-decl name='can_be_null' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='29'>
        <var-decl name='regs_allocated' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='28'>
        <var-decl name='fastmap_accurate' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='27'>
        <var-decl name='no_sub' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='26'>
        <var-decl name='not_bol' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='25'>
        <var-decl name='not_eol' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='newline_anchor' type-id='type-id-5' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='re_dfa_t' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-74'/>
    <pointer-type-def type-id='type-id-74' size-in-bits='64' id='type-id-70'/>
    <typedef-decl name='__re_long_size_t' type-id='type-id-35' id='type-id-71'/>
    <typedef-decl name='reg_syntax_t' type-id='type-id-35' id='type-id-72'/>
    <pointer-type-def type-id='type-id-32' size-in-bits='64' id='type-id-17'/>
    <type-decl name='unsigned char' size-in-bits='8' id='type-id-75'/>
    <pointer-type-def type-id='type-id-75' size-in-bits='64' id='type-id-73'/>
    <typedef-decl name='regex_t' type-id='type-id-69' id='type-id-26'/>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' id='type-id-76'>
      <underlying-type type-id='type-id-49'/>
      <enumerator name='ZFS_TYPE_FILESYSTEM' value='1'/>
      <enumerator name='ZFS_TYPE_SNAPSHOT' value='2'/>
      <enumerator name='ZFS_TYPE_VOLUME' value='4'/>
      <enumerator name='ZFS_TYPE_POOL' value='8'/>
      <enumerator name='ZFS_TYPE_BOOKMARK' value='16'/>
    </enum-decl>
    <typedef-decl name='zfs_type_t' type-id='type-id-76' id='type-id-13'/>
    <class-decl name='dmu_objset_stats' size-in-bits='2304' is-struct='yes' visibility='default' id='type-id-77'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='dds_num_clones' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='dds_creation_txg' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='dds_guid' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='dds_type' type-id='type-id-78' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='dds_is_snapshot' type-id='type-id-79' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='232'>
        <var-decl name='dds_inconsistent' type-id='type-id-79' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='240'>
        <var-decl name='dds_redacted' type-id='type-id-79' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='248'>
        <var-decl name='dds_origin' type-id='type-id-12' visibility='default'/>
      </data-member>
    </class-decl>
    <enum-decl name='dmu_objset_type' id='type-id-80'>
      <underlying-type type-id='type-id-49'/>
      <enumerator name='DMU_OST_NONE' value='0'/>
      <enumerator name='DMU_OST_META' value='1'/>
      <enumerator name='DMU_OST_ZFS' value='2'/>
      <enumerator name='DMU_OST_ZVOL' value='3'/>
      <enumerator name='DMU_OST_OTHER' value='4'/>
      <enumerator name='DMU_OST_ANY' value='5'/>
      <enumerator name='DMU_OST_NUMTYPES' value='6'/>
    </enum-decl>
    <typedef-decl name='dmu_objset_type_t' type-id='type-id-80' id='type-id-78'/>
    <typedef-decl name='__uint8_t' type-id='type-id-75' id='type-id-81'/>
    <typedef-decl name='uint8_t' type-id='type-id-81' id='type-id-79'/>
    <typedef-decl name='dmu_objset_stats_t' type-id='type-id-77' id='type-id-14'/>
    <pointer-type-def type-id='type-id-79' size-in-bits='64' id='type-id-18'/>
    <pointer-type-def type-id='type-id-9' size-in-bits='64' id='type-id-82'/>
    <qualified-type-def type-id='type-id-32' const='yes' id='type-id-83'/>
    <pointer-type-def type-id='type-id-83' size-in-bits='64' id='type-id-84'/>
    <function-decl name='zfs_unmount' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-82'/>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zfs_unshare_smb' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-82'/>
      <parameter type-id='type-id-84'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zfs_commit_smb_shares' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='uu_avl_walk_end' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='uu_avl_last' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='remove_mountpoint' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-82'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_share_smb' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-82'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zfs_refresh_properties' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-82'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' id='type-id-85'>
      <underlying-type type-id='type-id-49'/>
      <enumerator name='ZPROP_CONT' value='-2'/>
      <enumerator name='ZPROP_INVAL' value='-1'/>
      <enumerator name='ZFS_PROP_TYPE' value='0'/>
      <enumerator name='ZFS_PROP_CREATION' value='1'/>
      <enumerator name='ZFS_PROP_USED' value='2'/>
      <enumerator name='ZFS_PROP_AVAILABLE' value='3'/>
      <enumerator name='ZFS_PROP_REFERENCED' value='4'/>
      <enumerator name='ZFS_PROP_COMPRESSRATIO' value='5'/>
      <enumerator name='ZFS_PROP_MOUNTED' value='6'/>
      <enumerator name='ZFS_PROP_ORIGIN' value='7'/>
      <enumerator name='ZFS_PROP_QUOTA' value='8'/>
      <enumerator name='ZFS_PROP_RESERVATION' value='9'/>
      <enumerator name='ZFS_PROP_VOLSIZE' value='10'/>
      <enumerator name='ZFS_PROP_VOLBLOCKSIZE' value='11'/>
      <enumerator name='ZFS_PROP_RECORDSIZE' value='12'/>
      <enumerator name='ZFS_PROP_MOUNTPOINT' value='13'/>
      <enumerator name='ZFS_PROP_SHARENFS' value='14'/>
      <enumerator name='ZFS_PROP_CHECKSUM' value='15'/>
      <enumerator name='ZFS_PROP_COMPRESSION' value='16'/>
      <enumerator name='ZFS_PROP_ATIME' value='17'/>
      <enumerator name='ZFS_PROP_DEVICES' value='18'/>
      <enumerator name='ZFS_PROP_EXEC' value='19'/>
      <enumerator name='ZFS_PROP_SETUID' value='20'/>
      <enumerator name='ZFS_PROP_READONLY' value='21'/>
      <enumerator name='ZFS_PROP_ZONED' value='22'/>
      <enumerator name='ZFS_PROP_SNAPDIR' value='23'/>
      <enumerator name='ZFS_PROP_ACLMODE' value='24'/>
      <enumerator name='ZFS_PROP_ACLINHERIT' value='25'/>
      <enumerator name='ZFS_PROP_CREATETXG' value='26'/>
      <enumerator name='ZFS_PROP_NAME' value='27'/>
      <enumerator name='ZFS_PROP_CANMOUNT' value='28'/>
      <enumerator name='ZFS_PROP_ISCSIOPTIONS' value='29'/>
      <enumerator name='ZFS_PROP_XATTR' value='30'/>
      <enumerator name='ZFS_PROP_NUMCLONES' value='31'/>
      <enumerator name='ZFS_PROP_COPIES' value='32'/>
      <enumerator name='ZFS_PROP_VERSION' value='33'/>
      <enumerator name='ZFS_PROP_UTF8ONLY' value='34'/>
      <enumerator name='ZFS_PROP_NORMALIZE' value='35'/>
      <enumerator name='ZFS_PROP_CASE' value='36'/>
      <enumerator name='ZFS_PROP_VSCAN' value='37'/>
      <enumerator name='ZFS_PROP_NBMAND' value='38'/>
      <enumerator name='ZFS_PROP_SHARESMB' value='39'/>
      <enumerator name='ZFS_PROP_REFQUOTA' value='40'/>
      <enumerator name='ZFS_PROP_REFRESERVATION' value='41'/>
      <enumerator name='ZFS_PROP_GUID' value='42'/>
      <enumerator name='ZFS_PROP_PRIMARYCACHE' value='43'/>
      <enumerator name='ZFS_PROP_SECONDARYCACHE' value='44'/>
      <enumerator name='ZFS_PROP_USEDSNAP' value='45'/>
      <enumerator name='ZFS_PROP_USEDDS' value='46'/>
      <enumerator name='ZFS_PROP_USEDCHILD' value='47'/>
      <enumerator name='ZFS_PROP_USEDREFRESERV' value='48'/>
      <enumerator name='ZFS_PROP_USERACCOUNTING' value='49'/>
      <enumerator name='ZFS_PROP_STMF_SHAREINFO' value='50'/>
      <enumerator name='ZFS_PROP_DEFER_DESTROY' value='51'/>
      <enumerator name='ZFS_PROP_USERREFS' value='52'/>
      <enumerator name='ZFS_PROP_LOGBIAS' value='53'/>
      <enumerator name='ZFS_PROP_UNIQUE' value='54'/>
      <enumerator name='ZFS_PROP_OBJSETID' value='55'/>
      <enumerator name='ZFS_PROP_DEDUP' value='56'/>
      <enumerator name='ZFS_PROP_MLSLABEL' value='57'/>
      <enumerator name='ZFS_PROP_SYNC' value='58'/>
      <enumerator name='ZFS_PROP_DNODESIZE' value='59'/>
      <enumerator name='ZFS_PROP_REFRATIO' value='60'/>
      <enumerator name='ZFS_PROP_WRITTEN' value='61'/>
      <enumerator name='ZFS_PROP_CLONES' value='62'/>
      <enumerator name='ZFS_PROP_LOGICALUSED' value='63'/>
      <enumerator name='ZFS_PROP_LOGICALREFERENCED' value='64'/>
      <enumerator name='ZFS_PROP_INCONSISTENT' value='65'/>
      <enumerator name='ZFS_PROP_VOLMODE' value='66'/>
      <enumerator name='ZFS_PROP_FILESYSTEM_LIMIT' value='67'/>
      <enumerator name='ZFS_PROP_SNAPSHOT_LIMIT' value='68'/>
      <enumerator name='ZFS_PROP_FILESYSTEM_COUNT' value='69'/>
      <enumerator name='ZFS_PROP_SNAPSHOT_COUNT' value='70'/>
      <enumerator name='ZFS_PROP_SNAPDEV' value='71'/>
      <enumerator name='ZFS_PROP_ACLTYPE' value='72'/>
      <enumerator name='ZFS_PROP_SELINUX_CONTEXT' value='73'/>
      <enumerator name='ZFS_PROP_SELINUX_FSCONTEXT' value='74'/>
      <enumerator name='ZFS_PROP_SELINUX_DEFCONTEXT' value='75'/>
      <enumerator name='ZFS_PROP_SELINUX_ROOTCONTEXT' value='76'/>
      <enumerator name='ZFS_PROP_RELATIME' value='77'/>
      <enumerator name='ZFS_PROP_REDUNDANT_METADATA' value='78'/>
      <enumerator name='ZFS_PROP_OVERLAY' value='79'/>
      <enumerator name='ZFS_PROP_PREV_SNAP' value='80'/>
      <enumerator name='ZFS_PROP_RECEIVE_RESUME_TOKEN' value='81'/>
      <enumerator name='ZFS_PROP_ENCRYPTION' value='82'/>
      <enumerator name='ZFS_PROP_KEYLOCATION' value='83'/>
      <enumerator name='ZFS_PROP_KEYFORMAT' value='84'/>
      <enumerator name='ZFS_PROP_PBKDF2_SALT' value='85'/>
      <enumerator name='ZFS_PROP_PBKDF2_ITERS' value='86'/>
      <enumerator name='ZFS_PROP_ENCRYPTION_ROOT' value='87'/>
      <enumerator name='ZFS_PROP_KEY_GUID' value='88'/>
      <enumerator name='ZFS_PROP_KEYSTATUS' value='89'/>
      <enumerator name='ZFS_PROP_REMAPTXG' value='90'/>
      <enumerator name='ZFS_PROP_SPECIAL_SMALL_BLOCKS' value='91'/>
      <enumerator name='ZFS_PROP_IVSET_GUID' value='92'/>
      <enumerator name='ZFS_PROP_REDACTED' value='93'/>
      <enumerator name='ZFS_PROP_REDACT_SNAPS' value='94'/>
      <enumerator name='ZFS_NUM_PROPS' value='95'/>
    </enum-decl>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' id='type-id-86'>
      <underlying-type type-id='type-id-49'/>
      <enumerator name='ZPROP_SRC_NONE' value='1'/>
      <enumerator name='ZPROP_SRC_DEFAULT' value='2'/>
      <enumerator name='ZPROP_SRC_TEMPORARY' value='4'/>
      <enumerator name='ZPROP_SRC_LOCAL' value='8'/>
      <enumerator name='ZPROP_SRC_INHERITED' value='16'/>
      <enumerator name='ZPROP_SRC_RECEIVED' value='32'/>
    </enum-decl>
    <pointer-type-def type-id='type-id-86' size-in-bits='64' id='type-id-87'/>
    <function-decl name='zfs_prop_get' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-82'/>
      <parameter type-id='type-id-85'/>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-35'/>
      <parameter type-id='type-id-87'/>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-35'/>
      <parameter type-id='type-id-50'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zfs_prop_get_int' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-82'/>
      <parameter type-id='type-id-85'/>
      <return type-id='type-id-35'/>
    </function-decl>
    <pointer-type-def type-id='type-id-17' size-in-bits='64' id='type-id-88'/>
    <function-decl name='zfs_is_mounted' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-82'/>
      <parameter type-id='type-id-88'/>
      <return type-id='type-id-50'/>
    </function-decl>
    <function-decl name='zfs_mount' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-82'/>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zfs_unshare_nfs' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-82'/>
      <parameter type-id='type-id-84'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zfs_share_nfs' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-82'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zfs_commit_nfs_shares' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='strlcpy' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-35'/>
      <return type-id='type-id-35'/>
    </function-decl>
    <function-decl name='strlcat' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-35'/>
      <return type-id='type-id-35'/>
    </function-decl>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' id='type-id-89'>
      <underlying-type type-id='type-id-49'/>
      <enumerator name='PROTO_NFS' value='0'/>
      <enumerator name='PROTO_SMB' value='1'/>
      <enumerator name='PROTO_END' value='2'/>
    </enum-decl>
    <function-decl name='zfs_unshare_proto' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-82'/>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-87'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zfs_commit_proto' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-87'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='uu_avl_remove' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_close' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-82'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='uu_avl_destroy' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <pointer-type-def type-id='type-id-45' size-in-bits='64' id='type-id-90'/>
    <function-decl name='uu_avl_pool_destroy' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-90'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <pointer-type-def type-id='type-id-19' size-in-bits='64' id='type-id-91'/>
    <function-decl name='zfs_alloc' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-91'/>
      <parameter type-id='type-id-35'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <pointer-type-def type-id='type-id-92' size-in-bits='64' id='type-id-93'/>
    <function-decl name='uu_avl_pool_create' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-35'/>
      <parameter type-id='type-id-35'/>
      <parameter type-id='type-id-93'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-90'/>
    </function-decl>
    <function-decl name='uu_avl_create' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-90'/>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zfs_error' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-91'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-84'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <pointer-type-def type-id='type-id-94' size-in-bits='64' id='type-id-95'/>
    <function-decl name='zfs_iter_dependents' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-82'/>
      <parameter type-id='type-id-50'/>
      <parameter type-id='type-id-95'/>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zfs_iter_mounted' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-82'/>
      <parameter type-id='type-id-95'/>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zfs_iter_children' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-82'/>
      <parameter type-id='type-id-95'/>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <qualified-type-def type-id='type-id-9' const='yes' id='type-id-96'/>
    <pointer-type-def type-id='type-id-96' size-in-bits='64' id='type-id-97'/>
    <function-decl name='zfs_get_name' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-97'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='zfs_open' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-91'/>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-82'/>
    </function-decl>
    <function-decl name='zfs_is_shared' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-82'/>
      <return type-id='type-id-50'/>
    </function-decl>
    <class-decl name='uu_avl_node' size-in-bits='192' is-struct='yes' visibility='default' id='type-id-98'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='uan_opaque' type-id='type-id-99' visibility='default'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-66' size-in-bits='192' id='type-id-99'>
      <subrange length='3' type-id='type-id-33' id='type-id-100'/>

    </array-type-def>
    <pointer-type-def type-id='type-id-98' size-in-bits='64' id='type-id-101'/>
    <function-decl name='uu_avl_node_init' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-101'/>
      <parameter type-id='type-id-90'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <pointer-type-def type-id='type-id-35' size-in-bits='64' id='type-id-102'/>
    <function-decl name='uu_avl_find' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-102'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='uu_avl_insert' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-35'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_get_handle' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-82'/>
      <return type-id='type-id-91'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-68'>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-8'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-92'>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-8'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-94'>
      <parameter type-id='type-id-82'/>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-8'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='libzfs_config.c' comp-dir-path='/home/nabijaczleweli/store/code/zfs/lib/libzfs' language='LANG_C99'>
    <function-decl name='zpool_skip_pool' mangled-name='zpool_skip_pool' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_skip_pool'>
      <parameter type-id='type-id-84' name='poolname'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <pointer-type-def type-id='type-id-7' size-in-bits='64' id='type-id-103'/>
    <function-decl name='uu_avl_teardown' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-103'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <pointer-type-def type-id='type-id-36' size-in-bits='64' id='type-id-104'/>
    <function-decl name='nvlist_free' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-104'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <pointer-type-def type-id='type-id-15' size-in-bits='64' id='type-id-105'/>
    <function-decl name='zpool_get_config' mangled-name='zpool_get_config' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_get_config'>
      <parameter type-id='type-id-11' name='zhp'/>
      <parameter type-id='type-id-105' name='oldconfig'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='zpool_get_features' mangled-name='zpool_get_features' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_get_features'>
      <parameter type-id='type-id-11' name='zhp'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='nvlist_exists' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-104'/>
      <parameter type-id='type-id-84'/>
      <return type-id='type-id-50'/>
    </function-decl>
    <pointer-type-def type-id='type-id-16' size-in-bits='64' id='type-id-106'/>
    <function-decl name='zpool_refresh_stats' mangled-name='zpool_refresh_stats' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_refresh_stats'>
      <parameter type-id='type-id-11' name='zhp'/>
      <parameter type-id='type-id-106' name='missing'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <pointer-type-def type-id='type-id-104' size-in-bits='64' id='type-id-107'/>
    <function-decl name='nvlist_lookup_nvlist' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-104'/>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-107'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <class-decl name='zfs_cmd' size-in-bits='109952' is-struct='yes' visibility='default' id='type-id-108'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='zc_name' type-id='type-id-109' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32768'>
        <var-decl name='zc_nvlist_src' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32832'>
        <var-decl name='zc_nvlist_src_size' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32896'>
        <var-decl name='zc_nvlist_dst' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32960'>
        <var-decl name='zc_nvlist_dst_size' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='33024'>
        <var-decl name='zc_nvlist_dst_filled' type-id='type-id-16' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='33056'>
        <var-decl name='zc_pad2' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='33088'>
        <var-decl name='zc_history' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='33152'>
        <var-decl name='zc_value' type-id='type-id-110' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='98688'>
        <var-decl name='zc_string' type-id='type-id-12' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='100736'>
        <var-decl name='zc_guid' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='100800'>
        <var-decl name='zc_nvlist_conf' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='100864'>
        <var-decl name='zc_nvlist_conf_size' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='100928'>
        <var-decl name='zc_cookie' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='100992'>
        <var-decl name='zc_objset_type' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='101056'>
        <var-decl name='zc_perm_action' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='101120'>
        <var-decl name='zc_history_len' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='101184'>
        <var-decl name='zc_history_offset' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='101248'>
        <var-decl name='zc_obj' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='101312'>
        <var-decl name='zc_iflags' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='101376'>
        <var-decl name='zc_share' type-id='type-id-111' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='101632'>
        <var-decl name='zc_objset_stats' type-id='type-id-14' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='103936'>
        <var-decl name='zc_begin_record' type-id='type-id-112' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='106368'>
        <var-decl name='zc_inject_record' type-id='type-id-113' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109184'>
        <var-decl name='zc_defer_destroy' type-id='type-id-38' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109216'>
        <var-decl name='zc_flags' type-id='type-id-38' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109248'>
        <var-decl name='zc_action_handle' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109312'>
        <var-decl name='zc_cleanup_fd' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109344'>
        <var-decl name='zc_simple' type-id='type-id-79' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109352'>
        <var-decl name='zc_pad' type-id='type-id-114' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109376'>
        <var-decl name='zc_sendobj' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109440'>
        <var-decl name='zc_fromobj' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109504'>
        <var-decl name='zc_createtxg' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109568'>
        <var-decl name='zc_stat' type-id='type-id-115' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109888'>
        <var-decl name='zc_zoneid' type-id='type-id-22' visibility='default'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-32' size-in-bits='32768' id='type-id-109'>
      <subrange length='4096' type-id='type-id-33' id='type-id-116'/>

    </array-type-def>

    <array-type-def dimensions='1' type-id='type-id-32' size-in-bits='65536' id='type-id-110'>
      <subrange length='8192' type-id='type-id-33' id='type-id-117'/>

    </array-type-def>
    <class-decl name='zfs_share' size-in-bits='256' is-struct='yes' visibility='default' id='type-id-118'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='z_exportdata' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='z_sharedata' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='z_sharetype' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='z_sharemax' type-id='type-id-22' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='zfs_share_t' type-id='type-id-118' id='type-id-111'/>
    <class-decl name='drr_begin' size-in-bits='2432' is-struct='yes' visibility='default' id='type-id-112'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='drr_magic' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='drr_versioninfo' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='drr_creation_time' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='drr_type' type-id='type-id-78' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='drr_flags' type-id='type-id-38' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='drr_toguid' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='drr_fromguid' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='drr_toname' type-id='type-id-12' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='zinject_record' size-in-bits='2816' is-struct='yes' visibility='default' id='type-id-119'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='zi_objset' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='zi_object' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='zi_start' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='zi_end' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='zi_guid' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='zi_level' type-id='type-id-38' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='zi_error' type-id='type-id-38' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='zi_type' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='zi_freq' type-id='type-id-38' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='zi_failfast' type-id='type-id-38' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='zi_func' type-id='type-id-12' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2560'>
        <var-decl name='zi_iotype' type-id='type-id-38' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2592'>
        <var-decl name='zi_duration' type-id='type-id-37' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2624'>
        <var-decl name='zi_timer' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2688'>
        <var-decl name='zi_nlanes' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2752'>
        <var-decl name='zi_cmd' type-id='type-id-38' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2784'>
        <var-decl name='zi_dvas' type-id='type-id-38' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='zinject_record_t' type-id='type-id-119' id='type-id-113'/>

    <array-type-def dimensions='1' type-id='type-id-79' size-in-bits='24' id='type-id-114'>
      <subrange length='3' type-id='type-id-33' id='type-id-100'/>

    </array-type-def>
    <class-decl name='zfs_stat' size-in-bits='320' is-struct='yes' visibility='default' id='type-id-120'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='zs_gen' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='zs_mode' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='zs_links' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='zs_ctime' type-id='type-id-121' visibility='default'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-22' size-in-bits='128' id='type-id-121'>
      <subrange length='2' type-id='type-id-33' id='type-id-67'/>

    </array-type-def>
    <typedef-decl name='zfs_stat_t' type-id='type-id-120' id='type-id-115'/>
    <pointer-type-def type-id='type-id-108' size-in-bits='64' id='type-id-122'/>
    <function-decl name='zcmd_alloc_dst_nvlist' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-91'/>
      <parameter type-id='type-id-122'/>
      <parameter type-id='type-id-35'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zfs_ioctl' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-91'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-122'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zcmd_expand_dst_nvlist' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-91'/>
      <parameter type-id='type-id-122'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zcmd_free_nvlists' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-122'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zcmd_read_dst_nvlist' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-91'/>
      <parameter type-id='type-id-122'/>
      <parameter type-id='type-id-107'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='getenv' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-84'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <pointer-type-def type-id='type-id-123' size-in-bits='64' id='type-id-124'/>
    <typedef-decl name='zpool_iter_f' type-id='type-id-124' id='type-id-125'/>
    <function-decl name='zpool_iter' mangled-name='zpool_iter' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_iter'>
      <parameter type-id='type-id-10' name='hdl'/>
      <parameter type-id='type-id-125' name='func'/>
      <parameter type-id='type-id-7' name='data'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='uu_avl_first' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='uu_avl_next' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <pointer-type-def type-id='type-id-27' size-in-bits='64' id='type-id-126'/>
    <pointer-type-def type-id='type-id-126' size-in-bits='64' id='type-id-127'/>
    <function-decl name='zpool_open_silent' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-91'/>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-127'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='no_memory' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-91'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <class-decl name='nvpair' size-in-bits='128' is-struct='yes' visibility='default' id='type-id-128'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nvp_size' type-id='type-id-37' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='nvp_name_sz' type-id='type-id-129' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='nvp_reserve' type-id='type-id-129' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='nvp_value_elem' type-id='type-id-37' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='nvp_type' type-id='type-id-130' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__int16_t' type-id='type-id-55' id='type-id-131'/>
    <typedef-decl name='int16_t' type-id='type-id-131' id='type-id-129'/>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' id='type-id-132'>
      <underlying-type type-id='type-id-49'/>
      <enumerator name='DATA_TYPE_DONTCARE' value='-1'/>
      <enumerator name='DATA_TYPE_UNKNOWN' value='0'/>
      <enumerator name='DATA_TYPE_BOOLEAN' value='1'/>
      <enumerator name='DATA_TYPE_BYTE' value='2'/>
      <enumerator name='DATA_TYPE_INT16' value='3'/>
      <enumerator name='DATA_TYPE_UINT16' value='4'/>
      <enumerator name='DATA_TYPE_INT32' value='5'/>
      <enumerator name='DATA_TYPE_UINT32' value='6'/>
      <enumerator name='DATA_TYPE_INT64' value='7'/>
      <enumerator name='DATA_TYPE_UINT64' value='8'/>
      <enumerator name='DATA_TYPE_STRING' value='9'/>
      <enumerator name='DATA_TYPE_BYTE_ARRAY' value='10'/>
      <enumerator name='DATA_TYPE_INT16_ARRAY' value='11'/>
      <enumerator name='DATA_TYPE_UINT16_ARRAY' value='12'/>
      <enumerator name='DATA_TYPE_INT32_ARRAY' value='13'/>
      <enumerator name='DATA_TYPE_UINT32_ARRAY' value='14'/>
      <enumerator name='DATA_TYPE_INT64_ARRAY' value='15'/>
      <enumerator name='DATA_TYPE_UINT64_ARRAY' value='16'/>
      <enumerator name='DATA_TYPE_STRING_ARRAY' value='17'/>
      <enumerator name='DATA_TYPE_HRTIME' value='18'/>
      <enumerator name='DATA_TYPE_NVLIST' value='19'/>
      <enumerator name='DATA_TYPE_NVLIST_ARRAY' value='20'/>
      <enumerator name='DATA_TYPE_BOOLEAN_VALUE' value='21'/>
      <enumerator name='DATA_TYPE_INT8' value='22'/>
      <enumerator name='DATA_TYPE_UINT8' value='23'/>
      <enumerator name='DATA_TYPE_BOOLEAN_ARRAY' value='24'/>
      <enumerator name='DATA_TYPE_INT8_ARRAY' value='25'/>
      <enumerator name='DATA_TYPE_UINT8_ARRAY' value='26'/>
      <enumerator name='DATA_TYPE_DOUBLE' value='27'/>
    </enum-decl>
    <typedef-decl name='data_type_t' type-id='type-id-132' id='type-id-130'/>
    <pointer-type-def type-id='type-id-128' size-in-bits='64' id='type-id-133'/>
    <function-decl name='nvlist_next_nvpair' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-104'/>
      <parameter type-id='type-id-133'/>
      <return type-id='type-id-133'/>
    </function-decl>
    <function-decl name='nvpair_name' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-133'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='zfs_strdup' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-91'/>
      <parameter type-id='type-id-84'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='nvpair_value_nvlist' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-133'/>
      <parameter type-id='type-id-107'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='libspl_assertf' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-84'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='nvlist_dup' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-104'/>
      <parameter type-id='type-id-107'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='dcgettext' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='zfs_standard_error' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-91'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-84'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <typedef-decl name='zfs_handle_t' type-id='type-id-9' id='type-id-134'/>
    <pointer-type-def type-id='type-id-134' size-in-bits='64' id='type-id-135'/>
    <pointer-type-def type-id='type-id-136' size-in-bits='64' id='type-id-137'/>
    <typedef-decl name='zfs_iter_f' type-id='type-id-137' id='type-id-138'/>
    <function-decl name='zfs_iter_root' mangled-name='zfs_iter_root' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_iter_root'>
      <parameter type-id='type-id-10' name='hdl'/>
      <parameter type-id='type-id-138' name='func'/>
      <parameter type-id='type-id-7' name='data'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='make_dataset_handle' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-91'/>
      <parameter type-id='type-id-84'/>
      <return type-id='type-id-82'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-136'>
      <parameter type-id='type-id-135'/>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-8'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-123'>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-8'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='libzfs_crypto.c' comp-dir-path='/home/nabijaczleweli/store/code/zfs/lib/libzfs' language='LANG_C99'>
    <function-decl name='zfs_crypto_get_encryption_root' mangled-name='zfs_crypto_get_encryption_root' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_crypto_get_encryption_root'>
      <parameter type-id='type-id-135' name='zhp'/>
      <parameter type-id='type-id-106' name='is_encroot'/>
      <parameter type-id='type-id-17' name='buf'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <pointer-type-def type-id='type-id-18' size-in-bits='64' id='type-id-139'/>
    <typedef-decl name='uint_t' type-id='type-id-5' id='type-id-140'/>
    <pointer-type-def type-id='type-id-140' size-in-bits='64' id='type-id-141'/>
    <function-decl name='zfs_crypto_create' mangled-name='zfs_crypto_create' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_crypto_create'>
      <parameter type-id='type-id-10' name='hdl'/>
      <parameter type-id='type-id-17' name='parent_name'/>
      <parameter type-id='type-id-15' name='props'/>
      <parameter type-id='type-id-15' name='pool_props'/>
      <parameter type-id='type-id-16' name='stdin_available'/>
      <parameter type-id='type-id-139' name='wkeydata_out'/>
      <parameter type-id='type-id-141' name='wkeylen_out'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zfs_prop_to_name' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-85'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='nvlist_lookup_uint64' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-104'/>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-102'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='nvlist_lookup_string' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-104'/>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-88'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' id='type-id-142'>
      <underlying-type type-id='type-id-49'/>
      <enumerator name='ZPOOL_PROP_INVAL' value='-1'/>
      <enumerator name='ZPOOL_PROP_NAME' value='0'/>
      <enumerator name='ZPOOL_PROP_SIZE' value='1'/>
      <enumerator name='ZPOOL_PROP_CAPACITY' value='2'/>
      <enumerator name='ZPOOL_PROP_ALTROOT' value='3'/>
      <enumerator name='ZPOOL_PROP_HEALTH' value='4'/>
      <enumerator name='ZPOOL_PROP_GUID' value='5'/>
      <enumerator name='ZPOOL_PROP_VERSION' value='6'/>
      <enumerator name='ZPOOL_PROP_BOOTFS' value='7'/>
      <enumerator name='ZPOOL_PROP_DELEGATION' value='8'/>
      <enumerator name='ZPOOL_PROP_AUTOREPLACE' value='9'/>
      <enumerator name='ZPOOL_PROP_CACHEFILE' value='10'/>
      <enumerator name='ZPOOL_PROP_FAILUREMODE' value='11'/>
      <enumerator name='ZPOOL_PROP_LISTSNAPS' value='12'/>
      <enumerator name='ZPOOL_PROP_AUTOEXPAND' value='13'/>
      <enumerator name='ZPOOL_PROP_DEDUPDITTO' value='14'/>
      <enumerator name='ZPOOL_PROP_DEDUPRATIO' value='15'/>
      <enumerator name='ZPOOL_PROP_FREE' value='16'/>
      <enumerator name='ZPOOL_PROP_ALLOCATED' value='17'/>
      <enumerator name='ZPOOL_PROP_READONLY' value='18'/>
      <enumerator name='ZPOOL_PROP_ASHIFT' value='19'/>
      <enumerator name='ZPOOL_PROP_COMMENT' value='20'/>
      <enumerator name='ZPOOL_PROP_EXPANDSZ' value='21'/>
      <enumerator name='ZPOOL_PROP_FREEING' value='22'/>
      <enumerator name='ZPOOL_PROP_FRAGMENTATION' value='23'/>
      <enumerator name='ZPOOL_PROP_LEAKED' value='24'/>
      <enumerator name='ZPOOL_PROP_MAXBLOCKSIZE' value='25'/>
      <enumerator name='ZPOOL_PROP_TNAME' value='26'/>
      <enumerator name='ZPOOL_PROP_MAXDNODESIZE' value='27'/>
      <enumerator name='ZPOOL_PROP_MULTIHOST' value='28'/>
      <enumerator name='ZPOOL_PROP_CHECKPOINT' value='29'/>
      <enumerator name='ZPOOL_PROP_LOAD_GUID' value='30'/>
      <enumerator name='ZPOOL_PROP_AUTOTRIM' value='31'/>
      <enumerator name='ZPOOL_PROP_COMPATIBILITY' value='32'/>
      <enumerator name='ZPOOL_NUM_PROPS' value='33'/>
    </enum-decl>
    <function-decl name='zpool_get_prop_int' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-142'/>
      <parameter type-id='type-id-87'/>
      <return type-id='type-id-35'/>
    </function-decl>
    <function-decl name='zpool_get_features' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-126'/>
      <return type-id='type-id-104'/>
    </function-decl>
    <function-decl name='zfs_error_aux' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-91'/>
      <parameter type-id='type-id-84'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='nvlist_add_string' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-104'/>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-84'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='open' mangled-name='open64' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-8'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='read' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-35'/>
      <return type-id='type-id-54'/>
    </function-decl>
    <function-decl name='close' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='nvlist_add_uint64' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-104'/>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-35'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zfs_crypto_clone_check' mangled-name='zfs_crypto_clone_check' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_crypto_clone_check'>
      <parameter type-id='type-id-10' name='hdl'/>
      <parameter type-id='type-id-135' name='origin_zhp'/>
      <parameter type-id='type-id-17' name='parent_name'/>
      <parameter type-id='type-id-15' name='props'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zfs_crypto_attempt_load_keys' mangled-name='zfs_crypto_attempt_load_keys' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_crypto_attempt_load_keys'>
      <parameter type-id='type-id-10' name='hdl'/>
      <parameter type-id='type-id-17' name='fsname'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zfs_handle_dup' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-82'/>
      <return type-id='type-id-82'/>
    </function-decl>
    <function-decl name='zfs_iter_filesystems' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-82'/>
      <parameter type-id='type-id-95'/>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zfs_crypto_load_key' mangled-name='zfs_crypto_load_key' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_crypto_load_key'>
      <parameter type-id='type-id-135' name='zhp'/>
      <parameter type-id='type-id-16' name='noop'/>
      <parameter type-id='type-id-17' name='alt_keylocation'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='lzc_load_key' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-50'/>
      <parameter type-id='type-id-73'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <qualified-type-def type-id='type-id-69' const='yes' id='type-id-143'/>
    <pointer-type-def type-id='type-id-143' size-in-bits='64' id='type-id-144'/>
    <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-145'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='rm_so' type-id='type-id-146' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='rm_eo' type-id='type-id-146' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='regoff_t' type-id='type-id-8' id='type-id-146'/>
    <pointer-type-def type-id='type-id-145' size-in-bits='64' id='type-id-147'/>
    <function-decl name='regexec' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-144'/>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-35'/>
      <parameter type-id='type-id-147'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <class-decl name='_IO_FILE' size-in-bits='1728' is-struct='yes' visibility='default' id='type-id-148'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_flags' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_IO_read_ptr' type-id='type-id-17' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_IO_read_end' type-id='type-id-17' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_IO_read_base' type-id='type-id-17' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='_IO_write_base' type-id='type-id-17' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='_IO_write_ptr' type-id='type-id-17' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_IO_write_end' type-id='type-id-17' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='_IO_buf_base' type-id='type-id-17' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='_IO_buf_end' type-id='type-id-17' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='_IO_save_base' type-id='type-id-17' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='_IO_backup_base' type-id='type-id-17' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='_IO_save_end' type-id='type-id-17' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='_markers' type-id='type-id-149' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='_chain' type-id='type-id-150' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='_fileno' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='_flags2' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='_old_offset' type-id='type-id-151' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='_cur_column' type-id='type-id-152' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1040'>
        <var-decl name='_vtable_offset' type-id='type-id-153' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1048'>
        <var-decl name='_shortbuf' type-id='type-id-154' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='_offset' type-id='type-id-155' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='_codecvt' type-id='type-id-156' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='_wide_data' type-id='type-id-157' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='_freeres_list' type-id='type-id-150' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='_freeres_buf' type-id='type-id-7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='__pad5' type-id='type-id-28' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='_mode' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='_unused2' type-id='type-id-158' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='_IO_marker' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-159'/>
    <pointer-type-def type-id='type-id-159' size-in-bits='64' id='type-id-149'/>
    <pointer-type-def type-id='type-id-148' size-in-bits='64' id='type-id-150'/>
    <typedef-decl name='__off_t' type-id='type-id-54' id='type-id-151'/>
    <type-decl name='unsigned short int' size-in-bits='16' id='type-id-152'/>
    <type-decl name='signed char' size-in-bits='8' id='type-id-153'/>

    <array-type-def dimensions='1' type-id='type-id-32' size-in-bits='8' id='type-id-154'>
      <subrange length='1' type-id='type-id-33' id='type-id-160'/>

    </array-type-def>
    <typedef-decl name='__off64_t' type-id='type-id-54' id='type-id-155'/>
    <class-decl name='_IO_codecvt' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-161'/>
    <pointer-type-def type-id='type-id-161' size-in-bits='64' id='type-id-156'/>
    <class-decl name='_IO_wide_data' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-162'/>
    <pointer-type-def type-id='type-id-162' size-in-bits='64' id='type-id-157'/>

    <array-type-def dimensions='1' type-id='type-id-32' size-in-bits='160' id='type-id-158'>
      <subrange length='20' type-id='type-id-33' id='type-id-163'/>

    </array-type-def>
    <function-decl name='fileno' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-150'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='isatty' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <qualified-type-def type-id='type-id-75' const='yes' id='type-id-164'/>
    <pointer-type-def type-id='type-id-164' size-in-bits='64' id='type-id-165'/>
    <function-decl name='PKCS5_PBKDF2_HMAC_SHA1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-165'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-73'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zfs_crypto_unload_key' mangled-name='zfs_crypto_unload_key' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_crypto_unload_key'>
      <parameter type-id='type-id-135' name='zhp'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='lzc_unload_key' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-84'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zfs_crypto_rewrap' mangled-name='zfs_crypto_rewrap' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_crypto_rewrap'>
      <parameter type-id='type-id-135' name='zhp'/>
      <parameter type-id='type-id-15' name='raw_props'/>
      <parameter type-id='type-id-16' name='inheritkey'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zfs_parent_name' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-82'/>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-35'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='fnvlist_alloc' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-104'/>
    </function-decl>
    <function-decl name='zfs_name_to_prop' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-84'/>
      <return type-id='type-id-85'/>
    </function-decl>
    <function-decl name='zfs_valid_proplist' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-91'/>
      <parameter type-id='type-id-76'/>
      <parameter type-id='type-id-104'/>
      <parameter type-id='type-id-35'/>
      <parameter type-id='type-id-82'/>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-50'/>
      <parameter type-id='type-id-84'/>
      <return type-id='type-id-104'/>
    </function-decl>
    <function-decl name='lzc_change_key' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-35'/>
      <parameter type-id='type-id-104'/>
      <parameter type-id='type-id-73'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='ferror' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-150'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='1024' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-166' visibility='default' id='type-id-167'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__val' type-id='type-id-168' visibility='default'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-35' size-in-bits='1024' id='type-id-168'>
      <subrange length='16' type-id='type-id-33' id='type-id-169'/>

    </array-type-def>
    <pointer-type-def type-id='type-id-167' size-in-bits='64' id='type-id-170'/>
    <function-decl name='sigemptyset' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-170'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <class-decl name='sigaction' size-in-bits='1216' is-struct='yes' visibility='default' id='type-id-171'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__sigaction_handler' type-id='type-id-172' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='sa_mask' type-id='type-id-166' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='sa_flags' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='sa_restorer' type-id='type-id-173' visibility='default'/>
      </data-member>
    </class-decl>
    <union-decl name='__anonymous_union__' size-in-bits='64' is-anonymous='yes' visibility='default' id='type-id-172'>
      <data-member access='private'>
        <var-decl name='sa_handler' type-id='type-id-174' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='sa_sigaction' type-id='type-id-175' visibility='default'/>
      </data-member>
    </union-decl>
    <pointer-type-def type-id='type-id-176' size-in-bits='64' id='type-id-177'/>
    <typedef-decl name='__sighandler_t' type-id='type-id-177' id='type-id-174'/>
    <class-decl name='__anonymous_struct__' size-in-bits='1024' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-178' visibility='default' id='type-id-179'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='si_signo' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='si_errno' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='si_code' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='__pad0' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_sifields' type-id='type-id-180' visibility='default'/>
      </data-member>
    </class-decl>
    <union-decl name='__anonymous_union__' size-in-bits='896' is-anonymous='yes' visibility='default' id='type-id-180'>
      <data-member access='private'>
        <var-decl name='_pad' type-id='type-id-181' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='_kill' type-id='type-id-182' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='_timer' type-id='type-id-183' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='_rt' type-id='type-id-184' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='_sigchld' type-id='type-id-185' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='_sigfault' type-id='type-id-186' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='_sigpoll' type-id='type-id-187' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='_sigsys' type-id='type-id-188' visibility='default'/>
      </data-member>
    </union-decl>

    <array-type-def dimensions='1' type-id='type-id-8' size-in-bits='896' id='type-id-181'>
      <subrange length='28' type-id='type-id-33' id='type-id-189'/>

    </array-type-def>
    <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-182'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='si_pid' type-id='type-id-190' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='si_uid' type-id='type-id-191' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__pid_t' type-id='type-id-8' id='type-id-190'/>
    <typedef-decl name='__uid_t' type-id='type-id-5' id='type-id-191'/>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-183'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='si_tid' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='si_overrun' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='si_sigval' type-id='type-id-192' visibility='default'/>
      </data-member>
    </class-decl>
    <union-decl name='sigval' size-in-bits='64' visibility='default' id='type-id-193'>
      <data-member access='private'>
        <var-decl name='sival_int' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='sival_ptr' type-id='type-id-7' visibility='default'/>
      </data-member>
    </union-decl>
    <typedef-decl name='__sigval_t' type-id='type-id-193' id='type-id-192'/>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-184'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='si_pid' type-id='type-id-190' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='si_uid' type-id='type-id-191' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='si_sigval' type-id='type-id-192' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='256' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-185'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='si_pid' type-id='type-id-190' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='si_uid' type-id='type-id-191' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='si_status' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='si_utime' type-id='type-id-194' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='si_stime' type-id='type-id-194' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__clock_t' type-id='type-id-54' id='type-id-194'/>
    <class-decl name='__anonymous_struct__' size-in-bits='256' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-186'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='si_addr' type-id='type-id-7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='si_addr_lsb' type-id='type-id-55' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_bounds' type-id='type-id-195' visibility='default'/>
      </data-member>
    </class-decl>
    <union-decl name='__anonymous_union__' size-in-bits='128' is-anonymous='yes' visibility='default' id='type-id-195'>
      <data-member access='private'>
        <var-decl name='_addr_bnd' type-id='type-id-196' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='_pkey' type-id='type-id-40' visibility='default'/>
      </data-member>
    </union-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-196'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_lower' type-id='type-id-7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_upper' type-id='type-id-7' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-187'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='si_band' type-id='type-id-54' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='si_fd' type-id='type-id-8' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-188'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_call_addr' type-id='type-id-7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_syscall' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='_arch' type-id='type-id-5' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='siginfo_t' type-id='type-id-179' id='type-id-178'/>
    <pointer-type-def type-id='type-id-178' size-in-bits='64' id='type-id-197'/>
    <pointer-type-def type-id='type-id-198' size-in-bits='64' id='type-id-175'/>
    <typedef-decl name='__sigset_t' type-id='type-id-167' id='type-id-166'/>
    <pointer-type-def type-id='type-id-199' size-in-bits='64' id='type-id-173'/>
    <qualified-type-def type-id='type-id-171' const='yes' id='type-id-200'/>
    <pointer-type-def type-id='type-id-200' size-in-bits='64' id='type-id-201'/>
    <pointer-type-def type-id='type-id-171' size-in-bits='64' id='type-id-202'/>
    <function-decl name='sigaction' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-201'/>
      <parameter type-id='type-id-202'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='fputc' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-150'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='fflush' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-150'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <class-decl name='termios' size-in-bits='480' is-struct='yes' visibility='default' id='type-id-203'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='c_iflag' type-id='type-id-204' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='c_oflag' type-id='type-id-204' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='c_cflag' type-id='type-id-204' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='c_lflag' type-id='type-id-204' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='c_line' type-id='type-id-205' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='136'>
        <var-decl name='c_cc' type-id='type-id-206' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='c_ispeed' type-id='type-id-207' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='c_ospeed' type-id='type-id-207' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='tcflag_t' type-id='type-id-5' id='type-id-204'/>
    <typedef-decl name='cc_t' type-id='type-id-75' id='type-id-205'/>

    <array-type-def dimensions='1' type-id='type-id-205' size-in-bits='256' id='type-id-206'>
      <subrange length='32' type-id='type-id-33' id='type-id-208'/>

    </array-type-def>
    <typedef-decl name='speed_t' type-id='type-id-5' id='type-id-207'/>
    <pointer-type-def type-id='type-id-203' size-in-bits='64' id='type-id-209'/>
    <function-decl name='tcgetattr' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-209'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <qualified-type-def type-id='type-id-203' const='yes' id='type-id-210'/>
    <pointer-type-def type-id='type-id-210' size-in-bits='64' id='type-id-211'/>
    <function-decl name='tcsetattr' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-211'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='getpid' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='kill' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='fclose' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-150'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='dlopen' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='dlsym' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-84'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='fdopen' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-84'/>
      <return type-id='type-id-150'/>
    </function-decl>
    <function-decl name='dlerror' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='asprintf' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-88'/>
      <parameter type-id='type-id-84'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='mkostemps' mangled-name='mkostemps64' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='unlink' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-84'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='rewind' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-150'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-199'>
      <return type-id='type-id-6'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-176'>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-6'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-198'>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-197'/>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-6'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='libzfs_dataset.c' comp-dir-path='/home/nabijaczleweli/store/code/zfs/lib/libzfs' language='LANG_C99'>
    <function-decl name='zfs_type_to_name' mangled-name='zfs_type_to_name' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_type_to_name'>
      <parameter type-id='type-id-13' name='type'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' id='type-id-212'>
      <underlying-type type-id='type-id-49'/>
      <enumerator name='NAME_ERR_LEADING_SLASH' value='0'/>
      <enumerator name='NAME_ERR_EMPTY_COMPONENT' value='1'/>
      <enumerator name='NAME_ERR_TRAILING_SLASH' value='2'/>
      <enumerator name='NAME_ERR_INVALCHAR' value='3'/>
      <enumerator name='NAME_ERR_MULTIPLE_DELIMITERS' value='4'/>
      <enumerator name='NAME_ERR_NOLETTER' value='5'/>
      <enumerator name='NAME_ERR_RESERVED' value='6'/>
      <enumerator name='NAME_ERR_DISKLIKE' value='7'/>
      <enumerator name='NAME_ERR_TOOLONG' value='8'/>
      <enumerator name='NAME_ERR_SELF_REF' value='9'/>
      <enumerator name='NAME_ERR_PARENT_REF' value='10'/>
      <enumerator name='NAME_ERR_NO_AT' value='11'/>
      <enumerator name='NAME_ERR_NO_POUND' value='12'/>
    </enum-decl>
    <pointer-type-def type-id='type-id-212' size-in-bits='64' id='type-id-213'/>
    <function-decl name='entity_namecheck' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-213'/>
      <parameter type-id='type-id-17'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zfs_name_valid' mangled-name='zfs_name_valid' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_name_valid'>
      <parameter type-id='type-id-84' name='name'/>
      <parameter type-id='type-id-13' name='type'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zpool_name_valid' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-91'/>
      <parameter type-id='type-id-50'/>
      <parameter type-id='type-id-84'/>
      <return type-id='type-id-50'/>
    </function-decl>
    <function-decl name='zpool_free_handles' mangled-name='zpool_free_handles' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_free_handles'>
      <parameter type-id='type-id-10' name='hdl'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zpool_close' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-126'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_refresh_properties' mangled-name='zfs_refresh_properties' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_refresh_properties'>
      <parameter type-id='type-id-135' name='zhp'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zpool_get_name' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-126'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='zpool_open_canfail' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-91'/>
      <parameter type-id='type-id-84'/>
      <return type-id='type-id-126'/>
    </function-decl>
    <function-decl name='zfs_handle_dup' mangled-name='zfs_handle_dup' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_handle_dup'>
      <parameter type-id='type-id-135' name='zhp_orig'/>
      <return type-id='type-id-135'/>
    </function-decl>
    <function-decl name='zfs_close' mangled-name='zfs_close' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_close'>
      <parameter type-id='type-id-135' name='zhp'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_bookmark_exists' mangled-name='zfs_bookmark_exists' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_bookmark_exists'>
      <parameter type-id='type-id-84' name='path'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='lzc_get_bookmarks' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-104'/>
      <parameter type-id='type-id-107'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zfs_open' mangled-name='zfs_open' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_open'>
      <parameter type-id='type-id-10' name='hdl'/>
      <parameter type-id='type-id-84' name='path'/>
      <parameter type-id='type-id-8' name='types'/>
      <return type-id='type-id-135'/>
    </function-decl>
    <function-decl name='zfs_iter_bookmarks' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-82'/>
      <parameter type-id='type-id-95'/>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='libzfs_mnttab_init' mangled-name='libzfs_mnttab_init' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='libzfs_mnttab_init'>
      <parameter type-id='type-id-10' name='hdl'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <pointer-type-def type-id='type-id-51' size-in-bits='64' id='type-id-214'/>
    <union-decl name='__anonymous_union__' size-in-bits='32' is-anonymous='yes' visibility='default' id='type-id-215'>
      <data-member access='private'>
        <var-decl name='__size' type-id='type-id-216' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='__align' type-id='type-id-8' visibility='default'/>
      </data-member>
    </union-decl>

    <array-type-def dimensions='1' type-id='type-id-32' size-in-bits='32' id='type-id-216'>
      <subrange length='4' type-id='type-id-33' id='type-id-217'/>

    </array-type-def>
    <qualified-type-def type-id='type-id-215' const='yes' id='type-id-218'/>
    <pointer-type-def type-id='type-id-218' size-in-bits='64' id='type-id-219'/>
    <function-decl name='pthread_mutex_init' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-214'/>
      <parameter type-id='type-id-219'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <pointer-type-def type-id='type-id-60' size-in-bits='64' id='type-id-220'/>
    <function-decl name='avl_create' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-220'/>
      <parameter type-id='type-id-62'/>
      <parameter type-id='type-id-35'/>
      <parameter type-id='type-id-35'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='libzfs_mnttab_fini' mangled-name='libzfs_mnttab_fini' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='libzfs_mnttab_fini'>
      <parameter type-id='type-id-10' name='hdl'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='avl_destroy_nodes' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-220'/>
      <parameter type-id='type-id-103'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='avl_destroy' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-220'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='pthread_mutex_destroy' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-214'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='libzfs_mnttab_cache' mangled-name='libzfs_mnttab_cache' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='libzfs_mnttab_cache'>
      <parameter type-id='type-id-10' name='hdl'/>
      <parameter type-id='type-id-16' name='enable'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <class-decl name='mnttab' size-in-bits='256' is-struct='yes' visibility='default' id='type-id-221'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mnt_special' type-id='type-id-17' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='mnt_mountp' type-id='type-id-17' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='mnt_fstype' type-id='type-id-17' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='mnt_mntopts' type-id='type-id-17' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-221' size-in-bits='64' id='type-id-222'/>
    <function-decl name='libzfs_mnttab_find' mangled-name='libzfs_mnttab_find' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='libzfs_mnttab_find'>
      <parameter type-id='type-id-10' name='hdl'/>
      <parameter type-id='type-id-84' name='fsname'/>
      <parameter type-id='type-id-222' name='entry'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='pthread_mutex_lock' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-214'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='avl_numnodes' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-220'/>
      <return type-id='type-id-35'/>
    </function-decl>
    <function-decl name='avl_find' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-220'/>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-102'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='getmntany' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-150'/>
      <parameter type-id='type-id-222'/>
      <parameter type-id='type-id-222'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='pthread_mutex_unlock' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-214'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='avl_add' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-220'/>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='libzfs_mnttab_add' mangled-name='libzfs_mnttab_add' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='libzfs_mnttab_add'>
      <parameter type-id='type-id-10' name='hdl'/>
      <parameter type-id='type-id-84' name='special'/>
      <parameter type-id='type-id-84' name='mountp'/>
      <parameter type-id='type-id-84' name='mntopts'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='libzfs_mnttab_remove' mangled-name='libzfs_mnttab_remove' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='libzfs_mnttab_remove'>
      <parameter type-id='type-id-10' name='hdl'/>
      <parameter type-id='type-id-84' name='fsname'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='avl_remove' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-220'/>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <pointer-type-def type-id='type-id-8' size-in-bits='64' id='type-id-223'/>
    <function-decl name='zfs_spa_version' mangled-name='zfs_spa_version' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_spa_version'>
      <parameter type-id='type-id-135' name='zhp'/>
      <parameter type-id='type-id-223' name='spa_version'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zfs_valid_proplist' mangled-name='zfs_valid_proplist' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_valid_proplist'>
      <parameter type-id='type-id-10' name='hdl'/>
      <parameter type-id='type-id-13' name='type'/>
      <parameter type-id='type-id-15' name='nvl'/>
      <parameter type-id='type-id-22' name='zoned'/>
      <parameter type-id='type-id-135' name='zhp'/>
      <parameter type-id='type-id-11' name='zpool_hdl'/>
      <parameter type-id='type-id-16' name='key_params_ok'/>
      <parameter type-id='type-id-84' name='errbuf'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='nvlist_alloc' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-107'/>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zfs_prop_valid_for_type' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-76'/>
      <parameter type-id='type-id-50'/>
      <return type-id='type-id-50'/>
    </function-decl>
    <function-decl name='zfs_prop_readonly' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-85'/>
      <return type-id='type-id-50'/>
    </function-decl>
    <function-decl name='zfs_prop_setonce' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-85'/>
      <return type-id='type-id-50'/>
    </function-decl>
    <function-decl name='zfs_prop_encryption_key_param' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-85'/>
      <return type-id='type-id-50'/>
    </function-decl>
    <function-decl name='zprop_parse_value' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-91'/>
      <parameter type-id='type-id-133'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-76'/>
      <parameter type-id='type-id-104'/>
      <parameter type-id='type-id-88'/>
      <parameter type-id='type-id-102'/>
      <parameter type-id='type-id-84'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zfs_prop_user' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-84'/>
      <return type-id='type-id-50'/>
    </function-decl>
    <function-decl name='nvpair_type' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-133'/>
      <return type-id='type-id-132'/>
    </function-decl>
    <function-decl name='nvpair_value_string' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-133'/>
      <parameter type-id='type-id-88'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zfs_prop_userquota' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-84'/>
      <return type-id='type-id-50'/>
    </function-decl>
    <function-decl name='zfs_nicestrtonum' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-91'/>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-102'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='nvpair_value_uint64' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-133'/>
      <parameter type-id='type-id-102'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='mountpoint_namecheck' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-213'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zfs_prop_valid_keylocation' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-50'/>
      <return type-id='type-id-50'/>
    </function-decl>
    <function-decl name='zpool_prop_get_feature' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-35'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zfs_parse_options' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-89'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='nvlist_add_uint64_array' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-104'/>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-102'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zfs_prop_written' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-84'/>
      <return type-id='type-id-50'/>
    </function-decl>
    <function-decl name='zfs_nicebytes' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-35'/>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-35'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <class-decl name='passwd' size-in-bits='384' is-struct='yes' visibility='default' id='type-id-224'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='pw_name' type-id='type-id-17' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='pw_passwd' type-id='type-id-17' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='pw_uid' type-id='type-id-191' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='pw_gid' type-id='type-id-225' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='pw_gecos' type-id='type-id-17' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='pw_dir' type-id='type-id-17' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='pw_shell' type-id='type-id-17' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__gid_t' type-id='type-id-5' id='type-id-225'/>
    <pointer-type-def type-id='type-id-224' size-in-bits='64' id='type-id-226'/>
    <function-decl name='getpwnam' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-84'/>
      <return type-id='type-id-226'/>
    </function-decl>
    <class-decl name='group' size-in-bits='256' is-struct='yes' visibility='default' id='type-id-227'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='gr_name' type-id='type-id-17' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='gr_passwd' type-id='type-id-17' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='gr_gid' type-id='type-id-225' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='gr_mem' type-id='type-id-88' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-227' size-in-bits='64' id='type-id-228'/>
    <function-decl name='getgrnam' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-84'/>
      <return type-id='type-id-228'/>
    </function-decl>
    <typedef-decl name='zfs_prop_t' type-id='type-id-85' id='type-id-229'/>
    <function-decl name='zfs_prop_get_int' mangled-name='zfs_prop_get_int' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_get_int'>
      <parameter type-id='type-id-135' name='zhp'/>
      <parameter type-id='type-id-229' name='prop'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zfs_prop_set' mangled-name='zfs_prop_set' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_set'>
      <parameter type-id='type-id-135' name='zhp'/>
      <parameter type-id='type-id-84' name='propname'/>
      <parameter type-id='type-id-84' name='propval'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zfs_prop_set_list' mangled-name='zfs_prop_set_list' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_set_list'>
      <parameter type-id='type-id-135' name='zhp'/>
      <parameter type-id='type-id-15' name='props'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='fnvlist_free' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-104'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='fnvlist_add_uint64' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-104'/>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-35'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zvol_volsize_to_reservation' mangled-name='zvol_volsize_to_reservation' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zvol_volsize_to_reservation'>
      <parameter type-id='type-id-11' name='zph'/>
      <parameter type-id='type-id-22' name='volsize'/>
      <parameter type-id='type-id-15' name='props'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='fnvpair_value_uint64' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-133'/>
      <return type-id='type-id-35'/>
    </function-decl>
    <class-decl name='prop_changelist' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-230'/>
    <pointer-type-def type-id='type-id-230' size-in-bits='64' id='type-id-231'/>
    <function-decl name='changelist_gather' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-82'/>
      <parameter type-id='type-id-85'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-231'/>
    </function-decl>
    <function-decl name='changelist_haszonedchild' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-231'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='changelist_prefix' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-231'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zcmd_write_src_nvlist' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-91'/>
      <parameter type-id='type-id-122'/>
      <parameter type-id='type-id-104'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='changelist_free' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-231'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='changelist_postfix' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-231'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zfs_setprop_error' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-91'/>
      <parameter type-id='type-id-85'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-17'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='nvlist_remove_all' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-104'/>
      <parameter type-id='type-id-84'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zfs_prop_inherit' mangled-name='zfs_prop_inherit' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_inherit'>
      <parameter type-id='type-id-135' name='zhp'/>
      <parameter type-id='type-id-84' name='propname'/>
      <parameter type-id='type-id-16' name='received'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zfs_prop_inheritable' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-85'/>
      <return type-id='type-id-50'/>
    </function-decl>
    <function-decl name='getprop_uint64' mangled-name='getprop_uint64' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getprop_uint64'>
      <parameter type-id='type-id-135' name='zhp'/>
      <parameter type-id='type-id-229' name='prop'/>
      <parameter type-id='type-id-88' name='source'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zfs_prop_default_numeric' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-85'/>
      <return type-id='type-id-35'/>
    </function-decl>
    <function-decl name='zfs_prop_get_recvd' mangled-name='zfs_prop_get_recvd' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_get_recvd'>
      <parameter type-id='type-id-135' name='zhp'/>
      <parameter type-id='type-id-84' name='propname'/>
      <parameter type-id='type-id-17' name='propbuf'/>
      <parameter type-id='type-id-28' name='proplen'/>
      <parameter type-id='type-id-16' name='literal'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <typedef-decl name='zprop_source_t' type-id='type-id-86' id='type-id-232'/>
    <pointer-type-def type-id='type-id-232' size-in-bits='64' id='type-id-233'/>
    <function-decl name='zfs_prop_get' mangled-name='zfs_prop_get' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_get'>
      <parameter type-id='type-id-135' name='zhp'/>
      <parameter type-id='type-id-229' name='prop'/>
      <parameter type-id='type-id-17' name='propbuf'/>
      <parameter type-id='type-id-28' name='proplen'/>
      <parameter type-id='type-id-233' name='src'/>
      <parameter type-id='type-id-17' name='statbuf'/>
      <parameter type-id='type-id-28' name='statlen'/>
      <parameter type-id='type-id-16' name='literal'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' id='type-id-234'>
      <underlying-type type-id='type-id-49'/>
      <enumerator name='PROP_TYPE_NUMBER' value='0'/>
      <enumerator name='PROP_TYPE_STRING' value='1'/>
      <enumerator name='PROP_TYPE_INDEX' value='2'/>
    </enum-decl>
    <function-decl name='zfs_prop_get_type' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-85'/>
      <return type-id='type-id-234'/>
    </function-decl>
    <function-decl name='zfs_nicenum' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-35'/>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-35'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <class-decl name='tm' size-in-bits='448' is-struct='yes' visibility='default' id='type-id-235'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tm_sec' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='tm_min' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tm_hour' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='tm_mday' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='tm_mon' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='tm_year' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='tm_wday' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='tm_yday' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='tm_isdst' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='tm_gmtoff' type-id='type-id-54' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='tm_zone' type-id='type-id-84' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-235' size-in-bits='64' id='type-id-236'/>
    <qualified-type-def type-id='type-id-54' const='yes' id='type-id-237'/>
    <pointer-type-def type-id='type-id-237' size-in-bits='64' id='type-id-238'/>
    <function-decl name='localtime_r' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-238'/>
      <parameter type-id='type-id-236'/>
      <return type-id='type-id-236'/>
    </function-decl>
    <qualified-type-def type-id='type-id-235' const='yes' id='type-id-239'/>
    <pointer-type-def type-id='type-id-239' size-in-bits='64' id='type-id-240'/>
    <function-decl name='strftime' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-35'/>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-240'/>
      <return type-id='type-id-35'/>
    </function-decl>
    <function-decl name='zpool_get_prop' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-142'/>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-35'/>
      <parameter type-id='type-id-87'/>
      <parameter type-id='type-id-50'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <pointer-type-def type-id='type-id-84' size-in-bits='64' id='type-id-241'/>
    <function-decl name='zfs_prop_index_to_string' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-85'/>
      <parameter type-id='type-id-35'/>
      <parameter type-id='type-id-241'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zfs_get_clones_nvl' mangled-name='zfs_get_clones_nvl' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_get_clones_nvl'>
      <parameter type-id='type-id-135' name='zhp'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='strsep' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-88'/>
      <parameter type-id='type-id-84'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='nvlist_add_nvlist' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-104'/>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-104'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='fnvlist_add_boolean' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-104'/>
      <parameter type-id='type-id-84'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='fnvlist_add_string' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-104'/>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-84'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='lzc_channel_program_nosync' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-35'/>
      <parameter type-id='type-id-35'/>
      <parameter type-id='type-id-104'/>
      <parameter type-id='type-id-107'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_nvlist' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-104'/>
      <parameter type-id='type-id-84'/>
      <return type-id='type-id-104'/>
    </function-decl>
    <pointer-type-def type-id='type-id-54' size-in-bits='64' id='type-id-242'/>
    <function-decl name='nvlist_lookup_int64' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-104'/>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-242'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zfs_prop_default_string' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-85'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_string' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-104'/>
      <parameter type-id='type-id-84'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <pointer-type-def type-id='type-id-102' size-in-bits='64' id='type-id-243'/>
    <pointer-type-def type-id='type-id-5' size-in-bits='64' id='type-id-244'/>
    <function-decl name='nvlist_lookup_uint64_array' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-104'/>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-243'/>
      <parameter type-id='type-id-244'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='nvlist_empty' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-104'/>
      <return type-id='type-id-50'/>
    </function-decl>
    <class-decl name='mntent' size-in-bits='320' is-struct='yes' visibility='default' id='type-id-245'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mnt_fsname' type-id='type-id-17' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='mnt_dir' type-id='type-id-17' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='mnt_type' type-id='type-id-17' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='mnt_opts' type-id='type-id-17' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='mnt_freq' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='mnt_passno' type-id='type-id-8' visibility='default'/>
      </data-member>
    </class-decl>
    <qualified-type-def type-id='type-id-245' const='yes' id='type-id-246'/>
    <pointer-type-def type-id='type-id-246' size-in-bits='64' id='type-id-247'/>
    <function-decl name='hasmntopt' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-247'/>
      <parameter type-id='type-id-84'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <pointer-type-def type-id='type-id-22' size-in-bits='64' id='type-id-248'/>
    <function-decl name='zfs_prop_get_numeric' mangled-name='zfs_prop_get_numeric' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_get_numeric'>
      <parameter type-id='type-id-135' name='zhp'/>
      <parameter type-id='type-id-229' name='prop'/>
      <parameter type-id='type-id-248' name='value'/>
      <parameter type-id='type-id-233' name='src'/>
      <parameter type-id='type-id-17' name='statbuf'/>
      <parameter type-id='type-id-28' name='statlen'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zfs_error_fmt' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-91'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-84'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zfs_prop_get_userquota_int' mangled-name='zfs_prop_get_userquota_int' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_get_userquota_int'>
      <parameter type-id='type-id-135' name='zhp'/>
      <parameter type-id='type-id-84' name='propname'/>
      <parameter type-id='type-id-248' name='propvalue'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zfs_prop_get_userquota' mangled-name='zfs_prop_get_userquota' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_get_userquota'>
      <parameter type-id='type-id-135' name='zhp'/>
      <parameter type-id='type-id-84' name='propname'/>
      <parameter type-id='type-id-17' name='propbuf'/>
      <parameter type-id='type-id-8' name='proplen'/>
      <parameter type-id='type-id-16' name='literal'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zfs_prop_get_written_int' mangled-name='zfs_prop_get_written_int' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_get_written_int'>
      <parameter type-id='type-id-135' name='zhp'/>
      <parameter type-id='type-id-84' name='propname'/>
      <parameter type-id='type-id-248' name='propvalue'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zfs_prop_get_written' mangled-name='zfs_prop_get_written' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_get_written'>
      <parameter type-id='type-id-135' name='zhp'/>
      <parameter type-id='type-id-84' name='propname'/>
      <parameter type-id='type-id-17' name='propbuf'/>
      <parameter type-id='type-id-8' name='proplen'/>
      <parameter type-id='type-id-16' name='literal'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <qualified-type-def type-id='type-id-134' const='yes' id='type-id-249'/>
    <pointer-type-def type-id='type-id-249' size-in-bits='64' id='type-id-250'/>
    <function-decl name='zfs_get_name' mangled-name='zfs_get_name' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_get_name'>
      <parameter type-id='type-id-250' name='zhp'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='zfs_get_pool_name' mangled-name='zfs_get_pool_name' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_get_pool_name'>
      <parameter type-id='type-id-250' name='zhp'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='zfs_get_type' mangled-name='zfs_get_type' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_get_type'>
      <parameter type-id='type-id-250' name='zhp'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='zfs_get_underlying_type' mangled-name='zfs_get_underlying_type' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_get_underlying_type'>
      <parameter type-id='type-id-250' name='zhp'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='zfs_parent_name' mangled-name='zfs_parent_name' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_parent_name'>
      <parameter type-id='type-id-135' name='zhp'/>
      <parameter type-id='type-id-17' name='buf'/>
      <parameter type-id='type-id-28' name='buflen'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zfs_dataset_exists' mangled-name='zfs_dataset_exists' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_dataset_exists'>
      <parameter type-id='type-id-10' name='hdl'/>
      <parameter type-id='type-id-84' name='path'/>
      <parameter type-id='type-id-13' name='types'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='zfs_create' mangled-name='zfs_create' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_create'>
      <parameter type-id='type-id-10' name='hdl'/>
      <parameter type-id='type-id-84' name='path'/>
      <parameter type-id='type-id-13' name='type'/>
      <parameter type-id='type-id-15' name='props'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zfs_share' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-82'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zfs_commit_all_shares' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='dataset_nestcheck' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-84'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zpool_open' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-91'/>
      <parameter type-id='type-id-84'/>
      <return type-id='type-id-126'/>
    </function-decl>
    <pointer-type-def type-id='type-id-73' size-in-bits='64' id='type-id-251'/>
    <function-decl name='zfs_crypto_create' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-91'/>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-104'/>
      <parameter type-id='type-id-104'/>
      <parameter type-id='type-id-50'/>
      <parameter type-id='type-id-251'/>
      <parameter type-id='type-id-244'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <enum-decl name='lzc_dataset_type' id='type-id-252'>
      <underlying-type type-id='type-id-49'/>
      <enumerator name='LZC_DATSET_TYPE_ZFS' value='2'/>
      <enumerator name='LZC_DATSET_TYPE_ZVOL' value='3'/>
    </enum-decl>
    <function-decl name='lzc_create' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-252'/>
      <parameter type-id='type-id-104'/>
      <parameter type-id='type-id-73'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zfs_create_ancestors' mangled-name='zfs_create_ancestors' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_create_ancestors'>
      <parameter type-id='type-id-10' name='hdl'/>
      <parameter type-id='type-id-84' name='path'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zfs_destroy' mangled-name='zfs_destroy' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_destroy'>
      <parameter type-id='type-id-135' name='zhp'/>
      <parameter type-id='type-id-16' name='defer'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='lzc_destroy_bookmarks' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-104'/>
      <parameter type-id='type-id-107'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='lzc_destroy_snaps' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-104'/>
      <parameter type-id='type-id-50'/>
      <parameter type-id='type-id-107'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zfs_standard_error_fmt' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-91'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-84'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='lzc_destroy' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-84'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zfs_destroy_snaps' mangled-name='zfs_destroy_snaps' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_destroy_snaps'>
      <parameter type-id='type-id-135' name='zhp'/>
      <parameter type-id='type-id-17' name='snapname'/>
      <parameter type-id='type-id-16' name='defer'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zfs_destroy_snaps_nvl' mangled-name='zfs_destroy_snaps_nvl' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_destroy_snaps_nvl'>
      <parameter type-id='type-id-10' name='hdl'/>
      <parameter type-id='type-id-15' name='snaps'/>
      <parameter type-id='type-id-16' name='defer'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='lzc_exists' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-84'/>
      <return type-id='type-id-50'/>
    </function-decl>
    <function-decl name='nvlist_add_boolean' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-104'/>
      <parameter type-id='type-id-84'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='fnvpair_value_int32' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-133'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zfs_clone' mangled-name='zfs_clone' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_clone'>
      <parameter type-id='type-id-135' name='zhp'/>
      <parameter type-id='type-id-84' name='target'/>
      <parameter type-id='type-id-15' name='props'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zfs_crypto_clone_check' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-91'/>
      <parameter type-id='type-id-82'/>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-104'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='lzc_clone' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-104'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zfs_promote' mangled-name='zfs_promote' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_promote'>
      <parameter type-id='type-id-135' name='zhp'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='lzc_promote' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zfs_snapshot_nvl' mangled-name='zfs_snapshot_nvl' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_snapshot_nvl'>
      <parameter type-id='type-id-10' name='hdl'/>
      <parameter type-id='type-id-15' name='snaps'/>
      <parameter type-id='type-id-15' name='props'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='lzc_snapshot' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-104'/>
      <parameter type-id='type-id-104'/>
      <parameter type-id='type-id-107'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zfs_snapshot' mangled-name='zfs_snapshot' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_snapshot'>
      <parameter type-id='type-id-10' name='hdl'/>
      <parameter type-id='type-id-84' name='path'/>
      <parameter type-id='type-id-16' name='recursive'/>
      <parameter type-id='type-id-15' name='props'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zfs_rollback' mangled-name='zfs_rollback' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_rollback'>
      <parameter type-id='type-id-135' name='zhp'/>
      <parameter type-id='type-id-135' name='snap'/>
      <parameter type-id='type-id-16' name='force'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zfs_iter_snapshots' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-82'/>
      <parameter type-id='type-id-50'/>
      <parameter type-id='type-id-95'/>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-35'/>
      <parameter type-id='type-id-35'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='lzc_rollback_to' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-84'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <class-decl name='renameflags' size-in-bits='32' is-struct='yes' visibility='default' id='type-id-253'>
      <data-member access='public' layout-offset-in-bits='31'>
        <var-decl name='recursive' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='30'>
        <var-decl name='nounmount' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='29'>
        <var-decl name='forceunmount' type-id='type-id-8' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='renameflags_t' type-id='type-id-253' id='type-id-254'/>
    <function-decl name='zfs_rename' mangled-name='zfs_rename' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_rename'>
      <parameter type-id='type-id-135' name='zhp'/>
      <parameter type-id='type-id-84' name='target'/>
      <parameter type-id='type-id-254' name='flags'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='changelist_rename' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-231'/>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-84'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_get_all_props' mangled-name='zfs_get_all_props' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_get_all_props'>
      <parameter type-id='type-id-135' name='zhp'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='zfs_get_recvd_props' mangled-name='zfs_get_recvd_props' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_get_recvd_props'>
      <parameter type-id='type-id-135' name='zhp'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='zfs_get_user_props' mangled-name='zfs_get_user_props' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_get_user_props'>
      <parameter type-id='type-id-135' name='zhp'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <class-decl name='zprop_list' size-in-bits='448' is-struct='yes' visibility='default' id='type-id-255'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='pl_prop' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='pl_user_prop' type-id='type-id-17' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='pl_next' type-id='type-id-256' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='pl_all' type-id='type-id-16' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='pl_width' type-id='type-id-28' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='pl_recvd_width' type-id='type-id-28' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='pl_fixed' type-id='type-id-16' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-255' size-in-bits='64' id='type-id-256'/>
    <typedef-decl name='zprop_list_t' type-id='type-id-255' id='type-id-257'/>
    <pointer-type-def type-id='type-id-257' size-in-bits='64' id='type-id-258'/>
    <pointer-type-def type-id='type-id-258' size-in-bits='64' id='type-id-259'/>
    <function-decl name='zfs_expand_proplist' mangled-name='zfs_expand_proplist' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_expand_proplist'>
      <parameter type-id='type-id-135' name='zhp'/>
      <parameter type-id='type-id-259' name='plp'/>
      <parameter type-id='type-id-16' name='received'/>
      <parameter type-id='type-id-16' name='literal'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <pointer-type-def type-id='type-id-256' size-in-bits='64' id='type-id-260'/>
    <function-decl name='zprop_expand_list' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-91'/>
      <parameter type-id='type-id-260'/>
      <parameter type-id='type-id-76'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zfs_prune_proplist' mangled-name='zfs_prune_proplist' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prune_proplist'>
      <parameter type-id='type-id-135' name='zhp'/>
      <parameter type-id='type-id-18' name='props'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='nvlist_remove' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-104'/>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-132'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zfs_smb_acl_add' mangled-name='zfs_smb_acl_add' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_smb_acl_add'>
      <parameter type-id='type-id-10' name='hdl'/>
      <parameter type-id='type-id-17' name='dataset'/>
      <parameter type-id='type-id-17' name='path'/>
      <parameter type-id='type-id-17' name='resource'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='ioctl' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-35'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zfs_smb_acl_remove' mangled-name='zfs_smb_acl_remove' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_smb_acl_remove'>
      <parameter type-id='type-id-10' name='hdl'/>
      <parameter type-id='type-id-17' name='dataset'/>
      <parameter type-id='type-id-17' name='path'/>
      <parameter type-id='type-id-17' name='resource'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zfs_smb_acl_purge' mangled-name='zfs_smb_acl_purge' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_smb_acl_purge'>
      <parameter type-id='type-id-10' name='hdl'/>
      <parameter type-id='type-id-17' name='dataset'/>
      <parameter type-id='type-id-17' name='path'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zfs_smb_acl_rename' mangled-name='zfs_smb_acl_rename' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_smb_acl_rename'>
      <parameter type-id='type-id-10' name='hdl'/>
      <parameter type-id='type-id-17' name='dataset'/>
      <parameter type-id='type-id-17' name='path'/>
      <parameter type-id='type-id-17' name='oldname'/>
      <parameter type-id='type-id-17' name='newname'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' id='type-id-261'>
      <underlying-type type-id='type-id-49'/>
      <enumerator name='ZFS_PROP_USERUSED' value='0'/>
      <enumerator name='ZFS_PROP_USERQUOTA' value='1'/>
      <enumerator name='ZFS_PROP_GROUPUSED' value='2'/>
      <enumerator name='ZFS_PROP_GROUPQUOTA' value='3'/>
      <enumerator name='ZFS_PROP_USEROBJUSED' value='4'/>
      <enumerator name='ZFS_PROP_USEROBJQUOTA' value='5'/>
      <enumerator name='ZFS_PROP_GROUPOBJUSED' value='6'/>
      <enumerator name='ZFS_PROP_GROUPOBJQUOTA' value='7'/>
      <enumerator name='ZFS_PROP_PROJECTUSED' value='8'/>
      <enumerator name='ZFS_PROP_PROJECTQUOTA' value='9'/>
      <enumerator name='ZFS_PROP_PROJECTOBJUSED' value='10'/>
      <enumerator name='ZFS_PROP_PROJECTOBJQUOTA' value='11'/>
      <enumerator name='ZFS_NUM_USERQUOTA_PROPS' value='12'/>
    </enum-decl>
    <typedef-decl name='zfs_userquota_prop_t' type-id='type-id-261' id='type-id-262'/>
    <typedef-decl name='uid_t' type-id='type-id-191' id='type-id-263'/>
    <pointer-type-def type-id='type-id-264' size-in-bits='64' id='type-id-265'/>
    <typedef-decl name='zfs_userspace_cb_t' type-id='type-id-265' id='type-id-266'/>
    <function-decl name='zfs_userspace' mangled-name='zfs_userspace' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_userspace'>
      <parameter type-id='type-id-135' name='zhp'/>
      <parameter type-id='type-id-262' name='type'/>
      <parameter type-id='type-id-266' name='func'/>
      <parameter type-id='type-id-7' name='arg'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zfs_hold' mangled-name='zfs_hold' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_hold'>
      <parameter type-id='type-id-135' name='zhp'/>
      <parameter type-id='type-id-84' name='snapname'/>
      <parameter type-id='type-id-84' name='tag'/>
      <parameter type-id='type-id-16' name='recursive'/>
      <parameter type-id='type-id-8' name='cleanup_fd'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zfs_hold_nvl' mangled-name='zfs_hold_nvl' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_hold_nvl'>
      <parameter type-id='type-id-135' name='zhp'/>
      <parameter type-id='type-id-8' name='cleanup_fd'/>
      <parameter type-id='type-id-15' name='holds'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='lzc_hold' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-104'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-107'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zfs_release' mangled-name='zfs_release' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_release'>
      <parameter type-id='type-id-135' name='zhp'/>
      <parameter type-id='type-id-84' name='snapname'/>
      <parameter type-id='type-id-84' name='tag'/>
      <parameter type-id='type-id-16' name='recursive'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='lzc_release' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-104'/>
      <parameter type-id='type-id-107'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='lzc_get_holds' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-107'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='fnvlist_add_nvlist' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-104'/>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-104'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_get_fsacl' mangled-name='zfs_get_fsacl' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_get_fsacl'>
      <parameter type-id='type-id-135' name='zhp'/>
      <parameter type-id='type-id-105' name='nvl'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='nvlist_unpack' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-35'/>
      <parameter type-id='type-id-107'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zfs_set_fsacl' mangled-name='zfs_set_fsacl' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_set_fsacl'>
      <parameter type-id='type-id-135' name='zhp'/>
      <parameter type-id='type-id-16' name='un'/>
      <parameter type-id='type-id-15' name='nvl'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='nvlist_size' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-104'/>
      <parameter type-id='type-id-102'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='nvlist_pack' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-104'/>
      <parameter type-id='type-id-88'/>
      <parameter type-id='type-id-102'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zfs_get_holds' mangled-name='zfs_get_holds' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_get_holds'>
      <parameter type-id='type-id-135' name='zhp'/>
      <parameter type-id='type-id-105' name='nvl'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zpool_get_config' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-107'/>
      <return type-id='type-id-104'/>
    </function-decl>
    <pointer-type-def type-id='type-id-107' size-in-bits='64' id='type-id-267'/>
    <function-decl name='nvlist_lookup_nvlist_array' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-104'/>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-267'/>
      <parameter type-id='type-id-244'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' id='type-id-268'>
      <underlying-type type-id='type-id-49'/>
      <enumerator name='ZFS_WAIT_DELETEQ' value='0'/>
      <enumerator name='ZFS_WAIT_NUM_ACTIVITIES' value='1'/>
    </enum-decl>
    <typedef-decl name='zfs_wait_activity_t' type-id='type-id-268' id='type-id-269'/>
    <function-decl name='zfs_wait_status' mangled-name='zfs_wait_status' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_wait_status'>
      <parameter type-id='type-id-135' name='zhp'/>
      <parameter type-id='type-id-269' name='activity'/>
      <parameter type-id='type-id-106' name='missing'/>
      <parameter type-id='type-id-106' name='waited'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='lzc_wait_fs' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-268'/>
      <parameter type-id='type-id-213'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='changelist_remove' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-231'/>
      <parameter type-id='type-id-84'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-264'>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-263'/>
      <parameter type-id='type-id-22'/>
      <return type-id='type-id-8'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='libzfs_diff.c' comp-dir-path='/home/nabijaczleweli/store/code/zfs/lib/libzfs' language='LANG_C99'>
    <function-decl name='zfs_show_diffs' mangled-name='zfs_show_diffs' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_show_diffs'>
      <parameter type-id='type-id-135' name='zhp'/>
      <parameter type-id='type-id-8' name='outfd'/>
      <parameter type-id='type-id-84' name='fromsnap'/>
      <parameter type-id='type-id-84' name='tosnap'/>
      <parameter type-id='type-id-8' name='flags'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zfs_validate_name' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-91'/>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-50'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zfs_asprintf' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-91'/>
      <parameter type-id='type-id-84'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='is_mounted' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-91'/>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-88'/>
      <return type-id='type-id-50'/>
    </function-decl>
    <class-decl name='differ_info' size-in-bits='9024' is-struct='yes' visibility='default' id='type-id-270'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='zhp' type-id='type-id-135' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='fromsnap' type-id='type-id-17' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='frommnt' type-id='type-id-17' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='tosnap' type-id='type-id-17' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='tomnt' type-id='type-id-17' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='ds' type-id='type-id-17' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='dsmnt' type-id='type-id-17' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='tmpsnap' type-id='type-id-17' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='errbuf' type-id='type-id-23' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8704'>
        <var-decl name='isclone' type-id='type-id-16' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8736'>
        <var-decl name='scripted' type-id='type-id-16' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8768'>
        <var-decl name='classify' type-id='type-id-16' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8800'>
        <var-decl name='timestamped' type-id='type-id-16' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8832'>
        <var-decl name='shares' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8896'>
        <var-decl name='zerr' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8928'>
        <var-decl name='cleanupfd' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8960'>
        <var-decl name='outputfd' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8992'>
        <var-decl name='datafd' type-id='type-id-8' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-270' size-in-bits='64' id='type-id-271'/>
    <function-decl name='find_shares_object' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-271'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='pipe2' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-223'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <union-decl name='pthread_attr_t' size-in-bits='448' visibility='default' id='type-id-272'>
      <data-member access='private'>
        <var-decl name='__size' type-id='type-id-273' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='__align' type-id='type-id-54' visibility='default'/>
      </data-member>
    </union-decl>

    <array-type-def dimensions='1' type-id='type-id-32' size-in-bits='448' id='type-id-273'>
      <subrange length='56' type-id='type-id-33' id='type-id-274'/>

    </array-type-def>
    <qualified-type-def type-id='type-id-272' const='yes' id='type-id-275'/>
    <pointer-type-def type-id='type-id-275' size-in-bits='64' id='type-id-276'/>
    <pointer-type-def type-id='type-id-277' size-in-bits='64' id='type-id-278'/>
    <function-decl name='pthread_create' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-102'/>
      <parameter type-id='type-id-276'/>
      <parameter type-id='type-id-278'/>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='pthread_join' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-35'/>
      <parameter type-id='type-id-103'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='pthread_cancel' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-35'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-277'>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-7'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='libzfs_import.c' comp-dir-path='/home/nabijaczleweli/store/code/zfs/lib/libzfs' language='LANG_C99'>
    <class-decl name='pool_config_ops' size-in-bits='128' is-struct='yes' visibility='default' id='type-id-279'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='pco_refresh_config' type-id='type-id-280' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='pco_pool_active' type-id='type-id-281' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='refresh_config_func_t' type-id='type-id-282' id='type-id-283'/>
    <pointer-type-def type-id='type-id-283' size-in-bits='64' id='type-id-280'/>
    <typedef-decl name='pool_active_func_t' type-id='type-id-284' id='type-id-285'/>
    <pointer-type-def type-id='type-id-285' size-in-bits='64' id='type-id-281'/>
    <qualified-type-def type-id='type-id-279' const='yes' id='type-id-286'/>
    <typedef-decl name='pool_config_ops_t' type-id='type-id-286' id='type-id-287'/>
    <var-decl name='libzfs_config_ops' type-id='type-id-287' mangled-name='libzfs_config_ops' visibility='default' elf-symbol-id='libzfs_config_ops'/>
    <function-decl name='zcmd_write_conf_nvlist' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-91'/>
      <parameter type-id='type-id-122'/>
      <parameter type-id='type-id-104'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zpool_clear_label' mangled-name='zpool_clear_label' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_clear_label'>
      <parameter type-id='type-id-8' name='fd'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='pread64' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-35'/>
      <parameter type-id='type-id-54'/>
      <return type-id='type-id-54'/>
    </function-decl>
    <function-decl name='pwrite64' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-35'/>
      <parameter type-id='type-id-54'/>
      <return type-id='type-id-54'/>
    </function-decl>
    <enum-decl name='pool_state' id='type-id-289'>
      <underlying-type type-id='type-id-49'/>
      <enumerator name='POOL_STATE_ACTIVE' value='0'/>
      <enumerator name='POOL_STATE_EXPORTED' value='1'/>
      <enumerator name='POOL_STATE_DESTROYED' value='2'/>
      <enumerator name='POOL_STATE_SPARE' value='3'/>
      <enumerator name='POOL_STATE_L2CACHE' value='4'/>
      <enumerator name='POOL_STATE_UNINITIALIZED' value='5'/>
      <enumerator name='POOL_STATE_UNAVAIL' value='6'/>
      <enumerator name='POOL_STATE_POTENTIALLY_ACTIVE' value='7'/>
    </enum-decl>
    <typedef-decl name='pool_state_t' type-id='type-id-289' id='type-id-290'/>
    <pointer-type-def type-id='type-id-290' size-in-bits='64' id='type-id-291'/>
    <function-decl name='zpool_in_use' mangled-name='zpool_in_use' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_in_use'>
      <parameter type-id='type-id-10' name='hdl'/>
      <parameter type-id='type-id-8' name='fd'/>
      <parameter type-id='type-id-291' name='state'/>
      <parameter type-id='type-id-88' name='namestr'/>
      <parameter type-id='type-id-106' name='inuse'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zpool_read_label' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-107'/>
      <parameter type-id='type-id-223'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <pointer-type-def type-id='type-id-292' size-in-bits='64' id='type-id-293'/>
    <function-decl name='zpool_iter' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-91'/>
      <parameter type-id='type-id-293'/>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-284'>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-22'/>
      <parameter type-id='type-id-106'/>
      <return type-id='type-id-8'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-292'>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-8'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-282'>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-15'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='libzfs_iter.c' comp-dir-path='/home/nabijaczleweli/store/code/zfs/lib/libzfs' language='LANG_C99'>
    <function-decl name='zfs_iter_filesystems' mangled-name='zfs_iter_filesystems' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_iter_filesystems'>
      <parameter type-id='type-id-135' name='zhp'/>
      <parameter type-id='type-id-138' name='func'/>
      <parameter type-id='type-id-7' name='data'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='make_dataset_handle_zc' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-91'/>
      <parameter type-id='type-id-122'/>
      <return type-id='type-id-82'/>
    </function-decl>
    <function-decl name='zfs_iter_snapshots' mangled-name='zfs_iter_snapshots' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_iter_snapshots'>
      <parameter type-id='type-id-135' name='zhp'/>
      <parameter type-id='type-id-16' name='simple'/>
      <parameter type-id='type-id-138' name='func'/>
      <parameter type-id='type-id-7' name='data'/>
      <parameter type-id='type-id-22' name='min_txg'/>
      <parameter type-id='type-id-22' name='max_txg'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='make_dataset_simple_handle_zc' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-82'/>
      <parameter type-id='type-id-122'/>
      <return type-id='type-id-82'/>
    </function-decl>
    <function-decl name='zfs_iter_bookmarks' mangled-name='zfs_iter_bookmarks' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_iter_bookmarks'>
      <parameter type-id='type-id-135' name='zhp'/>
      <parameter type-id='type-id-138' name='func'/>
      <parameter type-id='type-id-7' name='data'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zfs_get_type' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-97'/>
      <return type-id='type-id-76'/>
    </function-decl>
    <function-decl name='fnvpair_value_nvlist' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-133'/>
      <return type-id='type-id-104'/>
    </function-decl>
    <function-decl name='make_bookmark_handle' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-82'/>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-104'/>
      <return type-id='type-id-82'/>
    </function-decl>
    <function-decl name='zfs_iter_snapshots_sorted' mangled-name='zfs_iter_snapshots_sorted' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_iter_snapshots_sorted'>
      <parameter type-id='type-id-135' name='zhp'/>
      <parameter type-id='type-id-138' name='callback'/>
      <parameter type-id='type-id-7' name='data'/>
      <parameter type-id='type-id-22' name='min_txg'/>
      <parameter type-id='type-id-22' name='max_txg'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='avl_first' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-220'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='avl_walk' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-220'/>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='zfs_iter_snapspec' mangled-name='zfs_iter_snapspec' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_iter_snapspec'>
      <parameter type-id='type-id-135' name='fs_zhp'/>
      <parameter type-id='type-id-84' name='spec_orig'/>
      <parameter type-id='type-id-138' name='func'/>
      <parameter type-id='type-id-7' name='arg'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zfs_dataset_exists' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-91'/>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-76'/>
      <return type-id='type-id-50'/>
    </function-decl>
    <function-decl name='zfs_iter_children' mangled-name='zfs_iter_children' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_iter_children'>
      <parameter type-id='type-id-135' name='zhp'/>
      <parameter type-id='type-id-138' name='func'/>
      <parameter type-id='type-id-7' name='data'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zfs_iter_dependents' mangled-name='zfs_iter_dependents' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_iter_dependents'>
      <parameter type-id='type-id-135' name='zhp'/>
      <parameter type-id='type-id-16' name='allowrecursion'/>
      <parameter type-id='type-id-138' name='func'/>
      <parameter type-id='type-id-7' name='data'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zfs_get_clones_nvl' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-82'/>
      <return type-id='type-id-104'/>
    </function-decl>
    <function-decl name='zfs_iter_mounted' mangled-name='zfs_iter_mounted' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_iter_mounted'>
      <parameter type-id='type-id-135' name='zhp'/>
      <parameter type-id='type-id-138' name='func'/>
      <parameter type-id='type-id-7' name='data'/>
      <return type-id='type-id-8'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='libzfs_mount.c' comp-dir-path='/home/nabijaczleweli/store/code/zfs/lib/libzfs' language='LANG_C99'>
    <function-decl name='is_mounted' mangled-name='is_mounted' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='is_mounted'>
      <parameter type-id='type-id-10' name='zfs_hdl'/>
      <parameter type-id='type-id-84' name='special'/>
      <parameter type-id='type-id-88' name='where'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='libzfs_mnttab_find' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-91'/>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-222'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zfs_is_mounted' mangled-name='zfs_is_mounted' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_is_mounted'>
      <parameter type-id='type-id-135' name='zhp'/>
      <parameter type-id='type-id-88' name='where'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='zfs_mount' mangled-name='zfs_mount' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_mount'>
      <parameter type-id='type-id-135' name='zhp'/>
      <parameter type-id='type-id-84' name='options'/>
      <parameter type-id='type-id-8' name='flags'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zfs_mount_at' mangled-name='zfs_mount_at' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_mount_at'>
      <parameter type-id='type-id-135' name='zhp'/>
      <parameter type-id='type-id-84' name='options'/>
      <parameter type-id='type-id-8' name='flags'/>
      <parameter type-id='type-id-84' name='mountpoint'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='getprop_uint64' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-82'/>
      <parameter type-id='type-id-85'/>
      <parameter type-id='type-id-88'/>
      <return type-id='type-id-35'/>
    </function-decl>
    <pointer-type-def type-id='type-id-50' size-in-bits='64' id='type-id-294'/>
    <function-decl name='zfs_crypto_get_encryption_root' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-82'/>
      <parameter type-id='type-id-294'/>
      <parameter type-id='type-id-17'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zfs_crypto_load_key' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-82'/>
      <parameter type-id='type-id-50'/>
      <parameter type-id='type-id-17'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='mkdirp' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <class-decl name='statfs64' size-in-bits='960' is-struct='yes' visibility='default' id='type-id-295'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='f_type' type-id='type-id-296' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='f_bsize' type-id='type-id-296' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='f_blocks' type-id='type-id-297' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='f_bfree' type-id='type-id-297' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='f_bavail' type-id='type-id-297' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='f_files' type-id='type-id-298' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='f_ffree' type-id='type-id-298' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='f_fsid' type-id='type-id-299' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='f_namelen' type-id='type-id-296' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='f_frsize' type-id='type-id-296' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='f_flags' type-id='type-id-296' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='f_spare' type-id='type-id-300' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__fsword_t' type-id='type-id-54' id='type-id-296'/>
    <typedef-decl name='__fsblkcnt64_t' type-id='type-id-35' id='type-id-297'/>
    <typedef-decl name='__fsfilcnt64_t' type-id='type-id-35' id='type-id-298'/>
    <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-299' visibility='default' id='type-id-301'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__val' type-id='type-id-302' visibility='default'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-8' size-in-bits='64' id='type-id-302'>
      <subrange length='2' type-id='type-id-33' id='type-id-67'/>

    </array-type-def>
    <typedef-decl name='__fsid_t' type-id='type-id-301' id='type-id-299'/>

    <array-type-def dimensions='1' type-id='type-id-296' size-in-bits='256' id='type-id-300'>
      <subrange length='4' type-id='type-id-33' id='type-id-217'/>

    </array-type-def>
    <pointer-type-def type-id='type-id-295' size-in-bits='64' id='type-id-303'/>
    <function-decl name='statfs64' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-303'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='openat' mangled-name='openat64' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-8'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-304'/>
    <pointer-type-def type-id='type-id-304' size-in-bits='64' id='type-id-305'/>
    <function-decl name='fdopendir' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-305'/>
    </function-decl>
    <class-decl name='dirent64' size-in-bits='2240' is-struct='yes' visibility='default' id='type-id-306'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='d_ino' type-id='type-id-307' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='d_off' type-id='type-id-155' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='d_reclen' type-id='type-id-152' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='144'>
        <var-decl name='d_type' type-id='type-id-75' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='152'>
        <var-decl name='d_name' type-id='type-id-12' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__ino64_t' type-id='type-id-35' id='type-id-307'/>
    <pointer-type-def type-id='type-id-306' size-in-bits='64' id='type-id-308'/>
    <function-decl name='readdir64' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-305'/>
      <return type-id='type-id-308'/>
    </function-decl>
    <function-decl name='closedir' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-305'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='do_mount' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-82'/>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='libzfs_mnttab_remove' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-91'/>
      <parameter type-id='type-id-84'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='libzfs_mnttab_add' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-91'/>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-84'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_spa_version' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-82'/>
      <parameter type-id='type-id-223'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zfs_unmount' mangled-name='zfs_unmount' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_unmount'>
      <parameter type-id='type-id-135' name='zhp'/>
      <parameter type-id='type-id-84' name='mountpoint'/>
      <parameter type-id='type-id-8' name='flags'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='sa_commit_shares' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-84'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='do_unmount' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zfs_crypto_unload_key' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-82'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='sa_is_shared' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-17'/>
      <return type-id='type-id-50'/>
    </function-decl>
    <function-decl name='sa_disable_share' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-17'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='sa_errorstr' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='zfs_shareall' mangled-name='zfs_shareall' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_shareall'>
      <parameter type-id='type-id-135' name='zhp'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zfs_unmountall' mangled-name='zfs_unmountall' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_unmountall'>
      <parameter type-id='type-id-135' name='zhp'/>
      <parameter type-id='type-id-8' name='flags'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zfs_is_shared' mangled-name='zfs_is_shared' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_is_shared'>
      <parameter type-id='type-id-135' name='zhp'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='sa_enable_share' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-17'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zfs_share' mangled-name='zfs_share' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_share'>
      <parameter type-id='type-id-135' name='zhp'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zfs_unshare' mangled-name='zfs_unshare' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_unshare'>
      <parameter type-id='type-id-135' name='zhp'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='changelist_unshare' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-231'/>
      <parameter type-id='type-id-294'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zfs_unshareall' mangled-name='zfs_unshareall' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_unshareall'>
      <parameter type-id='type-id-135' name='zhp'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zfs_is_shared_nfs' mangled-name='zfs_is_shared_nfs' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_is_shared_nfs'>
      <parameter type-id='type-id-135' name='zhp'/>
      <parameter type-id='type-id-88' name='where'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='zfs_is_shared_smb' mangled-name='zfs_is_shared_smb' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_is_shared_smb'>
      <parameter type-id='type-id-135' name='zhp'/>
      <parameter type-id='type-id-88' name='where'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='sa_validate_shareopts' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-17'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zfs_commit_shares' mangled-name='zfs_commit_shares' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_commit_shares'>
      <parameter type-id='type-id-84' name='proto'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_share_nfs' mangled-name='zfs_share_nfs' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_share_nfs'>
      <parameter type-id='type-id-135' name='zhp'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zfs_share_smb' mangled-name='zfs_share_smb' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_share_smb'>
      <parameter type-id='type-id-135' name='zhp'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zfs_unshare_nfs' mangled-name='zfs_unshare_nfs' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_unshare_nfs'>
      <parameter type-id='type-id-135' name='zhp'/>
      <parameter type-id='type-id-84' name='mountpoint'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zfs_unshare_smb' mangled-name='zfs_unshare_smb' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_unshare_smb'>
      <parameter type-id='type-id-135' name='zhp'/>
      <parameter type-id='type-id-84' name='mountpoint'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zfs_unshareall_nfs' mangled-name='zfs_unshareall_nfs' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_unshareall_nfs'>
      <parameter type-id='type-id-135' name='zhp'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zfs_unshareall_smb' mangled-name='zfs_unshareall_smb' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_unshareall_smb'>
      <parameter type-id='type-id-135' name='zhp'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zfs_unshareall_bypath' mangled-name='zfs_unshareall_bypath' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_unshareall_bypath'>
      <parameter type-id='type-id-135' name='zhp'/>
      <parameter type-id='type-id-84' name='mountpoint'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zfs_unshareall_bytype' mangled-name='zfs_unshareall_bytype' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_unshareall_bytype'>
      <parameter type-id='type-id-135' name='zhp'/>
      <parameter type-id='type-id-84' name='mountpoint'/>
      <parameter type-id='type-id-84' name='proto'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='rmdir' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-84'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <class-decl name='get_all_cb' size-in-bits='192' is-struct='yes' visibility='default' id='type-id-309'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cb_handles' type-id='type-id-310' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='cb_alloc' type-id='type-id-28' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='cb_used' type-id='type-id-28' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-135' size-in-bits='64' id='type-id-310'/>
    <typedef-decl name='get_all_cb_t' type-id='type-id-309' id='type-id-311'/>
    <pointer-type-def type-id='type-id-311' size-in-bits='64' id='type-id-312'/>
    <function-decl name='libzfs_add_handle' mangled-name='libzfs_add_handle' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='libzfs_add_handle'>
      <parameter type-id='type-id-312' name='cbp'/>
      <parameter type-id='type-id-135' name='zhp'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_realloc' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-91'/>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-35'/>
      <parameter type-id='type-id-35'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='zfs_foreach_mountpoint' mangled-name='zfs_foreach_mountpoint' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_foreach_mountpoint'>
      <parameter type-id='type-id-10' name='hdl'/>
      <parameter type-id='type-id-310' name='handles'/>
      <parameter type-id='type-id-28' name='num_handles'/>
      <parameter type-id='type-id-138' name='func'/>
      <parameter type-id='type-id-7' name='data'/>
      <parameter type-id='type-id-16' name='parallel'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='qsort' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-35'/>
      <parameter type-id='type-id-35'/>
      <parameter type-id='type-id-62'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <class-decl name='tpool' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-313'/>
    <pointer-type-def type-id='type-id-313' size-in-bits='64' id='type-id-314'/>
    <pointer-type-def type-id='type-id-272' size-in-bits='64' id='type-id-315'/>
    <function-decl name='tpool_create' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-315'/>
      <return type-id='type-id-314'/>
    </function-decl>
    <pointer-type-def type-id='type-id-316' size-in-bits='64' id='type-id-317'/>
    <function-decl name='tpool_dispatch' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-314'/>
      <parameter type-id='type-id-317'/>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='tpool_wait' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-314'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='tpool_destroy' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-314'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zpool_enable_datasets' mangled-name='zpool_enable_datasets' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_enable_datasets'>
      <parameter type-id='type-id-11' name='zhp'/>
      <parameter type-id='type-id-84' name='mntopts'/>
      <parameter type-id='type-id-8' name='flags'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zpool_disable_datasets' mangled-name='zpool_disable_datasets' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_disable_datasets'>
      <parameter type-id='type-id-11' name='zhp'/>
      <parameter type-id='type-id-16' name='force'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-316'>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-6'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='libzfs_pool.c' comp-dir-path='/home/nabijaczleweli/store/code/zfs/lib/libzfs' language='LANG_C99'>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' id='type-id-318'>
      <underlying-type type-id='type-id-49'/>
      <enumerator name='ZPOOL_COMPATIBILITY_OK' value='0'/>
      <enumerator name='ZPOOL_COMPATIBILITY_WARNTOKEN' value='1'/>
      <enumerator name='ZPOOL_COMPATIBILITY_BADTOKEN' value='2'/>
      <enumerator name='ZPOOL_COMPATIBILITY_BADFILE' value='3'/>
      <enumerator name='ZPOOL_COMPATIBILITY_NOFILES' value='4'/>
    </enum-decl>
    <typedef-decl name='zpool_compat_status_t' type-id='type-id-318' id='type-id-319'/>
    <function-decl name='zpool_load_compat' mangled-name='zpool_load_compat' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_load_compat'>
      <parameter type-id='type-id-84' name='compat'/>
      <parameter type-id='type-id-106' name='features'/>
      <parameter type-id='type-id-17' name='report'/>
      <parameter type-id='type-id-28' name='rlen'/>
      <return type-id='type-id-319'/>
    </function-decl>
    <function-decl name='zpool_props_refresh' mangled-name='zpool_props_refresh' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_props_refresh'>
      <parameter type-id='type-id-11' name='zhp'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <typedef-decl name='zpool_prop_t' type-id='type-id-142' id='type-id-320'/>
    <function-decl name='zpool_get_prop_int' mangled-name='zpool_get_prop_int' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_get_prop_int'>
      <parameter type-id='type-id-11' name='zhp'/>
      <parameter type-id='type-id-320' name='prop'/>
      <parameter type-id='type-id-233' name='src'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zpool_prop_to_name' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-142'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='zpool_prop_default_numeric' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-142'/>
      <return type-id='type-id-35'/>
    </function-decl>
    <enum-decl name='vdev_state' id='type-id-321'>
      <underlying-type type-id='type-id-49'/>
      <enumerator name='VDEV_STATE_UNKNOWN' value='0'/>
      <enumerator name='VDEV_STATE_CLOSED' value='1'/>
      <enumerator name='VDEV_STATE_OFFLINE' value='2'/>
      <enumerator name='VDEV_STATE_REMOVED' value='3'/>
      <enumerator name='VDEV_STATE_CANT_OPEN' value='4'/>
      <enumerator name='VDEV_STATE_FAULTED' value='5'/>
      <enumerator name='VDEV_STATE_DEGRADED' value='6'/>
      <enumerator name='VDEV_STATE_HEALTHY' value='7'/>
    </enum-decl>
    <typedef-decl name='vdev_state_t' type-id='type-id-321' id='type-id-322'/>
    <enum-decl name='vdev_aux' id='type-id-323'>
      <underlying-type type-id='type-id-49'/>
      <enumerator name='VDEV_AUX_NONE' value='0'/>
      <enumerator name='VDEV_AUX_OPEN_FAILED' value='1'/>
      <enumerator name='VDEV_AUX_CORRUPT_DATA' value='2'/>
      <enumerator name='VDEV_AUX_NO_REPLICAS' value='3'/>
      <enumerator name='VDEV_AUX_BAD_GUID_SUM' value='4'/>
      <enumerator name='VDEV_AUX_TOO_SMALL' value='5'/>
      <enumerator name='VDEV_AUX_BAD_LABEL' value='6'/>
      <enumerator name='VDEV_AUX_VERSION_NEWER' value='7'/>
      <enumerator name='VDEV_AUX_VERSION_OLDER' value='8'/>
      <enumerator name='VDEV_AUX_UNSUP_FEAT' value='9'/>
      <enumerator name='VDEV_AUX_SPARED' value='10'/>
      <enumerator name='VDEV_AUX_ERR_EXCEEDED' value='11'/>
      <enumerator name='VDEV_AUX_IO_FAILURE' value='12'/>
      <enumerator name='VDEV_AUX_BAD_LOG' value='13'/>
      <enumerator name='VDEV_AUX_EXTERNAL' value='14'/>
      <enumerator name='VDEV_AUX_SPLIT_POOL' value='15'/>
      <enumerator name='VDEV_AUX_BAD_ASHIFT' value='16'/>
      <enumerator name='VDEV_AUX_EXTERNAL_PERSIST' value='17'/>
      <enumerator name='VDEV_AUX_ACTIVE' value='18'/>
      <enumerator name='VDEV_AUX_CHILDREN_OFFLINE' value='19'/>
      <enumerator name='VDEV_AUX_ASHIFT_TOO_BIG' value='20'/>
    </enum-decl>
    <typedef-decl name='vdev_aux_t' type-id='type-id-323' id='type-id-324'/>
    <function-decl name='zpool_state_to_name' mangled-name='zpool_state_to_name' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_state_to_name'>
      <parameter type-id='type-id-322' name='state'/>
      <parameter type-id='type-id-324' name='aux'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='zpool_pool_state_to_name' mangled-name='zpool_pool_state_to_name' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_pool_state_to_name'>
      <parameter type-id='type-id-290' name='state'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='zpool_get_state_str' mangled-name='zpool_get_state_str' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_get_state_str'>
      <parameter type-id='type-id-11' name='zhp'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' id='type-id-325'>
      <underlying-type type-id='type-id-49'/>
      <enumerator name='ZPOOL_STATUS_CORRUPT_CACHE' value='0'/>
      <enumerator name='ZPOOL_STATUS_MISSING_DEV_R' value='1'/>
      <enumerator name='ZPOOL_STATUS_MISSING_DEV_NR' value='2'/>
      <enumerator name='ZPOOL_STATUS_CORRUPT_LABEL_R' value='3'/>
      <enumerator name='ZPOOL_STATUS_CORRUPT_LABEL_NR' value='4'/>
      <enumerator name='ZPOOL_STATUS_BAD_GUID_SUM' value='5'/>
      <enumerator name='ZPOOL_STATUS_CORRUPT_POOL' value='6'/>
      <enumerator name='ZPOOL_STATUS_CORRUPT_DATA' value='7'/>
      <enumerator name='ZPOOL_STATUS_FAILING_DEV' value='8'/>
      <enumerator name='ZPOOL_STATUS_VERSION_NEWER' value='9'/>
      <enumerator name='ZPOOL_STATUS_HOSTID_MISMATCH' value='10'/>
      <enumerator name='ZPOOL_STATUS_HOSTID_ACTIVE' value='11'/>
      <enumerator name='ZPOOL_STATUS_HOSTID_REQUIRED' value='12'/>
      <enumerator name='ZPOOL_STATUS_IO_FAILURE_WAIT' value='13'/>
      <enumerator name='ZPOOL_STATUS_IO_FAILURE_CONTINUE' value='14'/>
      <enumerator name='ZPOOL_STATUS_IO_FAILURE_MMP' value='15'/>
      <enumerator name='ZPOOL_STATUS_BAD_LOG' value='16'/>
      <enumerator name='ZPOOL_STATUS_ERRATA' value='17'/>
      <enumerator name='ZPOOL_STATUS_UNSUP_FEAT_READ' value='18'/>
      <enumerator name='ZPOOL_STATUS_UNSUP_FEAT_WRITE' value='19'/>
      <enumerator name='ZPOOL_STATUS_FAULTED_DEV_R' value='20'/>
      <enumerator name='ZPOOL_STATUS_FAULTED_DEV_NR' value='21'/>
      <enumerator name='ZPOOL_STATUS_VERSION_OLDER' value='22'/>
      <enumerator name='ZPOOL_STATUS_FEAT_DISABLED' value='23'/>
      <enumerator name='ZPOOL_STATUS_RESILVERING' value='24'/>
      <enumerator name='ZPOOL_STATUS_OFFLINE_DEV' value='25'/>
      <enumerator name='ZPOOL_STATUS_REMOVED_DEV' value='26'/>
      <enumerator name='ZPOOL_STATUS_REBUILDING' value='27'/>
      <enumerator name='ZPOOL_STATUS_REBUILD_SCRUB' value='28'/>
      <enumerator name='ZPOOL_STATUS_NON_NATIVE_ASHIFT' value='29'/>
      <enumerator name='ZPOOL_STATUS_COMPATIBILITY_ERR' value='30'/>
      <enumerator name='ZPOOL_STATUS_INCOMPATIBLE_FEAT' value='31'/>
      <enumerator name='ZPOOL_STATUS_OK' value='32'/>
    </enum-decl>
    <enum-decl name='zpool_errata' id='type-id-326'>
      <underlying-type type-id='type-id-49'/>
      <enumerator name='ZPOOL_ERRATA_NONE' value='0'/>
      <enumerator name='ZPOOL_ERRATA_ZOL_2094_SCRUB' value='1'/>
      <enumerator name='ZPOOL_ERRATA_ZOL_2094_ASYNC_DESTROY' value='2'/>
      <enumerator name='ZPOOL_ERRATA_ZOL_6845_ENCRYPTION' value='3'/>
      <enumerator name='ZPOOL_ERRATA_ZOL_8308_ENCRYPTION' value='4'/>
    </enum-decl>
    <pointer-type-def type-id='type-id-326' size-in-bits='64' id='type-id-327'/>
    <function-decl name='zpool_get_status' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-88'/>
      <parameter type-id='type-id-327'/>
      <return type-id='type-id-325'/>
    </function-decl>
    <function-decl name='zpool_get_state' mangled-name='zpool_get_state' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_get_state'>
      <parameter type-id='type-id-11' name='zhp'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zpool_get_prop' mangled-name='zpool_get_prop' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_get_prop'>
      <parameter type-id='type-id-11' name='zhp'/>
      <parameter type-id='type-id-320' name='prop'/>
      <parameter type-id='type-id-17' name='buf'/>
      <parameter type-id='type-id-28' name='len'/>
      <parameter type-id='type-id-233' name='srctype'/>
      <parameter type-id='type-id-16' name='literal'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zpool_prop_get_type' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-142'/>
      <return type-id='type-id-234'/>
    </function-decl>
    <function-decl name='zpool_prop_index_to_string' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-142'/>
      <parameter type-id='type-id-35'/>
      <parameter type-id='type-id-241'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zpool_get_name' mangled-name='zpool_get_name' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_get_name'>
      <parameter type-id='type-id-11' name='zhp'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='zpool_prop_default_string' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-142'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='zpool_set_prop' mangled-name='zpool_set_prop' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_set_prop'>
      <parameter type-id='type-id-11' name='zhp'/>
      <parameter type-id='type-id-84' name='propname'/>
      <parameter type-id='type-id-84' name='propval'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zpool_standard_error' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-91'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-84'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zpool_name_to_prop' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-84'/>
      <return type-id='type-id-142'/>
    </function-decl>
    <function-decl name='zpool_prop_readonly' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-142'/>
      <return type-id='type-id-50'/>
    </function-decl>
    <function-decl name='zpool_prop_setonce' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-142'/>
      <return type-id='type-id-50'/>
    </function-decl>
    <function-decl name='zpool_prop_feature' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-84'/>
      <return type-id='type-id-50'/>
    </function-decl>
    <enum-decl name='spa_feature' id='type-id-328'>
      <underlying-type type-id='type-id-49'/>
      <enumerator name='SPA_FEATURE_NONE' value='-1'/>
      <enumerator name='SPA_FEATURE_ASYNC_DESTROY' value='0'/>
      <enumerator name='SPA_FEATURE_EMPTY_BPOBJ' value='1'/>
      <enumerator name='SPA_FEATURE_LZ4_COMPRESS' value='2'/>
      <enumerator name='SPA_FEATURE_MULTI_VDEV_CRASH_DUMP' value='3'/>
      <enumerator name='SPA_FEATURE_SPACEMAP_HISTOGRAM' value='4'/>
      <enumerator name='SPA_FEATURE_ENABLED_TXG' value='5'/>
      <enumerator name='SPA_FEATURE_HOLE_BIRTH' value='6'/>
      <enumerator name='SPA_FEATURE_EXTENSIBLE_DATASET' value='7'/>
      <enumerator name='SPA_FEATURE_EMBEDDED_DATA' value='8'/>
      <enumerator name='SPA_FEATURE_BOOKMARKS' value='9'/>
      <enumerator name='SPA_FEATURE_FS_SS_LIMIT' value='10'/>
      <enumerator name='SPA_FEATURE_LARGE_BLOCKS' value='11'/>
      <enumerator name='SPA_FEATURE_LARGE_DNODE' value='12'/>
      <enumerator name='SPA_FEATURE_SHA512' value='13'/>
      <enumerator name='SPA_FEATURE_SKEIN' value='14'/>
      <enumerator name='SPA_FEATURE_EDONR' value='15'/>
      <enumerator name='SPA_FEATURE_USEROBJ_ACCOUNTING' value='16'/>
      <enumerator name='SPA_FEATURE_ENCRYPTION' value='17'/>
      <enumerator name='SPA_FEATURE_PROJECT_QUOTA' value='18'/>
      <enumerator name='SPA_FEATURE_DEVICE_REMOVAL' value='19'/>
      <enumerator name='SPA_FEATURE_OBSOLETE_COUNTS' value='20'/>
      <enumerator name='SPA_FEATURE_POOL_CHECKPOINT' value='21'/>
      <enumerator name='SPA_FEATURE_SPACEMAP_V2' value='22'/>
      <enumerator name='SPA_FEATURE_ALLOCATION_CLASSES' value='23'/>
      <enumerator name='SPA_FEATURE_RESILVER_DEFER' value='24'/>
      <enumerator name='SPA_FEATURE_BOOKMARK_V2' value='25'/>
      <enumerator name='SPA_FEATURE_REDACTION_BOOKMARKS' value='26'/>
      <enumerator name='SPA_FEATURE_REDACTED_DATASETS' value='27'/>
      <enumerator name='SPA_FEATURE_BOOKMARK_WRITTEN' value='28'/>
      <enumerator name='SPA_FEATURE_LOG_SPACEMAP' value='29'/>
      <enumerator name='SPA_FEATURE_LIVELIST' value='30'/>
      <enumerator name='SPA_FEATURE_DEVICE_REBUILD' value='31'/>
      <enumerator name='SPA_FEATURE_ZSTD_COMPRESS' value='32'/>
      <enumerator name='SPA_FEATURE_DRAID' value='33'/>
      <enumerator name='SPA_FEATURES' value='34'/>
    </enum-decl>
    <pointer-type-def type-id='type-id-328' size-in-bits='64' id='type-id-329'/>
    <function-decl name='zfeature_lookup_name' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-329'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zpool_open_canfail' mangled-name='zpool_open_canfail' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_open_canfail'>
      <parameter type-id='type-id-10' name='hdl'/>
      <parameter type-id='type-id-84' name='pool'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='zpool_close' mangled-name='zpool_close' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_close'>
      <parameter type-id='type-id-11' name='zhp'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='get_system_hostid' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-35'/>
    </function-decl>
    <function-decl name='zpool_expand_proplist' mangled-name='zpool_expand_proplist' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_expand_proplist'>
      <parameter type-id='type-id-11' name='zhp'/>
      <parameter type-id='type-id-259' name='plp'/>
      <parameter type-id='type-id-16' name='literal'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zfeature_is_supported' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-84'/>
      <return type-id='type-id-50'/>
    </function-decl>
    <function-decl name='zpool_prop_get_feature' mangled-name='zpool_prop_get_feature' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_prop_get_feature'>
      <parameter type-id='type-id-11' name='zhp'/>
      <parameter type-id='type-id-84' name='propname'/>
      <parameter type-id='type-id-17' name='buf'/>
      <parameter type-id='type-id-28' name='len'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='pool_namecheck' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-213'/>
      <parameter type-id='type-id-17'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zpool_refresh_stats' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-294'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zpool_open' mangled-name='zpool_open' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_open'>
      <parameter type-id='type-id-10' name='hdl'/>
      <parameter type-id='type-id-84' name='pool'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='zpool_is_draid_spare' mangled-name='zpool_is_draid_spare' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_is_draid_spare'>
      <parameter type-id='type-id-84' name='name'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='zpool_create' mangled-name='zpool_create' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_create'>
      <parameter type-id='type-id-10' name='hdl'/>
      <parameter type-id='type-id-84' name='pool'/>
      <parameter type-id='type-id-15' name='nvroot'/>
      <parameter type-id='type-id-15' name='props'/>
      <parameter type-id='type-id-15' name='fsprops'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='nvlist_add_uint8_array' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-104'/>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-73'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zpool_destroy' mangled-name='zpool_destroy' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_destroy'>
      <parameter type-id='type-id-11' name='zhp'/>
      <parameter type-id='type-id-84' name='log_str'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zpool_checkpoint' mangled-name='zpool_checkpoint' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_checkpoint'>
      <parameter type-id='type-id-11' name='zhp'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='lzc_pool_checkpoint' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-84'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zpool_discard_checkpoint' mangled-name='zpool_discard_checkpoint' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_discard_checkpoint'>
      <parameter type-id='type-id-11' name='zhp'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='lzc_pool_checkpoint_discard' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-84'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zpool_add' mangled-name='zpool_add' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_add'>
      <parameter type-id='type-id-11' name='zhp'/>
      <parameter type-id='type-id-15' name='nvroot'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zpool_export' mangled-name='zpool_export' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_export'>
      <parameter type-id='type-id-11' name='zhp'/>
      <parameter type-id='type-id-16' name='force'/>
      <parameter type-id='type-id-84' name='log_str'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zpool_standard_error_fmt' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-91'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-84'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zpool_export_force' mangled-name='zpool_export_force' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_export_force'>
      <parameter type-id='type-id-11' name='zhp'/>
      <parameter type-id='type-id-84' name='log_str'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zpool_explain_recover' mangled-name='zpool_explain_recover' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_explain_recover'>
      <parameter type-id='type-id-10' name='hdl'/>
      <parameter type-id='type-id-84' name='name'/>
      <parameter type-id='type-id-8' name='reason'/>
      <parameter type-id='type-id-15' name='config'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zpool_import' mangled-name='zpool_import' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_import'>
      <parameter type-id='type-id-10' name='hdl'/>
      <parameter type-id='type-id-15' name='config'/>
      <parameter type-id='type-id-84' name='newname'/>
      <parameter type-id='type-id-17' name='altroot'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zpool_import_props' mangled-name='zpool_import_props' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_import_props'>
      <parameter type-id='type-id-10' name='hdl'/>
      <parameter type-id='type-id-15' name='config'/>
      <parameter type-id='type-id-84' name='newname'/>
      <parameter type-id='type-id-15' name='props'/>
      <parameter type-id='type-id-8' name='flags'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <class-decl name='zpool_load_policy' size-in-bits='256' is-struct='yes' visibility='default' id='type-id-330'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='zlp_rewind' type-id='type-id-38' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='zlp_maxmeta' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='zlp_maxdata' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='zlp_txg' type-id='type-id-22' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-330' size-in-bits='64' id='type-id-331'/>
    <function-decl name='zpool_get_load_policy' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-104'/>
      <parameter type-id='type-id-331'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zpool_print_unsup_feat' mangled-name='zpool_print_unsup_feat' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_print_unsup_feat'>
      <parameter type-id='type-id-15' name='config'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_uint64' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-104'/>
      <parameter type-id='type-id-84'/>
      <return type-id='type-id-35'/>
    </function-decl>
    <function-decl name='zpool_vdev_name' mangled-name='zpool_vdev_name' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_vdev_name'>
      <parameter type-id='type-id-10' name='hdl'/>
      <parameter type-id='type-id-11' name='zhp'/>
      <parameter type-id='type-id-15' name='nv'/>
      <parameter type-id='type-id-8' name='name_flags'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <enum-decl name='pool_initialize_func' id='type-id-332'>
      <underlying-type type-id='type-id-49'/>
      <enumerator name='POOL_INITIALIZE_START' value='0'/>
      <enumerator name='POOL_INITIALIZE_CANCEL' value='1'/>
      <enumerator name='POOL_INITIALIZE_SUSPEND' value='2'/>
      <enumerator name='POOL_INITIALIZE_FUNCS' value='3'/>
    </enum-decl>
    <typedef-decl name='pool_initialize_func_t' type-id='type-id-332' id='type-id-333'/>
    <function-decl name='zpool_initialize' mangled-name='zpool_initialize' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_initialize'>
      <parameter type-id='type-id-11' name='zhp'/>
      <parameter type-id='type-id-333' name='cmd_type'/>
      <parameter type-id='type-id-15' name='vds'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='lzc_initialize' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-332'/>
      <parameter type-id='type-id-104'/>
      <parameter type-id='type-id-107'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='fnvpair_value_int64' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-133'/>
      <return type-id='type-id-54'/>
    </function-decl>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' id='type-id-334'>
      <underlying-type type-id='type-id-49'/>
      <enumerator name='ZPOOL_WAIT_CKPT_DISCARD' value='0'/>
      <enumerator name='ZPOOL_WAIT_FREE' value='1'/>
      <enumerator name='ZPOOL_WAIT_INITIALIZE' value='2'/>
      <enumerator name='ZPOOL_WAIT_REPLACE' value='3'/>
      <enumerator name='ZPOOL_WAIT_REMOVE' value='4'/>
      <enumerator name='ZPOOL_WAIT_RESILVER' value='5'/>
      <enumerator name='ZPOOL_WAIT_SCRUB' value='6'/>
      <enumerator name='ZPOOL_WAIT_TRIM' value='7'/>
      <enumerator name='ZPOOL_WAIT_NUM_ACTIVITIES' value='8'/>
    </enum-decl>
    <function-decl name='lzc_wait_tag' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-334'/>
      <parameter type-id='type-id-35'/>
      <parameter type-id='type-id-294'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zpool_initialize_wait' mangled-name='zpool_initialize_wait' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_initialize_wait'>
      <parameter type-id='type-id-11' name='zhp'/>
      <parameter type-id='type-id-333' name='cmd_type'/>
      <parameter type-id='type-id-15' name='vds'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <enum-decl name='pool_trim_func' id='type-id-335'>
      <underlying-type type-id='type-id-49'/>
      <enumerator name='POOL_TRIM_START' value='0'/>
      <enumerator name='POOL_TRIM_CANCEL' value='1'/>
      <enumerator name='POOL_TRIM_SUSPEND' value='2'/>
      <enumerator name='POOL_TRIM_FUNCS' value='3'/>
    </enum-decl>
    <typedef-decl name='pool_trim_func_t' type-id='type-id-335' id='type-id-336'/>
    <class-decl name='trimflags' size-in-bits='192' is-struct='yes' visibility='default' id='type-id-337'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fullpool' type-id='type-id-16' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='secure' type-id='type-id-16' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='wait' type-id='type-id-16' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='rate' type-id='type-id-22' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='trimflags_t' type-id='type-id-337' id='type-id-338'/>
    <pointer-type-def type-id='type-id-338' size-in-bits='64' id='type-id-339'/>
    <function-decl name='zpool_trim' mangled-name='zpool_trim' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_trim'>
      <parameter type-id='type-id-11' name='zhp'/>
      <parameter type-id='type-id-336' name='cmd_type'/>
      <parameter type-id='type-id-15' name='vds'/>
      <parameter type-id='type-id-339' name='trim_flags'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='lzc_trim' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-335'/>
      <parameter type-id='type-id-35'/>
      <parameter type-id='type-id-50'/>
      <parameter type-id='type-id-104'/>
      <parameter type-id='type-id-107'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='fnvlist_add_int64' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-104'/>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-54'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zpool_find_vdev' mangled-name='zpool_find_vdev' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_find_vdev'>
      <parameter type-id='type-id-11' name='zhp'/>
      <parameter type-id='type-id-84' name='path'/>
      <parameter type-id='type-id-106' name='avail_spare'/>
      <parameter type-id='type-id-106' name='l2cache'/>
      <parameter type-id='type-id-106' name='log'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <enum-decl name='pool_scan_func' id='type-id-340'>
      <underlying-type type-id='type-id-49'/>
      <enumerator name='POOL_SCAN_NONE' value='0'/>
      <enumerator name='POOL_SCAN_SCRUB' value='1'/>
      <enumerator name='POOL_SCAN_RESILVER' value='2'/>
      <enumerator name='POOL_SCAN_FUNCS' value='3'/>
    </enum-decl>
    <typedef-decl name='pool_scan_func_t' type-id='type-id-340' id='type-id-341'/>
    <enum-decl name='pool_scrub_cmd' id='type-id-342'>
      <underlying-type type-id='type-id-49'/>
      <enumerator name='POOL_SCRUB_NORMAL' value='0'/>
      <enumerator name='POOL_SCRUB_PAUSE' value='1'/>
      <enumerator name='POOL_SCRUB_FLAGS_END' value='2'/>
    </enum-decl>
    <typedef-decl name='pool_scrub_cmd_t' type-id='type-id-342' id='type-id-343'/>
    <function-decl name='zpool_scan' mangled-name='zpool_scan' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_scan'>
      <parameter type-id='type-id-11' name='zhp'/>
      <parameter type-id='type-id-341' name='func'/>
      <parameter type-id='type-id-343' name='cmd'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zpool_find_vdev_by_physpath' mangled-name='zpool_find_vdev_by_physpath' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_find_vdev_by_physpath'>
      <parameter type-id='type-id-11' name='zhp'/>
      <parameter type-id='type-id-84' name='ppath'/>
      <parameter type-id='type-id-106' name='avail_spare'/>
      <parameter type-id='type-id-106' name='l2cache'/>
      <parameter type-id='type-id-106' name='log'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='zfs_strcmp_pathname' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zpool_get_physpath' mangled-name='zpool_get_physpath' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_get_physpath'>
      <parameter type-id='type-id-11' name='zhp'/>
      <parameter type-id='type-id-17' name='physpath'/>
      <parameter type-id='type-id-28' name='phypath_size'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zpool_vdev_path_to_guid' mangled-name='zpool_vdev_path_to_guid' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_vdev_path_to_guid'>
      <parameter type-id='type-id-11' name='zhp'/>
      <parameter type-id='type-id-84' name='path'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <pointer-type-def type-id='type-id-322' size-in-bits='64' id='type-id-344'/>
    <function-decl name='zpool_vdev_online' mangled-name='zpool_vdev_online' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_vdev_online'>
      <parameter type-id='type-id-11' name='zhp'/>
      <parameter type-id='type-id-84' name='path'/>
      <parameter type-id='type-id-8' name='flags'/>
      <parameter type-id='type-id-344' name='newstate'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zfs_resolve_shortname' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-35'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zpool_relabel_disk' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-91'/>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-84'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zpool_vdev_offline' mangled-name='zpool_vdev_offline' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_vdev_offline'>
      <parameter type-id='type-id-11' name='zhp'/>
      <parameter type-id='type-id-84' name='path'/>
      <parameter type-id='type-id-16' name='istmp'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zpool_vdev_fault' mangled-name='zpool_vdev_fault' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_vdev_fault'>
      <parameter type-id='type-id-11' name='zhp'/>
      <parameter type-id='type-id-22' name='guid'/>
      <parameter type-id='type-id-324' name='aux'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zpool_vdev_degrade' mangled-name='zpool_vdev_degrade' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_vdev_degrade'>
      <parameter type-id='type-id-11' name='zhp'/>
      <parameter type-id='type-id-22' name='guid'/>
      <parameter type-id='type-id-324' name='aux'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zpool_vdev_attach' mangled-name='zpool_vdev_attach' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_vdev_attach'>
      <parameter type-id='type-id-11' name='zhp'/>
      <parameter type-id='type-id-84' name='old_disk'/>
      <parameter type-id='type-id-84' name='new_disk'/>
      <parameter type-id='type-id-15' name='nvroot'/>
      <parameter type-id='type-id-8' name='replacing'/>
      <parameter type-id='type-id-16' name='rebuild'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zfeature_lookup_guid' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-329'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='realpath' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-17'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='zfs_strip_path' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-17'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='zfs_strip_partition' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-17'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='zpool_vdev_detach' mangled-name='zpool_vdev_detach' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_vdev_detach'>
      <parameter type-id='type-id-11' name='zhp'/>
      <parameter type-id='type-id-84' name='path'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <class-decl name='splitflags' size-in-bits='64' is-struct='yes' visibility='default' id='type-id-345'>
      <data-member access='public' layout-offset-in-bits='31'>
        <var-decl name='dryrun' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='30'>
        <var-decl name='import' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='name_flags' type-id='type-id-8' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='splitflags_t' type-id='type-id-345' id='type-id-346'/>
    <function-decl name='zpool_vdev_split' mangled-name='zpool_vdev_split' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_vdev_split'>
      <parameter type-id='type-id-11' name='zhp'/>
      <parameter type-id='type-id-17' name='newname'/>
      <parameter type-id='type-id-105' name='newroot'/>
      <parameter type-id='type-id-15' name='props'/>
      <parameter type-id='type-id-346' name='flags'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='nvlist_add_nvlist_array' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-104'/>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-107'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zpool_vdev_remove' mangled-name='zpool_vdev_remove' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_vdev_remove'>
      <parameter type-id='type-id-11' name='zhp'/>
      <parameter type-id='type-id-84' name='path'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zpool_vdev_remove_cancel' mangled-name='zpool_vdev_remove_cancel' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_vdev_remove_cancel'>
      <parameter type-id='type-id-11' name='zhp'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zpool_vdev_indirect_size' mangled-name='zpool_vdev_indirect_size' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_vdev_indirect_size'>
      <parameter type-id='type-id-11' name='zhp'/>
      <parameter type-id='type-id-84' name='path'/>
      <parameter type-id='type-id-248' name='sizep'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zpool_clear' mangled-name='zpool_clear' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_clear'>
      <parameter type-id='type-id-11' name='zhp'/>
      <parameter type-id='type-id-84' name='path'/>
      <parameter type-id='type-id-15' name='rewindnvl'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zpool_vdev_clear' mangled-name='zpool_vdev_clear' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_vdev_clear'>
      <parameter type-id='type-id-11' name='zhp'/>
      <parameter type-id='type-id-22' name='guid'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zpool_reguid' mangled-name='zpool_reguid' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_reguid'>
      <parameter type-id='type-id-11' name='zhp'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zpool_reopen_one' mangled-name='zpool_reopen_one' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_reopen_one'>
      <parameter type-id='type-id-11' name='zhp'/>
      <parameter type-id='type-id-7' name='data'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zpool_get_handle' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-126'/>
      <return type-id='type-id-91'/>
    </function-decl>
    <function-decl name='lzc_reopen' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-50'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zpool_sync_one' mangled-name='zpool_sync_one' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_sync_one'>
      <parameter type-id='type-id-11' name='zhp'/>
      <parameter type-id='type-id-7' name='data'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='fnvlist_add_boolean_value' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-104'/>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-50'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='lzc_sync' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-104'/>
      <parameter type-id='type-id-107'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zpool_get_errlog' mangled-name='zpool_get_errlog' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_get_errlog'>
      <parameter type-id='type-id-11' name='zhp'/>
      <parameter type-id='type-id-105' name='nverrlistp'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zpool_upgrade' mangled-name='zpool_upgrade' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_upgrade'>
      <parameter type-id='type-id-11' name='zhp'/>
      <parameter type-id='type-id-22' name='new_version'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zfs_save_arguments' mangled-name='zfs_save_arguments' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_save_arguments'>
      <parameter type-id='type-id-8' name='argc'/>
      <parameter type-id='type-id-88' name='argv'/>
      <parameter type-id='type-id-17' name='string'/>
      <parameter type-id='type-id-8' name='len'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zpool_log_history' mangled-name='zpool_log_history' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_log_history'>
      <parameter type-id='type-id-10' name='hdl'/>
      <parameter type-id='type-id-84' name='message'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zpool_get_history' mangled-name='zpool_get_history' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_get_history'>
      <parameter type-id='type-id-11' name='zhp'/>
      <parameter type-id='type-id-105' name='nvhisp'/>
      <parameter type-id='type-id-248' name='off'/>
      <parameter type-id='type-id-106' name='eof'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zpool_history_unpack' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-35'/>
      <parameter type-id='type-id-102'/>
      <parameter type-id='type-id-267'/>
      <parameter type-id='type-id-244'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zpool_events_next' mangled-name='zpool_events_next' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_events_next'>
      <parameter type-id='type-id-10' name='hdl'/>
      <parameter type-id='type-id-105' name='nvp'/>
      <parameter type-id='type-id-223' name='dropped'/>
      <parameter type-id='type-id-5' name='flags'/>
      <parameter type-id='type-id-8' name='zevent_fd'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zpool_events_clear' mangled-name='zpool_events_clear' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_events_clear'>
      <parameter type-id='type-id-10' name='hdl'/>
      <parameter type-id='type-id-223' name='count'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zpool_events_seek' mangled-name='zpool_events_seek' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_events_seek'>
      <parameter type-id='type-id-10' name='hdl'/>
      <parameter type-id='type-id-22' name='eid'/>
      <parameter type-id='type-id-8' name='zevent_fd'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zpool_obj_to_path' mangled-name='zpool_obj_to_path' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_obj_to_path'>
      <parameter type-id='type-id-11' name='zhp'/>
      <parameter type-id='type-id-22' name='dsobj'/>
      <parameter type-id='type-id-22' name='obj'/>
      <parameter type-id='type-id-17' name='pathname'/>
      <parameter type-id='type-id-28' name='len'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zpool_obj_to_path_ds' mangled-name='zpool_obj_to_path_ds' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_obj_to_path_ds'>
      <parameter type-id='type-id-11' name='zhp'/>
      <parameter type-id='type-id-22' name='dsobj'/>
      <parameter type-id='type-id-22' name='obj'/>
      <parameter type-id='type-id-17' name='pathname'/>
      <parameter type-id='type-id-28' name='len'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <typedef-decl name='zpool_wait_activity_t' type-id='type-id-334' id='type-id-347'/>
    <function-decl name='zpool_wait' mangled-name='zpool_wait' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_wait'>
      <parameter type-id='type-id-11' name='zhp'/>
      <parameter type-id='type-id-347' name='activity'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='lzc_wait' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-334'/>
      <parameter type-id='type-id-294'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zpool_wait_status' mangled-name='zpool_wait_status' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_wait_status'>
      <parameter type-id='type-id-11' name='zhp'/>
      <parameter type-id='type-id-347' name='activity'/>
      <parameter type-id='type-id-106' name='missing'/>
      <parameter type-id='type-id-106' name='waited'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <qualified-type-def type-id='type-id-42' const='yes' id='type-id-348'/>
    <pointer-type-def type-id='type-id-348' size-in-bits='64' id='type-id-349'/>
    <function-decl name='zpool_set_bootenv' mangled-name='zpool_set_bootenv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_set_bootenv'>
      <parameter type-id='type-id-11' name='zhp'/>
      <parameter type-id='type-id-349' name='envmap'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <qualified-type-def type-id='type-id-36' const='yes' id='type-id-350'/>
    <pointer-type-def type-id='type-id-350' size-in-bits='64' id='type-id-351'/>
    <function-decl name='lzc_set_bootenv' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-351'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zpool_get_bootenv' mangled-name='zpool_get_bootenv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_get_bootenv'>
      <parameter type-id='type-id-11' name='zhp'/>
      <parameter type-id='type-id-105' name='nvlp'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='lzc_get_bootenv' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-107'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='strtok_r' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-88'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='mmap' mangled-name='mmap64' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-35'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-54'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='strchrnul' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='munmap' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-35'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zfs_name_valid' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-76'/>
      <return type-id='type-id-8'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='libzfs_sendrecv.c' comp-dir-path='/home/nabijaczleweli/store/code/zfs/lib/libzfs' language='LANG_C99'>
    <class-decl name='sendflags' size-in-bits='544' is-struct='yes' visibility='default' id='type-id-352'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='verbosity' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='replicate' type-id='type-id-16' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='skipmissing' type-id='type-id-16' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='doall' type-id='type-id-16' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='fromorigin' type-id='type-id-16' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='pad' type-id='type-id-16' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='props' type-id='type-id-16' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='dryrun' type-id='type-id-16' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='parsable' type-id='type-id-16' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='progress' type-id='type-id-16' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='largeblock' type-id='type-id-16' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='embed_data' type-id='type-id-16' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='compress' type-id='type-id-16' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='raw' type-id='type-id-16' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='backup' type-id='type-id-16' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='holds' type-id='type-id-16' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='saved' type-id='type-id-16' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='sendflags_t' type-id='type-id-352' id='type-id-353'/>
    <pointer-type-def type-id='type-id-353' size-in-bits='64' id='type-id-354'/>
    <typedef-decl name='snapfilter_cb_t' type-id='type-id-355' id='type-id-356'/>
    <pointer-type-def type-id='type-id-356' size-in-bits='64' id='type-id-357'/>
    <function-decl name='zfs_send' mangled-name='zfs_send' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_send'>
      <parameter type-id='type-id-135' name='zhp'/>
      <parameter type-id='type-id-84' name='fromsnap'/>
      <parameter type-id='type-id-84' name='tosnap'/>
      <parameter type-id='type-id-354' name='flags'/>
      <parameter type-id='type-id-8' name='outfd'/>
      <parameter type-id='type-id-357' name='filter_func'/>
      <parameter type-id='type-id-7' name='cb_arg'/>
      <parameter type-id='type-id-105' name='debugnvp'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zfs_send_progress' mangled-name='zfs_send_progress' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_send_progress'>
      <parameter type-id='type-id-135' name='zhp'/>
      <parameter type-id='type-id-8' name='fd'/>
      <parameter type-id='type-id-248' name='bytes_written'/>
      <parameter type-id='type-id-248' name='blocks_visited'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zfs_send_resume_token_to_nvlist' mangled-name='zfs_send_resume_token_to_nvlist' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_send_resume_token_to_nvlist'>
      <parameter type-id='type-id-10' name='hdl'/>
      <parameter type-id='type-id-84' name='token'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <class-decl name='zio_cksum' size-in-bits='256' is-struct='yes' visibility='default' id='type-id-358'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='zc_word' type-id='type-id-359' visibility='default'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-22' size-in-bits='256' id='type-id-359'>
      <subrange length='4' type-id='type-id-33' id='type-id-217'/>

    </array-type-def>
    <pointer-type-def type-id='type-id-358' size-in-bits='64' id='type-id-360'/>
    <function-decl name='fletcher_4_native_varsize' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-35'/>
      <parameter type-id='type-id-360'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='uncompress' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-73'/>
      <parameter type-id='type-id-102'/>
      <parameter type-id='type-id-165'/>
      <parameter type-id='type-id-35'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zfs_send_resume' mangled-name='zfs_send_resume' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_send_resume'>
      <parameter type-id='type-id-10' name='hdl'/>
      <parameter type-id='type-id-354' name='flags'/>
      <parameter type-id='type-id-8' name='outfd'/>
      <parameter type-id='type-id-84' name='resume_token'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='nvlist_print' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-150'/>
      <parameter type-id='type-id-104'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <enum-decl name='lzc_send_flags' id='type-id-361'>
      <underlying-type type-id='type-id-49'/>
      <enumerator name='LZC_SEND_FLAG_EMBED_DATA' value='1'/>
      <enumerator name='LZC_SEND_FLAG_LARGE_BLOCK' value='2'/>
      <enumerator name='LZC_SEND_FLAG_COMPRESS' value='4'/>
      <enumerator name='LZC_SEND_FLAG_RAW' value='8'/>
      <enumerator name='LZC_SEND_FLAG_SAVED' value='16'/>
    </enum-decl>
    <function-decl name='lzc_send_resume_redacted' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-361'/>
      <parameter type-id='type-id-35'/>
      <parameter type-id='type-id-35'/>
      <parameter type-id='type-id-84'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zfs_send_saved' mangled-name='zfs_send_saved' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_send_saved'>
      <parameter type-id='type-id-135' name='zhp'/>
      <parameter type-id='type-id-354' name='flags'/>
      <parameter type-id='type-id-8' name='outfd'/>
      <parameter type-id='type-id-84' name='resume_token'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zfs_get_pool_handle' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-97'/>
      <return type-id='type-id-126'/>
    </function-decl>
    <function-decl name='zfs_hold_nvl' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-82'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-104'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='fletcher_4_incremental_native' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-35'/>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='write' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-35'/>
      <return type-id='type-id-54'/>
    </function-decl>
    <function-decl name='fnvlist_size' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-104'/>
      <return type-id='type-id-35'/>
    </function-decl>
    <function-decl name='nvlist_lookup_boolean' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-104'/>
      <parameter type-id='type-id-84'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zfs_send_one' mangled-name='zfs_send_one' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_send_one'>
      <parameter type-id='type-id-135' name='zhp'/>
      <parameter type-id='type-id-84' name='from'/>
      <parameter type-id='type-id-8' name='fd'/>
      <parameter type-id='type-id-354' name='flags'/>
      <parameter type-id='type-id-84' name='redactbook'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='lzc_send_redacted' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-361'/>
      <parameter type-id='type-id-84'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='lzc_send_space_resume_redacted' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-361'/>
      <parameter type-id='type-id-35'/>
      <parameter type-id='type-id-35'/>
      <parameter type-id='type-id-35'/>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-102'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='sleep' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='time' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-242'/>
      <return type-id='type-id-54'/>
    </function-decl>
    <function-decl name='localtime' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-238'/>
      <return type-id='type-id-236'/>
    </function-decl>
    <class-decl name='recvflags' size-in-bits='416' is-struct='yes' visibility='default' id='type-id-362'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='verbose' type-id='type-id-16' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='isprefix' type-id='type-id-16' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='istail' type-id='type-id-16' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='dryrun' type-id='type-id-16' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='force' type-id='type-id-16' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='canmountoff' type-id='type-id-16' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='resumable' type-id='type-id-16' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='byteswap' type-id='type-id-16' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='nomount' type-id='type-id-16' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='holds' type-id='type-id-16' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='skipholds' type-id='type-id-16' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='domount' type-id='type-id-16' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='forceunmount' type-id='type-id-16' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='recvflags_t' type-id='type-id-362' id='type-id-363'/>
    <pointer-type-def type-id='type-id-363' size-in-bits='64' id='type-id-364'/>
    <pointer-type-def type-id='type-id-25' size-in-bits='64' id='type-id-365'/>
    <function-decl name='zfs_receive' mangled-name='zfs_receive' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_receive'>
      <parameter type-id='type-id-10' name='hdl'/>
      <parameter type-id='type-id-84' name='tosnap'/>
      <parameter type-id='type-id-15' name='props'/>
      <parameter type-id='type-id-364' name='flags'/>
      <parameter type-id='type-id-8' name='infd'/>
      <parameter type-id='type-id-365' name='stream_avl'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='libzfs_set_pipe_max' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='perror' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-84'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='fletcher_4_incremental_byteswap' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-35'/>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_uint64_array' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-104'/>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-244'/>
      <return type-id='type-id-102'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_boolean_value' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-104'/>
      <parameter type-id='type-id-84'/>
      <return type-id='type-id-50'/>
    </function-decl>
    <function-decl name='zfs_iter_snapshots_sorted' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-82'/>
      <parameter type-id='type-id-95'/>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-35'/>
      <parameter type-id='type-id-35'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zfs_get_recvd_props' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-82'/>
      <return type-id='type-id-104'/>
    </function-decl>
    <function-decl name='lzc_send_space' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-361'/>
      <parameter type-id='type-id-102'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='fnvlist_merge' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-104'/>
      <parameter type-id='type-id-104'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <class-decl name='dmu_replay_record' size-in-bits='2496' is-struct='yes' visibility='default' id='type-id-366'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='drr_type' type-id='type-id-367' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='drr_payloadlen' type-id='type-id-38' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='drr_u' type-id='type-id-368' visibility='default'/>
      </data-member>
    </class-decl>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' id='type-id-367'>
      <underlying-type type-id='type-id-49'/>
      <enumerator name='DRR_BEGIN' value='0'/>
      <enumerator name='DRR_OBJECT' value='1'/>
      <enumerator name='DRR_FREEOBJECTS' value='2'/>
      <enumerator name='DRR_WRITE' value='3'/>
      <enumerator name='DRR_FREE' value='4'/>
      <enumerator name='DRR_END' value='5'/>
      <enumerator name='DRR_WRITE_BYREF' value='6'/>
      <enumerator name='DRR_SPILL' value='7'/>
      <enumerator name='DRR_WRITE_EMBEDDED' value='8'/>
      <enumerator name='DRR_OBJECT_RANGE' value='9'/>
      <enumerator name='DRR_REDACT' value='10'/>
      <enumerator name='DRR_NUMTYPES' value='11'/>
    </enum-decl>
    <union-decl name='__anonymous_union__' size-in-bits='2432' is-anonymous='yes' visibility='default' id='type-id-368'>
      <data-member access='private'>
        <var-decl name='drr_begin' type-id='type-id-112' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='drr_end' type-id='type-id-369' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='drr_object' type-id='type-id-370' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='drr_freeobjects' type-id='type-id-371' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='drr_write' type-id='type-id-372' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='drr_free' type-id='type-id-373' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='drr_write_byref' type-id='type-id-374' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='drr_spill' type-id='type-id-375' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='drr_write_embedded' type-id='type-id-376' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='drr_object_range' type-id='type-id-377' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='drr_redact' type-id='type-id-378' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='drr_checksum' type-id='type-id-379' visibility='default'/>
      </data-member>
    </union-decl>
    <class-decl name='drr_end' size-in-bits='320' is-struct='yes' visibility='default' id='type-id-369'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='drr_checksum' type-id='type-id-380' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='drr_toguid' type-id='type-id-22' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='zio_cksum_t' type-id='type-id-358' id='type-id-380'/>
    <class-decl name='drr_object' size-in-bits='448' is-struct='yes' visibility='default' id='type-id-370'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='drr_object' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='drr_type' type-id='type-id-381' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='drr_bonustype' type-id='type-id-381' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='drr_blksz' type-id='type-id-38' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='drr_bonuslen' type-id='type-id-38' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='drr_checksumtype' type-id='type-id-79' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='200'>
        <var-decl name='drr_compress' type-id='type-id-79' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='208'>
        <var-decl name='drr_dn_slots' type-id='type-id-79' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='216'>
        <var-decl name='drr_flags' type-id='type-id-79' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='drr_raw_bonuslen' type-id='type-id-38' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='drr_toguid' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='drr_indblkshift' type-id='type-id-79' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='328'>
        <var-decl name='drr_nlevels' type-id='type-id-79' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='336'>
        <var-decl name='drr_nblkptr' type-id='type-id-79' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='344'>
        <var-decl name='drr_pad' type-id='type-id-382' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='drr_maxblkid' type-id='type-id-22' visibility='default'/>
      </data-member>
    </class-decl>
    <enum-decl name='dmu_object_type' id='type-id-383'>
      <underlying-type type-id='type-id-49'/>
      <enumerator name='DMU_OT_NONE' value='0'/>
      <enumerator name='DMU_OT_OBJECT_DIRECTORY' value='1'/>
      <enumerator name='DMU_OT_OBJECT_ARRAY' value='2'/>
      <enumerator name='DMU_OT_PACKED_NVLIST' value='3'/>
      <enumerator name='DMU_OT_PACKED_NVLIST_SIZE' value='4'/>
      <enumerator name='DMU_OT_BPOBJ' value='5'/>
      <enumerator name='DMU_OT_BPOBJ_HDR' value='6'/>
      <enumerator name='DMU_OT_SPACE_MAP_HEADER' value='7'/>
      <enumerator name='DMU_OT_SPACE_MAP' value='8'/>
      <enumerator name='DMU_OT_INTENT_LOG' value='9'/>
      <enumerator name='DMU_OT_DNODE' value='10'/>
      <enumerator name='DMU_OT_OBJSET' value='11'/>
      <enumerator name='DMU_OT_DSL_DIR' value='12'/>
      <enumerator name='DMU_OT_DSL_DIR_CHILD_MAP' value='13'/>
      <enumerator name='DMU_OT_DSL_DS_SNAP_MAP' value='14'/>
      <enumerator name='DMU_OT_DSL_PROPS' value='15'/>
      <enumerator name='DMU_OT_DSL_DATASET' value='16'/>
      <enumerator name='DMU_OT_ZNODE' value='17'/>
      <enumerator name='DMU_OT_OLDACL' value='18'/>
      <enumerator name='DMU_OT_PLAIN_FILE_CONTENTS' value='19'/>
      <enumerator name='DMU_OT_DIRECTORY_CONTENTS' value='20'/>
      <enumerator name='DMU_OT_MASTER_NODE' value='21'/>
      <enumerator name='DMU_OT_UNLINKED_SET' value='22'/>
      <enumerator name='DMU_OT_ZVOL' value='23'/>
      <enumerator name='DMU_OT_ZVOL_PROP' value='24'/>
      <enumerator name='DMU_OT_PLAIN_OTHER' value='25'/>
      <enumerator name='DMU_OT_UINT64_OTHER' value='26'/>
      <enumerator name='DMU_OT_ZAP_OTHER' value='27'/>
      <enumerator name='DMU_OT_ERROR_LOG' value='28'/>
      <enumerator name='DMU_OT_SPA_HISTORY' value='29'/>
      <enumerator name='DMU_OT_SPA_HISTORY_OFFSETS' value='30'/>
      <enumerator name='DMU_OT_POOL_PROPS' value='31'/>
      <enumerator name='DMU_OT_DSL_PERMS' value='32'/>
      <enumerator name='DMU_OT_ACL' value='33'/>
      <enumerator name='DMU_OT_SYSACL' value='34'/>
      <enumerator name='DMU_OT_FUID' value='35'/>
      <enumerator name='DMU_OT_FUID_SIZE' value='36'/>
      <enumerator name='DMU_OT_NEXT_CLONES' value='37'/>
      <enumerator name='DMU_OT_SCAN_QUEUE' value='38'/>
      <enumerator name='DMU_OT_USERGROUP_USED' value='39'/>
      <enumerator name='DMU_OT_USERGROUP_QUOTA' value='40'/>
      <enumerator name='DMU_OT_USERREFS' value='41'/>
      <enumerator name='DMU_OT_DDT_ZAP' value='42'/>
      <enumerator name='DMU_OT_DDT_STATS' value='43'/>
      <enumerator name='DMU_OT_SA' value='44'/>
      <enumerator name='DMU_OT_SA_MASTER_NODE' value='45'/>
      <enumerator name='DMU_OT_SA_ATTR_REGISTRATION' value='46'/>
      <enumerator name='DMU_OT_SA_ATTR_LAYOUTS' value='47'/>
      <enumerator name='DMU_OT_SCAN_XLATE' value='48'/>
      <enumerator name='DMU_OT_DEDUP' value='49'/>
      <enumerator name='DMU_OT_DEADLIST' value='50'/>
      <enumerator name='DMU_OT_DEADLIST_HDR' value='51'/>
      <enumerator name='DMU_OT_DSL_CLONES' value='52'/>
      <enumerator name='DMU_OT_BPOBJ_SUBOBJ' value='53'/>
      <enumerator name='DMU_OT_NUMTYPES' value='54'/>
      <enumerator name='DMU_OTN_UINT8_DATA' value='128'/>
      <enumerator name='DMU_OTN_UINT8_METADATA' value='192'/>
      <enumerator name='DMU_OTN_UINT16_DATA' value='129'/>
      <enumerator name='DMU_OTN_UINT16_METADATA' value='193'/>
      <enumerator name='DMU_OTN_UINT32_DATA' value='130'/>
      <enumerator name='DMU_OTN_UINT32_METADATA' value='194'/>
      <enumerator name='DMU_OTN_UINT64_DATA' value='131'/>
      <enumerator name='DMU_OTN_UINT64_METADATA' value='195'/>
      <enumerator name='DMU_OTN_ZAP_DATA' value='132'/>
      <enumerator name='DMU_OTN_ZAP_METADATA' value='196'/>
      <enumerator name='DMU_OTN_UINT8_ENC_DATA' value='160'/>
      <enumerator name='DMU_OTN_UINT8_ENC_METADATA' value='224'/>
      <enumerator name='DMU_OTN_UINT16_ENC_DATA' value='161'/>
      <enumerator name='DMU_OTN_UINT16_ENC_METADATA' value='225'/>
      <enumerator name='DMU_OTN_UINT32_ENC_DATA' value='162'/>
      <enumerator name='DMU_OTN_UINT32_ENC_METADATA' value='226'/>
      <enumerator name='DMU_OTN_UINT64_ENC_DATA' value='163'/>
      <enumerator name='DMU_OTN_UINT64_ENC_METADATA' value='227'/>
      <enumerator name='DMU_OTN_ZAP_ENC_DATA' value='164'/>
      <enumerator name='DMU_OTN_ZAP_ENC_METADATA' value='228'/>
    </enum-decl>
    <typedef-decl name='dmu_object_type_t' type-id='type-id-383' id='type-id-381'/>

    <array-type-def dimensions='1' type-id='type-id-79' size-in-bits='40' id='type-id-382'>
      <subrange length='5' type-id='type-id-33' id='type-id-384'/>

    </array-type-def>
    <class-decl name='drr_freeobjects' size-in-bits='192' is-struct='yes' visibility='default' id='type-id-371'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='drr_firstobj' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='drr_numobjs' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='drr_toguid' type-id='type-id-22' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='drr_write' size-in-bits='1088' is-struct='yes' visibility='default' id='type-id-372'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='drr_object' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='drr_type' type-id='type-id-381' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='drr_pad' type-id='type-id-38' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='drr_offset' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='drr_logical_size' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='drr_toguid' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='drr_checksumtype' type-id='type-id-79' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='328'>
        <var-decl name='drr_flags' type-id='type-id-79' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='336'>
        <var-decl name='drr_compressiontype' type-id='type-id-79' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='344'>
        <var-decl name='drr_pad2' type-id='type-id-382' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='drr_key' type-id='type-id-385' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='drr_compressed_size' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='drr_salt' type-id='type-id-386' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='drr_iv' type-id='type-id-387' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='drr_mac' type-id='type-id-388' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='ddt_key' size-in-bits='320' is-struct='yes' visibility='default' id='type-id-389'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ddk_cksum' type-id='type-id-380' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='ddk_prop' type-id='type-id-22' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='ddt_key_t' type-id='type-id-389' id='type-id-385'/>

    <array-type-def dimensions='1' type-id='type-id-79' size-in-bits='64' id='type-id-386'>
      <subrange length='8' type-id='type-id-33' id='type-id-390'/>

    </array-type-def>

    <array-type-def dimensions='1' type-id='type-id-79' size-in-bits='96' id='type-id-387'>
      <subrange length='12' type-id='type-id-33' id='type-id-391'/>

    </array-type-def>

    <array-type-def dimensions='1' type-id='type-id-79' size-in-bits='128' id='type-id-388'>
      <subrange length='16' type-id='type-id-33' id='type-id-169'/>

    </array-type-def>
    <class-decl name='drr_free' size-in-bits='256' is-struct='yes' visibility='default' id='type-id-373'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='drr_object' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='drr_offset' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='drr_length' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='drr_toguid' type-id='type-id-22' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='drr_write_byref' size-in-bits='832' is-struct='yes' visibility='default' id='type-id-374'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='drr_object' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='drr_offset' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='drr_length' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='drr_toguid' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='drr_refguid' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='drr_refobject' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='drr_refoffset' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='drr_checksumtype' type-id='type-id-79' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='456'>
        <var-decl name='drr_flags' type-id='type-id-79' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='464'>
        <var-decl name='drr_pad2' type-id='type-id-392' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='drr_key' type-id='type-id-385' visibility='default'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-79' size-in-bits='48' id='type-id-392'>
      <subrange length='6' type-id='type-id-33' id='type-id-393'/>

    </array-type-def>
    <class-decl name='drr_spill' size-in-bits='640' is-struct='yes' visibility='default' id='type-id-375'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='drr_object' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='drr_length' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='drr_toguid' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='drr_flags' type-id='type-id-79' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='200'>
        <var-decl name='drr_compressiontype' type-id='type-id-79' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='208'>
        <var-decl name='drr_pad' type-id='type-id-392' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='drr_compressed_size' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='drr_salt' type-id='type-id-386' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='drr_iv' type-id='type-id-387' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
