<abi-corpus path='libzfs.so' architecture='elf-amd-x86_64' soname='libzfs.so.4'>
  <elf-needed>
    <dependency name='libzfs_core.so.3'/>
    <dependency name='libnvpair.so.3'/>
    <dependency name='libuutil.so.3'/>
    <dependency name='libm.so.6'/>
    <dependency name='libcrypto.so.1.1'/>
    <dependency name='libz.so.1'/>
    <dependency name='libpthread.so.0'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='SHA256Init' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='SHA2Final' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='SHA2Init' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='SHA2Update' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='SHA384Init' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='SHA512Init' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='bookmark_namecheck' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='changelist_free' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='zprop_expand_list' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zprop_free_list' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zprop_get_list' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zprop_index_to_string' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zprop_iter' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zprop_iter_common' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zprop_name_to_prop' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zprop_parse_value' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zprop_print_one_property' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zprop_random_value' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zprop_register_hidden' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zprop_register_impl' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zprop_register_index' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zprop_register_number' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zprop_register_string' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zprop_string_to_index' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zprop_valid_for_type' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zprop_values' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zprop_width' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zvol_volsize_to_reservation' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <elf-variable-symbols>
    <elf-symbol name='fletcher_4_abd_ops' size='24' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fletcher_4_avx2_ops' size='64' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fletcher_4_avx512bw_ops' size='64' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fletcher_4_avx512f_ops' size='64' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fletcher_4_sse2_ops' size='64' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fletcher_4_ssse3_ops' size='64' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fletcher_4_superscalar4_ops' size='64' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fletcher_4_superscalar_ops' size='64' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='libzfs_config_ops' size='16' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nfs_only' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='proto_table' size='48' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='share_all_proto' size='12' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='smb_only' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='smb_shares' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spa_feature_table' size='1904' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zfeature_checks_disable' size='4' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zfs_deleg_perm_tab' size='512' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zfs_history_event_names' size='328' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zfs_max_dataset_nesting' size='4' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zfs_userquota_prop_prefixes' size='96' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-variable-symbols>
  <abi-instr version='1.0' address-size='64' path='libzfs_changelist.c' comp-dir-path='/home/colm/src/zfs/zfs/lib/libzfs' language='LANG_C99'>
    <class-decl name='prop_changelist' size-in-bits='448' is-struct='yes' visibility='default' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_changelist.c' line='75' column='1' id='type-id-1'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cl_prop' type-id='type-id-2' visibility='default' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_changelist.c' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='cl_realprop' type-id='type-id-2' visibility='default' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_changelist.c' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='cl_shareprop' type-id='type-id-2' visibility='default' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_changelist.c' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='cl_pool' type-id='type-id-3' visibility='default' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_changelist.c' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='cl_tree' type-id='type-id-4' visibility='default' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_changelist.c' line='80' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='cl_waslegacy' type-id='type-id-5' visibility='default' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_changelist.c' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='cl_allchildren' type-id='type-id-5' visibility='default' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_changelist.c' line='82' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='cl_alldependents' type-id='type-id-5' visibility='default' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_changelist.c' line='83' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='cl_mflags' type-id='type-id-6' visibility='default' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_changelist.c' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='cl_gflags' type-id='type-id-6' visibility='default' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_changelist.c' line='85' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='cl_haszonedchild' type-id='type-id-5' visibility='default' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_changelist.c' line='86' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='unnamed-enum-underlying-type' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='type-id-7'/>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' filepath='../../include/sys/fs/zfs.h' line='91' column='1' id='type-id-8'>
      <underlying-type type-id='type-id-7'/>
      <enumerator name='ZPROP_CONT' value='-2'/>
      <enumerator name='ZPROP_INVAL' value='-1'/>
      <enumerator name='ZFS_PROP_TYPE' value='0'/>
      <enumerator name='ZFS_PROP_CREATION' value='1'/>
      <enumerator name='ZFS_PROP_USED' value='2'/>
      <enumerator name='ZFS_PROP_AVAILABLE' value='3'/>
      <enumerator name='ZFS_PROP_REFERENCED' value='4'/>
      <enumerator name='ZFS_PROP_COMPRESSRATIO' value='5'/>
      <enumerator name='ZFS_PROP_MOUNTED' value='6'/>
      <enumerator name='ZFS_PROP_ORIGIN' value='7'/>
      <enumerator name='ZFS_PROP_QUOTA' value='8'/>
      <enumerator name='ZFS_PROP_RESERVATION' value='9'/>
      <enumerator name='ZFS_PROP_VOLSIZE' value='10'/>
      <enumerator name='ZFS_PROP_VOLBLOCKSIZE' value='11'/>
      <enumerator name='ZFS_PROP_RECORDSIZE' value='12'/>
      <enumerator name='ZFS_PROP_MOUNTPOINT' value='13'/>
      <enumerator name='ZFS_PROP_SHARENFS' value='14'/>
      <enumerator name='ZFS_PROP_CHECKSUM' value='15'/>
      <enumerator name='ZFS_PROP_COMPRESSION' value='16'/>
      <enumerator name='ZFS_PROP_ATIME' value='17'/>
      <enumerator name='ZFS_PROP_DEVICES' value='18'/>
      <enumerator name='ZFS_PROP_EXEC' value='19'/>
      <enumerator name='ZFS_PROP_SETUID' value='20'/>
      <enumerator name='ZFS_PROP_READONLY' value='21'/>
      <enumerator name='ZFS_PROP_ZONED' value='22'/>
      <enumerator name='ZFS_PROP_SNAPDIR' value='23'/>
      <enumerator name='ZFS_PROP_ACLMODE' value='24'/>
      <enumerator name='ZFS_PROP_ACLINHERIT' value='25'/>
      <enumerator name='ZFS_PROP_CREATETXG' value='26'/>
      <enumerator name='ZFS_PROP_NAME' value='27'/>
      <enumerator name='ZFS_PROP_CANMOUNT' value='28'/>
      <enumerator name='ZFS_PROP_ISCSIOPTIONS' value='29'/>
      <enumerator name='ZFS_PROP_XATTR' value='30'/>
      <enumerator name='ZFS_PROP_NUMCLONES' value='31'/>
      <enumerator name='ZFS_PROP_COPIES' value='32'/>
      <enumerator name='ZFS_PROP_VERSION' value='33'/>
      <enumerator name='ZFS_PROP_UTF8ONLY' value='34'/>
      <enumerator name='ZFS_PROP_NORMALIZE' value='35'/>
      <enumerator name='ZFS_PROP_CASE' value='36'/>
      <enumerator name='ZFS_PROP_VSCAN' value='37'/>
      <enumerator name='ZFS_PROP_NBMAND' value='38'/>
      <enumerator name='ZFS_PROP_SHARESMB' value='39'/>
      <enumerator name='ZFS_PROP_REFQUOTA' value='40'/>
      <enumerator name='ZFS_PROP_REFRESERVATION' value='41'/>
      <enumerator name='ZFS_PROP_GUID' value='42'/>
      <enumerator name='ZFS_PROP_PRIMARYCACHE' value='43'/>
      <enumerator name='ZFS_PROP_SECONDARYCACHE' value='44'/>
      <enumerator name='ZFS_PROP_USEDSNAP' value='45'/>
      <enumerator name='ZFS_PROP_USEDDS' value='46'/>
      <enumerator name='ZFS_PROP_USEDCHILD' value='47'/>
      <enumerator name='ZFS_PROP_USEDREFRESERV' value='48'/>
      <enumerator name='ZFS_PROP_USERACCOUNTING' value='49'/>
      <enumerator name='ZFS_PROP_STMF_SHAREINFO' value='50'/>
      <enumerator name='ZFS_PROP_DEFER_DESTROY' value='51'/>
      <enumerator name='ZFS_PROP_USERREFS' value='52'/>
      <enumerator name='ZFS_PROP_LOGBIAS' value='53'/>
      <enumerator name='ZFS_PROP_UNIQUE' value='54'/>
      <enumerator name='ZFS_PROP_OBJSETID' value='55'/>
      <enumerator name='ZFS_PROP_DEDUP' value='56'/>
      <enumerator name='ZFS_PROP_MLSLABEL' value='57'/>
      <enumerator name='ZFS_PROP_SYNC' value='58'/>
      <enumerator name='ZFS_PROP_DNODESIZE' value='59'/>
      <enumerator name='ZFS_PROP_REFRATIO' value='60'/>
      <enumerator name='ZFS_PROP_WRITTEN' value='61'/>
      <enumerator name='ZFS_PROP_CLONES' value='62'/>
      <enumerator name='ZFS_PROP_LOGICALUSED' value='63'/>
      <enumerator name='ZFS_PROP_LOGICALREFERENCED' value='64'/>
      <enumerator name='ZFS_PROP_INCONSISTENT' value='65'/>
      <enumerator name='ZFS_PROP_VOLMODE' value='66'/>
      <enumerator name='ZFS_PROP_FILESYSTEM_LIMIT' value='67'/>
      <enumerator name='ZFS_PROP_SNAPSHOT_LIMIT' value='68'/>
      <enumerator name='ZFS_PROP_FILESYSTEM_COUNT' value='69'/>
      <enumerator name='ZFS_PROP_SNAPSHOT_COUNT' value='70'/>
      <enumerator name='ZFS_PROP_SNAPDEV' value='71'/>
      <enumerator name='ZFS_PROP_ACLTYPE' value='72'/>
      <enumerator name='ZFS_PROP_SELINUX_CONTEXT' value='73'/>
      <enumerator name='ZFS_PROP_SELINUX_FSCONTEXT' value='74'/>
      <enumerator name='ZFS_PROP_SELINUX_DEFCONTEXT' value='75'/>
      <enumerator name='ZFS_PROP_SELINUX_ROOTCONTEXT' value='76'/>
      <enumerator name='ZFS_PROP_RELATIME' value='77'/>
      <enumerator name='ZFS_PROP_REDUNDANT_METADATA' value='78'/>
      <enumerator name='ZFS_PROP_OVERLAY' value='79'/>
      <enumerator name='ZFS_PROP_PREV_SNAP' value='80'/>
      <enumerator name='ZFS_PROP_RECEIVE_RESUME_TOKEN' value='81'/>
      <enumerator name='ZFS_PROP_ENCRYPTION' value='82'/>
      <enumerator name='ZFS_PROP_KEYLOCATION' value='83'/>
      <enumerator name='ZFS_PROP_KEYFORMAT' value='84'/>
      <enumerator name='ZFS_PROP_PBKDF2_SALT' value='85'/>
      <enumerator name='ZFS_PROP_PBKDF2_ITERS' value='86'/>
      <enumerator name='ZFS_PROP_ENCRYPTION_ROOT' value='87'/>
      <enumerator name='ZFS_PROP_KEY_GUID' value='88'/>
      <enumerator name='ZFS_PROP_KEYSTATUS' value='89'/>
      <enumerator name='ZFS_PROP_REMAPTXG' value='90'/>
      <enumerator name='ZFS_PROP_SPECIAL_SMALL_BLOCKS' value='91'/>
      <enumerator name='ZFS_PROP_IVSET_GUID' value='92'/>
      <enumerator name='ZFS_PROP_REDACTED' value='93'/>
      <enumerator name='ZFS_PROP_REDACT_SNAPS' value='94'/>
      <enumerator name='ZFS_NUM_PROPS' value='95'/>
    </enum-decl>
    <typedef-decl name='zfs_prop_t' type-id='type-id-8' filepath='../../include/sys/fs/zfs.h' line='190' column='1' id='type-id-2'/>
    <class-decl name='uu_avl_pool' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-9'/>
    <typedef-decl name='uu_avl_pool_t' type-id='type-id-9' filepath='../../include/libuutil.h' line='287' column='1' id='type-id-10'/>
    <pointer-type-def type-id='type-id-10' size-in-bits='64' id='type-id-3'/>
    <class-decl name='uu_avl' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-11'/>
    <typedef-decl name='uu_avl_t' type-id='type-id-11' filepath='../../include/libuutil.h' line='288' column='1' id='type-id-12'/>
    <pointer-type-def type-id='type-id-12' size-in-bits='64' id='type-id-4'/>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' filepath='../../lib/libspl/include/sys/stdtypes.h' line='26' column='1' id='type-id-13'>
      <underlying-type type-id='type-id-7'/>
      <enumerator name='B_FALSE' value='0'/>
      <enumerator name='B_TRUE' value='1'/>
    </enum-decl>
    <typedef-decl name='boolean_t' type-id='type-id-13' filepath='../../lib/libspl/include/sys/stdtypes.h' line='29' column='1' id='type-id-5'/>
    <type-decl name='int' size-in-bits='32' id='type-id-6'/>
    <typedef-decl name='prop_changelist_t' type-id='type-id-1' filepath='../../include/libzfs_impl.h' line='174' column='1' id='type-id-14'/>
    <pointer-type-def type-id='type-id-14' size-in-bits='64' id='type-id-15'/>
    <class-decl name='zfs_handle' size-in-bits='4928' is-struct='yes' visibility='default' filepath='../../include/libzfs_impl.h' line='77' column='1' id='type-id-16'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='zfs_hdl' type-id='type-id-17' visibility='default' filepath='../../include/libzfs_impl.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='zpool_hdl' type-id='type-id-18' visibility='default' filepath='../../include/libzfs_impl.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='zfs_name' type-id='type-id-19' visibility='default' filepath='../../include/libzfs_impl.h' line='80' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='zfs_type' type-id='type-id-20' visibility='default' filepath='../../include/libzfs_impl.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2208'>
        <var-decl name='zfs_head_type' type-id='type-id-20' visibility='default' filepath='../../include/libzfs_impl.h' line='82' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <var-decl name='zfs_dmustats' type-id='type-id-21' visibility='default' filepath='../../include/libzfs_impl.h' line='83' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4544'>
        <var-decl name='zfs_props' type-id='type-id-22' visibility='default' filepath='../../include/libzfs_impl.h' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4608'>
        <var-decl name='zfs_user_props' type-id='type-id-22' visibility='default' filepath='../../include/libzfs_impl.h' line='85' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4672'>
        <var-decl name='zfs_recvd_props' type-id='type-id-22' visibility='default' filepath='../../include/libzfs_impl.h' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4736'>
        <var-decl name='zfs_mntcheck' type-id='type-id-5' visibility='default' filepath='../../include/libzfs_impl.h' line='87' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4800'>
        <var-decl name='zfs_mntopts' type-id='type-id-23' visibility='default' filepath='../../include/libzfs_impl.h' line='88' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4864'>
        <var-decl name='zfs_props_table' type-id='type-id-24' visibility='default' filepath='../../include/libzfs_impl.h' line='89' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='libzfs_handle' size-in-bits='20224' is-struct='yes' visibility='default' filepath='../../include/libzfs_impl.h' line='48' column='1' id='type-id-25'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='libzfs_error' type-id='type-id-6' visibility='default' filepath='../../include/libzfs_impl.h' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='libzfs_fd' type-id='type-id-6' visibility='default' filepath='../../include/libzfs_impl.h' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='libzfs_mnttab' type-id='type-id-26' visibility='default' filepath='../../include/libzfs_impl.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='libzfs_pool_handles' type-id='type-id-18' visibility='default' filepath='../../include/libzfs_impl.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='libzfs_ns_avlpool' type-id='type-id-3' visibility='default' filepath='../../include/libzfs_impl.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='libzfs_ns_avl' type-id='type-id-4' visibility='default' filepath='../../include/libzfs_impl.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='libzfs_ns_gen' type-id='type-id-27' visibility='default' filepath='../../include/libzfs_impl.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='libzfs_desc_active' type-id='type-id-6' visibility='default' filepath='../../include/libzfs_impl.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='libzfs_action' type-id='type-id-28' visibility='default' filepath='../../include/libzfs_impl.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8608'>
        <var-decl name='libzfs_desc' type-id='type-id-28' visibility='default' filepath='../../include/libzfs_impl.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16800'>
        <var-decl name='libzfs_printerr' type-id='type-id-6' visibility='default' filepath='../../include/libzfs_impl.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16832'>
        <var-decl name='libzfs_storeerr' type-id='type-id-6' visibility='default' filepath='../../include/libzfs_impl.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16864'>
        <var-decl name='libzfs_mnttab_enable' type-id='type-id-5' visibility='default' filepath='../../include/libzfs_impl.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16896'>
        <var-decl name='libzfs_mnttab_cache_lock' type-id='type-id-29' visibility='default' filepath='../../include/libzfs_impl.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17216'>
        <var-decl name='libzfs_mnttab_cache' type-id='type-id-30' visibility='default' filepath='../../include/libzfs_impl.h' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17536'>
        <var-decl name='libzfs_pool_iter' type-id='type-id-6' visibility='default' filepath='../../include/libzfs_impl.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17568'>
        <var-decl name='libzfs_chassis_id' type-id='type-id-19' visibility='default' filepath='../../include/libzfs_impl.h' line='71' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='19616'>
        <var-decl name='libzfs_prop_debug' type-id='type-id-5' visibility='default' filepath='../../include/libzfs_impl.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='19648'>
        <var-decl name='libzfs_urire' type-id='type-id-31' visibility='default' filepath='../../include/libzfs_impl.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='20160'>
        <var-decl name='libzfs_max_nvlist' type-id='type-id-27' visibility='default' filepath='../../include/libzfs_impl.h' line='74' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_IO_FILE' size-in-bits='1728' is-struct='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='49' column='1' id='type-id-32'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_flags' type-id='type-id-6' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_IO_read_ptr' type-id='type-id-23' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_IO_read_end' type-id='type-id-23' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_IO_read_base' type-id='type-id-23' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='_IO_write_base' type-id='type-id-23' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='_IO_write_ptr' type-id='type-id-23' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_IO_write_end' type-id='type-id-23' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='_IO_buf_base' type-id='type-id-23' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='_IO_buf_end' type-id='type-id-23' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='_IO_save_base' type-id='type-id-23' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='_IO_backup_base' type-id='type-id-23' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='_IO_save_end' type-id='type-id-23' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='_markers' type-id='type-id-33' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='_chain' type-id='type-id-34' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='_fileno' type-id='type-id-6' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='_flags2' type-id='type-id-6' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='_old_offset' type-id='type-id-35' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='_cur_column' type-id='type-id-36' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1040'>
        <var-decl name='_vtable_offset' type-id='type-id-37' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1048'>
        <var-decl name='_shortbuf' type-id='type-id-38' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='_offset' type-id='type-id-39' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='_codecvt' type-id='type-id-40' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='_wide_data' type-id='type-id-41' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='_freeres_list' type-id='type-id-34' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='_freeres_buf' type-id='type-id-42' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='__pad5' type-id='type-id-43' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='_mode' type-id='type-id-6' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='_unused2' type-id='type-id-44' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='98' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='char' size-in-bits='8' id='type-id-45'/>
    <pointer-type-def type-id='type-id-45' size-in-bits='64' id='type-id-23'/>
    <class-decl name='_IO_marker' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-46'/>
    <pointer-type-def type-id='type-id-46' size-in-bits='64' id='type-id-33'/>
    <pointer-type-def type-id='type-id-32' size-in-bits='64' id='type-id-34'/>
    <type-decl name='long int' size-in-bits='64' id='type-id-47'/>
    <typedef-decl name='__off_t' type-id='type-id-47' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='150' column='1' id='type-id-35'/>
    <type-decl name='unsigned short int' size-in-bits='16' id='type-id-36'/>
    <type-decl name='signed char' size-in-bits='8' id='type-id-37'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-48'/>

    <array-type-def dimensions='1' type-id='type-id-45' size-in-bits='8' id='type-id-38'>
      <subrange length='1' type-id='type-id-48' id='type-id-49'/>

    </array-type-def>
    <typedef-decl name='__off64_t' type-id='type-id-47' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='151' column='1' id='type-id-39'/>
    <class-decl name='_IO_codecvt' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-50'/>
    <pointer-type-def type-id='type-id-50' size-in-bits='64' id='type-id-40'/>
    <class-decl name='_IO_wide_data' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-51'/>
    <pointer-type-def type-id='type-id-51' size-in-bits='64' id='type-id-41'/>
    <type-decl name='void' id='type-id-52'/>
    <pointer-type-def type-id='type-id-52' size-in-bits='64' id='type-id-42'/>
    <typedef-decl name='size_t' type-id='type-id-48' filepath='/usr/lib/gcc/x86_64-linux-gnu/8/include/stddef.h' line='216' column='1' id='type-id-43'/>

    <array-type-def dimensions='1' type-id='type-id-45' size-in-bits='160' id='type-id-44'>
      <subrange length='20' type-id='type-id-48' id='type-id-53'/>

    </array-type-def>
    <typedef-decl name='FILE' type-id='type-id-32' filepath='/usr/include/x86_64-linux-gnu/bits/types/FILE.h' line='7' column='1' id='type-id-54'/>
    <pointer-type-def type-id='type-id-54' size-in-bits='64' id='type-id-26'/>
    <class-decl name='zpool_handle' size-in-bits='2560' is-struct='yes' visibility='default' filepath='../../include/libzfs_impl.h' line='98' column='1' id='type-id-55'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='zpool_hdl' type-id='type-id-17' visibility='default' filepath='../../include/libzfs_impl.h' line='99' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='zpool_next' type-id='type-id-18' visibility='default' filepath='../../include/libzfs_impl.h' line='100' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='zpool_name' type-id='type-id-19' visibility='default' filepath='../../include/libzfs_impl.h' line='101' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='zpool_state' type-id='type-id-6' visibility='default' filepath='../../include/libzfs_impl.h' line='102' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <var-decl name='zpool_config_size' type-id='type-id-43' visibility='default' filepath='../../include/libzfs_impl.h' line='103' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2304'>
        <var-decl name='zpool_config' type-id='type-id-22' visibility='default' filepath='../../include/libzfs_impl.h' line='104' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2368'>
        <var-decl name='zpool_old_config' type-id='type-id-22' visibility='default' filepath='../../include/libzfs_impl.h' line='105' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2432'>
        <var-decl name='zpool_props' type-id='type-id-22' visibility='default' filepath='../../include/libzfs_impl.h' line='106' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2496'>
        <var-decl name='zpool_start_block' type-id='type-id-56' visibility='default' filepath='../../include/libzfs_impl.h' line='107' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='libzfs_handle_t' type-id='type-id-25' filepath='../../include/libzfs.h' line='197' column='1' id='type-id-57'/>
    <pointer-type-def type-id='type-id-57' size-in-bits='64' id='type-id-17'/>
    <typedef-decl name='zpool_handle_t' type-id='type-id-55' filepath='../../include/libzfs.h' line='196' column='1' id='type-id-58'/>
    <pointer-type-def type-id='type-id-58' size-in-bits='64' id='type-id-18'/>

    <array-type-def dimensions='1' type-id='type-id-45' size-in-bits='2048' id='type-id-19'>
      <subrange length='256' type-id='type-id-48' id='type-id-59'/>

    </array-type-def>
    <class-decl name='nvlist' size-in-bits='192' is-struct='yes' visibility='default' filepath='../../include/sys/nvpair.h' line='85' column='1' id='type-id-60'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nvl_version' type-id='type-id-61' visibility='default' filepath='../../include/sys/nvpair.h' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='nvl_nvflag' type-id='type-id-62' visibility='default' filepath='../../include/sys/nvpair.h' line='87' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='nvl_priv' type-id='type-id-27' visibility='default' filepath='../../include/sys/nvpair.h' line='88' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='nvl_flag' type-id='type-id-62' visibility='default' filepath='../../include/sys/nvpair.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='nvl_pad' type-id='type-id-61' visibility='default' filepath='../../include/sys/nvpair.h' line='90' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__int32_t' type-id='type-id-6' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='40' column='1' id='type-id-63'/>
    <typedef-decl name='int32_t' type-id='type-id-63' filepath='/usr/include/x86_64-linux-gnu/bits/stdint-intn.h' line='26' column='1' id='type-id-61'/>
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-64'/>
    <typedef-decl name='__uint32_t' type-id='type-id-64' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='41' column='1' id='type-id-65'/>
    <typedef-decl name='uint32_t' type-id='type-id-65' filepath='/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h' line='26' column='1' id='type-id-62'/>
    <typedef-decl name='__uint64_t' type-id='type-id-48' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='44' column='1' id='type-id-66'/>
    <typedef-decl name='uint64_t' type-id='type-id-66' filepath='/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h' line='27' column='1' id='type-id-27'/>
    <typedef-decl name='nvlist_t' type-id='type-id-60' filepath='../../include/sys/nvpair.h' line='91' column='1' id='type-id-67'/>
    <pointer-type-def type-id='type-id-67' size-in-bits='64' id='type-id-22'/>
    <type-decl name='long long int' size-in-bits='64' id='type-id-68'/>
    <typedef-decl name='longlong_t' type-id='type-id-68' filepath='../../lib/libspl/include/sys/stdtypes.h' line='36' column='1' id='type-id-69'/>
    <typedef-decl name='diskaddr_t' type-id='type-id-69' filepath='../../lib/libspl/include/sys/stdtypes.h' line='41' column='1' id='type-id-56'/>

    <array-type-def dimensions='1' type-id='type-id-45' size-in-bits='8192' id='type-id-28'>
      <subrange length='1024' type-id='type-id-48' id='type-id-70'/>

    </array-type-def>
    <union-decl name='__anonymous_union__' size-in-bits='320' is-anonymous='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='67' column='1' id='type-id-71'>
      <data-member access='private'>
        <var-decl name='__data' type-id='type-id-72' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='69' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='__size' type-id='type-id-73' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='70' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='__align' type-id='type-id-47' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='71' column='1'/>
      </data-member>
    </union-decl>
    <class-decl name='__pthread_mutex_s' size-in-bits='320' is-struct='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='118' column='1' id='type-id-72'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__lock' type-id='type-id-6' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='120' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='__count' type-id='type-id-64' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='121' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__owner' type-id='type-id-6' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='122' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='__nusers' type-id='type-id-64' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='124' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='__kind' type-id='type-id-6' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='148' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='__spins' type-id='type-id-74' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='154' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='176'>
        <var-decl name='__elision' type-id='type-id-74' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='154' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='__list' type-id='type-id-75' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='155' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='short int' size-in-bits='16' id='type-id-74'/>
    <class-decl name='__pthread_internal_list' size-in-bits='128' is-struct='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='82' column='1' id='type-id-76'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__prev' type-id='type-id-77' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__next' type-id='type-id-77' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='85' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-76' size-in-bits='64' id='type-id-77'/>
    <typedef-decl name='__pthread_list_t' type-id='type-id-76' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='86' column='1' id='type-id-75'/>

    <array-type-def dimensions='1' type-id='type-id-45' size-in-bits='320' id='type-id-73'>
      <subrange length='40' type-id='type-id-48' id='type-id-78'/>

    </array-type-def>
    <typedef-decl name='pthread_mutex_t' type-id='type-id-71' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='72' column='1' id='type-id-29'/>
    <class-decl name='avl_tree' size-in-bits='320' is-struct='yes' visibility='default' filepath='../../include/sys/avl_impl.h' line='146' column='1' id='type-id-79'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='avl_root' type-id='type-id-80' visibility='default' filepath='../../include/sys/avl_impl.h' line='147' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='avl_compar' type-id='type-id-81' visibility='default' filepath='../../include/sys/avl_impl.h' line='148' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='avl_offset' type-id='type-id-43' visibility='default' filepath='../../include/sys/avl_impl.h' line='149' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='avl_numnodes' type-id='type-id-82' visibility='default' filepath='../../include/sys/avl_impl.h' line='150' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='avl_size' type-id='type-id-43' visibility='default' filepath='../../include/sys/avl_impl.h' line='151' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='avl_node' size-in-bits='192' is-struct='yes' visibility='default' filepath='../../include/sys/avl_impl.h' line='90' column='1' id='type-id-83'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='avl_child' type-id='type-id-84' visibility='default' filepath='../../include/sys/avl_impl.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='avl_pcb' type-id='type-id-85' visibility='default' filepath='../../include/sys/avl_impl.h' line='92' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-83' size-in-bits='64' id='type-id-80'/>

    <array-type-def dimensions='1' type-id='type-id-80' size-in-bits='128' id='type-id-84'>
      <subrange length='2' type-id='type-id-48' id='type-id-86'/>

    </array-type-def>
    <typedef-decl name='uintptr_t' type-id='type-id-48' filepath='/usr/include/stdint.h' line='90' column='1' id='type-id-85'/>
    <pointer-type-def type-id='type-id-87' size-in-bits='64' id='type-id-81'/>
    <typedef-decl name='ulong_t' type-id='type-id-48' filepath='../../lib/libspl/include/sys/stdtypes.h' line='34' column='1' id='type-id-82'/>
    <typedef-decl name='avl_tree_t' type-id='type-id-79' filepath='../../include/sys/avl.h' line='119' column='1' id='type-id-30'/>
    <class-decl name='re_pattern_buffer' size-in-bits='512' is-struct='yes' visibility='default' filepath='/usr/include/regex.h' line='413' column='1' id='type-id-88'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='buffer' type-id='type-id-89' visibility='default' filepath='/usr/include/regex.h' line='417' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='allocated' type-id='type-id-90' visibility='default' filepath='/usr/include/regex.h' line='420' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='used' type-id='type-id-90' visibility='default' filepath='/usr/include/regex.h' line='423' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='syntax' type-id='type-id-91' visibility='default' filepath='/usr/include/regex.h' line='426' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='fastmap' type-id='type-id-23' visibility='default' filepath='/usr/include/regex.h' line='431' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='translate' type-id='type-id-92' visibility='default' filepath='/usr/include/regex.h' line='437' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='re_nsub' type-id='type-id-43' visibility='default' filepath='/usr/include/regex.h' line='440' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31'>
        <var-decl name='can_be_null' type-id='type-id-64' visibility='default' filepath='/usr/include/regex.h' line='446' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='29'>
        <var-decl name='regs_allocated' type-id='type-id-64' visibility='default' filepath='/usr/include/regex.h' line='457' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='28'>
        <var-decl name='fastmap_accurate' type-id='type-id-64' visibility='default' filepath='/usr/include/regex.h' line='461' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='27'>
        <var-decl name='no_sub' type-id='type-id-64' visibility='default' filepath='/usr/include/regex.h' line='465' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='26'>
        <var-decl name='not_bol' type-id='type-id-64' visibility='default' filepath='/usr/include/regex.h' line='469' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='25'>
        <var-decl name='not_eol' type-id='type-id-64' visibility='default' filepath='/usr/include/regex.h' line='472' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='newline_anchor' type-id='type-id-64' visibility='default' filepath='/usr/include/regex.h' line='475' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='re_dfa_t' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-93'/>
    <pointer-type-def type-id='type-id-93' size-in-bits='64' id='type-id-89'/>
    <typedef-decl name='__re_long_size_t' type-id='type-id-48' filepath='/usr/include/regex.h' line='56' column='1' id='type-id-90'/>
    <typedef-decl name='reg_syntax_t' type-id='type-id-48' filepath='/usr/include/regex.h' line='72' column='1' id='type-id-91'/>
    <type-decl name='unsigned char' size-in-bits='8' id='type-id-94'/>
    <pointer-type-def type-id='type-id-94' size-in-bits='64' id='type-id-92'/>
    <typedef-decl name='regex_t' type-id='type-id-88' filepath='/usr/include/regex.h' line='478' column='1' id='type-id-31'/>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' filepath='../../include/sys/fs/zfs.h' line='52' column='1' id='type-id-95'>
      <underlying-type type-id='type-id-7'/>
      <enumerator name='ZFS_TYPE_FILESYSTEM' value='1'/>
      <enumerator name='ZFS_TYPE_SNAPSHOT' value='2'/>
      <enumerator name='ZFS_TYPE_VOLUME' value='4'/>
      <enumerator name='ZFS_TYPE_POOL' value='8'/>
      <enumerator name='ZFS_TYPE_BOOKMARK' value='16'/>
    </enum-decl>
    <typedef-decl name='zfs_type_t' type-id='type-id-95' filepath='../../include/sys/fs/zfs.h' line='58' column='1' id='type-id-20'/>
    <class-decl name='dmu_objset_stats' size-in-bits='2304' is-struct='yes' visibility='default' filepath='../../include/sys/dmu.h' line='931' column='1' id='type-id-96'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='dds_num_clones' type-id='type-id-27' visibility='default' filepath='../../include/sys/dmu.h' line='932' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='dds_creation_txg' type-id='type-id-27' visibility='default' filepath='../../include/sys/dmu.h' line='933' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='dds_guid' type-id='type-id-27' visibility='default' filepath='../../include/sys/dmu.h' line='934' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='dds_type' type-id='type-id-97' visibility='default' filepath='../../include/sys/dmu.h' line='935' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='dds_is_snapshot' type-id='type-id-98' visibility='default' filepath='../../include/sys/dmu.h' line='936' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='232'>
        <var-decl name='dds_inconsistent' type-id='type-id-98' visibility='default' filepath='../../include/sys/dmu.h' line='937' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='240'>
        <var-decl name='dds_redacted' type-id='type-id-98' visibility='default' filepath='../../include/sys/dmu.h' line='938' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='248'>
        <var-decl name='dds_origin' type-id='type-id-19' visibility='default' filepath='../../include/sys/dmu.h' line='939' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='dmu_objset_type' filepath='../../include/sys/fs/zfs.h' line='64' column='1' id='type-id-99'>
      <underlying-type type-id='type-id-7'/>
      <enumerator name='DMU_OST_NONE' value='0'/>
      <enumerator name='DMU_OST_META' value='1'/>
      <enumerator name='DMU_OST_ZFS' value='2'/>
      <enumerator name='DMU_OST_ZVOL' value='3'/>
      <enumerator name='DMU_OST_OTHER' value='4'/>
      <enumerator name='DMU_OST_ANY' value='5'/>
      <enumerator name='DMU_OST_NUMTYPES' value='6'/>
    </enum-decl>
    <typedef-decl name='dmu_objset_type_t' type-id='type-id-99' filepath='../../include/sys/fs/zfs.h' line='72' column='1' id='type-id-97'/>
    <typedef-decl name='__uint8_t' type-id='type-id-94' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='37' column='1' id='type-id-100'/>
    <typedef-decl name='uint8_t' type-id='type-id-100' filepath='/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h' line='24' column='1' id='type-id-98'/>
    <typedef-decl name='dmu_objset_stats_t' type-id='type-id-96' filepath='../../include/sys/dmu.h' line='940' column='1' id='type-id-21'/>
    <pointer-type-def type-id='type-id-98' size-in-bits='64' id='type-id-24'/>
    <typedef-decl name='zfs_handle_t' type-id='type-id-16' filepath='../../include/libzfs.h' line='195' column='1' id='type-id-101'/>
    <pointer-type-def type-id='type-id-101' size-in-bits='64' id='type-id-102'/>
    <function-decl name='changelist_gather' mangled-name='changelist_gather' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_changelist.c' line='624' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='changelist_gather'>
      <parameter type-id='type-id-102' name='zhp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_changelist.c' line='624' column='1'/>
      <parameter type-id='type-id-2' name='prop' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_changelist.c' line='624' column='1'/>
      <parameter type-id='type-id-6' name='gather_flags' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_changelist.c' line='624' column='1'/>
      <parameter type-id='type-id-6' name='mnt_flags' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_changelist.c' line='625' column='1'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='changelist_free' mangled-name='changelist_free' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_changelist.c' line='412' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='changelist_free'>
      <parameter type-id='type-id-15' name='clp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_changelist.c' line='412' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <qualified-type-def type-id='type-id-45' const='yes' id='type-id-103'/>
    <pointer-type-def type-id='type-id-103' size-in-bits='64' id='type-id-104'/>
    <function-decl name='changelist_remove' mangled-name='changelist_remove' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_changelist.c' line='387' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='changelist_remove'>
      <parameter type-id='type-id-15' name='clp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_changelist.c' line='387' column='1'/>
      <parameter type-id='type-id-104' name='name' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_changelist.c' line='387' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='changelist_haszonedchild' mangled-name='changelist_haszonedchild' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_changelist.c' line='378' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='changelist_haszonedchild'>
      <parameter type-id='type-id-15' name='clp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_changelist.c' line='378' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' filepath='../../include/libzfs_impl.h' line='110' column='1' id='type-id-105'>
      <underlying-type type-id='type-id-7'/>
      <enumerator name='PROTO_NFS' value='0'/>
      <enumerator name='PROTO_SMB' value='1'/>
      <enumerator name='PROTO_END' value='2'/>
    </enum-decl>
    <typedef-decl name='zfs_share_proto_t' type-id='type-id-105' filepath='../../include/libzfs_impl.h' line='114' column='1' id='type-id-106'/>
    <pointer-type-def type-id='type-id-106' size-in-bits='64' id='type-id-107'/>
    <function-decl name='changelist_unshare' mangled-name='changelist_unshare' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_changelist.c' line='348' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='changelist_unshare'>
      <parameter type-id='type-id-15' name='clp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_changelist.c' line='348' column='1'/>
      <parameter type-id='type-id-107' name='proto' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_changelist.c' line='348' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='changelist_rename' mangled-name='changelist_rename' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_changelist.c' line='311' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='changelist_rename'>
      <parameter type-id='type-id-15' name='clp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_changelist.c' line='311' column='1'/>
      <parameter type-id='type-id-104' name='src' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_changelist.c' line='311' column='1'/>
      <parameter type-id='type-id-104' name='dst' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_changelist.c' line='311' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='isa_child_of' mangled-name='isa_child_of' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_changelist.c' line='288' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='isa_child_of'>
      <parameter type-id='type-id-104' name='dataset' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_changelist.c' line='288' column='1'/>
      <parameter type-id='type-id-104' name='parent' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_changelist.c' line='288' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='changelist_postfix' mangled-name='changelist_postfix' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_changelist.c' line='170' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='changelist_postfix'>
      <parameter type-id='type-id-15' name='clp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_changelist.c' line='170' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='changelist_prefix' mangled-name='changelist_prefix' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_changelist.c' line='96' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='changelist_prefix'>
      <parameter type-id='type-id-15' name='clp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_changelist.c' line='96' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_alloc' mangled-name='zfs_alloc' filepath='../../include/libzfs_impl.h' line='139' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='uu_avl_pool_create' mangled-name='uu_avl_pool_create' filepath='../../include/libuutil.h' line='332' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='uu_avl_create' mangled-name='uu_avl_create' filepath='../../include/libuutil.h' line='351' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='zfs_prop_get' mangled-name='zfs_prop_get' filepath='../../include/libzfs.h' line='493' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='zfs_iter_dependents' mangled-name='zfs_iter_dependents' filepath='../../include/libzfs.h' line='614' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='zfs_get_name' mangled-name='zfs_get_name' filepath='../../include/libzfs.h' line='470' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='zfs_open' mangled-name='zfs_open' filepath='../../include/libzfs.h' line='466' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='zfs_is_shared' mangled-name='zfs_is_shared' filepath='../../include/libzfs.h' line='836' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='zfs_prop_get_int' mangled-name='zfs_prop_get_int' filepath='../../include/libzfs.h' line='510' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='uu_avl_node_init' mangled-name='uu_avl_node_init' filepath='../../include/libuutil.h' line='348' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='uu_avl_find' mangled-name='uu_avl_find' filepath='../../include/libuutil.h' line='370' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='free' mangled-name='free' filepath='/usr/include/stdlib.h' line='563' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='zfs_close' mangled-name='zfs_close' filepath='../../include/libzfs.h' line='468' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='zfs_iter_children' mangled-name='zfs_iter_children' filepath='../../include/libzfs.h' line='613' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='zfs_iter_mounted' mangled-name='zfs_iter_mounted' filepath='../../include/libzfs.h' line='622' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='zfs_is_mounted' mangled-name='zfs_is_mounted' filepath='../../include/libzfs.h' line='820' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='uu_avl_insert' mangled-name='uu_avl_insert' filepath='../../include/libuutil.h' line='371' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='zfs_error' mangled-name='zfs_error' filepath='../../include/libzfs_impl.h' line='136' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='strcmp' mangled-name='strcmp' filepath='/usr/include/string.h' line='136' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='zfs_get_handle' mangled-name='zfs_get_handle' filepath='../../include/libzfs.h' line='210' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='getzoneid' mangled-name='getzoneid' filepath='../../include/sys/zfs_context.h' line='731' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='uu_avl_walk_start' mangled-name='uu_avl_walk_start' filepath='../../include/libuutil.h' line='366' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='uu_avl_remove' mangled-name='uu_avl_remove' filepath='../../include/libuutil.h' line='378' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='uu_avl_walk_next' mangled-name='uu_avl_walk_next' filepath='../../include/libuutil.h' line='367' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='uu_avl_walk_end' mangled-name='uu_avl_walk_end' filepath='../../include/libuutil.h' line='368' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='uu_avl_destroy' mangled-name='uu_avl_destroy' filepath='../../include/libuutil.h' line='354' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='uu_avl_pool_destroy' mangled-name='uu_avl_pool_destroy' filepath='../../include/libuutil.h' line='336' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='zfs_unshare_proto' mangled-name='zfs_unshare_proto' filepath='../../include/libzfs_impl.h' line='211' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='zfs_commit_proto' mangled-name='zfs_commit_proto' filepath='../../include/libzfs_impl.h' line='260' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='remove_mountpoint' mangled-name='remove_mountpoint' filepath='../../include/libzfs_impl.h' line='192' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='strlcpy' mangled-name='strlcpy' filepath='../../lib/libspl/include/string.h' line='37' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='strlen' mangled-name='strlen' filepath='/usr/include/string.h' line='384' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='strlcat' mangled-name='strlcat' filepath='../../lib/libspl/include/string.h' line='33' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='strncmp' mangled-name='strncmp' filepath='/usr/include/string.h' line='139' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='zfs_refresh_properties' mangled-name='zfs_refresh_properties' filepath='../../include/libzfs.h' line='806' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='zfs_share_nfs' mangled-name='zfs_share_nfs' filepath='../../include/libzfs.h' line='845' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='zfs_unshare_smb' mangled-name='zfs_unshare_smb' filepath='../../include/libzfs.h' line='849' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='zfs_unshare_nfs' mangled-name='zfs_unshare_nfs' filepath='../../include/libzfs.h' line='848' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='zfs_share_smb' mangled-name='zfs_share_smb' filepath='../../include/libzfs.h' line='846' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='zfs_mount' mangled-name='zfs_mount' filepath='../../include/libzfs.h' line='821' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='uu_avl_last' mangled-name='uu_avl_last' filepath='../../include/libuutil.h' line='359' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='zfs_commit_nfs_shares' mangled-name='zfs_commit_nfs_shares' filepath='../../include/libzfs.h' line='857' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='zfs_commit_smb_shares' mangled-name='zfs_commit_smb_shares' filepath='../../include/libzfs.h' line='858' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='zfs_unmount' mangled-name='zfs_unmount' filepath='../../include/libzfs.h' line='823' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-87'>
      <parameter type-id='type-id-42'/>
      <parameter type-id='type-id-42'/>
      <return type-id='type-id-6'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='libzfs_config.c' comp-dir-path='/home/colm/src/zfs/zfs/lib/libzfs' language='LANG_C99'>
    <pointer-type-def type-id='type-id-108' size-in-bits='64' id='type-id-109'/>
    <typedef-decl name='zfs_iter_f' type-id='type-id-109' filepath='../../include/libzfs.h' line='611' column='1' id='type-id-110'/>
    <function-decl name='zfs_iter_root' mangled-name='zfs_iter_root' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_config.c' line='434' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_iter_root'>
      <parameter type-id='type-id-17' name='hdl' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_config.c' line='434' column='1'/>
      <parameter type-id='type-id-110' name='func' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_config.c' line='434' column='1'/>
      <parameter type-id='type-id-42' name='data' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_config.c' line='434' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <pointer-type-def type-id='type-id-111' size-in-bits='64' id='type-id-112'/>
    <typedef-decl name='zpool_iter_f' type-id='type-id-112' filepath='../../include/libzfs.h' line='246' column='1' id='type-id-113'/>
    <function-decl name='zpool_iter' mangled-name='zpool_iter' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_config.c' line='389' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_iter'>
      <parameter type-id='type-id-17' name='hdl' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_config.c' line='389' column='1'/>
      <parameter type-id='type-id-113' name='func' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_config.c' line='389' column='1'/>
      <parameter type-id='type-id-42' name='data' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_config.c' line='389' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zpool_skip_pool' mangled-name='zpool_skip_pool' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_config.c' line='340' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_skip_pool'>
      <parameter type-id='type-id-104' name='poolname' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_config.c' line='340' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <pointer-type-def type-id='type-id-5' size-in-bits='64' id='type-id-114'/>
    <function-decl name='zpool_refresh_stats' mangled-name='zpool_refresh_stats' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_config.c' line='265' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_refresh_stats'>
      <parameter type-id='type-id-18' name='zhp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_config.c' line='265' column='1'/>
      <parameter type-id='type-id-114' name='missing' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_config.c' line='265' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zpool_get_features' mangled-name='zpool_get_features' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_config.c' line='232' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_get_features'>
      <parameter type-id='type-id-18' name='zhp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_config.c' line='232' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <pointer-type-def type-id='type-id-22' size-in-bits='64' id='type-id-115'/>
    <function-decl name='zpool_get_config' mangled-name='zpool_get_config' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_config.c' line='220' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_get_config'>
      <parameter type-id='type-id-18' name='zhp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_config.c' line='220' column='1'/>
      <parameter type-id='type-id-115' name='oldconfig' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_config.c' line='220' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='namespace_clear' mangled-name='namespace_clear' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_config.c' line='79' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='namespace_clear'>
      <parameter type-id='type-id-17' name='hdl' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_config.c' line='79' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='uu_avl_first' mangled-name='uu_avl_first' filepath='../../include/libuutil.h' line='358' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='make_dataset_handle' mangled-name='make_dataset_handle' filepath='../../include/libzfs_impl.h' line='196' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='uu_avl_next' mangled-name='uu_avl_next' filepath='../../include/libuutil.h' line='361' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='zpool_open_silent' mangled-name='zpool_open_silent' filepath='../../include/libzfs_impl.h' line='200' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='strchr' mangled-name='strchr' filepath='/usr/include/string.h' line='225' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='getenv' mangled-name='getenv' filepath='/usr/include/stdlib.h' line='631' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='__builtin_memset' mangled-name='memset' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='strcpy' mangled-name='strcpy' filepath='/usr/include/string.h' line='121' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='zcmd_alloc_dst_nvlist' mangled-name='zcmd_alloc_dst_nvlist' filepath='../../include/libzfs_impl.h' line='176' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='__errno_location' mangled-name='__errno_location' filepath='/usr/include/errno.h' line='37' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='zcmd_expand_dst_nvlist' mangled-name='zcmd_expand_dst_nvlist' filepath='../../include/libzfs_impl.h' line='179' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='zfs_ioctl' mangled-name='zfs_ioctl' filepath='../../include/libzfs.h' line='454' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='zcmd_read_dst_nvlist' mangled-name='zcmd_read_dst_nvlist' filepath='../../include/libzfs_impl.h' line='180' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='zcmd_free_nvlists' mangled-name='zcmd_free_nvlists' filepath='../../include/libzfs_impl.h' line='181' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='nvlist_free' mangled-name='nvlist_free' filepath='../../include/sys/nvpair.h' line='152' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='nvlist_exists' mangled-name='nvlist_exists' filepath='../../include/sys/nvpair.h' line='238' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='nvlist_lookup_nvlist' mangled-name='nvlist_lookup_nvlist' filepath='../../include/sys/nvpair.h' line='214' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='libspl_assertf' mangled-name='libspl_assertf' filepath='../../lib/libspl/include/assert.h' line='40' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='no_memory' mangled-name='no_memory' filepath='../../include/libzfs_impl.h' line='143' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='nvlist_dup' mangled-name='nvlist_dup' filepath='../../include/sys/nvpair.h' line='156' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='nvpair_name' mangled-name='nvpair_name' filepath='../../include/sys/nvpair.h' line='244' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='zfs_strdup' mangled-name='zfs_strdup' filepath='../../include/libzfs_impl.h' line='142' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='nvpair_value_nvlist' mangled-name='nvpair_value_nvlist' filepath='../../include/sys/nvpair.h' line='258' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='dcgettext' mangled-name='dcgettext' filepath='/usr/include/libintl.h' line='51' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='zfs_standard_error' mangled-name='zfs_standard_error' filepath='../../include/libzfs_impl.h' line='145' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='uu_avl_teardown' mangled-name='uu_avl_teardown' filepath='../../include/libuutil.h' line='376' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='nvlist_next_nvpair' mangled-name='nvlist_next_nvpair' filepath='../../include/sys/nvpair.h' line='242' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-108'>
      <parameter type-id='type-id-102'/>
      <parameter type-id='type-id-42'/>
      <return type-id='type-id-6'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-111'>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-42'/>
      <return type-id='type-id-6'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='libzfs_crypto.c' comp-dir-path='/home/colm/src/zfs/zfs/lib/libzfs' language='LANG_C99'>
    <function-decl name='zfs_crypto_rewrap' mangled-name='zfs_crypto_rewrap' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_crypto.c' line='1389' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_crypto_rewrap'>
      <parameter type-id='type-id-102' name='zhp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_crypto.c' line='1389' column='1'/>
      <parameter type-id='type-id-22' name='raw_props' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_crypto.c' line='1389' column='1'/>
      <parameter type-id='type-id-5' name='inheritkey' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_crypto.c' line='1389' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_crypto_unload_key' mangled-name='zfs_crypto_unload_key' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_crypto.c' line='1253' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_crypto_unload_key'>
      <parameter type-id='type-id-102' name='zhp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_crypto.c' line='1253' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_crypto_load_key' mangled-name='zfs_crypto_load_key' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_crypto.c' line='1085' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_crypto_load_key'>
      <parameter type-id='type-id-102' name='zhp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_crypto.c' line='1085' column='1'/>
      <parameter type-id='type-id-5' name='noop' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_crypto.c' line='1085' column='1'/>
      <parameter type-id='type-id-23' name='alt_keylocation' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_crypto.c' line='1085' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_crypto_attempt_load_keys' mangled-name='zfs_crypto_attempt_load_keys' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_crypto.c' line='1050' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_crypto_attempt_load_keys'>
      <parameter type-id='type-id-17' name='hdl' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_crypto.c' line='1050' column='1'/>
      <parameter type-id='type-id-23' name='fsname' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_crypto.c' line='1050' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_crypto_clone_check' mangled-name='zfs_crypto_clone_check' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_crypto.c' line='984' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_crypto_clone_check'>
      <parameter type-id='type-id-17' name='hdl' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_crypto.c' line='984' column='1'/>
      <parameter type-id='type-id-102' name='origin_zhp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_crypto.c' line='984' column='1'/>
      <parameter type-id='type-id-23' name='parent_name' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_crypto.c' line='985' column='1'/>
      <parameter type-id='type-id-22' name='props' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_crypto.c' line='985' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <pointer-type-def type-id='type-id-24' size-in-bits='64' id='type-id-116'/>
    <typedef-decl name='uint_t' type-id='type-id-64' filepath='../../lib/libspl/include/sys/stdtypes.h' line='33' column='1' id='type-id-117'/>
    <pointer-type-def type-id='type-id-117' size-in-bits='64' id='type-id-118'/>
    <function-decl name='zfs_crypto_create' mangled-name='zfs_crypto_create' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_crypto.c' line='812' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_crypto_create'>
      <parameter type-id='type-id-17' name='hdl' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_crypto.c' line='812' column='1'/>
      <parameter type-id='type-id-23' name='parent_name' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_crypto.c' line='812' column='1'/>
      <parameter type-id='type-id-22' name='props' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_crypto.c' line='812' column='1'/>
      <parameter type-id='type-id-22' name='pool_props' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_crypto.c' line='813' column='1'/>
      <parameter type-id='type-id-5' name='stdin_available' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_crypto.c' line='813' column='1'/>
      <parameter type-id='type-id-116' name='wkeydata_out' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_crypto.c' line='813' column='1'/>
      <parameter type-id='type-id-118' name='wkeylen_out' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_crypto.c' line='814' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_crypto_get_encryption_root' mangled-name='zfs_crypto_get_encryption_root' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_crypto.c' line='781' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_crypto_get_encryption_root'>
      <parameter type-id='type-id-102' name='zhp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_crypto.c' line='781' column='1'/>
      <parameter type-id='type-id-114' name='is_encroot' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_crypto.c' line='781' column='1'/>
      <parameter type-id='type-id-23' name='buf' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_crypto.c' line='782' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_name_to_prop' mangled-name='zfs_name_to_prop' filepath='../../include/sys/fs/zfs.h' line='313' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='zfs_error_aux' mangled-name='zfs_error_aux' filepath='../../include/libzfs_impl.h' line='138' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='fnvlist_alloc' mangled-name='fnvlist_alloc' filepath='../../include/sys/nvpair.h' line='276' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='zfs_valid_proplist' mangled-name='zfs_valid_proplist' filepath='../../include/libzfs.h' line='487' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='snprintf' mangled-name='snprintf' filepath='/usr/include/stdio.h' line='354' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='zfs_parent_name' mangled-name='zfs_parent_name' filepath='../../include/libzfs.h' line='810' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='lzc_change_key' mangled-name='lzc_change_key' filepath='../../include/libzfs_core.h' line='64' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='zfs_prop_to_name' mangled-name='zfs_prop_to_name' filepath='../../include/libzfs.h' line='490' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='nvlist_lookup_uint64' mangled-name='nvlist_lookup_uint64' filepath='../../include/sys/nvpair.h' line='212' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='nvlist_lookup_string' mangled-name='nvlist_lookup_string' filepath='../../include/sys/nvpair.h' line='213' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='nvlist_add_uint64' mangled-name='nvlist_add_uint64' filepath='../../include/sys/nvpair.h' line='178' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='nvlist_add_string' mangled-name='nvlist_add_string' filepath='../../include/sys/nvpair.h' line='179' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='lzc_unload_key' mangled-name='lzc_unload_key' filepath='../../include/libzfs_core.h' line='63' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='lzc_load_key' mangled-name='lzc_load_key' filepath='../../include/libzfs_core.h' line='62' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='zfs_handle_dup' mangled-name='zfs_handle_dup' filepath='../../include/libzfs.h' line='467' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='printf' mangled-name='printf' filepath='/usr/include/stdio.h' line='332' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='zfs_iter_filesystems' mangled-name='zfs_iter_filesystems' filepath='../../include/libzfs.h' line='615' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='read' mangled-name='read' filepath='/usr/include/unistd.h' line='360' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='open' mangled-name='open64' filepath='/usr/include/fcntl.h' line='171' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='close' mangled-name='close' filepath='/usr/include/unistd.h' line='353' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='calloc' mangled-name='calloc' filepath='/usr/include/stdlib.h' line='541' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='__builtin_memcpy' mangled-name='memcpy' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='regexec' mangled-name='regexec' filepath='/usr/include/regex.h' line='643' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='fileno' mangled-name='fileno' filepath='/usr/include/stdio.h' line='792' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='isatty' mangled-name='isatty' filepath='/usr/include/unistd.h' line='779' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='__getdelim' mangled-name='__getdelim' filepath='/usr/include/stdio.h' line='609' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='sigemptyset' mangled-name='sigemptyset' filepath='/usr/include/signal.h' line='196' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='sigaction' mangled-name='sigaction' filepath='/usr/include/signal.h' line='240' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='fputc' mangled-name='fputc' filepath='/usr/include/stdio.h' line='527' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='fflush' mangled-name='fflush' filepath='/usr/include/stdio.h' line='218' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='tcgetattr' mangled-name='tcgetattr' filepath='/usr/include/termios.h' line='66' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='tcsetattr' mangled-name='tcsetattr' filepath='/usr/include/termios.h' line='70' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='__builtin_putchar' mangled-name='putchar' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='getpid' mangled-name='getpid' filepath='/usr/include/unistd.h' line='628' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='kill' mangled-name='kill' filepath='/usr/include/signal.h' line='112' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='__ctype_b_loc' mangled-name='__ctype_b_loc' filepath='/usr/include/ctype.h' line='79' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='zpool_get_features' mangled-name='zpool_get_features' filepath='../../include/libzfs.h' line='412' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='zpool_get_prop_int' mangled-name='zpool_get_prop_int' filepath='../../include/libzfs.h' line='329' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='malloc' mangled-name='malloc' filepath='/usr/include/stdlib.h' line='539' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='fread' mangled-name='fread' filepath='/usr/include/stdio.h' line='652' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='ferror' mangled-name='ferror' filepath='/usr/include/stdio.h' line='767' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='fopen' mangled-name='fopen64' filepath='/usr/include/stdio.h' line='257' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='fclose' mangled-name='fclose' filepath='/usr/include/stdio.h' line='213' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='sscanf' mangled-name='sscanf' filepath='/usr/include/stdio.h' line='399' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='__builtin_memmove' mangled-name='memmove' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='PKCS5_PBKDF2_HMAC_SHA1' mangled-name='PKCS5_PBKDF2_HMAC_SHA1' filepath='/usr/include/openssl/evp.h' line='1087' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='libzfs_dataset.c' comp-dir-path='/home/colm/src/zfs/zfs/lib/libzfs' language='LANG_C99'>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' filepath='../../include/sys/fs/zfs.h' line='1431' column='1' id='type-id-119'>
      <underlying-type type-id='type-id-7'/>
      <enumerator name='ZFS_WAIT_DELETEQ' value='0'/>
      <enumerator name='ZFS_WAIT_NUM_ACTIVITIES' value='1'/>
    </enum-decl>
    <typedef-decl name='zfs_wait_activity_t' type-id='type-id-119' filepath='../../include/sys/fs/zfs.h' line='1434' column='1' id='type-id-120'/>
    <function-decl name='zfs_wait_status' mangled-name='zfs_wait_status' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='5547' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_wait_status'>
      <parameter type-id='type-id-102' name='zhp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='5547' column='1'/>
      <parameter type-id='type-id-120' name='activity' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='5547' column='1'/>
      <parameter type-id='type-id-114' name='missing' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='5548' column='1'/>
      <parameter type-id='type-id-114' name='waited' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='5548' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zvol_volsize_to_reservation' mangled-name='zvol_volsize_to_reservation' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='5491' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zvol_volsize_to_reservation'>
      <parameter type-id='type-id-18' name='zph' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='5491' column='1'/>
      <parameter type-id='type-id-27' name='volsize' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='5491' column='1'/>
      <parameter type-id='type-id-22' name='props' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='5492' column='1'/>
      <return type-id='type-id-27'/>
    </function-decl>
    <function-decl name='zfs_get_holds' mangled-name='zfs_get_holds' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='5233' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_get_holds'>
      <parameter type-id='type-id-102' name='zhp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='5233' column='1'/>
      <parameter type-id='type-id-115' name='nvl' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='5233' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_set_fsacl' mangled-name='zfs_set_fsacl' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='5179' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_set_fsacl'>
      <parameter type-id='type-id-102' name='zhp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='5179' column='1'/>
      <parameter type-id='type-id-5' name='un' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='5179' column='1'/>
      <parameter type-id='type-id-22' name='nvl' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='5179' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_get_fsacl' mangled-name='zfs_get_fsacl' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='5112' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_get_fsacl'>
      <parameter type-id='type-id-102' name='zhp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='5112' column='1'/>
      <parameter type-id='type-id-115' name='nvl' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='5112' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_release' mangled-name='zfs_release' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='5031' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_release'>
      <parameter type-id='type-id-102' name='zhp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='5031' column='1'/>
      <parameter type-id='type-id-104' name='snapname' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='5031' column='1'/>
      <parameter type-id='type-id-104' name='tag' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='5031' column='1'/>
      <parameter type-id='type-id-5' name='recursive' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='5032' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_hold_nvl' mangled-name='zfs_hold_nvl' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='4932' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_hold_nvl'>
      <parameter type-id='type-id-102' name='zhp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='4932' column='1'/>
      <parameter type-id='type-id-6' name='cleanup_fd' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='4932' column='1'/>
      <parameter type-id='type-id-22' name='holds' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='4932' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_hold' mangled-name='zfs_hold' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='4900' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_hold'>
      <parameter type-id='type-id-102' name='zhp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='4900' column='1'/>
      <parameter type-id='type-id-104' name='snapname' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='4900' column='1'/>
      <parameter type-id='type-id-104' name='tag' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='4900' column='1'/>
      <parameter type-id='type-id-5' name='recursive' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='4901' column='1'/>
      <parameter type-id='type-id-6' name='cleanup_fd' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='4901' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' filepath='../../include/sys/fs/zfs.h' line='192' column='1' id='type-id-121'>
      <underlying-type type-id='type-id-7'/>
      <enumerator name='ZFS_PROP_USERUSED' value='0'/>
      <enumerator name='ZFS_PROP_USERQUOTA' value='1'/>
      <enumerator name='ZFS_PROP_GROUPUSED' value='2'/>
      <enumerator name='ZFS_PROP_GROUPQUOTA' value='3'/>
      <enumerator name='ZFS_PROP_USEROBJUSED' value='4'/>
      <enumerator name='ZFS_PROP_USEROBJQUOTA' value='5'/>
      <enumerator name='ZFS_PROP_GROUPOBJUSED' value='6'/>
      <enumerator name='ZFS_PROP_GROUPOBJQUOTA' value='7'/>
      <enumerator name='ZFS_PROP_PROJECTUSED' value='8'/>
      <enumerator name='ZFS_PROP_PROJECTQUOTA' value='9'/>
      <enumerator name='ZFS_PROP_PROJECTOBJUSED' value='10'/>
      <enumerator name='ZFS_PROP_PROJECTOBJQUOTA' value='11'/>
      <enumerator name='ZFS_NUM_USERQUOTA_PROPS' value='12'/>
    </enum-decl>
    <typedef-decl name='zfs_userquota_prop_t' type-id='type-id-121' filepath='../../include/sys/fs/zfs.h' line='206' column='1' id='type-id-122'/>
    <typedef-decl name='__uid_t' type-id='type-id-64' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='144' column='1' id='type-id-123'/>
    <typedef-decl name='uid_t' type-id='type-id-123' filepath='/usr/include/x86_64-linux-gnu/sys/types.h' line='79' column='1' id='type-id-124'/>
    <pointer-type-def type-id='type-id-125' size-in-bits='64' id='type-id-126'/>
    <typedef-decl name='zfs_userspace_cb_t' type-id='type-id-126' filepath='../../include/libzfs.h' line='734' column='1' id='type-id-127'/>
    <function-decl name='zfs_userspace' mangled-name='zfs_userspace' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='4820' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_userspace'>
      <parameter type-id='type-id-102' name='zhp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='4820' column='1'/>
      <parameter type-id='type-id-122' name='type' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='4820' column='1'/>
      <parameter type-id='type-id-127' name='func' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='4821' column='1'/>
      <parameter type-id='type-id-42' name='arg' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='4821' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_smb_acl_rename' mangled-name='zfs_smb_acl_rename' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='4812' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_smb_acl_rename'>
      <parameter type-id='type-id-17' name='hdl' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='4812' column='1'/>
      <parameter type-id='type-id-23' name='dataset' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='4812' column='1'/>
      <parameter type-id='type-id-23' name='path' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='4812' column='1'/>
      <parameter type-id='type-id-23' name='oldname' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='4813' column='1'/>
      <parameter type-id='type-id-23' name='newname' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='4813' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_smb_acl_purge' mangled-name='zfs_smb_acl_purge' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='4805' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_smb_acl_purge'>
      <parameter type-id='type-id-17' name='hdl' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='4805' column='1'/>
      <parameter type-id='type-id-23' name='dataset' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='4805' column='1'/>
      <parameter type-id='type-id-23' name='path' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='4805' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_smb_acl_remove' mangled-name='zfs_smb_acl_remove' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='4797' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_smb_acl_remove'>
      <parameter type-id='type-id-17' name='hdl' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='4797' column='1'/>
      <parameter type-id='type-id-23' name='dataset' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='4797' column='1'/>
      <parameter type-id='type-id-23' name='path' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='4798' column='1'/>
      <parameter type-id='type-id-23' name='resource' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='4798' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_smb_acl_add' mangled-name='zfs_smb_acl_add' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='4789' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_smb_acl_add'>
      <parameter type-id='type-id-17' name='hdl' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='4797' column='1'/>
      <parameter type-id='type-id-23' name='dataset' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='4797' column='1'/>
      <parameter type-id='type-id-23' name='path' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='4798' column='1'/>
      <parameter type-id='type-id-23' name='resource' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='4798' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_prune_proplist' mangled-name='zfs_prune_proplist' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='4707' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prune_proplist'>
      <parameter type-id='type-id-102' name='zhp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='4707' column='1'/>
      <parameter type-id='type-id-24' name='props' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='4707' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <class-decl name='zprop_list' size-in-bits='448' is-struct='yes' visibility='default' filepath='../../include/libzfs.h' line='535' column='1' id='type-id-128'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='pl_prop' type-id='type-id-6' visibility='default' filepath='../../include/libzfs.h' line='536' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='pl_user_prop' type-id='type-id-23' visibility='default' filepath='../../include/libzfs.h' line='537' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='pl_next' type-id='type-id-129' visibility='default' filepath='../../include/libzfs.h' line='538' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='pl_all' type-id='type-id-5' visibility='default' filepath='../../include/libzfs.h' line='539' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='pl_width' type-id='type-id-43' visibility='default' filepath='../../include/libzfs.h' line='540' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='pl_recvd_width' type-id='type-id-43' visibility='default' filepath='../../include/libzfs.h' line='541' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='pl_fixed' type-id='type-id-5' visibility='default' filepath='../../include/libzfs.h' line='542' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-128' size-in-bits='64' id='type-id-129'/>
    <typedef-decl name='zprop_list_t' type-id='type-id-128' filepath='../../include/libzfs.h' line='543' column='1' id='type-id-130'/>
    <pointer-type-def type-id='type-id-130' size-in-bits='64' id='type-id-131'/>
    <pointer-type-def type-id='type-id-131' size-in-bits='64' id='type-id-132'/>
    <function-decl name='zfs_expand_proplist' mangled-name='zfs_expand_proplist' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='4610' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_expand_proplist'>
      <parameter type-id='type-id-102' name='zhp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='4610' column='1'/>
      <parameter type-id='type-id-132' name='plp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='4610' column='1'/>
      <parameter type-id='type-id-5' name='received' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='4610' column='1'/>
      <parameter type-id='type-id-5' name='literal' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='4611' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_get_user_props' mangled-name='zfs_get_user_props' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='4591' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_get_user_props'>
      <parameter type-id='type-id-102' name='zhp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='4591' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zfs_get_recvd_props' mangled-name='zfs_get_recvd_props' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='4582' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_get_recvd_props'>
      <parameter type-id='type-id-102' name='zhp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='4582' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zfs_get_all_props' mangled-name='zfs_get_all_props' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='4576' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_get_all_props'>
      <parameter type-id='type-id-102' name='zhp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='4591' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <class-decl name='renameflags' size-in-bits='32' is-struct='yes' visibility='default' filepath='../../include/libzfs.h' line='649' column='1' id='type-id-133'>
      <data-member access='public' layout-offset-in-bits='31'>
        <var-decl name='recursive' type-id='type-id-6' visibility='default' filepath='../../include/libzfs.h' line='651' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='30'>
        <var-decl name='nounmount' type-id='type-id-6' visibility='default' filepath='../../include/libzfs.h' line='654' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='29'>
        <var-decl name='forceunmount' type-id='type-id-6' visibility='default' filepath='../../include/libzfs.h' line='657' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='renameflags_t' type-id='type-id-133' filepath='../../include/libzfs.h' line='658' column='1' id='type-id-134'/>
    <function-decl name='zfs_rename' mangled-name='zfs_rename' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='4374' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_rename'>
      <parameter type-id='type-id-102' name='zhp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='4374' column='1'/>
      <parameter type-id='type-id-104' name='target' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='4374' column='1'/>
      <parameter type-id='type-id-134' name='flags' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='4374' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_rollback' mangled-name='zfs_rollback' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='4274' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_rollback'>
      <parameter type-id='type-id-102' name='zhp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='4274' column='1'/>
      <parameter type-id='type-id-102' name='snap' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='4274' column='1'/>
      <parameter type-id='type-id-5' name='force' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='4274' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_snapshot' mangled-name='zfs_snapshot' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='4173' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_snapshot'>
      <parameter type-id='type-id-17' name='hdl' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='4173' column='1'/>
      <parameter type-id='type-id-104' name='path' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='4173' column='1'/>
      <parameter type-id='type-id-5' name='recursive' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='4173' column='1'/>
      <parameter type-id='type-id-22' name='props' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='4174' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_snapshot_nvl' mangled-name='zfs_snapshot_nvl' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='4093' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_snapshot_nvl'>
      <parameter type-id='type-id-17' name='hdl' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='4093' column='1'/>
      <parameter type-id='type-id-22' name='snaps' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='4093' column='1'/>
      <parameter type-id='type-id-22' name='props' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='4093' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_promote' mangled-name='zfs_promote' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='4009' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_promote'>
      <parameter type-id='type-id-102' name='zhp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='4009' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_clone' mangled-name='zfs_clone' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='3923' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_clone'>
      <parameter type-id='type-id-102' name='zhp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='3923' column='1'/>
      <parameter type-id='type-id-104' name='target' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='3923' column='1'/>
      <parameter type-id='type-id-22' name='props' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='3923' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_destroy_snaps_nvl' mangled-name='zfs_destroy_snaps_nvl' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='3876' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_destroy_snaps_nvl'>
      <parameter type-id='type-id-17' name='hdl' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='3876' column='1'/>
      <parameter type-id='type-id-22' name='snaps' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='3876' column='1'/>
      <parameter type-id='type-id-5' name='defer' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='3876' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_destroy_snaps' mangled-name='zfs_destroy_snaps' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='3852' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_destroy_snaps'>
      <parameter type-id='type-id-102' name='zhp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='3852' column='1'/>
      <parameter type-id='type-id-23' name='snapname' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='3852' column='1'/>
      <parameter type-id='type-id-5' name='defer' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='3852' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_destroy' mangled-name='zfs_destroy' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='3784' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_destroy'>
      <parameter type-id='type-id-102' name='zhp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='3784' column='1'/>
      <parameter type-id='type-id-5' name='defer' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='3784' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_create' mangled-name='zfs_create' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='3609' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_create'>
      <parameter type-id='type-id-17' name='hdl' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='3609' column='1'/>
      <parameter type-id='type-id-104' name='path' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='3609' column='1'/>
      <parameter type-id='type-id-20' name='type' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='3609' column='1'/>
      <parameter type-id='type-id-22' name='props' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='3610' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_create_ancestors' mangled-name='zfs_create_ancestors' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='3572' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_create_ancestors'>
      <parameter type-id='type-id-17' name='hdl' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='3572' column='1'/>
      <parameter type-id='type-id-104' name='path' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='3572' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='create_parents' mangled-name='create_parents' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='3498' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='create_parents'>
      <parameter type-id='type-id-17' name='hdl' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='3498' column='1'/>
      <parameter type-id='type-id-23' name='target' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='3498' column='1'/>
      <parameter type-id='type-id-6' name='prefixlen' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='3498' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_parent_name' mangled-name='zfs_parent_name' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='3377' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_parent_name'>
      <parameter type-id='type-id-102' name='zhp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='3377' column='1'/>
      <parameter type-id='type-id-23' name='buf' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='3377' column='1'/>
      <parameter type-id='type-id-43' name='buflen' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='3377' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <qualified-type-def type-id='type-id-101' const='yes' id='type-id-135'/>
    <pointer-type-def type-id='type-id-135' size-in-bits='64' id='type-id-136'/>
    <function-decl name='zfs_get_type' mangled-name='zfs_get_type' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='3331' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_get_type'>
      <parameter type-id='type-id-136' name='zhp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='3331' column='1'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='zfs_get_pool_name' mangled-name='zfs_get_pool_name' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='3322' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_get_pool_name'>
      <parameter type-id='type-id-136' name='zhp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='3322' column='1'/>
      <return type-id='type-id-104'/>
    </function-decl>
    <function-decl name='zfs_get_name' mangled-name='zfs_get_name' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='3313' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_get_name'>
      <parameter type-id='type-id-136' name='zhp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='3322' column='1'/>
      <return type-id='type-id-104'/>
    </function-decl>
    <function-decl name='zfs_prop_get_written' mangled-name='zfs_prop_get_written' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='3288' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_get_written'>
      <parameter type-id='type-id-102' name='zhp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='3288' column='1'/>
      <parameter type-id='type-id-104' name='propname' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='3288' column='1'/>
      <parameter type-id='type-id-23' name='propbuf' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='3289' column='1'/>
      <parameter type-id='type-id-6' name='proplen' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='3289' column='1'/>
      <parameter type-id='type-id-5' name='literal' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='3289' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <pointer-type-def type-id='type-id-27' size-in-bits='64' id='type-id-137'/>
    <function-decl name='zfs_prop_get_written_int' mangled-name='zfs_prop_get_written_int' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='3253' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_get_written_int'>
      <parameter type-id='type-id-102' name='zhp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='3253' column='1'/>
      <parameter type-id='type-id-104' name='propname' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='3253' column='1'/>
      <parameter type-id='type-id-137' name='propvalue' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='3254' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_prop_get_userquota' mangled-name='zfs_prop_get_userquota' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='3217' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_get_userquota'>
      <parameter type-id='type-id-102' name='zhp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='3217' column='1'/>
      <parameter type-id='type-id-104' name='propname' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='3217' column='1'/>
      <parameter type-id='type-id-23' name='propbuf' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='3218' column='1'/>
      <parameter type-id='type-id-6' name='proplen' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='3218' column='1'/>
      <parameter type-id='type-id-5' name='literal' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='3218' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_prop_get_userquota_int' mangled-name='zfs_prop_get_userquota_int' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='3207' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_get_userquota_int'>
      <parameter type-id='type-id-102' name='zhp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='3207' column='1'/>
      <parameter type-id='type-id-104' name='propname' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='3207' column='1'/>
      <parameter type-id='type-id-137' name='propvalue' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='3208' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' filepath='../../include/sys/fs/zfs.h' line='259' column='1' id='type-id-138'>
      <underlying-type type-id='type-id-7'/>
      <enumerator name='ZPROP_SRC_NONE' value='1'/>
      <enumerator name='ZPROP_SRC_DEFAULT' value='2'/>
      <enumerator name='ZPROP_SRC_TEMPORARY' value='4'/>
      <enumerator name='ZPROP_SRC_LOCAL' value='8'/>
      <enumerator name='ZPROP_SRC_INHERITED' value='16'/>
      <enumerator name='ZPROP_SRC_RECEIVED' value='32'/>
    </enum-decl>
    <typedef-decl name='zprop_source_t' type-id='type-id-138' filepath='../../include/sys/fs/zfs.h' line='266' column='1' id='type-id-139'/>
    <pointer-type-def type-id='type-id-139' size-in-bits='64' id='type-id-140'/>
    <function-decl name='zfs_prop_get_numeric' mangled-name='zfs_prop_get_numeric' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='3003' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_get_numeric'>
      <parameter type-id='type-id-102' name='zhp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='3003' column='1'/>
      <parameter type-id='type-id-2' name='prop' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='3003' column='1'/>
      <parameter type-id='type-id-137' name='value' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='3003' column='1'/>
      <parameter type-id='type-id-140' name='src' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='3004' column='1'/>
      <parameter type-id='type-id-23' name='statbuf' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='3004' column='1'/>
      <parameter type-id='type-id-43' name='statlen' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='3004' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_prop_get_int' mangled-name='zfs_prop_get_int' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='2980' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_get_int'>
      <parameter type-id='type-id-102' name='zhp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='2980' column='1'/>
      <parameter type-id='type-id-2' name='prop' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='2980' column='1'/>
      <return type-id='type-id-27'/>
    </function-decl>
    <function-decl name='zfs_prop_get' mangled-name='zfs_prop_get' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='2605' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_get'>
      <parameter type-id='type-id-102' name='zhp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='2605' column='1'/>
      <parameter type-id='type-id-2' name='prop' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='2605' column='1'/>
      <parameter type-id='type-id-23' name='propbuf' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='2605' column='1'/>
      <parameter type-id='type-id-43' name='proplen' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='2605' column='1'/>
      <parameter type-id='type-id-140' name='src' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='2606' column='1'/>
      <parameter type-id='type-id-23' name='statbuf' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='2606' column='1'/>
      <parameter type-id='type-id-43' name='statlen' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='2606' column='1'/>
      <parameter type-id='type-id-5' name='literal' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='2606' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_get_clones_nvl' mangled-name='zfs_get_clones_nvl' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='2436' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_get_clones_nvl'>
      <parameter type-id='type-id-102' name='zhp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='2436' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zfs_prop_get_recvd' mangled-name='zfs_prop_get_recvd' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='2349' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_get_recvd'>
      <parameter type-id='type-id-102' name='zhp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='2349' column='1'/>
      <parameter type-id='type-id-104' name='propname' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='2349' column='1'/>
      <parameter type-id='type-id-23' name='propbuf' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='2349' column='1'/>
      <parameter type-id='type-id-43' name='proplen' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='2350' column='1'/>
      <parameter type-id='type-id-5' name='literal' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='2350' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_prop_inherit' mangled-name='zfs_prop_inherit' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='1927' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_inherit'>
      <parameter type-id='type-id-102' name='zhp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='1927' column='1'/>
      <parameter type-id='type-id-104' name='propname' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='1927' column='1'/>
      <parameter type-id='type-id-5' name='received' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='1927' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_prop_set_list' mangled-name='zfs_prop_set_list' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='1745' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_set_list'>
      <parameter type-id='type-id-102' name='zhp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='1745' column='1'/>
      <parameter type-id='type-id-22' name='props' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='1745' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_prop_set' mangled-name='zfs_prop_set' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='1714' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_set'>
      <parameter type-id='type-id-102' name='zhp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='1714' column='1'/>
      <parameter type-id='type-id-104' name='propname' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='1714' column='1'/>
      <parameter type-id='type-id-104' name='propval' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='1714' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_valid_proplist' mangled-name='zfs_valid_proplist' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='1005' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_valid_proplist'>
      <parameter type-id='type-id-17' name='hdl' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='1005' column='1'/>
      <parameter type-id='type-id-20' name='type' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='1005' column='1'/>
      <parameter type-id='type-id-22' name='nvl' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='1005' column='1'/>
      <parameter type-id='type-id-27' name='zoned' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='1006' column='1'/>
      <parameter type-id='type-id-102' name='zhp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='1006' column='1'/>
      <parameter type-id='type-id-18' name='zpool_hdl' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='1006' column='1'/>
      <parameter type-id='type-id-5' name='key_params_ok' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='1007' column='1'/>
      <parameter type-id='type-id-104' name='errbuf' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='1007' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <pointer-type-def type-id='type-id-6' size-in-bits='64' id='type-id-141'/>
    <function-decl name='zfs_spa_version' mangled-name='zfs_spa_version' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='968' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_spa_version'>
      <parameter type-id='type-id-102' name='zhp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='968' column='1'/>
      <parameter type-id='type-id-141' name='spa_version' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='968' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='libzfs_mnttab_remove' mangled-name='libzfs_mnttab_remove' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='948' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='libzfs_mnttab_remove'>
      <parameter type-id='type-id-17' name='hdl' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='948' column='1'/>
      <parameter type-id='type-id-104' name='fsname' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='948' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='libzfs_mnttab_add' mangled-name='libzfs_mnttab_add' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='918' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='libzfs_mnttab_add'>
      <parameter type-id='type-id-17' name='hdl' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='918' column='1'/>
      <parameter type-id='type-id-104' name='special' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='918' column='1'/>
      <parameter type-id='type-id-104' name='mountp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='919' column='1'/>
      <parameter type-id='type-id-104' name='mntopts' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='919' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='libzfs_mnttab_cache' mangled-name='libzfs_mnttab_cache' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='866' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='libzfs_mnttab_cache'>
      <parameter type-id='type-id-17' name='hdl' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='866' column='1'/>
      <parameter type-id='type-id-5' name='enable' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='866' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='libzfs_mnttab_fini' mangled-name='libzfs_mnttab_fini' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='848' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='libzfs_mnttab_fini'>
      <parameter type-id='type-id-17' name='hdl' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='848' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='libzfs_mnttab_init' mangled-name='libzfs_mnttab_init' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='801' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='libzfs_mnttab_init'>
      <parameter type-id='type-id-17' name='hdl' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='801' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='zfs_close' mangled-name='zfs_close' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='773' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_close'>
      <parameter type-id='type-id-102' name='zhp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='773' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='zfs_open' mangled-name='zfs_open' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='684' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_open'>
      <parameter type-id='type-id-17' name='hdl' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='684' column='1'/>
      <parameter type-id='type-id-104' name='path' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='684' column='1'/>
      <parameter type-id='type-id-6' name='types' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='684' column='1'/>
      <return type-id='type-id-102'/>
    </function-decl>
    <function-decl name='make_bookmark_handle' mangled-name='make_bookmark_handle' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='619' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='make_bookmark_handle'>
      <parameter type-id='type-id-102' name='parent' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='619' column='1'/>
      <parameter type-id='type-id-104' name='path' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='619' column='1'/>
      <parameter type-id='type-id-22' name='bmark_props' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='620' column='1'/>
      <return type-id='type-id-102'/>
    </function-decl>
    <function-decl name='zfs_bookmark_exists' mangled-name='zfs_bookmark_exists' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='588' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_bookmark_exists'>
      <parameter type-id='type-id-104' name='path' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='588' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='zfs_handle_dup' mangled-name='zfs_handle_dup' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='541' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_handle_dup'>
      <parameter type-id='type-id-102' name='zhp_orig' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='541' column='1'/>
      <return type-id='type-id-102'/>
    </function-decl>
    <class-decl name='zfs_cmd' size-in-bits='109952' is-struct='yes' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='477' column='1' id='type-id-142'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='zc_name' type-id='type-id-143' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='478' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32768'>
        <var-decl name='zc_nvlist_src' type-id='type-id-27' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='479' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32832'>
        <var-decl name='zc_nvlist_src_size' type-id='type-id-27' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='480' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32896'>
        <var-decl name='zc_nvlist_dst' type-id='type-id-27' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='481' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32960'>
        <var-decl name='zc_nvlist_dst_size' type-id='type-id-27' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='482' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='33024'>
        <var-decl name='zc_nvlist_dst_filled' type-id='type-id-5' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='483' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='33056'>
        <var-decl name='zc_pad2' type-id='type-id-6' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='484' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='33088'>
        <var-decl name='zc_history' type-id='type-id-27' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='490' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='33152'>
        <var-decl name='zc_value' type-id='type-id-144' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='491' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='98688'>
        <var-decl name='zc_string' type-id='type-id-19' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='492' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='100736'>
        <var-decl name='zc_guid' type-id='type-id-27' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='493' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='100800'>
        <var-decl name='zc_nvlist_conf' type-id='type-id-27' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='494' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='100864'>
        <var-decl name='zc_nvlist_conf_size' type-id='type-id-27' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='495' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='100928'>
        <var-decl name='zc_cookie' type-id='type-id-27' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='496' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='100992'>
        <var-decl name='zc_objset_type' type-id='type-id-27' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='497' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='101056'>
        <var-decl name='zc_perm_action' type-id='type-id-27' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='498' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='101120'>
        <var-decl name='zc_history_len' type-id='type-id-27' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='499' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='101184'>
        <var-decl name='zc_history_offset' type-id='type-id-27' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='500' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='101248'>
        <var-decl name='zc_obj' type-id='type-id-27' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='501' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='101312'>
        <var-decl name='zc_iflags' type-id='type-id-27' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='502' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='101376'>
        <var-decl name='zc_share' type-id='type-id-145' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='503' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='101632'>
        <var-decl name='zc_objset_stats' type-id='type-id-21' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='504' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='103936'>
        <var-decl name='zc_begin_record' type-id='type-id-146' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='505' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='106368'>
        <var-decl name='zc_inject_record' type-id='type-id-147' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='506' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109184'>
        <var-decl name='zc_defer_destroy' type-id='type-id-62' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='507' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109216'>
        <var-decl name='zc_flags' type-id='type-id-62' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='508' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109248'>
        <var-decl name='zc_action_handle' type-id='type-id-27' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='509' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109312'>
        <var-decl name='zc_cleanup_fd' type-id='type-id-6' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='510' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109344'>
        <var-decl name='zc_simple' type-id='type-id-98' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='511' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109352'>
        <var-decl name='zc_pad' type-id='type-id-148' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='512' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109376'>
        <var-decl name='zc_sendobj' type-id='type-id-27' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='513' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109440'>
        <var-decl name='zc_fromobj' type-id='type-id-27' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='514' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109504'>
        <var-decl name='zc_createtxg' type-id='type-id-27' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='515' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109568'>
        <var-decl name='zc_stat' type-id='type-id-149' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='516' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109888'>
        <var-decl name='zc_zoneid' type-id='type-id-27' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='517' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-45' size-in-bits='32768' id='type-id-143'>
      <subrange length='4096' type-id='type-id-48' id='type-id-150'/>

    </array-type-def>

    <array-type-def dimensions='1' type-id='type-id-45' size-in-bits='65536' id='type-id-144'>
      <subrange length='8192' type-id='type-id-48' id='type-id-151'/>

    </array-type-def>
    <class-decl name='zfs_share' size-in-bits='256' is-struct='yes' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='452' column='1' id='type-id-152'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='z_exportdata' type-id='type-id-27' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='453' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='z_sharedata' type-id='type-id-27' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='454' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='z_sharetype' type-id='type-id-27' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='455' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='z_sharemax' type-id='type-id-27' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='456' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='zfs_share_t' type-id='type-id-152' filepath='../../include/sys/zfs_ioctl.h' line='457' column='1' id='type-id-145'/>
    <class-decl name='drr_begin' size-in-bits='2432' is-struct='yes' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='231' column='1' id='type-id-146'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='drr_magic' type-id='type-id-27' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='232' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='drr_versioninfo' type-id='type-id-27' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='233' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='drr_creation_time' type-id='type-id-27' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='234' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='drr_type' type-id='type-id-97' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='235' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='drr_flags' type-id='type-id-62' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='236' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='drr_toguid' type-id='type-id-27' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='237' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='drr_fromguid' type-id='type-id-27' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='238' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='drr_toname' type-id='type-id-19' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='239' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='zinject_record' size-in-bits='2816' is-struct='yes' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='403' column='1' id='type-id-153'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='zi_objset' type-id='type-id-27' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='404' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='zi_object' type-id='type-id-27' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='405' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='zi_start' type-id='type-id-27' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='406' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='zi_end' type-id='type-id-27' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='407' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='zi_guid' type-id='type-id-27' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='408' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='zi_level' type-id='type-id-62' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='409' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='zi_error' type-id='type-id-62' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='410' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='zi_type' type-id='type-id-27' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='411' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='zi_freq' type-id='type-id-62' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='412' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='zi_failfast' type-id='type-id-62' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='413' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='zi_func' type-id='type-id-19' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='414' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2560'>
        <var-decl name='zi_iotype' type-id='type-id-62' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='415' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2592'>
        <var-decl name='zi_duration' type-id='type-id-61' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='416' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2624'>
        <var-decl name='zi_timer' type-id='type-id-27' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='417' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2688'>
        <var-decl name='zi_nlanes' type-id='type-id-27' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='418' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2752'>
        <var-decl name='zi_cmd' type-id='type-id-62' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='419' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2784'>
        <var-decl name='zi_dvas' type-id='type-id-62' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='420' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='zinject_record_t' type-id='type-id-153' filepath='../../include/sys/zfs_ioctl.h' line='421' column='1' id='type-id-147'/>

    <array-type-def dimensions='1' type-id='type-id-98' size-in-bits='24' id='type-id-148'>
      <subrange length='3' type-id='type-id-48' id='type-id-154'/>

    </array-type-def>
    <class-decl name='zfs_stat' size-in-bits='320' is-struct='yes' visibility='default' filepath='../../include/sys/zfs_stat.h' line='42' column='1' id='type-id-155'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='zs_gen' type-id='type-id-27' visibility='default' filepath='../../include/sys/zfs_stat.h' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='zs_mode' type-id='type-id-27' visibility='default' filepath='../../include/sys/zfs_stat.h' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='zs_links' type-id='type-id-27' visibility='default' filepath='../../include/sys/zfs_stat.h' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='zs_ctime' type-id='type-id-156' visibility='default' filepath='../../include/sys/zfs_stat.h' line='46' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-27' size-in-bits='128' id='type-id-156'>
      <subrange length='2' type-id='type-id-48' id='type-id-86'/>

    </array-type-def>
    <typedef-decl name='zfs_stat_t' type-id='type-id-155' filepath='../../include/sys/zfs_stat.h' line='47' column='1' id='type-id-149'/>
    <typedef-decl name='zfs_cmd_t' type-id='type-id-142' filepath='../../include/sys/zfs_ioctl.h' line='518' column='1' id='type-id-157'/>
    <pointer-type-def type-id='type-id-157' size-in-bits='64' id='type-id-158'/>
    <function-decl name='make_dataset_simple_handle_zc' mangled-name='make_dataset_simple_handle_zc' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='524' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='make_dataset_simple_handle_zc'>
      <parameter type-id='type-id-102' name='pzhp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='524' column='1'/>
      <parameter type-id='type-id-158' name='zc' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='524' column='1'/>
      <return type-id='type-id-102'/>
    </function-decl>
    <function-decl name='make_dataset_handle_zc' mangled-name='make_dataset_handle_zc' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='507' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='make_dataset_handle_zc'>
      <parameter type-id='type-id-17' name='hdl' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='507' column='1'/>
      <parameter type-id='type-id-158' name='zc' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='507' column='1'/>
      <return type-id='type-id-102'/>
    </function-decl>
    <function-decl name='make_dataset_handle' mangled-name='make_dataset_handle' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='478' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='make_dataset_handle'>
      <parameter type-id='type-id-17' name='hdl' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='478' column='1'/>
      <parameter type-id='type-id-104' name='path' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='478' column='1'/>
      <return type-id='type-id-102'/>
    </function-decl>
    <function-decl name='zfs_refresh_properties' mangled-name='zfs_refresh_properties' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='434' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_refresh_properties'>
      <parameter type-id='type-id-102' name='zhp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='434' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='zpool_free_handles' mangled-name='zpool_free_handles' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='313' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_free_handles'>
      <parameter type-id='type-id-17' name='hdl' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='313' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='zfs_name_valid' mangled-name='zfs_name_valid' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='222' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_name_valid'>
      <parameter type-id='type-id-104' name='name' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='222' column='1'/>
      <parameter type-id='type-id-20' name='type' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='222' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_validate_name' mangled-name='zfs_validate_name' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='106' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_validate_name'>
      <parameter type-id='type-id-17' name='hdl' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='106' column='1'/>
      <parameter type-id='type-id-104' name='path' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='106' column='1'/>
      <parameter type-id='type-id-6' name='type' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='106' column='1'/>
      <parameter type-id='type-id-5' name='modifying' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='107' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_type_to_name' mangled-name='zfs_type_to_name' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='80' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_type_to_name'>
      <parameter type-id='type-id-20' name='type' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='80' column='1'/>
      <return type-id='type-id-104'/>
    </function-decl>
    <class-decl name='mnttab' size-in-bits='256' is-struct='yes' visibility='default' filepath='../../lib/libspl/include/os/linux/sys/mnttab.h' line='49' column='1' id='type-id-159'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mnt_special' type-id='type-id-23' visibility='default' filepath='../../lib/libspl/include/os/linux/sys/mnttab.h' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='mnt_mountp' type-id='type-id-23' visibility='default' filepath='../../lib/libspl/include/os/linux/sys/mnttab.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='mnt_fstype' type-id='type-id-23' visibility='default' filepath='../../lib/libspl/include/os/linux/sys/mnttab.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='mnt_mntopts' type-id='type-id-23' visibility='default' filepath='../../lib/libspl/include/os/linux/sys/mnttab.h' line='53' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-159' size-in-bits='64' id='type-id-160'/>
    <function-decl name='libzfs_mnttab_find' mangled-name='libzfs_mnttab_find' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='872' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='libzfs_mnttab_find'>
      <parameter type-id='type-id-17' name='hdl' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='872' column='1'/>
      <parameter type-id='type-id-104' name='fsname' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='872' column='1'/>
      <parameter type-id='type-id-160' name='entry' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='873' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <pointer-type-def type-id='type-id-23' size-in-bits='64' id='type-id-161'/>
    <function-decl name='getprop_uint64' mangled-name='getprop_uint64' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='2038' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getprop_uint64'>
      <parameter type-id='type-id-102' name='zhp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='2038' column='1'/>
      <parameter type-id='type-id-2' name='prop' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='2038' column='1'/>
      <parameter type-id='type-id-161' name='source' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='2038' column='1'/>
      <return type-id='type-id-27'/>
    </function-decl>
    <function-decl name='zfs_dataset_exists' mangled-name='zfs_dataset_exists' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='3472' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_dataset_exists'>
      <parameter type-id='type-id-17' name='hdl' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='3472' column='1'/>
      <parameter type-id='type-id-104' name='path' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='3472' column='1'/>
      <parameter type-id='type-id-20' name='types' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_dataset.c' line='3472' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='lzc_wait_fs' mangled-name='lzc_wait_fs' filepath='../../include/libzfs_core.h' line='136' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='zfs_standard_error_fmt' mangled-name='zfs_standard_error_fmt' filepath='../../include/libzfs_impl.h' line='146' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='nvlist_lookup_nvlist_array' mangled-name='nvlist_lookup_nvlist_array' filepath='../../include/sys/nvpair.h' line='227' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='zpool_get_config' mangled-name='zpool_get_config' filepath='../../include/libzfs.h' line='411' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='strtol' mangled-name='strtol' filepath='/usr/include/stdlib.h' line='176' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='lzc_get_holds' mangled-name='lzc_get_holds' filepath='../../include/libzfs_core.h' line='75' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='nvlist_size' mangled-name='nvlist_size' filepath='../../include/sys/nvpair.h' line='153' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='nvlist_pack' mangled-name='nvlist_pack' filepath='../../include/sys/nvpair.h' line='154' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='nvlist_unpack' mangled-name='nvlist_unpack' filepath='../../include/sys/nvpair.h' line='155' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='strerror' mangled-name='strerror' filepath='/usr/include/string.h' line='396' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='nvlist_empty' mangled-name='nvlist_empty' filepath='../../include/sys/nvpair.h' line='239' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='lzc_release' mangled-name='lzc_release' filepath='../../include/libzfs_core.h' line='74' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='fnvlist_free' mangled-name='fnvlist_free' filepath='../../include/sys/nvpair.h' line='277' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='fnvpair_value_int32' mangled-name='fnvpair_value_int32' filepath='../../include/sys/nvpair.h' line='345' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='fnvlist_add_boolean' mangled-name='fnvlist_add_boolean' filepath='../../include/sys/nvpair.h' line='286' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='fnvlist_add_nvlist' mangled-name='fnvlist_add_nvlist' filepath='../../include/sys/nvpair.h' line='298' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='lzc_hold' mangled-name='lzc_hold' filepath='../../include/libzfs_core.h' line='73' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='ioctl' mangled-name='ioctl' filepath='/usr/include/x86_64-linux-gnu/sys/ioctl.h' line='41' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='nvlist_alloc' mangled-name='nvlist_alloc' filepath='../../include/sys/nvpair.h' line='151' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='zcmd_write_src_nvlist' mangled-name='zcmd_write_src_nvlist' filepath='../../include/libzfs_impl.h' line='177' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='nvpair_type' mangled-name='nvpair_type' filepath='../../include/sys/nvpair.h' line='245' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='nvlist_remove' mangled-name='nvlist_remove' filepath='../../include/sys/nvpair.h' line='198' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='zprop_expand_list' mangled-name='zprop_expand_list' filepath='../../include/libzfs_impl.h' line='156' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='changelist_gather' mangled-name='changelist_gather' filepath='../../include/libzfs_impl.h' line='188' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='changelist_haszonedchild' mangled-name='changelist_haszonedchild' filepath='../../include/libzfs_impl.h' line='190' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='changelist_prefix' mangled-name='changelist_prefix' filepath='../../include/libzfs_impl.h' line='183' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='changelist_rename' mangled-name='changelist_rename' filepath='../../include/libzfs_impl.h' line='185' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='changelist_postfix' mangled-name='changelist_postfix' filepath='../../include/libzfs_impl.h' line='184' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='changelist_free' mangled-name='changelist_free' filepath='../../include/libzfs_impl.h' line='187' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='zfs_iter_snapshots' mangled-name='zfs_iter_snapshots' filepath='../../include/libzfs.h' line='616' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='zfs_iter_bookmarks' mangled-name='zfs_iter_bookmarks' filepath='../../include/libzfs.h' line='621' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='lzc_rollback_to' mangled-name='lzc_rollback_to' filepath='../../include/libzfs_core.h' line='118' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='changelist_remove' mangled-name='changelist_remove' filepath='../../include/libzfs_impl.h' line='186' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='strcspn' mangled-name='strcspn' filepath='/usr/include/string.h' line='272' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='zpool_open' mangled-name='zpool_open' filepath='../../include/libzfs.h' line='234' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='zpool_close' mangled-name='zpool_close' filepath='../../include/libzfs.h' line='236' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='lzc_snapshot' mangled-name='lzc_snapshot' filepath='../../include/libzfs_core.h' line='52' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='lzc_promote' mangled-name='lzc_promote' filepath='../../include/libzfs_core.h' line='56' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='zfs_crypto_clone_check' mangled-name='zfs_crypto_clone_check' filepath='../../include/libzfs.h' line='528' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='lzc_clone' mangled-name='lzc_clone' filepath='../../include/libzfs_core.h' line='55' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='lzc_destroy_snaps' mangled-name='lzc_destroy_snaps' filepath='../../include/libzfs_core.h' line='57' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='lzc_destroy_bookmarks' mangled-name='lzc_destroy_bookmarks' filepath='../../include/libzfs_core.h' line='61' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='lzc_destroy' mangled-name='lzc_destroy' filepath='../../include/libzfs_core.h' line='121' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='zfs_prop_default_numeric' mangled-name='zfs_prop_default_numeric' filepath='../../include/libzfs.h' line='483' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='dataset_nestcheck' mangled-name='dataset_nestcheck' filepath='../../include/zfs_namecheck.h' line='62' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='zfs_crypto_create' mangled-name='zfs_crypto_create' filepath='../../include/libzfs.h' line='526' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='lzc_create' mangled-name='lzc_create' filepath='../../include/libzfs_core.h' line='53' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='strdup' mangled-name='strdup' filepath='/usr/include/string.h' line='166' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='zfs_share' mangled-name='zfs_share' filepath='../../include/libzfs.h' line='837' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='zfs_commit_all_shares' mangled-name='zfs_commit_all_shares' filepath='../../include/libzfs.h' line='859' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='strncpy' mangled-name='strncpy' filepath='/usr/include/string.h' line='124' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='strrchr' mangled-name='strrchr' filepath='/usr/include/string.h' line='252' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='zfs_nicebytes' mangled-name='zfs_nicebytes' filepath='../../include/libzutil.h' line='134' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='zfs_nicenum' mangled-name='zfs_nicenum' filepath='../../include/libzutil.h' line='135' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='zfs_prop_valid_for_type' mangled-name='zfs_prop_valid_for_type' filepath='../../include/sys/fs/zfs.h' line='320' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='zfs_error_fmt' mangled-name='zfs_error_fmt' filepath='../../include/libzfs_impl.h' line='137' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='localtime_r' mangled-name='localtime_r' filepath='/usr/include/time.h' line='133' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='strftime' mangled-name='strftime' filepath='/usr/include/time.h' line='88' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='zpool_get_prop' mangled-name='zpool_get_prop' filepath='../../include/libzfs.h' line='327' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='nvlist_lookup_uint64_array' mangled-name='nvlist_lookup_uint64_array' filepath='../../include/sys/nvpair.h' line='225' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='zfs_prop_get_type' mangled-name='zfs_prop_get_type' filepath='../../include/zfs_prop.h' line='91' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='zfs_prop_index_to_string' mangled-name='zfs_prop_index_to_string' filepath='../../include/sys/fs/zfs.h' line='317' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='zfs_prop_readonly' mangled-name='zfs_prop_readonly' filepath='../../include/sys/fs/zfs.h' line='306' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='abort' mangled-name='abort' filepath='/usr/include/stdlib.h' line='588' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='nvlist_lookup_int64' mangled-name='nvlist_lookup_int64' filepath='../../include/sys/nvpair.h' line='211' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='fprintf' mangled-name='fprintf' filepath='/usr/include/stdio.h' line='326' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='fnvlist_add_string' mangled-name='fnvlist_add_string' filepath='../../include/sys/nvpair.h' line='297' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='lzc_channel_program_nosync' mangled-name='lzc_channel_program_nosync' filepath='../../include/libzfs_core.h' line='125' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_nvlist' mangled-name='fnvlist_lookup_nvlist' filepath='../../include/sys/nvpair.h' line='329' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='strsep' mangled-name='strsep' filepath='/usr/include/string.h' line='439' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='nvlist_add_nvlist' mangled-name='nvlist_add_nvlist' filepath='../../include/sys/nvpair.h' line='180' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='hasmntopt' mangled-name='hasmntopt' filepath='/usr/include/mntent.h' line='89' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='zfs_prop_setonce' mangled-name='zfs_prop_setonce' filepath='../../include/sys/fs/zfs.h' line='309' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='zfs_prop_inheritable' mangled-name='zfs_prop_inheritable' filepath='../../include/sys/fs/zfs.h' line='308' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='zfs_prop_user' mangled-name='zfs_prop_user' filepath='../../include/sys/fs/zfs.h' line='314' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='zfs_setprop_error' mangled-name='zfs_setprop_error' filepath='../../include/libzfs_impl.h' line='147' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='fnvlist_add_uint64' mangled-name='fnvlist_add_uint64' filepath='../../include/sys/nvpair.h' line='296' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='fnvpair_value_uint64' mangled-name='fnvpair_value_uint64' filepath='../../include/sys/nvpair.h' line='350' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='nvpair_value_uint64' mangled-name='nvpair_value_uint64' filepath='../../include/sys/nvpair.h' line='256' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='asprintf' mangled-name='asprintf' filepath='/usr/include/stdio.h' line='372' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='nvlist_add_uint64_array' mangled-name='nvlist_add_uint64_array' filepath='../../include/sys/nvpair.h' line='190' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='nvpair_value_string' mangled-name='nvpair_value_string' filepath='../../include/sys/nvpair.h' line='257' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='zfs_nicestrtonum' mangled-name='zfs_nicestrtonum' filepath='../../include/libzfs.h' line='862' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='zpool_prop_get_feature' mangled-name='zpool_prop_get_feature' filepath='../../include/libzfs.h' line='563' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='mountpoint_namecheck' mangled-name='mountpoint_namecheck' filepath='../../include/zfs_namecheck.h' line='63' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='zfs_parse_options' mangled-name='zfs_parse_options' filepath='../../include/libzfs_impl.h' line='209' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='zfs_prop_encryption_key_param' mangled-name='zfs_prop_encryption_key_param' filepath='../../include/sys/fs/zfs.h' line='310' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='zprop_parse_value' mangled-name='zprop_parse_value' filepath='../../include/libzfs_impl.h' line='154' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='zfs_prop_userquota' mangled-name='zfs_prop_userquota' filepath='../../include/sys/fs/zfs.h' line='315' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='zfs_prop_written' mangled-name='zfs_prop_written' filepath='../../include/sys/fs/zfs.h' line='316' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='zfs_prop_valid_keylocation' mangled-name='zfs_prop_valid_keylocation' filepath='../../include/sys/fs/zfs.h' line='311' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='pthread_mutex_lock' mangled-name='pthread_mutex_lock' filepath='/usr/include/pthread.h' line='763' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='avl_find' mangled-name='avl_find' filepath='../../include/sys/avl.h' line='175' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='avl_remove' mangled-name='avl_remove' filepath='../../include/sys/avl.h' line='260' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='pthread_mutex_unlock' mangled-name='pthread_mutex_unlock' filepath='/usr/include/pthread.h' line='774' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='avl_numnodes' mangled-name='avl_numnodes' filepath='../../include/sys/avl.h' line='281' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='avl_add' mangled-name='avl_add' filepath='../../include/sys/avl.h' line='252' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='avl_destroy_nodes' mangled-name='avl_destroy_nodes' filepath='../../include/sys/avl.h' line='309' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='avl_destroy' mangled-name='avl_destroy' filepath='../../include/sys/avl.h' line='317' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='pthread_mutex_destroy' mangled-name='pthread_mutex_destroy' filepath='/usr/include/pthread.h' line='755' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='pthread_mutex_init' mangled-name='pthread_mutex_init' filepath='/usr/include/pthread.h' line='750' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='avl_create' mangled-name='avl_create' filepath='../../include/sys/avl.h' line='163' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='lzc_get_bookmarks' mangled-name='lzc_get_bookmarks' filepath='../../include/libzfs_core.h' line='59' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='zpool_get_name' mangled-name='zpool_get_name' filepath='../../include/libzfs.h' line='237' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='zpool_open_canfail' mangled-name='zpool_open_canfail' filepath='../../include/libzfs.h' line='235' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='zpool_name_valid' mangled-name='zpool_name_valid' filepath='../../include/libzfs_impl.h' line='202' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='entity_namecheck' mangled-name='entity_namecheck' filepath='../../include/zfs_namecheck.h' line='58' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='strtoul' mangled-name='strtoul' filepath='/usr/include/stdlib.h' line='180' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='getgrnam' mangled-name='getgrnam' filepath='/usr/include/grp.h' line='107' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='getpwnam' mangled-name='getpwnam' filepath='/usr/include/pwd.h' line='116' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='zfs_prop_default_string' mangled-name='zfs_prop_default_string' filepath='../../include/libzfs.h' line='482' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_string' mangled-name='fnvlist_lookup_string' filepath='../../include/sys/nvpair.h' line='328' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='strstr' mangled-name='strstr' filepath='/usr/include/string.h' line='329' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='lzc_exists' mangled-name='lzc_exists' filepath='../../include/libzfs_core.h' line='115' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='nvlist_add_boolean' mangled-name='nvlist_add_boolean' filepath='../../include/sys/nvpair.h' line='168' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='freopen' mangled-name='freopen64' filepath='/usr/include/stdio.h' line='260' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='getmntany' mangled-name='getmntany' filepath='../../lib/libspl/include/os/linux/sys/mnttab.h' line='73' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='_sol_getmntent' mangled-name='_sol_getmntent' filepath='../../lib/libspl/include/os/linux/sys/mnttab.h' line='74' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='nvlist_remove_all' mangled-name='nvlist_remove_all' filepath='../../include/sys/nvpair.h' line='199' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-125'>
      <parameter type-id='type-id-42'/>
      <parameter type-id='type-id-104'/>
      <parameter type-id='type-id-124'/>
      <parameter type-id='type-id-27'/>
      <return type-id='type-id-6'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='libzfs_diff.c' comp-dir-path='/home/colm/src/zfs/zfs/lib/libzfs' language='LANG_C99'>
    <function-decl name='zfs_show_diffs' mangled-name='zfs_show_diffs' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_diff.c' line='716' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_show_diffs'>
      <parameter type-id='type-id-102' name='zhp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_diff.c' line='716' column='1'/>
      <parameter type-id='type-id-6' name='outfd' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_diff.c' line='716' column='1'/>
      <parameter type-id='type-id-104' name='fromsnap' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_diff.c' line='716' column='1'/>
      <parameter type-id='type-id-104' name='tosnap' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_diff.c' line='717' column='1'/>
      <parameter type-id='type-id-6' name='flags' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_diff.c' line='717' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_asprintf' mangled-name='zfs_asprintf' filepath='../../include/libzfs_impl.h' line='141' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='zfs_validate_name' mangled-name='zfs_validate_name' filepath='../../include/libzfs_impl.h' line='204' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='find_shares_object' mangled-name='find_shares_object' filepath='../../include/libzfs_impl.h' line='258' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='pipe' mangled-name='pipe' filepath='/usr/include/unistd.h' line='417' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='pthread_create' mangled-name='pthread_create' filepath='/usr/include/pthread.h' line='234' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='pthread_join' mangled-name='pthread_join' filepath='/usr/include/pthread.h' line='251' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='pthread_cancel' mangled-name='pthread_cancel' filepath='/usr/include/pthread.h' line='514' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='fdopen' mangled-name='fdopen' filepath='/usr/include/stdio.h' line='279' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='__builtin_fwrite' mangled-name='fwrite' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='is_mounted' mangled-name='is_mounted' filepath='../../include/libzfs.h' line='819' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='libzfs_import.c' comp-dir-path='/home/colm/src/zfs/zfs/lib/libzfs' language='LANG_C99'>
    <class-decl name='pool_config_ops' size-in-bits='128' is-struct='yes' visibility='default' filepath='../../include/libzutil.h' line='51' column='1' id='type-id-162'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='pco_refresh_config' type-id='type-id-163' visibility='default' filepath='../../include/libzutil.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='pco_pool_active' type-id='type-id-164' visibility='default' filepath='../../include/libzutil.h' line='53' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='refresh_config_func_t' type-id='type-id-165' filepath='../../include/libzutil.h' line='47' column='1' id='type-id-166'/>
    <pointer-type-def type-id='type-id-166' size-in-bits='64' id='type-id-163'/>
    <typedef-decl name='pool_active_func_t' type-id='type-id-167' filepath='../../include/libzutil.h' line='49' column='1' id='type-id-168'/>
    <pointer-type-def type-id='type-id-168' size-in-bits='64' id='type-id-164'/>
    <qualified-type-def type-id='type-id-162' const='yes' id='type-id-169'/>
    <typedef-decl name='pool_config_ops_t' type-id='type-id-169' filepath='../../include/libzutil.h' line='54' column='1' id='type-id-170'/>
    <var-decl name='libzfs_config_ops' type-id='type-id-170' mangled-name='libzfs_config_ops' visibility='default' filepath='../../include/libzutil.h' line='59' column='1' elf-symbol-id='libzfs_config_ops'/>
    <enum-decl name='pool_state' filepath='../../include/sys/fs/zfs.h' line='906' column='1' id='type-id-171'>
      <underlying-type type-id='type-id-7'/>
      <enumerator name='POOL_STATE_ACTIVE' value='0'/>
      <enumerator name='POOL_STATE_EXPORTED' value='1'/>
      <enumerator name='POOL_STATE_DESTROYED' value='2'/>
      <enumerator name='POOL_STATE_SPARE' value='3'/>
      <enumerator name='POOL_STATE_L2CACHE' value='4'/>
      <enumerator name='POOL_STATE_UNINITIALIZED' value='5'/>
      <enumerator name='POOL_STATE_UNAVAIL' value='6'/>
      <enumerator name='POOL_STATE_POTENTIALLY_ACTIVE' value='7'/>
    </enum-decl>
    <typedef-decl name='pool_state_t' type-id='type-id-171' filepath='../../include/sys/fs/zfs.h' line='915' column='1' id='type-id-172'/>
    <pointer-type-def type-id='type-id-172' size-in-bits='64' id='type-id-173'/>
    <function-decl name='zpool_in_use' mangled-name='zpool_in_use' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_import.c' line='300' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_in_use'>
      <parameter type-id='type-id-17' name='hdl' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_import.c' line='300' column='1'/>
      <parameter type-id='type-id-6' name='fd' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_import.c' line='300' column='1'/>
      <parameter type-id='type-id-173' name='state' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_import.c' line='300' column='1'/>
      <parameter type-id='type-id-161' name='namestr' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_import.c' line='300' column='1'/>
      <parameter type-id='type-id-114' name='inuse' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_import.c' line='301' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zpool_clear_label' mangled-name='zpool_clear_label' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_import.c' line='144' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_clear_label'>
      <parameter type-id='type-id-6' name='fd' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_import.c' line='144' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zpool_read_label' mangled-name='zpool_read_label' filepath='../../include/libzutil.h' line='79' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='zpool_iter' mangled-name='zpool_iter' filepath='../../include/libzfs.h' line='247' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='pread64' mangled-name='pread64' filepath='/usr/include/unistd.h' line='404' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='pwrite64' mangled-name='pwrite64' filepath='/usr/include/unistd.h' line='408' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='__fxstat64' mangled-name='__fxstat64' filepath='/usr/include/x86_64-linux-gnu/sys/stat.h' line='428' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='zcmd_write_conf_nvlist' mangled-name='zcmd_write_conf_nvlist' filepath='../../include/libzfs_impl.h' line='178' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-167'>
      <parameter type-id='type-id-42'/>
      <parameter type-id='type-id-104'/>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-114'/>
      <return type-id='type-id-6'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-165'>
      <parameter type-id='type-id-42'/>
      <parameter type-id='type-id-22'/>
      <return type-id='type-id-22'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='libzfs_iter.c' comp-dir-path='/home/colm/src/zfs/zfs/lib/libzfs' language='LANG_C99'>
    <function-decl name='zfs_iter_mounted' mangled-name='zfs_iter_mounted' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_iter.c' line='559' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_iter_mounted'>
      <parameter type-id='type-id-102' name='zhp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_iter.c' line='559' column='1'/>
      <parameter type-id='type-id-110' name='func' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_iter.c' line='559' column='1'/>
      <parameter type-id='type-id-42' name='data' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_iter.c' line='559' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_iter_dependents' mangled-name='zfs_iter_dependents' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_iter.c' line='543' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_iter_dependents'>
      <parameter type-id='type-id-102' name='zhp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_iter.c' line='543' column='1'/>
      <parameter type-id='type-id-5' name='allowrecursion' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_iter.c' line='543' column='1'/>
      <parameter type-id='type-id-110' name='func' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_iter.c' line='544' column='1'/>
      <parameter type-id='type-id-42' name='data' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_iter.c' line='544' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_iter_children' mangled-name='zfs_iter_children' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_iter.c' line='460' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_iter_children'>
      <parameter type-id='type-id-102' name='zhp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_iter.c' line='460' column='1'/>
      <parameter type-id='type-id-110' name='func' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_iter.c' line='460' column='1'/>
      <parameter type-id='type-id-42' name='data' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_iter.c' line='460' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_iter_snapspec' mangled-name='zfs_iter_snapspec' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_iter.c' line='383' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_iter_snapspec'>
      <parameter type-id='type-id-102' name='fs_zhp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_iter.c' line='383' column='1'/>
      <parameter type-id='type-id-104' name='spec_orig' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_iter.c' line='383' column='1'/>
      <parameter type-id='type-id-110' name='func' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_iter.c' line='384' column='1'/>
      <parameter type-id='type-id-42' name='arg' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_iter.c' line='384' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_iter_snapshots_sorted' mangled-name='zfs_iter_snapshots_sorted' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_iter.c' line='309' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_iter_snapshots_sorted'>
      <parameter type-id='type-id-102' name='zhp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_iter.c' line='309' column='1'/>
      <parameter type-id='type-id-110' name='callback' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_iter.c' line='309' column='1'/>
      <parameter type-id='type-id-42' name='data' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_iter.c' line='309' column='1'/>
      <parameter type-id='type-id-27' name='min_txg' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_iter.c' line='310' column='1'/>
      <parameter type-id='type-id-27' name='max_txg' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_iter.c' line='310' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_iter_bookmarks' mangled-name='zfs_iter_bookmarks' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_iter.c' line='202' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_iter_bookmarks'>
      <parameter type-id='type-id-102' name='zhp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_iter.c' line='202' column='1'/>
      <parameter type-id='type-id-110' name='func' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_iter.c' line='202' column='1'/>
      <parameter type-id='type-id-42' name='data' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_iter.c' line='202' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_iter_snapshots' mangled-name='zfs_iter_snapshots' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_iter.c' line='143' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_iter_snapshots'>
      <parameter type-id='type-id-102' name='zhp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_iter.c' line='143' column='1'/>
      <parameter type-id='type-id-5' name='simple' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_iter.c' line='143' column='1'/>
      <parameter type-id='type-id-110' name='func' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_iter.c' line='143' column='1'/>
      <parameter type-id='type-id-42' name='data' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_iter.c' line='144' column='1'/>
      <parameter type-id='type-id-27' name='min_txg' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_iter.c' line='144' column='1'/>
      <parameter type-id='type-id-27' name='max_txg' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_iter.c' line='144' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_iter_filesystems' mangled-name='zfs_iter_filesystems' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_iter.c' line='107' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_iter_filesystems'>
      <parameter type-id='type-id-102' name='zhp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_iter.c' line='107' column='1'/>
      <parameter type-id='type-id-110' name='func' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_iter.c' line='107' column='1'/>
      <parameter type-id='type-id-42' name='data' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_iter.c' line='107' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_get_clones_nvl' mangled-name='zfs_get_clones_nvl' filepath='../../include/libzfs.h' line='517' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='zfs_dataset_exists' mangled-name='zfs_dataset_exists' filepath='../../include/libzfs.h' line='811' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='avl_first' mangled-name='avl_first' filepath='../../include/sys/avl.h' line='205' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='avl_walk' mangled-name='avl_walk' filepath='../../include/sys/avl_impl.h' line='158' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='make_bookmark_handle' mangled-name='make_bookmark_handle' filepath='../../include/libzfs_impl.h' line='197' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='fnvpair_value_nvlist' mangled-name='fnvpair_value_nvlist' filepath='../../include/sys/nvpair.h' line='352' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='zfs_get_type' mangled-name='zfs_get_type' filepath='../../include/libzfs.h' line='469' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='make_dataset_simple_handle_zc' mangled-name='make_dataset_simple_handle_zc' filepath='../../include/libzfs_impl.h' line='152' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='make_dataset_handle_zc' mangled-name='make_dataset_handle_zc' filepath='../../include/libzfs_impl.h' line='151' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='libzfs_mount.c' comp-dir-path='/home/colm/src/zfs/zfs/lib/libzfs' language='LANG_C99'>
    <class-decl name='__anonymous_struct__' size-in-bits='192' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-174' visibility='default' filepath='../../include/libzfs_impl.h' line='214' column='1' id='type-id-175'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='p_prop' type-id='type-id-2' visibility='default' filepath='../../include/libzfs_impl.h' line='215' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='p_name' type-id='type-id-23' visibility='default' filepath='../../include/libzfs_impl.h' line='216' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='p_share_err' type-id='type-id-6' visibility='default' filepath='../../include/libzfs_impl.h' line='217' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='p_unshare_err' type-id='type-id-6' visibility='default' filepath='../../include/libzfs_impl.h' line='218' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='proto_table_t' type-id='type-id-175' filepath='../../include/libzfs_impl.h' line='219' column='1' id='type-id-174'/>

    <array-type-def dimensions='1' type-id='type-id-174' size-in-bits='384' id='type-id-176'>
      <subrange length='2' type-id='type-id-48' id='type-id-86'/>

    </array-type-def>
    <var-decl name='proto_table' type-id='type-id-176' mangled-name='proto_table' visibility='default' filepath='../../include/libzfs_impl.h' line='242' column='1' elf-symbol-id='proto_table'/>

    <array-type-def dimensions='1' type-id='type-id-106' size-in-bits='64' alignment-in-bits='32' id='type-id-177'>
      <subrange length='2' type-id='type-id-48' id='type-id-86'/>

    </array-type-def>
    <var-decl name='nfs_only' type-id='type-id-177' mangled-name='nfs_only' visibility='default' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_mount.c' line='110' column='1' elf-symbol-id='nfs_only'/>
    <var-decl name='smb_only' type-id='type-id-177' mangled-name='smb_only' visibility='default' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_mount.c' line='115' column='1' elf-symbol-id='smb_only'/>

    <array-type-def dimensions='1' type-id='type-id-106' size-in-bits='96' alignment-in-bits='32' id='type-id-178'>
      <subrange length='3' type-id='type-id-48' id='type-id-154'/>

    </array-type-def>
    <var-decl name='share_all_proto' type-id='type-id-178' mangled-name='share_all_proto' visibility='default' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_mount.c' line='119' column='1' elf-symbol-id='share_all_proto'/>
    <function-decl name='zpool_disable_datasets' mangled-name='zpool_unmount_datasets' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_mount.c' line='1484' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_unmount_datasets'>
      <parameter type-id='type-id-18' name='zhp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_mount.c' line='1484' column='1'/>
      <parameter type-id='type-id-5' name='force' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_mount.c' line='1484' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zpool_enable_datasets' mangled-name='zpool_enable_datasets' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_mount.c' line='1414' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_enable_datasets'>
      <parameter type-id='type-id-18' name='zhp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_mount.c' line='1414' column='1'/>
      <parameter type-id='type-id-104' name='mntopts' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_mount.c' line='1414' column='1'/>
      <parameter type-id='type-id-6' name='flags' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_mount.c' line='1414' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <pointer-type-def type-id='type-id-102' size-in-bits='64' id='type-id-179'/>
    <function-decl name='zfs_foreach_mountpoint' mangled-name='zfs_foreach_mountpoint' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_mount.c' line='1353' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_foreach_mountpoint'>
      <parameter type-id='type-id-17' name='hdl' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_mount.c' line='1353' column='1'/>
      <parameter type-id='type-id-179' name='handles' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_mount.c' line='1353' column='1'/>
      <parameter type-id='type-id-43' name='num_handles' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_mount.c' line='1354' column='1'/>
      <parameter type-id='type-id-110' name='func' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_mount.c' line='1354' column='1'/>
      <parameter type-id='type-id-42' name='data' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_mount.c' line='1354' column='1'/>
      <parameter type-id='type-id-5' name='parallel' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_mount.c' line='1354' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <class-decl name='get_all_cb' size-in-bits='192' is-struct='yes' visibility='default' filepath='../../include/libzfs.h' line='624' column='1' id='type-id-180'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cb_handles' type-id='type-id-179' visibility='default' filepath='../../include/libzfs.h' line='625' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='cb_alloc' type-id='type-id-43' visibility='default' filepath='../../include/libzfs.h' line='626' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='cb_used' type-id='type-id-43' visibility='default' filepath='../../include/libzfs.h' line='627' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='get_all_cb_t' type-id='type-id-180' filepath='../../include/libzfs.h' line='628' column='1' id='type-id-181'/>
    <pointer-type-def type-id='type-id-181' size-in-bits='64' id='type-id-182'/>
    <function-decl name='libzfs_add_handle' mangled-name='libzfs_add_handle' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_mount.c' line='1031' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='libzfs_add_handle'>
      <parameter type-id='type-id-182' name='cbp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_mount.c' line='1031' column='1'/>
      <parameter type-id='type-id-102' name='zhp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_mount.c' line='1031' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='remove_mountpoint' mangled-name='remove_mountpoint' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_mount.c' line='1005' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='remove_mountpoint'>
      <parameter type-id='type-id-102' name='zhp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_mount.c' line='1005' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='zfs_unshareall_bytype' mangled-name='zfs_unshareall_bytype' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_mount.c' line='980' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_unshareall_bytype'>
      <parameter type-id='type-id-102' name='zhp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_mount.c' line='980' column='1'/>
      <parameter type-id='type-id-104' name='mountpoint' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_mount.c' line='980' column='1'/>
      <parameter type-id='type-id-104' name='proto' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_mount.c' line='981' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_unshareall_bypath' mangled-name='zfs_unshareall_bypath' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_mount.c' line='974' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_unshareall_bypath'>
      <parameter type-id='type-id-102' name='zhp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_mount.c' line='974' column='1'/>
      <parameter type-id='type-id-104' name='mountpoint' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_mount.c' line='974' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_unshareall' mangled-name='zfs_unshareall' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_mount.c' line='968' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_unshareall'>
      <parameter type-id='type-id-102' name='zhp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_mount.c' line='968' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_unshareall_smb' mangled-name='zfs_unshareall_smb' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_mount.c' line='962' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_unshareall_smb'>
      <parameter type-id='type-id-102' name='zhp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_mount.c' line='968' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_unshareall_nfs' mangled-name='zfs_unshareall_nfs' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_mount.c' line='956' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_unshareall_nfs'>
      <parameter type-id='type-id-102' name='zhp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_mount.c' line='968' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_unshare_smb' mangled-name='zfs_unshare_smb' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_mount.c' line='931' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_unshare_smb'>
      <parameter type-id='type-id-102' name='zhp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_mount.c' line='974' column='1'/>
      <parameter type-id='type-id-104' name='mountpoint' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_mount.c' line='974' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_unshare_nfs' mangled-name='zfs_unshare_nfs' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_mount.c' line='925' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_unshare_nfs'>
      <parameter type-id='type-id-102' name='zhp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_mount.c' line='974' column='1'/>
      <parameter type-id='type-id-104' name='mountpoint' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_mount.c' line='974' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_unshare_proto' mangled-name='zfs_unshare_proto' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_mount.c' line='887' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_unshare_proto'>
      <parameter type-id='type-id-102' name='zhp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_mount.c' line='887' column='1'/>
      <parameter type-id='type-id-104' name='mountpoint' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_mount.c' line='887' column='1'/>
      <parameter type-id='type-id-107' name='proto' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_mount.c' line='888' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_share_smb' mangled-name='zfs_share_smb' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_mount.c' line='872' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_share_smb'>
      <parameter type-id='type-id-102' name='zhp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_mount.c' line='968' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_share_nfs' mangled-name='zfs_share_nfs' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_mount.c' line='866' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_share_nfs'>
      <parameter type-id='type-id-102' name='zhp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_mount.c' line='968' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_commit_shares' mangled-name='zfs_commit_shares' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_mount.c' line='855' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_commit_shares'>
      <parameter type-id='type-id-104' name='proto' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_mount.c' line='855' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='zfs_commit_proto' mangled-name='zfs_commit_proto' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_mount.c' line='828' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_commit_proto'>
      <parameter type-id='type-id-107' name='proto' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_mount.c' line='828' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='zfs_parse_options' mangled-name='zfs_parse_options' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_mount.c' line='822' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_parse_options'>
      <parameter type-id='type-id-23' name='options' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_mount.c' line='822' column='1'/>
      <parameter type-id='type-id-106' name='proto' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_mount.c' line='822' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_is_shared_smb' mangled-name='zfs_is_shared_smb' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_mount.c' line='809' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_is_shared_smb'>
      <parameter type-id='type-id-102' name='zhp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_mount.c' line='809' column='1'/>
      <parameter type-id='type-id-161' name='where' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_mount.c' line='809' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='zfs_is_shared_nfs' mangled-name='zfs_is_shared_nfs' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_mount.c' line='802' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_is_shared_nfs'>
      <parameter type-id='type-id-102' name='zhp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_mount.c' line='809' column='1'/>
      <parameter type-id='type-id-161' name='where' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_mount.c' line='809' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' filepath='../../include/libzfs_impl.h' line='120' column='1' id='type-id-183'>
      <underlying-type type-id='type-id-7'/>
      <enumerator name='SHARED_NOT_SHARED' value='0'/>
      <enumerator name='SHARED_NFS' value='2'/>
      <enumerator name='SHARED_SMB' value='4'/>
    </enum-decl>
    <typedef-decl name='zfs_share_type_t' type-id='type-id-183' filepath='../../include/libzfs_impl.h' line='124' column='1' id='type-id-184'/>
    <function-decl name='zfs_is_shared_proto' mangled-name='zfs_is_shared_proto' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_mount.c' line='780' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_is_shared_proto'>
      <parameter type-id='type-id-102' name='zhp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_mount.c' line='780' column='1'/>
      <parameter type-id='type-id-161' name='where' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_mount.c' line='780' column='1'/>
      <parameter type-id='type-id-106' name='proto' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_mount.c' line='780' column='1'/>
      <return type-id='type-id-184'/>
    </function-decl>
    <function-decl name='zfs_unshare' mangled-name='zfs_unshare' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_mount.c' line='770' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_unshare'>
      <parameter type-id='type-id-102' name='zhp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_mount.c' line='968' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_share' mangled-name='zfs_share' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_mount.c' line='763' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_share'>
      <parameter type-id='type-id-102' name='zhp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_mount.c' line='968' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_share_proto' mangled-name='zfs_share_proto' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_mount.c' line='718' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_share_proto'>
      <parameter type-id='type-id-102' name='zhp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_mount.c' line='718' column='1'/>
      <parameter type-id='type-id-107' name='proto' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_mount.c' line='718' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='unshare_one' mangled-name='unshare_one' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_mount.c' line='678' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='unshare_one'>
      <parameter type-id='type-id-17' name='hdl' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_mount.c' line='678' column='1'/>
      <parameter type-id='type-id-104' name='name' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_mount.c' line='678' column='1'/>
      <parameter type-id='type-id-104' name='mountpoint' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_mount.c' line='678' column='1'/>
      <parameter type-id='type-id-106' name='proto' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_mount.c' line='679' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_is_shared' mangled-name='zfs_is_shared' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_mount.c' line='659' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_is_shared'>
      <parameter type-id='type-id-102' name='zhp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_mount.c' line='659' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='zfs_unmountall' mangled-name='zfs_unmountall' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_mount.c' line='642' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_unmountall'>
      <parameter type-id='type-id-102' name='zhp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_mount.c' line='642' column='1'/>
      <parameter type-id='type-id-6' name='flags' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_mount.c' line='642' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_unmount' mangled-name='zfs_unmount' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_mount.c' line='568' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_unmount'>
      <parameter type-id='type-id-102' name='zhp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_mount.c' line='568' column='1'/>
      <parameter type-id='type-id-104' name='mountpoint' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_mount.c' line='568' column='1'/>
      <parameter type-id='type-id-6' name='flags' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_mount.c' line='568' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_mount_at' mangled-name='zfs_mount_at' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_mount.c' line='382' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_mount_at'>
      <parameter type-id='type-id-102' name='zhp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_mount.c' line='382' column='1'/>
      <parameter type-id='type-id-104' name='options' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_mount.c' line='382' column='1'/>
      <parameter type-id='type-id-6' name='flags' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_mount.c' line='382' column='1'/>
      <parameter type-id='type-id-104' name='mountpoint' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_mount.c' line='383' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_mount' mangled-name='zfs_mount' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_mount.c' line='367' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_mount'>
      <parameter type-id='type-id-102' name='zhp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_mount.c' line='367' column='1'/>
      <parameter type-id='type-id-104' name='options' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_mount.c' line='367' column='1'/>
      <parameter type-id='type-id-6' name='flags' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_mount.c' line='367' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_is_mounted' mangled-name='zfs_is_mounted' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_mount.c' line='238' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_is_mounted'>
      <parameter type-id='type-id-102' name='zhp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_mount.c' line='238' column='1'/>
      <parameter type-id='type-id-161' name='where' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_mount.c' line='238' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='is_mounted' mangled-name='is_mounted' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_mount.c' line='224' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='is_mounted'>
      <parameter type-id='type-id-17' name='zfs_hdl' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_mount.c' line='224' column='1'/>
      <parameter type-id='type-id-104' name='special' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_mount.c' line='224' column='1'/>
      <parameter type-id='type-id-161' name='where' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_mount.c' line='224' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='zfs_is_mountable' mangled-name='zfs_is_mountable' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_mount.c' line='265' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_is_mountable'>
      <parameter type-id='type-id-102' name='zhp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_mount.c' line='265' column='1'/>
      <parameter type-id='type-id-23' name='buf' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_mount.c' line='265' column='1'/>
      <parameter type-id='type-id-43' name='buflen' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_mount.c' line='265' column='1'/>
      <parameter type-id='type-id-140' name='source' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_mount.c' line='266' column='1'/>
      <parameter type-id='type-id-6' name='flags' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_mount.c' line='266' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='is_shared' mangled-name='is_shared' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_mount.c' line='697' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='is_shared'>
      <parameter type-id='type-id-104' name='mountpoint' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_mount.c' line='697' column='1'/>
      <parameter type-id='type-id-106' name='proto' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_mount.c' line='697' column='1'/>
      <return type-id='type-id-184'/>
    </function-decl>
    <function-decl name='zfs_realloc' mangled-name='zfs_realloc' filepath='../../include/libzfs_impl.h' line='140' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='do_unmount' mangled-name='do_unmount' filepath='../../include/libzfs_impl.h' line='246' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='qsort' mangled-name='qsort' filepath='/usr/include/stdlib.h' line='827' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='tpool_dispatch' mangled-name='tpool_dispatch' filepath='../../include/thread_pool.h' line='44' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='tpool_create' mangled-name='tpool_create' filepath='../../include/thread_pool.h' line='42' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='tpool_wait' mangled-name='tpool_wait' filepath='../../include/thread_pool.h' line='48' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='tpool_destroy' mangled-name='tpool_destroy' filepath='../../include/thread_pool.h' line='46' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='rmdir' mangled-name='rmdir' filepath='/usr/include/unistd.h' line='834' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='changelist_unshare' mangled-name='changelist_unshare' filepath='../../include/libzfs_impl.h' line='189' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='libzfs_mnttab_find' mangled-name='libzfs_mnttab_find' filepath='../../include/libzfs.h' line='225' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='sa_commit_shares' mangled-name='sa_commit_shares' filepath='../../lib/libspl/include/libshare.h' line='81' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='sa_validate_shareopts' mangled-name='sa_validate_shareopts' filepath='../../lib/libspl/include/libshare.h' line='84' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='sa_enable_share' mangled-name='sa_enable_share' filepath='../../lib/libspl/include/libshare.h' line='77' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='sa_errorstr' mangled-name='sa_errorstr' filepath='../../lib/libspl/include/libshare.h' line='74' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='sa_disable_share' mangled-name='sa_disable_share' filepath='../../lib/libspl/include/libshare.h' line='79' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='libzfs_mnttab_remove' mangled-name='libzfs_mnttab_remove' filepath='../../include/libzfs.h' line='229' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='zfs_crypto_get_encryption_root' mangled-name='zfs_crypto_get_encryption_root' filepath='../../include/libzfs.h' line='525' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='zfs_crypto_unload_key' mangled-name='zfs_crypto_unload_key' filepath='../../include/libzfs.h' line='532' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='zfs_spa_version' mangled-name='zfs_spa_version' filepath='../../include/libzfs.h' line='813' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='__lxstat' mangled-name='__lxstat64' filepath='/usr/include/x86_64-linux-gnu/sys/stat.h' line='412' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='openat' mangled-name='openat64' filepath='/usr/include/fcntl.h' line='196' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='fdopendir' mangled-name='fdopendir' filepath='/usr/include/dirent.h' line='141' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='readdir64' mangled-name='readdir64' filepath='/usr/include/dirent.h' line='173' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='closedir' mangled-name='closedir' filepath='/usr/include/dirent.h' line='149' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='__xstat' mangled-name='__xstat64' filepath='/usr/include/x86_64-linux-gnu/sys/stat.h' line='409' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='statfs64' mangled-name='statfs64' filepath='/usr/include/x86_64-linux-gnu/sys/statfs.h' line='43' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='do_mount' mangled-name='do_mount' filepath='../../include/libzfs_impl.h' line='244' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='libzfs_mnttab_add' mangled-name='libzfs_mnttab_add' filepath='../../include/libzfs.h' line='227' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='mkdirp' mangled-name='mkdirp' filepath='../../lib/libspl/include/libgen.h' line='33' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='zfs_crypto_load_key' mangled-name='zfs_crypto_load_key' filepath='../../include/libzfs.h' line='531' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='getprop_uint64' mangled-name='getprop_uint64' filepath='../../include/libzfs.h' line='509' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='sa_is_shared' mangled-name='sa_is_shared' filepath='../../lib/libspl/include/libshare.h' line='80' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-52'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='libzfs_pool.c' comp-dir-path='/home/colm/src/zfs/zfs/lib/libzfs' language='LANG_C99'>
    <function-decl name='zpool_get_bootenv' mangled-name='zpool_get_bootenv' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='4689' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_get_bootenv'>
      <parameter type-id='type-id-18' name='zhp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='4689' column='1'/>
      <parameter type-id='type-id-115' name='nvlp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='4689' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <qualified-type-def type-id='type-id-67' const='yes' id='type-id-185'/>
    <pointer-type-def type-id='type-id-185' size-in-bits='64' id='type-id-186'/>
    <function-decl name='zpool_set_bootenv' mangled-name='zpool_set_bootenv' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='4676' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_set_bootenv'>
      <parameter type-id='type-id-18' name='zhp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='4676' column='1'/>
      <parameter type-id='type-id-186' name='envmap' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='4676' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' filepath='../../include/sys/fs/zfs.h' line='1419' column='1' id='type-id-187'>
      <underlying-type type-id='type-id-7'/>
      <enumerator name='ZPOOL_WAIT_CKPT_DISCARD' value='0'/>
      <enumerator name='ZPOOL_WAIT_FREE' value='1'/>
      <enumerator name='ZPOOL_WAIT_INITIALIZE' value='2'/>
      <enumerator name='ZPOOL_WAIT_REPLACE' value='3'/>
      <enumerator name='ZPOOL_WAIT_REMOVE' value='4'/>
      <enumerator name='ZPOOL_WAIT_RESILVER' value='5'/>
      <enumerator name='ZPOOL_WAIT_SCRUB' value='6'/>
      <enumerator name='ZPOOL_WAIT_TRIM' value='7'/>
      <enumerator name='ZPOOL_WAIT_NUM_ACTIVITIES' value='8'/>
    </enum-decl>
    <typedef-decl name='zpool_wait_activity_t' type-id='type-id-187' filepath='../../include/sys/fs/zfs.h' line='1429' column='1' id='type-id-188'/>
    <function-decl name='zpool_wait_status' mangled-name='zpool_wait_status' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='4658' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_wait_status'>
      <parameter type-id='type-id-18' name='zhp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='4658' column='1'/>
      <parameter type-id='type-id-188' name='activity' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='4658' column='1'/>
      <parameter type-id='type-id-114' name='missing' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='4659' column='1'/>
      <parameter type-id='type-id-114' name='waited' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='4659' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zpool_wait' mangled-name='zpool_wait' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='4631' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_wait'>
      <parameter type-id='type-id-18' name='zhp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='4631' column='1'/>
      <parameter type-id='type-id-188' name='activity' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='4631' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zpool_obj_to_path_ds' mangled-name='zpool_obj_to_path_ds' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='4622' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_obj_to_path_ds'>
      <parameter type-id='type-id-18' name='zhp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='4622' column='1'/>
      <parameter type-id='type-id-27' name='dsobj' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='4622' column='1'/>
      <parameter type-id='type-id-27' name='obj' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='4622' column='1'/>
      <parameter type-id='type-id-23' name='pathname' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='4623' column='1'/>
      <parameter type-id='type-id-43' name='len' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='4623' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='zpool_obj_to_path' mangled-name='zpool_obj_to_path' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='4615' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_obj_to_path'>
      <parameter type-id='type-id-18' name='zhp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='4622' column='1'/>
      <parameter type-id='type-id-27' name='dsobj' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='4622' column='1'/>
      <parameter type-id='type-id-27' name='obj' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='4622' column='1'/>
      <parameter type-id='type-id-23' name='pathname' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='4623' column='1'/>
      <parameter type-id='type-id-43' name='len' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='4623' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='zpool_events_seek' mangled-name='zpool_events_seek' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='4533' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_events_seek'>
      <parameter type-id='type-id-17' name='hdl' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='4533' column='1'/>
      <parameter type-id='type-id-27' name='eid' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='4533' column='1'/>
      <parameter type-id='type-id-6' name='zevent_fd' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='4533' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zpool_events_clear' mangled-name='zpool_events_clear' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='4510' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_events_clear'>
      <parameter type-id='type-id-17' name='hdl' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='4510' column='1'/>
      <parameter type-id='type-id-141' name='count' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='4510' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zpool_events_next' mangled-name='zpool_events_next' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='4450' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_events_next'>
      <parameter type-id='type-id-17' name='hdl' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='4450' column='1'/>
      <parameter type-id='type-id-115' name='nvp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='4450' column='1'/>
      <parameter type-id='type-id-141' name='dropped' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='4451' column='1'/>
      <parameter type-id='type-id-64' name='flags' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='4451' column='1'/>
      <parameter type-id='type-id-6' name='zevent_fd' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='4451' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zpool_get_history' mangled-name='zpool_get_history' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='4380' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_get_history'>
      <parameter type-id='type-id-18' name='zhp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='4380' column='1'/>
      <parameter type-id='type-id-115' name='nvhisp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='4380' column='1'/>
      <parameter type-id='type-id-137' name='off' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='4380' column='1'/>
      <parameter type-id='type-id-114' name='eof' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='4381' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zpool_log_history' mangled-name='zpool_log_history' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='4311' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_log_history'>
      <parameter type-id='type-id-17' name='hdl' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='4311' column='1'/>
      <parameter type-id='type-id-104' name='message' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='4311' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_save_arguments' mangled-name='zfs_save_arguments' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='4299' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_save_arguments'>
      <parameter type-id='type-id-6' name='argc' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='4299' column='1'/>
      <parameter type-id='type-id-161' name='argv' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='4299' column='1'/>
      <parameter type-id='type-id-23' name='string' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='4299' column='1'/>
      <parameter type-id='type-id-6' name='len' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='4299' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='zpool_upgrade' mangled-name='zpool_upgrade' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='4283' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_upgrade'>
      <parameter type-id='type-id-18' name='zhp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='4283' column='1'/>
      <parameter type-id='type-id-27' name='new_version' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='4283' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zpool_get_errlog' mangled-name='zpool_get_errlog' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='4184' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_get_errlog'>
      <parameter type-id='type-id-18' name='zhp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='4184' column='1'/>
      <parameter type-id='type-id-115' name='nverrlistp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='4184' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zpool_vdev_name' mangled-name='zpool_vdev_name' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='4059' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_vdev_name'>
      <parameter type-id='type-id-17' name='hdl' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='4059' column='1'/>
      <parameter type-id='type-id-18' name='zhp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='4059' column='1'/>
      <parameter type-id='type-id-22' name='nv' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='4059' column='1'/>
      <parameter type-id='type-id-6' name='name_flags' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='4060' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='zpool_sync_one' mangled-name='zpool_sync_one' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='4022' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_sync_one'>
      <parameter type-id='type-id-18' name='zhp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='4022' column='1'/>
      <parameter type-id='type-id-42' name='data' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='4022' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zpool_reopen_one' mangled-name='zpool_reopen_one' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='4004' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_reopen_one'>
      <parameter type-id='type-id-18' name='zhp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='4004' column='1'/>
      <parameter type-id='type-id-42' name='data' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='4004' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zpool_reguid' mangled-name='zpool_reguid' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='3984' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_reguid'>
      <parameter type-id='type-id-18' name='zhp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='3984' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zpool_vdev_clear' mangled-name='zpool_vdev_clear' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='3960' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_vdev_clear'>
      <parameter type-id='type-id-18' name='zhp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='3960' column='1'/>
      <parameter type-id='type-id-27' name='guid' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='3960' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zpool_clear' mangled-name='zpool_clear' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='3884' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_clear'>
      <parameter type-id='type-id-18' name='zhp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='3884' column='1'/>
      <parameter type-id='type-id-104' name='path' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='3884' column='1'/>
      <parameter type-id='type-id-22' name='rewindnvl' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='3884' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zpool_vdev_indirect_size' mangled-name='zpool_vdev_indirect_size' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='3851' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_vdev_indirect_size'>
      <parameter type-id='type-id-18' name='zhp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='3851' column='1'/>
      <parameter type-id='type-id-104' name='path' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='3851' column='1'/>
      <parameter type-id='type-id-137' name='sizep' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='3852' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zpool_vdev_remove_cancel' mangled-name='zpool_vdev_remove_cancel' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='3831' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_vdev_remove_cancel'>
      <parameter type-id='type-id-18' name='zhp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='3984' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zpool_vdev_remove' mangled-name='zpool_vdev_remove' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='3759' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_vdev_remove'>
      <parameter type-id='type-id-18' name='zhp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='3759' column='1'/>
      <parameter type-id='type-id-104' name='path' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='3759' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <class-decl name='splitflags' size-in-bits='64' is-struct='yes' visibility='default' filepath='../../include/libzfs.h' line='258' column='1' id='type-id-189'>
      <data-member access='public' layout-offset-in-bits='31'>
        <var-decl name='dryrun' type-id='type-id-6' visibility='default' filepath='../../include/libzfs.h' line='260' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='30'>
        <var-decl name='import' type-id='type-id-6' visibility='default' filepath='../../include/libzfs.h' line='263' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='name_flags' type-id='type-id-6' visibility='default' filepath='../../include/libzfs.h' line='264' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='splitflags_t' type-id='type-id-189' filepath='../../include/libzfs.h' line='265' column='1' id='type-id-190'/>
    <function-decl name='zpool_vdev_split' mangled-name='zpool_vdev_split' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='3515' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_vdev_split'>
      <parameter type-id='type-id-18' name='zhp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='3515' column='1'/>
      <parameter type-id='type-id-23' name='newname' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='3515' column='1'/>
      <parameter type-id='type-id-115' name='newroot' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='3515' column='1'/>
      <parameter type-id='type-id-22' name='props' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='3516' column='1'/>
      <parameter type-id='type-id-190' name='flags' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='3516' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zpool_vdev_detach' mangled-name='zpool_vdev_detach' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='3418' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_vdev_detach'>
      <parameter type-id='type-id-18' name='zhp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='3418' column='1'/>
      <parameter type-id='type-id-104' name='path' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='3418' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zpool_vdev_attach' mangled-name='zpool_vdev_attach' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='3245' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_vdev_attach'>
      <parameter type-id='type-id-18' name='zhp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='3245' column='1'/>
      <parameter type-id='type-id-104' name='old_disk' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='3245' column='1'/>
      <parameter type-id='type-id-104' name='new_disk' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='3246' column='1'/>
      <parameter type-id='type-id-22' name='nvroot' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='3246' column='1'/>
      <parameter type-id='type-id-6' name='replacing' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='3246' column='1'/>
      <parameter type-id='type-id-5' name='rebuild' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='3246' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <enum-decl name='vdev_aux' filepath='../../include/sys/fs/zfs.h' line='876' column='1' id='type-id-191'>
      <underlying-type type-id='type-id-7'/>
      <enumerator name='VDEV_AUX_NONE' value='0'/>
      <enumerator name='VDEV_AUX_OPEN_FAILED' value='1'/>
      <enumerator name='VDEV_AUX_CORRUPT_DATA' value='2'/>
      <enumerator name='VDEV_AUX_NO_REPLICAS' value='3'/>
      <enumerator name='VDEV_AUX_BAD_GUID_SUM' value='4'/>
      <enumerator name='VDEV_AUX_TOO_SMALL' value='5'/>
      <enumerator name='VDEV_AUX_BAD_LABEL' value='6'/>
      <enumerator name='VDEV_AUX_VERSION_NEWER' value='7'/>
      <enumerator name='VDEV_AUX_VERSION_OLDER' value='8'/>
      <enumerator name='VDEV_AUX_UNSUP_FEAT' value='9'/>
      <enumerator name='VDEV_AUX_SPARED' value='10'/>
      <enumerator name='VDEV_AUX_ERR_EXCEEDED' value='11'/>
      <enumerator name='VDEV_AUX_IO_FAILURE' value='12'/>
      <enumerator name='VDEV_AUX_BAD_LOG' value='13'/>
      <enumerator name='VDEV_AUX_EXTERNAL' value='14'/>
      <enumerator name='VDEV_AUX_SPLIT_POOL' value='15'/>
      <enumerator name='VDEV_AUX_BAD_ASHIFT' value='16'/>
      <enumerator name='VDEV_AUX_EXTERNAL_PERSIST' value='17'/>
      <enumerator name='VDEV_AUX_ACTIVE' value='18'/>
      <enumerator name='VDEV_AUX_CHILDREN_OFFLINE' value='19'/>
      <enumerator name='VDEV_AUX_ASHIFT_TOO_BIG' value='20'/>
    </enum-decl>
    <typedef-decl name='vdev_aux_t' type-id='type-id-191' filepath='../../include/sys/fs/zfs.h' line='898' column='1' id='type-id-192'/>
    <function-decl name='zpool_vdev_degrade' mangled-name='zpool_vdev_degrade' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='3191' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_vdev_degrade'>
      <parameter type-id='type-id-18' name='zhp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='3191' column='1'/>
      <parameter type-id='type-id-27' name='guid' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='3191' column='1'/>
      <parameter type-id='type-id-192' name='aux' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='3191' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zpool_vdev_fault' mangled-name='zpool_vdev_fault' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='3156' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_vdev_fault'>
      <parameter type-id='type-id-18' name='zhp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='3156' column='1'/>
      <parameter type-id='type-id-27' name='guid' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='3156' column='1'/>
      <parameter type-id='type-id-192' name='aux' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='3156' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zpool_vdev_offline' mangled-name='zpool_vdev_offline' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='3106' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_vdev_offline'>
      <parameter type-id='type-id-18' name='zhp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='3106' column='1'/>
      <parameter type-id='type-id-104' name='path' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='3106' column='1'/>
      <parameter type-id='type-id-5' name='istmp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='3106' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <enum-decl name='vdev_state' filepath='../../include/sys/fs/zfs.h' line='859' column='1' id='type-id-193'>
      <underlying-type type-id='type-id-7'/>
      <enumerator name='VDEV_STATE_UNKNOWN' value='0'/>
      <enumerator name='VDEV_STATE_CLOSED' value='1'/>
      <enumerator name='VDEV_STATE_OFFLINE' value='2'/>
      <enumerator name='VDEV_STATE_REMOVED' value='3'/>
      <enumerator name='VDEV_STATE_CANT_OPEN' value='4'/>
      <enumerator name='VDEV_STATE_FAULTED' value='5'/>
      <enumerator name='VDEV_STATE_DEGRADED' value='6'/>
      <enumerator name='VDEV_STATE_HEALTHY' value='7'/>
    </enum-decl>
    <typedef-decl name='vdev_state_t' type-id='type-id-193' filepath='../../include/sys/fs/zfs.h' line='868' column='1' id='type-id-194'/>
    <pointer-type-def type-id='type-id-194' size-in-bits='64' id='type-id-195'/>
    <function-decl name='zpool_vdev_online' mangled-name='zpool_vdev_online' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='3019' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_vdev_online'>
      <parameter type-id='type-id-18' name='zhp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='3019' column='1'/>
      <parameter type-id='type-id-104' name='path' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='3019' column='1'/>
      <parameter type-id='type-id-6' name='flags' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='3019' column='1'/>
      <parameter type-id='type-id-195' name='newstate' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='3020' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zpool_vdev_path_to_guid' mangled-name='zpool_vdev_path_to_guid' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='3009' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_vdev_path_to_guid'>
      <parameter type-id='type-id-18' name='zhp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='3009' column='1'/>
      <parameter type-id='type-id-104' name='path' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='3009' column='1'/>
      <return type-id='type-id-27'/>
    </function-decl>
    <function-decl name='zpool_get_physpath' mangled-name='zpool_get_physpath' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='2971' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_get_physpath'>
      <parameter type-id='type-id-18' name='zhp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='2971' column='1'/>
      <parameter type-id='type-id-23' name='physpath' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='2971' column='1'/>
      <parameter type-id='type-id-43' name='phypath_size' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='2971' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zpool_find_vdev' mangled-name='zpool_find_vdev' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='2798' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_find_vdev'>
      <parameter type-id='type-id-18' name='zhp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='2798' column='1'/>
      <parameter type-id='type-id-104' name='path' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='2798' column='1'/>
      <parameter type-id='type-id-114' name='avail_spare' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='2798' column='1'/>
      <parameter type-id='type-id-114' name='l2cache' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='2799' column='1'/>
      <parameter type-id='type-id-114' name='log' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='2799' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zpool_find_vdev_by_physpath' mangled-name='zpool_find_vdev_by_physpath' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='2747' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_find_vdev_by_physpath'>
      <parameter type-id='type-id-18' name='zhp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='2747' column='1'/>
      <parameter type-id='type-id-104' name='ppath' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='2747' column='1'/>
      <parameter type-id='type-id-114' name='avail_spare' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='2748' column='1'/>
      <parameter type-id='type-id-114' name='l2cache' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='2748' column='1'/>
      <parameter type-id='type-id-114' name='log' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='2748' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <enum-decl name='pool_scan_func' filepath='../../include/sys/fs/zfs.h' line='930' column='1' id='type-id-196'>
      <underlying-type type-id='type-id-7'/>
      <enumerator name='POOL_SCAN_NONE' value='0'/>
      <enumerator name='POOL_SCAN_SCRUB' value='1'/>
      <enumerator name='POOL_SCAN_RESILVER' value='2'/>
      <enumerator name='POOL_SCAN_FUNCS' value='3'/>
    </enum-decl>
    <typedef-decl name='pool_scan_func_t' type-id='type-id-196' filepath='../../include/sys/fs/zfs.h' line='935' column='1' id='type-id-197'/>
    <enum-decl name='pool_scrub_cmd' filepath='../../include/sys/fs/zfs.h' line='940' column='1' id='type-id-198'>
      <underlying-type type-id='type-id-7'/>
      <enumerator name='POOL_SCRUB_NORMAL' value='0'/>
      <enumerator name='POOL_SCRUB_PAUSE' value='1'/>
      <enumerator name='POOL_SCRUB_FLAGS_END' value='2'/>
    </enum-decl>
    <typedef-decl name='pool_scrub_cmd_t' type-id='type-id-198' filepath='../../include/sys/fs/zfs.h' line='944' column='1' id='type-id-199'/>
    <function-decl name='zpool_scan' mangled-name='zpool_scan' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='2502' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_scan'>
      <parameter type-id='type-id-18' name='zhp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='2502' column='1'/>
      <parameter type-id='type-id-197' name='func' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='2502' column='1'/>
      <parameter type-id='type-id-199' name='cmd' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='2502' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <enum-decl name='pool_trim_func' filepath='../../include/sys/fs/zfs.h' line='1169' column='1' id='type-id-200'>
      <underlying-type type-id='type-id-7'/>
      <enumerator name='POOL_TRIM_START' value='0'/>
      <enumerator name='POOL_TRIM_CANCEL' value='1'/>
      <enumerator name='POOL_TRIM_SUSPEND' value='2'/>
      <enumerator name='POOL_TRIM_FUNCS' value='3'/>
    </enum-decl>
    <typedef-decl name='pool_trim_func_t' type-id='type-id-200' filepath='../../include/sys/fs/zfs.h' line='1174' column='1' id='type-id-201'/>
    <class-decl name='trimflags' size-in-bits='192' is-struct='yes' visibility='default' filepath='../../include/libzfs.h' line='267' column='1' id='type-id-202'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fullpool' type-id='type-id-5' visibility='default' filepath='../../include/libzfs.h' line='269' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='secure' type-id='type-id-5' visibility='default' filepath='../../include/libzfs.h' line='272' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='wait' type-id='type-id-5' visibility='default' filepath='../../include/libzfs.h' line='275' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='rate' type-id='type-id-27' visibility='default' filepath='../../include/libzfs.h' line='278' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='trimflags_t' type-id='type-id-202' filepath='../../include/libzfs.h' line='279' column='1' id='type-id-203'/>
    <pointer-type-def type-id='type-id-203' size-in-bits='64' id='type-id-204'/>
    <function-decl name='zpool_trim' mangled-name='zpool_trim' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='2446' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_trim'>
      <parameter type-id='type-id-18' name='zhp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='2446' column='1'/>
      <parameter type-id='type-id-201' name='cmd_type' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='2446' column='1'/>
      <parameter type-id='type-id-22' name='vds' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='2446' column='1'/>
      <parameter type-id='type-id-204' name='trim_flags' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='2447' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <enum-decl name='pool_initialize_func' filepath='../../include/sys/fs/zfs.h' line='1159' column='1' id='type-id-205'>
      <underlying-type type-id='type-id-7'/>
      <enumerator name='POOL_INITIALIZE_START' value='0'/>
      <enumerator name='POOL_INITIALIZE_CANCEL' value='1'/>
      <enumerator name='POOL_INITIALIZE_SUSPEND' value='2'/>
      <enumerator name='POOL_INITIALIZE_FUNCS' value='3'/>
    </enum-decl>
    <typedef-decl name='pool_initialize_func_t' type-id='type-id-205' filepath='../../include/sys/fs/zfs.h' line='1164' column='1' id='type-id-206'/>
    <function-decl name='zpool_initialize_wait' mangled-name='zpool_initialize_wait' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='2337' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_initialize_wait'>
      <parameter type-id='type-id-18' name='zhp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='2337' column='1'/>
      <parameter type-id='type-id-206' name='cmd_type' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='2337' column='1'/>
      <parameter type-id='type-id-22' name='vds' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='2338' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zpool_initialize' mangled-name='zpool_initialize' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='2330' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_initialize'>
      <parameter type-id='type-id-18' name='zhp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='2337' column='1'/>
      <parameter type-id='type-id-206' name='cmd_type' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='2337' column='1'/>
      <parameter type-id='type-id-22' name='vds' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='2338' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zpool_import_props' mangled-name='zpool_import_props' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='1941' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_import_props'>
      <parameter type-id='type-id-17' name='hdl' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='1941' column='1'/>
      <parameter type-id='type-id-22' name='config' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='1941' column='1'/>
      <parameter type-id='type-id-104' name='newname' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='1941' column='1'/>
      <parameter type-id='type-id-22' name='props' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='1942' column='1'/>
      <parameter type-id='type-id-6' name='flags' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='1942' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zpool_print_unsup_feat' mangled-name='zpool_print_unsup_feat' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='1910' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_print_unsup_feat'>
      <parameter type-id='type-id-22' name='config' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='1910' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='zpool_import' mangled-name='zpool_import' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='1852' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_import'>
      <parameter type-id='type-id-17' name='hdl' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='1852' column='1'/>
      <parameter type-id='type-id-22' name='config' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='1852' column='1'/>
      <parameter type-id='type-id-104' name='newname' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='1852' column='1'/>
      <parameter type-id='type-id-23' name='altroot' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='1853' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zpool_explain_recover' mangled-name='zpool_explain_recover' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='1765' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_explain_recover'>
      <parameter type-id='type-id-17' name='hdl' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='1765' column='1'/>
      <parameter type-id='type-id-104' name='name' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='1765' column='1'/>
      <parameter type-id='type-id-6' name='reason' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='1765' column='1'/>
      <parameter type-id='type-id-22' name='config' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='1766' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='zpool_export_force' mangled-name='zpool_export_force' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='1707' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_export_force'>
      <parameter type-id='type-id-18' name='zhp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='1707' column='1'/>
      <parameter type-id='type-id-104' name='log_str' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='1707' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zpool_export' mangled-name='zpool_export' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='1701' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_export'>
      <parameter type-id='type-id-18' name='zhp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='1701' column='1'/>
      <parameter type-id='type-id-5' name='force' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='1701' column='1'/>
      <parameter type-id='type-id-104' name='log_str' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='1701' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zpool_add' mangled-name='zpool_add' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='1557' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_add'>
      <parameter type-id='type-id-18' name='zhp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='1557' column='1'/>
      <parameter type-id='type-id-22' name='nvroot' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='1557' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zpool_discard_checkpoint' mangled-name='zpool_discard_checkpoint' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='1535' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_discard_checkpoint'>
      <parameter type-id='type-id-18' name='zhp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='1535' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zpool_checkpoint' mangled-name='zpool_checkpoint' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='1514' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_checkpoint'>
      <parameter type-id='type-id-18' name='zhp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='1535' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zpool_destroy' mangled-name='zpool_destroy' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='1471' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_destroy'>
      <parameter type-id='type-id-18' name='zhp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='1471' column='1'/>
      <parameter type-id='type-id-104' name='log_str' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='1471' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zpool_create' mangled-name='zpool_create' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='1292' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_create'>
      <parameter type-id='type-id-17' name='hdl' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='1292' column='1'/>
      <parameter type-id='type-id-104' name='pool' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='1292' column='1'/>
      <parameter type-id='type-id-22' name='nvroot' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='1292' column='1'/>
      <parameter type-id='type-id-22' name='props' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='1293' column='1'/>
      <parameter type-id='type-id-22' name='fsprops' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='1293' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zpool_is_draid_spare' mangled-name='zpool_is_draid_spare' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='1273' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_is_draid_spare'>
      <parameter type-id='type-id-104' name='name' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='1273' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='zpool_get_state' mangled-name='zpool_get_state' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='1202' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_get_state'>
      <parameter type-id='type-id-18' name='zhp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='1202' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zpool_get_name' mangled-name='zpool_get_name' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='1192' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_get_name'>
      <parameter type-id='type-id-18' name='zhp' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='1192' column='1'/>
      <return type-id='type-id-104'/>
    </function-decl>
    <function-decl name='zpool_close' mangled-name='zpool_close' filepath='/home/colm/src/zfs/zfs/lib/libzfs/libzfs_pool.c' line='1180' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_close'>
