<abi-corpus path='libzfs.so' architecture='elf-amd-x86_64' soname='libzfs.so.4'>
  <elf-needed>
    <dependency name='libzfs_core.so.3'/>
    <dependency name='libuuid.so.1'/>
    <dependency name='libblkid.so.1'/>
    <dependency name='libudev.so.1'/>
    <dependency name='libnvpair.so.3'/>
    <dependency name='libtirpc.so.3'/>
    <dependency name='libuutil.so.3'/>
    <dependency name='libm.so.6'/>
    <dependency name='libcrypto.so.1.1'/>
    <dependency name='libz.so.1'/>
    <dependency name='libpthread.so.0'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='SHA256Init' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='SHA2Final' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='SHA2Init' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='SHA2Update' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='SHA384Init' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='SHA512Init' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='bookmark_namecheck' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

  <elf-variable-symbols>
    <elf-symbol name='fletcher_4_abd_ops' size='24' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fletcher_4_avx2_ops' size='64' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fletcher_4_avx512bw_ops' size='64' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fletcher_4_avx512f_ops' size='64' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fletcher_4_sse2_ops' size='64' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fletcher_4_ssse3_ops' size='64' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fletcher_4_superscalar4_ops' size='64' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fletcher_4_superscalar_ops' size='64' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='libzfs_config_ops' size='16' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nfs_only' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='proto_table' size='48' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='share_all_proto' size='12' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='smb_only' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='smb_shares' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spa_feature_table' size='1904' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zfeature_checks_disable' size='4' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zfs_deleg_perm_tab' size='512' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zfs_history_event_names' size='328' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zfs_max_dataset_nesting' size='4' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zfs_userquota_prop_prefixes' size='96' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-variable-symbols>
  <abi-instr version='1.0' address-size='64' path='libzfs_changelist.c' comp-dir-path='/home/fedora/zfs/lib/libzfs' language='LANG_C99'>






    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='128' id='type-id-2'>
      <subrange length='2' type-id='type-id-3' id='type-id-4'/>

    </array-type-def>
    <type-decl name='char' size-in-bits='8' id='type-id-5'/>
    <array-type-def dimensions='1' type-id='type-id-5' size-in-bits='8192' id='type-id-6'>
      <subrange length='1024' type-id='type-id-3' id='type-id-7'/>

    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-5' size-in-bits='8' id='type-id-8'>
      <subrange length='1' type-id='type-id-3' id='type-id-9'/>

    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-5' size-in-bits='160' id='type-id-10'>
      <subrange length='20' type-id='type-id-3' id='type-id-11'/>

    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-5' size-in-bits='2048' id='type-id-12'>
      <subrange length='256' type-id='type-id-3' id='type-id-13'/>

    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-5' size-in-bits='320' id='type-id-14'>
      <subrange length='40' type-id='type-id-3' id='type-id-15'/>

    </array-type-def>
    <class-decl name='_IO_codecvt' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-16'/>
    <class-decl name='_IO_marker' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-17'/>
    <class-decl name='_IO_wide_data' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-18'/>
    <class-decl name='re_dfa_t' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-19'/>
    <class-decl name='uu_avl' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-20'/>
    <class-decl name='uu_avl_pool' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-21'/>
    <type-decl name='int' size-in-bits='32' id='type-id-22'/>
    <type-decl name='long int' size-in-bits='64' id='type-id-23'/>
    <type-decl name='long long int' size-in-bits='64' id='type-id-24'/>
    <type-decl name='short int' size-in-bits='16' id='type-id-25'/>
    <type-decl name='signed char' size-in-bits='8' id='type-id-26'/>
    <type-decl name='unnamed-enum-underlying-type' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='type-id-27'/>
    <type-decl name='unsigned char' size-in-bits='8' id='type-id-28'/>
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-29'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-3'/>
    <type-decl name='unsigned short int' size-in-bits='16' id='type-id-30'/>
    <type-decl name='void' id='type-id-31'/>
    <typedef-decl name='prop_changelist_t' type-id='type-id-32' filepath='../../include/libzfs_impl.h' line='174' column='1' id='type-id-33'/>
    <class-decl name='prop_changelist' size-in-bits='448' is-struct='yes' visibility='default' filepath='/home/fedora/zfs/lib/libzfs/libzfs_changelist.c' line='75' column='1' id='type-id-32'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cl_prop' type-id='type-id-34' visibility='default' filepath='/home/fedora/zfs/lib/libzfs/libzfs_changelist.c' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='cl_realprop' type-id='type-id-34' visibility='default' filepath='/home/fedora/zfs/lib/libzfs/libzfs_changelist.c' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='cl_shareprop' type-id='type-id-34' visibility='default' filepath='/home/fedora/zfs/lib/libzfs/libzfs_changelist.c' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='cl_pool' type-id='type-id-35' visibility='default' filepath='/home/fedora/zfs/lib/libzfs/libzfs_changelist.c' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='cl_tree' type-id='type-id-36' visibility='default' filepath='/home/fedora/zfs/lib/libzfs/libzfs_changelist.c' line='80' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='cl_waslegacy' type-id='type-id-37' visibility='default' filepath='/home/fedora/zfs/lib/libzfs/libzfs_changelist.c' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='cl_allchildren' type-id='type-id-37' visibility='default' filepath='/home/fedora/zfs/lib/libzfs/libzfs_changelist.c' line='82' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='cl_alldependents' type-id='type-id-37' visibility='default' filepath='/home/fedora/zfs/lib/libzfs/libzfs_changelist.c' line='83' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='cl_mflags' type-id='type-id-22' visibility='default' filepath='/home/fedora/zfs/lib/libzfs/libzfs_changelist.c' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='cl_gflags' type-id='type-id-22' visibility='default' filepath='/home/fedora/zfs/lib/libzfs/libzfs_changelist.c' line='85' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='cl_haszonedchild' type-id='type-id-37' visibility='default' filepath='/home/fedora/zfs/lib/libzfs/libzfs_changelist.c' line='86' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='zfs_prop_t' type-id='type-id-38' filepath='../../include/sys/fs/zfs.h' line='190' column='1' id='type-id-34'/>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' filepath='../../include/sys/fs/zfs.h' line='91' column='1' id='type-id-38'>
      <underlying-type type-id='type-id-27'/>
      <enumerator name='ZPROP_CONT' value='-2'/>
      <enumerator name='ZPROP_INVAL' value='-1'/>
      <enumerator name='ZFS_PROP_TYPE' value='0'/>
      <enumerator name='ZFS_PROP_CREATION' value='1'/>
      <enumerator name='ZFS_PROP_USED' value='2'/>
      <enumerator name='ZFS_PROP_AVAILABLE' value='3'/>
      <enumerator name='ZFS_PROP_REFERENCED' value='4'/>
      <enumerator name='ZFS_PROP_COMPRESSRATIO' value='5'/>
      <enumerator name='ZFS_PROP_MOUNTED' value='6'/>
      <enumerator name='ZFS_PROP_ORIGIN' value='7'/>
      <enumerator name='ZFS_PROP_QUOTA' value='8'/>
      <enumerator name='ZFS_PROP_RESERVATION' value='9'/>
      <enumerator name='ZFS_PROP_VOLSIZE' value='10'/>
      <enumerator name='ZFS_PROP_VOLBLOCKSIZE' value='11'/>
      <enumerator name='ZFS_PROP_RECORDSIZE' value='12'/>
      <enumerator name='ZFS_PROP_MOUNTPOINT' value='13'/>
      <enumerator name='ZFS_PROP_SHARENFS' value='14'/>
      <enumerator name='ZFS_PROP_CHECKSUM' value='15'/>
      <enumerator name='ZFS_PROP_COMPRESSION' value='16'/>
      <enumerator name='ZFS_PROP_ATIME' value='17'/>
      <enumerator name='ZFS_PROP_DEVICES' value='18'/>
      <enumerator name='ZFS_PROP_EXEC' value='19'/>
      <enumerator name='ZFS_PROP_SETUID' value='20'/>
      <enumerator name='ZFS_PROP_READONLY' value='21'/>
      <enumerator name='ZFS_PROP_ZONED' value='22'/>
      <enumerator name='ZFS_PROP_SNAPDIR' value='23'/>
      <enumerator name='ZFS_PROP_ACLMODE' value='24'/>
      <enumerator name='ZFS_PROP_ACLINHERIT' value='25'/>
      <enumerator name='ZFS_PROP_CREATETXG' value='26'/>
      <enumerator name='ZFS_PROP_NAME' value='27'/>
      <enumerator name='ZFS_PROP_CANMOUNT' value='28'/>
      <enumerator name='ZFS_PROP_ISCSIOPTIONS' value='29'/>
      <enumerator name='ZFS_PROP_XATTR' value='30'/>
      <enumerator name='ZFS_PROP_NUMCLONES' value='31'/>
      <enumerator name='ZFS_PROP_COPIES' value='32'/>
      <enumerator name='ZFS_PROP_VERSION' value='33'/>
      <enumerator name='ZFS_PROP_UTF8ONLY' value='34'/>
      <enumerator name='ZFS_PROP_NORMALIZE' value='35'/>
      <enumerator name='ZFS_PROP_CASE' value='36'/>
      <enumerator name='ZFS_PROP_VSCAN' value='37'/>
      <enumerator name='ZFS_PROP_NBMAND' value='38'/>
      <enumerator name='ZFS_PROP_SHARESMB' value='39'/>
      <enumerator name='ZFS_PROP_REFQUOTA' value='40'/>
      <enumerator name='ZFS_PROP_REFRESERVATION' value='41'/>
      <enumerator name='ZFS_PROP_GUID' value='42'/>
      <enumerator name='ZFS_PROP_PRIMARYCACHE' value='43'/>
      <enumerator name='ZFS_PROP_SECONDARYCACHE' value='44'/>
      <enumerator name='ZFS_PROP_USEDSNAP' value='45'/>
      <enumerator name='ZFS_PROP_USEDDS' value='46'/>
      <enumerator name='ZFS_PROP_USEDCHILD' value='47'/>
      <enumerator name='ZFS_PROP_USEDREFRESERV' value='48'/>
      <enumerator name='ZFS_PROP_USERACCOUNTING' value='49'/>
      <enumerator name='ZFS_PROP_STMF_SHAREINFO' value='50'/>
      <enumerator name='ZFS_PROP_DEFER_DESTROY' value='51'/>
      <enumerator name='ZFS_PROP_USERREFS' value='52'/>
      <enumerator name='ZFS_PROP_LOGBIAS' value='53'/>
      <enumerator name='ZFS_PROP_UNIQUE' value='54'/>
      <enumerator name='ZFS_PROP_OBJSETID' value='55'/>
      <enumerator name='ZFS_PROP_DEDUP' value='56'/>
      <enumerator name='ZFS_PROP_MLSLABEL' value='57'/>
      <enumerator name='ZFS_PROP_SYNC' value='58'/>
      <enumerator name='ZFS_PROP_DNODESIZE' value='59'/>
      <enumerator name='ZFS_PROP_REFRATIO' value='60'/>
      <enumerator name='ZFS_PROP_WRITTEN' value='61'/>
      <enumerator name='ZFS_PROP_CLONES' value='62'/>
      <enumerator name='ZFS_PROP_LOGICALUSED' value='63'/>
      <enumerator name='ZFS_PROP_LOGICALREFERENCED' value='64'/>
      <enumerator name='ZFS_PROP_INCONSISTENT' value='65'/>
      <enumerator name='ZFS_PROP_VOLMODE' value='66'/>
      <enumerator name='ZFS_PROP_FILESYSTEM_LIMIT' value='67'/>
      <enumerator name='ZFS_PROP_SNAPSHOT_LIMIT' value='68'/>
      <enumerator name='ZFS_PROP_FILESYSTEM_COUNT' value='69'/>
      <enumerator name='ZFS_PROP_SNAPSHOT_COUNT' value='70'/>
      <enumerator name='ZFS_PROP_SNAPDEV' value='71'/>
      <enumerator name='ZFS_PROP_ACLTYPE' value='72'/>
      <enumerator name='ZFS_PROP_SELINUX_CONTEXT' value='73'/>
      <enumerator name='ZFS_PROP_SELINUX_FSCONTEXT' value='74'/>
      <enumerator name='ZFS_PROP_SELINUX_DEFCONTEXT' value='75'/>
      <enumerator name='ZFS_PROP_SELINUX_ROOTCONTEXT' value='76'/>
      <enumerator name='ZFS_PROP_RELATIME' value='77'/>
      <enumerator name='ZFS_PROP_REDUNDANT_METADATA' value='78'/>
      <enumerator name='ZFS_PROP_OVERLAY' value='79'/>
      <enumerator name='ZFS_PROP_PREV_SNAP' value='80'/>
      <enumerator name='ZFS_PROP_RECEIVE_RESUME_TOKEN' value='81'/>
      <enumerator name='ZFS_PROP_ENCRYPTION' value='82'/>
      <enumerator name='ZFS_PROP_KEYLOCATION' value='83'/>
      <enumerator name='ZFS_PROP_KEYFORMAT' value='84'/>
      <enumerator name='ZFS_PROP_PBKDF2_SALT' value='85'/>
      <enumerator name='ZFS_PROP_PBKDF2_ITERS' value='86'/>
      <enumerator name='ZFS_PROP_ENCRYPTION_ROOT' value='87'/>
      <enumerator name='ZFS_PROP_KEY_GUID' value='88'/>
      <enumerator name='ZFS_PROP_KEYSTATUS' value='89'/>
      <enumerator name='ZFS_PROP_REMAPTXG' value='90'/>
      <enumerator name='ZFS_PROP_SPECIAL_SMALL_BLOCKS' value='91'/>
      <enumerator name='ZFS_PROP_IVSET_GUID' value='92'/>
      <enumerator name='ZFS_PROP_REDACTED' value='93'/>
      <enumerator name='ZFS_PROP_REDACT_SNAPS' value='94'/>
      <enumerator name='ZFS_NUM_PROPS' value='95'/>
    </enum-decl>
    <typedef-decl name='uu_avl_pool_t' type-id='type-id-21' filepath='../../include/libuutil.h' line='287' column='1' id='type-id-39'/>
    <typedef-decl name='uu_avl_t' type-id='type-id-20' filepath='../../include/libuutil.h' line='288' column='1' id='type-id-40'/>
    <typedef-decl name='boolean_t' type-id='type-id-41' filepath='../../lib/libspl/include/sys/stdtypes.h' line='29' column='1' id='type-id-37'/>
    <enum-decl name='__anonymous_enum__1' is-anonymous='yes' filepath='../../lib/libspl/include/sys/stdtypes.h' line='26' column='1' id='type-id-41'>
      <underlying-type type-id='type-id-27'/>
      <enumerator name='B_FALSE' value='0'/>
      <enumerator name='B_TRUE' value='1'/>
    </enum-decl>
    <typedef-decl name='zfs_handle_t' type-id='type-id-42' filepath='../../include/libzfs.h' line='194' column='1' id='type-id-43'/>
    <class-decl name='zfs_handle' size-in-bits='4928' is-struct='yes' visibility='default' filepath='../../include/libzfs_impl.h' line='77' column='1' id='type-id-42'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='zfs_hdl' type-id='type-id-44' visibility='default' filepath='../../include/libzfs_impl.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='zpool_hdl' type-id='type-id-45' visibility='default' filepath='../../include/libzfs_impl.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='zfs_name' type-id='type-id-12' visibility='default' filepath='../../include/libzfs_impl.h' line='80' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='zfs_type' type-id='type-id-46' visibility='default' filepath='../../include/libzfs_impl.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2208'>
        <var-decl name='zfs_head_type' type-id='type-id-46' visibility='default' filepath='../../include/libzfs_impl.h' line='82' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <var-decl name='zfs_dmustats' type-id='type-id-47' visibility='default' filepath='../../include/libzfs_impl.h' line='83' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4544'>
        <var-decl name='zfs_props' type-id='type-id-48' visibility='default' filepath='../../include/libzfs_impl.h' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4608'>
        <var-decl name='zfs_user_props' type-id='type-id-48' visibility='default' filepath='../../include/libzfs_impl.h' line='85' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4672'>
        <var-decl name='zfs_recvd_props' type-id='type-id-48' visibility='default' filepath='../../include/libzfs_impl.h' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4736'>
        <var-decl name='zfs_mntcheck' type-id='type-id-37' visibility='default' filepath='../../include/libzfs_impl.h' line='87' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4800'>
        <var-decl name='zfs_mntopts' type-id='type-id-49' visibility='default' filepath='../../include/libzfs_impl.h' line='88' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4864'>
        <var-decl name='zfs_props_table' type-id='type-id-50' visibility='default' filepath='../../include/libzfs_impl.h' line='89' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='libzfs_handle' size-in-bits='20224' is-struct='yes' visibility='default' filepath='../../include/libzfs_impl.h' line='48' column='1' id='type-id-51'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='libzfs_error' type-id='type-id-22' visibility='default' filepath='../../include/libzfs_impl.h' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='libzfs_fd' type-id='type-id-22' visibility='default' filepath='../../include/libzfs_impl.h' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='libzfs_mnttab' type-id='type-id-52' visibility='default' filepath='../../include/libzfs_impl.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='libzfs_pool_handles' type-id='type-id-45' visibility='default' filepath='../../include/libzfs_impl.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='libzfs_ns_avlpool' type-id='type-id-35' visibility='default' filepath='../../include/libzfs_impl.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='libzfs_ns_avl' type-id='type-id-36' visibility='default' filepath='../../include/libzfs_impl.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='libzfs_ns_gen' type-id='type-id-53' visibility='default' filepath='../../include/libzfs_impl.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='libzfs_desc_active' type-id='type-id-22' visibility='default' filepath='../../include/libzfs_impl.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='libzfs_action' type-id='type-id-6' visibility='default' filepath='../../include/libzfs_impl.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8608'>
        <var-decl name='libzfs_desc' type-id='type-id-6' visibility='default' filepath='../../include/libzfs_impl.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16800'>
        <var-decl name='libzfs_printerr' type-id='type-id-22' visibility='default' filepath='../../include/libzfs_impl.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16832'>
        <var-decl name='libzfs_storeerr' type-id='type-id-22' visibility='default' filepath='../../include/libzfs_impl.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16864'>
        <var-decl name='libzfs_mnttab_enable' type-id='type-id-37' visibility='default' filepath='../../include/libzfs_impl.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16896'>
        <var-decl name='libzfs_mnttab_cache_lock' type-id='type-id-54' visibility='default' filepath='../../include/libzfs_impl.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17216'>
        <var-decl name='libzfs_mnttab_cache' type-id='type-id-55' visibility='default' filepath='../../include/libzfs_impl.h' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17536'>
        <var-decl name='libzfs_pool_iter' type-id='type-id-22' visibility='default' filepath='../../include/libzfs_impl.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17568'>
        <var-decl name='libzfs_chassis_id' type-id='type-id-12' visibility='default' filepath='../../include/libzfs_impl.h' line='71' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='19616'>
        <var-decl name='libzfs_prop_debug' type-id='type-id-37' visibility='default' filepath='../../include/libzfs_impl.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='19648'>
        <var-decl name='libzfs_urire' type-id='type-id-56' visibility='default' filepath='../../include/libzfs_impl.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='20160'>
        <var-decl name='libzfs_max_nvlist' type-id='type-id-53' visibility='default' filepath='../../include/libzfs_impl.h' line='74' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='FILE' type-id='type-id-57' filepath='/usr/include/bits/types/FILE.h' line='7' column='1' id='type-id-58'/>
    <class-decl name='_IO_FILE' size-in-bits='1728' is-struct='yes' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='49' column='1' id='type-id-57'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_flags' type-id='type-id-22' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_IO_read_ptr' type-id='type-id-49' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_IO_read_end' type-id='type-id-49' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_IO_read_base' type-id='type-id-49' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='_IO_write_base' type-id='type-id-49' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='_IO_write_ptr' type-id='type-id-49' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_IO_write_end' type-id='type-id-49' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='_IO_buf_base' type-id='type-id-49' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='_IO_buf_end' type-id='type-id-49' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='_IO_save_base' type-id='type-id-49' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='_IO_backup_base' type-id='type-id-49' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='_IO_save_end' type-id='type-id-49' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='_markers' type-id='type-id-59' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='_chain' type-id='type-id-60' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='_fileno' type-id='type-id-22' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='_flags2' type-id='type-id-22' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='_old_offset' type-id='type-id-61' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='_cur_column' type-id='type-id-30' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1040'>
        <var-decl name='_vtable_offset' type-id='type-id-26' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1048'>
        <var-decl name='_shortbuf' type-id='type-id-8' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='_lock' type-id='type-id-62' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='_offset' type-id='type-id-63' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='_codecvt' type-id='type-id-64' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='_wide_data' type-id='type-id-65' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='_freeres_list' type-id='type-id-60' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='_freeres_buf' type-id='type-id-66' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='__pad5' type-id='type-id-67' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='_mode' type-id='type-id-22' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='_unused2' type-id='type-id-10' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='98' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__off_t' type-id='type-id-23' filepath='/usr/include/bits/types.h' line='152' column='1' id='type-id-61'/>
    <typedef-decl name='_IO_lock_t' type-id='type-id-31' filepath='/usr/include/bits/types/struct_FILE.h' line='43' column='1' id='type-id-68'/>
    <typedef-decl name='__off64_t' type-id='type-id-23' filepath='/usr/include/bits/types.h' line='153' column='1' id='type-id-63'/>
    <typedef-decl name='size_t' type-id='type-id-3' filepath='/usr/lib/gcc/x86_64-redhat-linux/10/include/stddef.h' line='209' column='1' id='type-id-67'/>
    <class-decl name='zpool_handle' size-in-bits='2560' is-struct='yes' visibility='default' filepath='../../include/libzfs_impl.h' line='98' column='1' id='type-id-69'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='zpool_hdl' type-id='type-id-44' visibility='default' filepath='../../include/libzfs_impl.h' line='99' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='zpool_next' type-id='type-id-45' visibility='default' filepath='../../include/libzfs_impl.h' line='100' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='zpool_name' type-id='type-id-12' visibility='default' filepath='../../include/libzfs_impl.h' line='101' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='zpool_state' type-id='type-id-22' visibility='default' filepath='../../include/libzfs_impl.h' line='102' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <var-decl name='zpool_config_size' type-id='type-id-67' visibility='default' filepath='../../include/libzfs_impl.h' line='103' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2304'>
        <var-decl name='zpool_config' type-id='type-id-48' visibility='default' filepath='../../include/libzfs_impl.h' line='104' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2368'>
        <var-decl name='zpool_old_config' type-id='type-id-48' visibility='default' filepath='../../include/libzfs_impl.h' line='105' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2432'>
        <var-decl name='zpool_props' type-id='type-id-48' visibility='default' filepath='../../include/libzfs_impl.h' line='106' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2496'>
        <var-decl name='zpool_start_block' type-id='type-id-70' visibility='default' filepath='../../include/libzfs_impl.h' line='107' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='libzfs_handle_t' type-id='type-id-51' filepath='../../include/libzfs.h' line='196' column='1' id='type-id-71'/>
    <typedef-decl name='zpool_handle_t' type-id='type-id-69' filepath='../../include/libzfs.h' line='195' column='1' id='type-id-72'/>
    <typedef-decl name='nvlist_t' type-id='type-id-73' filepath='../../include/sys/nvpair.h' line='91' column='1' id='type-id-74'/>
    <class-decl name='nvlist' size-in-bits='192' is-struct='yes' visibility='default' filepath='../../include/sys/nvpair.h' line='85' column='1' id='type-id-73'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nvl_version' type-id='type-id-75' visibility='default' filepath='../../include/sys/nvpair.h' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='nvl_nvflag' type-id='type-id-76' visibility='default' filepath='../../include/sys/nvpair.h' line='87' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='nvl_priv' type-id='type-id-53' visibility='default' filepath='../../include/sys/nvpair.h' line='88' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='nvl_flag' type-id='type-id-76' visibility='default' filepath='../../include/sys/nvpair.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='nvl_pad' type-id='type-id-75' visibility='default' filepath='../../include/sys/nvpair.h' line='90' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='int32_t' type-id='type-id-77' filepath='/usr/include/bits/stdint-intn.h' line='26' column='1' id='type-id-75'/>
    <typedef-decl name='__int32_t' type-id='type-id-22' filepath='/usr/include/bits/types.h' line='41' column='1' id='type-id-77'/>
    <typedef-decl name='uint32_t' type-id='type-id-78' filepath='/usr/include/bits/stdint-uintn.h' line='26' column='1' id='type-id-76'/>
    <typedef-decl name='__uint32_t' type-id='type-id-29' filepath='/usr/include/bits/types.h' line='42' column='1' id='type-id-78'/>
    <typedef-decl name='uint64_t' type-id='type-id-79' filepath='/usr/include/bits/stdint-uintn.h' line='27' column='1' id='type-id-53'/>
    <typedef-decl name='__uint64_t' type-id='type-id-3' filepath='/usr/include/bits/types.h' line='45' column='1' id='type-id-79'/>
    <typedef-decl name='diskaddr_t' type-id='type-id-80' filepath='../../lib/libspl/include/sys/stdtypes.h' line='41' column='1' id='type-id-70'/>
    <typedef-decl name='longlong_t' type-id='type-id-24' filepath='../../lib/libspl/include/sys/stdtypes.h' line='36' column='1' id='type-id-80'/>
    <typedef-decl name='pthread_mutex_t' type-id='type-id-81' filepath='/usr/include/bits/pthreadtypes.h' line='72' column='1' id='type-id-54'/>
    <union-decl name='__anonymous_union__' size-in-bits='320' is-anonymous='yes' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='67' column='1' id='type-id-81'>
      <data-member access='private'>
        <var-decl name='__data' type-id='type-id-82' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='69' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='__size' type-id='type-id-14' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='70' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='__align' type-id='type-id-23' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='71' column='1'/>
      </data-member>
    </union-decl>
    <class-decl name='__pthread_mutex_s' size-in-bits='320' is-struct='yes' visibility='default' filepath='/usr/include/bits/struct_mutex.h' line='22' column='1' id='type-id-82'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__lock' type-id='type-id-22' visibility='default' filepath='/usr/include/bits/struct_mutex.h' line='24' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='__count' type-id='type-id-29' visibility='default' filepath='/usr/include/bits/struct_mutex.h' line='25' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__owner' type-id='type-id-22' visibility='default' filepath='/usr/include/bits/struct_mutex.h' line='26' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='__nusers' type-id='type-id-29' visibility='default' filepath='/usr/include/bits/struct_mutex.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='__kind' type-id='type-id-22' visibility='default' filepath='/usr/include/bits/struct_mutex.h' line='32' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='__spins' type-id='type-id-25' visibility='default' filepath='/usr/include/bits/struct_mutex.h' line='34' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='176'>
        <var-decl name='__elision' type-id='type-id-25' visibility='default' filepath='/usr/include/bits/struct_mutex.h' line='35' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='__list' type-id='type-id-83' visibility='default' filepath='/usr/include/bits/struct_mutex.h' line='36' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__pthread_list_t' type-id='type-id-84' filepath='/usr/include/bits/thread-shared-types.h' line='53' column='1' id='type-id-83'/>
    <class-decl name='__pthread_internal_list' size-in-bits='128' is-struct='yes' visibility='default' filepath='/usr/include/bits/thread-shared-types.h' line='49' column='1' id='type-id-84'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__prev' type-id='type-id-85' visibility='default' filepath='/usr/include/bits/thread-shared-types.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__next' type-id='type-id-85' visibility='default' filepath='/usr/include/bits/thread-shared-types.h' line='52' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='avl_tree_t' type-id='type-id-86' filepath='../../include/sys/avl.h' line='119' column='1' id='type-id-55'/>
    <class-decl name='avl_tree' size-in-bits='320' is-struct='yes' visibility='default' filepath='../../include/sys/avl_impl.h' line='146' column='1' id='type-id-86'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='avl_root' type-id='type-id-1' visibility='default' filepath='../../include/sys/avl_impl.h' line='147' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='avl_compar' type-id='type-id-87' visibility='default' filepath='../../include/sys/avl_impl.h' line='148' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='avl_offset' type-id='type-id-67' visibility='default' filepath='../../include/sys/avl_impl.h' line='149' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='avl_numnodes' type-id='type-id-88' visibility='default' filepath='../../include/sys/avl_impl.h' line='150' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='avl_size' type-id='type-id-67' visibility='default' filepath='../../include/sys/avl_impl.h' line='151' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='avl_node' size-in-bits='192' is-struct='yes' visibility='default' filepath='../../include/sys/avl_impl.h' line='90' column='1' id='type-id-89'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='avl_child' type-id='type-id-2' visibility='default' filepath='../../include/sys/avl_impl.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='avl_pcb' type-id='type-id-90' visibility='default' filepath='../../include/sys/avl_impl.h' line='92' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='uintptr_t' type-id='type-id-3' filepath='/usr/include/stdint.h' line='90' column='1' id='type-id-90'/>
    <typedef-decl name='ulong_t' type-id='type-id-3' filepath='../../lib/libspl/include/sys/stdtypes.h' line='34' column='1' id='type-id-88'/>
    <typedef-decl name='regex_t' type-id='type-id-91' filepath='/usr/include/regex.h' line='478' column='1' id='type-id-56'/>
    <class-decl name='re_pattern_buffer' size-in-bits='512' is-struct='yes' visibility='default' filepath='/usr/include/regex.h' line='413' column='1' id='type-id-91'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='buffer' type-id='type-id-92' visibility='default' filepath='/usr/include/regex.h' line='417' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='allocated' type-id='type-id-93' visibility='default' filepath='/usr/include/regex.h' line='420' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='used' type-id='type-id-93' visibility='default' filepath='/usr/include/regex.h' line='423' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='syntax' type-id='type-id-94' visibility='default' filepath='/usr/include/regex.h' line='426' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='fastmap' type-id='type-id-49' visibility='default' filepath='/usr/include/regex.h' line='431' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='translate' type-id='type-id-95' visibility='default' filepath='/usr/include/regex.h' line='437' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='re_nsub' type-id='type-id-67' visibility='default' filepath='/usr/include/regex.h' line='440' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31'>
        <var-decl name='can_be_null' type-id='type-id-29' visibility='default' filepath='/usr/include/regex.h' line='446' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='29'>
        <var-decl name='regs_allocated' type-id='type-id-29' visibility='default' filepath='/usr/include/regex.h' line='457' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='28'>
        <var-decl name='fastmap_accurate' type-id='type-id-29' visibility='default' filepath='/usr/include/regex.h' line='461' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='27'>
        <var-decl name='no_sub' type-id='type-id-29' visibility='default' filepath='/usr/include/regex.h' line='465' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='26'>
        <var-decl name='not_bol' type-id='type-id-29' visibility='default' filepath='/usr/include/regex.h' line='469' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='25'>
        <var-decl name='not_eol' type-id='type-id-29' visibility='default' filepath='/usr/include/regex.h' line='472' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='newline_anchor' type-id='type-id-29' visibility='default' filepath='/usr/include/regex.h' line='475' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__re_long_size_t' type-id='type-id-3' filepath='/usr/include/regex.h' line='56' column='1' id='type-id-93'/>
    <typedef-decl name='reg_syntax_t' type-id='type-id-3' filepath='/usr/include/regex.h' line='72' column='1' id='type-id-94'/>
    <typedef-decl name='zfs_type_t' type-id='type-id-96' filepath='../../include/sys/fs/zfs.h' line='58' column='1' id='type-id-46'/>
    <enum-decl name='__anonymous_enum__2' is-anonymous='yes' filepath='../../include/sys/fs/zfs.h' line='52' column='1' id='type-id-96'>
      <underlying-type type-id='type-id-27'/>
      <enumerator name='ZFS_TYPE_FILESYSTEM' value='1'/>
      <enumerator name='ZFS_TYPE_SNAPSHOT' value='2'/>
      <enumerator name='ZFS_TYPE_VOLUME' value='4'/>
      <enumerator name='ZFS_TYPE_POOL' value='8'/>
      <enumerator name='ZFS_TYPE_BOOKMARK' value='16'/>
    </enum-decl>
    <typedef-decl name='dmu_objset_stats_t' type-id='type-id-97' filepath='../../include/sys/dmu.h' line='943' column='1' id='type-id-47'/>
    <class-decl name='dmu_objset_stats' size-in-bits='2304' is-struct='yes' visibility='default' filepath='../../include/sys/dmu.h' line='934' column='1' id='type-id-97'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='dds_num_clones' type-id='type-id-53' visibility='default' filepath='../../include/sys/dmu.h' line='935' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='dds_creation_txg' type-id='type-id-53' visibility='default' filepath='../../include/sys/dmu.h' line='936' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='dds_guid' type-id='type-id-53' visibility='default' filepath='../../include/sys/dmu.h' line='937' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='dds_type' type-id='type-id-98' visibility='default' filepath='../../include/sys/dmu.h' line='938' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='dds_is_snapshot' type-id='type-id-99' visibility='default' filepath='../../include/sys/dmu.h' line='939' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='232'>
        <var-decl name='dds_inconsistent' type-id='type-id-99' visibility='default' filepath='../../include/sys/dmu.h' line='940' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='240'>
        <var-decl name='dds_redacted' type-id='type-id-99' visibility='default' filepath='../../include/sys/dmu.h' line='941' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='248'>
        <var-decl name='dds_origin' type-id='type-id-12' visibility='default' filepath='../../include/sys/dmu.h' line='942' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='dmu_objset_type_t' type-id='type-id-100' filepath='../../include/sys/fs/zfs.h' line='72' column='1' id='type-id-98'/>
    <enum-decl name='dmu_objset_type' filepath='../../include/sys/fs/zfs.h' line='64' column='1' id='type-id-100'>
      <underlying-type type-id='type-id-27'/>
      <enumerator name='DMU_OST_NONE' value='0'/>
      <enumerator name='DMU_OST_META' value='1'/>
      <enumerator name='DMU_OST_ZFS' value='2'/>
      <enumerator name='DMU_OST_ZVOL' value='3'/>
      <enumerator name='DMU_OST_OTHER' value='4'/>
      <enumerator name='DMU_OST_ANY' value='5'/>
      <enumerator name='DMU_OST_NUMTYPES' value='6'/>
    </enum-decl>
    <typedef-decl name='uint8_t' type-id='type-id-101' filepath='/usr/include/bits/stdint-uintn.h' line='24' column='1' id='type-id-99'/>
    <typedef-decl name='__uint8_t' type-id='type-id-28' filepath='/usr/include/bits/types.h' line='38' column='1' id='type-id-101'/>
    <typedef-decl name='zfs_share_proto_t' type-id='type-id-102' filepath='../../include/libzfs_impl.h' line='114' column='1' id='type-id-103'/>
    <enum-decl name='__anonymous_enum__3' is-anonymous='yes' filepath='../../include/libzfs_impl.h' line='110' column='1' id='type-id-102'>
      <underlying-type type-id='type-id-27'/>
      <enumerator name='PROTO_NFS' value='0'/>
      <enumerator name='PROTO_SMB' value='1'/>
      <enumerator name='PROTO_END' value='2'/>
    </enum-decl>
    <pointer-type-def type-id='type-id-58' size-in-bits='64' id='type-id-52'/>
    <pointer-type-def type-id='type-id-57' size-in-bits='64' id='type-id-60'/>
    <pointer-type-def type-id='type-id-16' size-in-bits='64' id='type-id-64'/>
    <pointer-type-def type-id='type-id-68' size-in-bits='64' id='type-id-62'/>
    <pointer-type-def type-id='type-id-17' size-in-bits='64' id='type-id-59'/>
    <pointer-type-def type-id='type-id-18' size-in-bits='64' id='type-id-65'/>
    <pointer-type-def type-id='type-id-84' size-in-bits='64' id='type-id-85'/>
    <pointer-type-def type-id='type-id-89' size-in-bits='64' id='type-id-1'/>
    <pointer-type-def type-id='type-id-5' size-in-bits='64' id='type-id-49'/>
    <qualified-type-def type-id='type-id-5' const='yes' id='type-id-104'/>
    <pointer-type-def type-id='type-id-104' size-in-bits='64' id='type-id-105'/>
    <pointer-type-def type-id='type-id-106' size-in-bits='64' id='type-id-87'/>
    <pointer-type-def type-id='type-id-71' size-in-bits='64' id='type-id-44'/>
    <pointer-type-def type-id='type-id-74' size-in-bits='64' id='type-id-48'/>
    <pointer-type-def type-id='type-id-33' size-in-bits='64' id='type-id-107'/>
    <pointer-type-def type-id='type-id-19' size-in-bits='64' id='type-id-92'/>
    <pointer-type-def type-id='type-id-99' size-in-bits='64' id='type-id-50'/>
    <pointer-type-def type-id='type-id-28' size-in-bits='64' id='type-id-95'/>
    <pointer-type-def type-id='type-id-39' size-in-bits='64' id='type-id-35'/>
    <pointer-type-def type-id='type-id-40' size-in-bits='64' id='type-id-36'/>
    <pointer-type-def type-id='type-id-31' size-in-bits='64' id='type-id-66'/>
    <pointer-type-def type-id='type-id-43' size-in-bits='64' id='type-id-108'/>
    <pointer-type-def type-id='type-id-103' size-in-bits='64' id='type-id-109'/>
    <pointer-type-def type-id='type-id-72' size-in-bits='64' id='type-id-45'/>
    <function-decl name='changelist_gather' mangled-name='changelist_gather' filepath='/home/fedora/zfs/lib/libzfs/libzfs_changelist.c' line='624' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='changelist_gather'>
      <parameter type-id='type-id-108' name='zhp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_changelist.c' line='624' column='1'/>
      <parameter type-id='type-id-34' name='prop' filepath='/home/fedora/zfs/lib/libzfs/libzfs_changelist.c' line='624' column='1'/>
      <parameter type-id='type-id-22' name='gather_flags' filepath='/home/fedora/zfs/lib/libzfs/libzfs_changelist.c' line='624' column='1'/>
      <parameter type-id='type-id-22' name='mnt_flags' filepath='/home/fedora/zfs/lib/libzfs/libzfs_changelist.c' line='625' column='1'/>
      <return type-id='type-id-107'/>
    </function-decl>
    <function-decl name='changelist_free' mangled-name='changelist_free' filepath='/home/fedora/zfs/lib/libzfs/libzfs_changelist.c' line='412' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='changelist_free'>
      <parameter type-id='type-id-107' name='clp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_changelist.c' line='412' column='1'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='changelist_remove' mangled-name='changelist_remove' filepath='/home/fedora/zfs/lib/libzfs/libzfs_changelist.c' line='387' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='changelist_remove'>
      <parameter type-id='type-id-107' name='clp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_changelist.c' line='387' column='1'/>
      <parameter type-id='type-id-105' name='name' filepath='/home/fedora/zfs/lib/libzfs/libzfs_changelist.c' line='387' column='1'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='changelist_haszonedchild' mangled-name='changelist_haszonedchild' filepath='/home/fedora/zfs/lib/libzfs/libzfs_changelist.c' line='378' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='changelist_haszonedchild'>
      <parameter type-id='type-id-107' name='clp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_changelist.c' line='378' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='changelist_unshare' mangled-name='changelist_unshare' filepath='/home/fedora/zfs/lib/libzfs/libzfs_changelist.c' line='348' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='changelist_unshare'>
      <parameter type-id='type-id-107' name='clp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_changelist.c' line='348' column='1'/>
      <parameter type-id='type-id-109' name='proto' filepath='/home/fedora/zfs/lib/libzfs/libzfs_changelist.c' line='348' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='changelist_rename' mangled-name='changelist_rename' filepath='/home/fedora/zfs/lib/libzfs/libzfs_changelist.c' line='311' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='changelist_rename'>
      <parameter type-id='type-id-107' name='clp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_changelist.c' line='311' column='1'/>
      <parameter type-id='type-id-105' name='src' filepath='/home/fedora/zfs/lib/libzfs/libzfs_changelist.c' line='311' column='1'/>
      <parameter type-id='type-id-105' name='dst' filepath='/home/fedora/zfs/lib/libzfs/libzfs_changelist.c' line='311' column='1'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='isa_child_of' mangled-name='isa_child_of' filepath='/home/fedora/zfs/lib/libzfs/libzfs_changelist.c' line='288' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='isa_child_of'>
      <parameter type-id='type-id-105' name='dataset' filepath='/home/fedora/zfs/lib/libzfs/libzfs_changelist.c' line='288' column='1'/>
      <parameter type-id='type-id-105' name='parent' filepath='/home/fedora/zfs/lib/libzfs/libzfs_changelist.c' line='288' column='1'/>
      <return type-id='type-id-37'/>
    </function-decl>
    <function-decl name='changelist_postfix' mangled-name='changelist_postfix' filepath='/home/fedora/zfs/lib/libzfs/libzfs_changelist.c' line='170' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='changelist_postfix'>
      <parameter type-id='type-id-107' name='clp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_changelist.c' line='170' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='changelist_prefix' mangled-name='changelist_prefix' filepath='/home/fedora/zfs/lib/libzfs/libzfs_changelist.c' line='96' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='changelist_prefix'>
      <parameter type-id='type-id-107' name='clp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_changelist.c' line='96' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-106'>
      <parameter type-id='type-id-66'/>
      <parameter type-id='type-id-66'/>
      <return type-id='type-id-22'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='libzfs_config.c' comp-dir-path='/home/fedora/zfs/lib/libzfs' language='LANG_C99'>
    <typedef-decl name='zfs_iter_f' type-id='type-id-110' filepath='../../include/libzfs.h' line='609' column='1' id='type-id-111'/>
    <typedef-decl name='zpool_iter_f' type-id='type-id-112' filepath='../../include/libzfs.h' line='245' column='1' id='type-id-113'/>
    <pointer-type-def type-id='type-id-37' size-in-bits='64' id='type-id-114'/>
    <pointer-type-def type-id='type-id-115' size-in-bits='64' id='type-id-110'/>
    <pointer-type-def type-id='type-id-116' size-in-bits='64' id='type-id-112'/>
    <pointer-type-def type-id='type-id-48' size-in-bits='64' id='type-id-117'/>
    <function-decl name='zfs_iter_root' mangled-name='zfs_iter_root' filepath='/home/fedora/zfs/lib/libzfs/libzfs_config.c' line='434' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_iter_root'>
      <parameter type-id='type-id-44' name='hdl' filepath='/home/fedora/zfs/lib/libzfs/libzfs_config.c' line='434' column='1'/>
      <parameter type-id='type-id-111' name='func' filepath='/home/fedora/zfs/lib/libzfs/libzfs_config.c' line='434' column='1'/>
      <parameter type-id='type-id-66' name='data' filepath='/home/fedora/zfs/lib/libzfs/libzfs_config.c' line='434' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zpool_iter' mangled-name='zpool_iter' filepath='/home/fedora/zfs/lib/libzfs/libzfs_config.c' line='389' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_iter'>
      <parameter type-id='type-id-44' name='hdl' filepath='/home/fedora/zfs/lib/libzfs/libzfs_config.c' line='389' column='1'/>
      <parameter type-id='type-id-113' name='func' filepath='/home/fedora/zfs/lib/libzfs/libzfs_config.c' line='389' column='1'/>
      <parameter type-id='type-id-66' name='data' filepath='/home/fedora/zfs/lib/libzfs/libzfs_config.c' line='389' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zpool_skip_pool' mangled-name='zpool_skip_pool' filepath='/home/fedora/zfs/lib/libzfs/libzfs_config.c' line='340' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_skip_pool'>
      <parameter type-id='type-id-105' name='poolname' filepath='/home/fedora/zfs/lib/libzfs/libzfs_config.c' line='340' column='1'/>
      <return type-id='type-id-37'/>
    </function-decl>
    <function-decl name='zpool_refresh_stats' mangled-name='zpool_refresh_stats' filepath='/home/fedora/zfs/lib/libzfs/libzfs_config.c' line='265' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_refresh_stats'>
      <parameter type-id='type-id-45' name='zhp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_config.c' line='265' column='1'/>
      <parameter type-id='type-id-114' name='missing' filepath='/home/fedora/zfs/lib/libzfs/libzfs_config.c' line='265' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zpool_get_features' mangled-name='zpool_get_features' filepath='/home/fedora/zfs/lib/libzfs/libzfs_config.c' line='232' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_get_features'>
      <parameter type-id='type-id-45' name='zhp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_config.c' line='232' column='1'/>
      <return type-id='type-id-48'/>
    </function-decl>
    <function-decl name='zpool_get_config' mangled-name='zpool_get_config' filepath='/home/fedora/zfs/lib/libzfs/libzfs_config.c' line='220' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_get_config'>
      <parameter type-id='type-id-45' name='zhp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_config.c' line='220' column='1'/>
      <parameter type-id='type-id-117' name='oldconfig' filepath='/home/fedora/zfs/lib/libzfs/libzfs_config.c' line='220' column='1'/>
      <return type-id='type-id-48'/>
    </function-decl>
    <function-decl name='namespace_clear' mangled-name='namespace_clear' filepath='/home/fedora/zfs/lib/libzfs/libzfs_config.c' line='79' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='namespace_clear'>
      <parameter type-id='type-id-44' name='hdl' filepath='/home/fedora/zfs/lib/libzfs/libzfs_config.c' line='79' column='1'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='__builtin_memset' mangled-name='memset' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-115'>
      <parameter type-id='type-id-108'/>
      <parameter type-id='type-id-66'/>
      <return type-id='type-id-22'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-116'>
      <parameter type-id='type-id-45'/>
      <parameter type-id='type-id-66'/>
      <return type-id='type-id-22'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='libzfs_crypto.c' comp-dir-path='/home/fedora/zfs/lib/libzfs' language='LANG_C99'>
    <typedef-decl name='uint_t' type-id='type-id-29' filepath='../../lib/libspl/include/sys/stdtypes.h' line='33' column='1' id='type-id-118'/>
    <pointer-type-def type-id='type-id-50' size-in-bits='64' id='type-id-119'/>
    <pointer-type-def type-id='type-id-118' size-in-bits='64' id='type-id-120'/>
    <function-decl name='zfs_crypto_rewrap' mangled-name='zfs_crypto_rewrap' filepath='/home/fedora/zfs/lib/libzfs/libzfs_crypto.c' line='1389' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_crypto_rewrap'>
      <parameter type-id='type-id-108' name='zhp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_crypto.c' line='1389' column='1'/>
      <parameter type-id='type-id-48' name='raw_props' filepath='/home/fedora/zfs/lib/libzfs/libzfs_crypto.c' line='1389' column='1'/>
      <parameter type-id='type-id-37' name='inheritkey' filepath='/home/fedora/zfs/lib/libzfs/libzfs_crypto.c' line='1389' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zfs_crypto_unload_key' mangled-name='zfs_crypto_unload_key' filepath='/home/fedora/zfs/lib/libzfs/libzfs_crypto.c' line='1253' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_crypto_unload_key'>
      <parameter type-id='type-id-108' name='zhp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_crypto.c' line='1253' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zfs_crypto_load_key' mangled-name='zfs_crypto_load_key' filepath='/home/fedora/zfs/lib/libzfs/libzfs_crypto.c' line='1085' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_crypto_load_key'>
      <parameter type-id='type-id-108' name='zhp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_crypto.c' line='1085' column='1'/>
      <parameter type-id='type-id-37' name='noop' filepath='/home/fedora/zfs/lib/libzfs/libzfs_crypto.c' line='1085' column='1'/>
      <parameter type-id='type-id-49' name='alt_keylocation' filepath='/home/fedora/zfs/lib/libzfs/libzfs_crypto.c' line='1085' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zfs_crypto_attempt_load_keys' mangled-name='zfs_crypto_attempt_load_keys' filepath='/home/fedora/zfs/lib/libzfs/libzfs_crypto.c' line='1050' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_crypto_attempt_load_keys'>
      <parameter type-id='type-id-44' name='hdl' filepath='/home/fedora/zfs/lib/libzfs/libzfs_crypto.c' line='1050' column='1'/>
      <parameter type-id='type-id-49' name='fsname' filepath='/home/fedora/zfs/lib/libzfs/libzfs_crypto.c' line='1050' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zfs_crypto_clone_check' mangled-name='zfs_crypto_clone_check' filepath='/home/fedora/zfs/lib/libzfs/libzfs_crypto.c' line='984' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_crypto_clone_check'>
      <parameter type-id='type-id-44' name='hdl' filepath='/home/fedora/zfs/lib/libzfs/libzfs_crypto.c' line='984' column='1'/>
      <parameter type-id='type-id-108' name='origin_zhp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_crypto.c' line='984' column='1'/>
      <parameter type-id='type-id-49' name='parent_name' filepath='/home/fedora/zfs/lib/libzfs/libzfs_crypto.c' line='985' column='1'/>
      <parameter type-id='type-id-48' name='props' filepath='/home/fedora/zfs/lib/libzfs/libzfs_crypto.c' line='985' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zfs_crypto_create' mangled-name='zfs_crypto_create' filepath='/home/fedora/zfs/lib/libzfs/libzfs_crypto.c' line='812' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_crypto_create'>
      <parameter type-id='type-id-44' name='hdl' filepath='/home/fedora/zfs/lib/libzfs/libzfs_crypto.c' line='812' column='1'/>
      <parameter type-id='type-id-49' name='parent_name' filepath='/home/fedora/zfs/lib/libzfs/libzfs_crypto.c' line='812' column='1'/>
      <parameter type-id='type-id-48' name='props' filepath='/home/fedora/zfs/lib/libzfs/libzfs_crypto.c' line='812' column='1'/>
      <parameter type-id='type-id-48' name='pool_props' filepath='/home/fedora/zfs/lib/libzfs/libzfs_crypto.c' line='813' column='1'/>
      <parameter type-id='type-id-37' name='stdin_available' filepath='/home/fedora/zfs/lib/libzfs/libzfs_crypto.c' line='813' column='1'/>
      <parameter type-id='type-id-119' name='wkeydata_out' filepath='/home/fedora/zfs/lib/libzfs/libzfs_crypto.c' line='813' column='1'/>
      <parameter type-id='type-id-120' name='wkeylen_out' filepath='/home/fedora/zfs/lib/libzfs/libzfs_crypto.c' line='814' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zfs_crypto_get_encryption_root' mangled-name='zfs_crypto_get_encryption_root' filepath='/home/fedora/zfs/lib/libzfs/libzfs_crypto.c' line='781' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_crypto_get_encryption_root'>
      <parameter type-id='type-id-108' name='zhp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_crypto.c' line='781' column='1'/>
      <parameter type-id='type-id-114' name='is_encroot' filepath='/home/fedora/zfs/lib/libzfs/libzfs_crypto.c' line='781' column='1'/>
      <parameter type-id='type-id-49' name='buf' filepath='/home/fedora/zfs/lib/libzfs/libzfs_crypto.c' line='782' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='__builtin_memcpy' mangled-name='memcpy' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='__builtin_putchar' mangled-name='putchar' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='__builtin_memmove' mangled-name='memmove' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-31'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='libzfs_dataset.c' comp-dir-path='/home/fedora/zfs/lib/libzfs' language='LANG_C99'>



    <array-type-def dimensions='1' type-id='type-id-5' size-in-bits='32768' id='type-id-121'>
      <subrange length='4096' type-id='type-id-3' id='type-id-122'/>

    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-5' size-in-bits='65536' id='type-id-123'>
      <subrange length='8192' type-id='type-id-3' id='type-id-124'/>

    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-53' size-in-bits='128' id='type-id-125'>
      <subrange length='2' type-id='type-id-3' id='type-id-4'/>

    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-99' size-in-bits='24' id='type-id-126'>
      <subrange length='3' type-id='type-id-3' id='type-id-127'/>

    </array-type-def>
    <typedef-decl name='zfs_wait_activity_t' type-id='type-id-128' filepath='../../include/sys/fs/zfs.h' line='1427' column='1' id='type-id-129'/>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' filepath='../../include/sys/fs/zfs.h' line='1424' column='1' id='type-id-128'>
      <underlying-type type-id='type-id-27'/>
      <enumerator name='ZFS_WAIT_DELETEQ' value='0'/>
      <enumerator name='ZFS_WAIT_NUM_ACTIVITIES' value='1'/>
    </enum-decl>
    <typedef-decl name='zfs_userquota_prop_t' type-id='type-id-130' filepath='../../include/sys/fs/zfs.h' line='206' column='1' id='type-id-131'/>
    <enum-decl name='__anonymous_enum__1' is-anonymous='yes' filepath='../../include/sys/fs/zfs.h' line='192' column='1' id='type-id-130'>
      <underlying-type type-id='type-id-27'/>
      <enumerator name='ZFS_PROP_USERUSED' value='0'/>
      <enumerator name='ZFS_PROP_USERQUOTA' value='1'/>
      <enumerator name='ZFS_PROP_GROUPUSED' value='2'/>
      <enumerator name='ZFS_PROP_GROUPQUOTA' value='3'/>
      <enumerator name='ZFS_PROP_USEROBJUSED' value='4'/>
      <enumerator name='ZFS_PROP_USEROBJQUOTA' value='5'/>
      <enumerator name='ZFS_PROP_GROUPOBJUSED' value='6'/>
      <enumerator name='ZFS_PROP_GROUPOBJQUOTA' value='7'/>
      <enumerator name='ZFS_PROP_PROJECTUSED' value='8'/>
      <enumerator name='ZFS_PROP_PROJECTQUOTA' value='9'/>
      <enumerator name='ZFS_PROP_PROJECTOBJUSED' value='10'/>
      <enumerator name='ZFS_PROP_PROJECTOBJQUOTA' value='11'/>
      <enumerator name='ZFS_NUM_USERQUOTA_PROPS' value='12'/>
    </enum-decl>
    <typedef-decl name='zfs_userspace_cb_t' type-id='type-id-132' filepath='../../include/libzfs.h' line='732' column='1' id='type-id-133'/>
    <typedef-decl name='uid_t' type-id='type-id-134' filepath='/usr/include/sys/types.h' line='79' column='1' id='type-id-135'/>
    <typedef-decl name='__uid_t' type-id='type-id-29' filepath='/usr/include/bits/types.h' line='146' column='1' id='type-id-134'/>
    <typedef-decl name='zprop_list_t' type-id='type-id-136' filepath='../../include/libzfs.h' line='541' column='1' id='type-id-137'/>
    <class-decl name='zprop_list' size-in-bits='448' is-struct='yes' visibility='default' filepath='../../include/libzfs.h' line='533' column='1' id='type-id-136'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='pl_prop' type-id='type-id-22' visibility='default' filepath='../../include/libzfs.h' line='534' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='pl_user_prop' type-id='type-id-49' visibility='default' filepath='../../include/libzfs.h' line='535' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='pl_next' type-id='type-id-138' visibility='default' filepath='../../include/libzfs.h' line='536' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='pl_all' type-id='type-id-37' visibility='default' filepath='../../include/libzfs.h' line='537' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='pl_width' type-id='type-id-67' visibility='default' filepath='../../include/libzfs.h' line='538' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='pl_recvd_width' type-id='type-id-67' visibility='default' filepath='../../include/libzfs.h' line='539' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='pl_fixed' type-id='type-id-37' visibility='default' filepath='../../include/libzfs.h' line='540' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='renameflags_t' type-id='type-id-139' filepath='../../include/libzfs.h' line='656' column='1' id='type-id-140'/>
    <class-decl name='renameflags' size-in-bits='32' is-struct='yes' visibility='default' filepath='../../include/libzfs.h' line='647' column='1' id='type-id-139'>
      <data-member access='public' layout-offset-in-bits='31'>
        <var-decl name='recursive' type-id='type-id-22' visibility='default' filepath='../../include/libzfs.h' line='649' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='30'>
        <var-decl name='nounmount' type-id='type-id-22' visibility='default' filepath='../../include/libzfs.h' line='652' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='29'>
        <var-decl name='forceunmount' type-id='type-id-22' visibility='default' filepath='../../include/libzfs.h' line='655' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='zprop_source_t' type-id='type-id-141' filepath='../../include/sys/fs/zfs.h' line='265' column='1' id='type-id-142'/>
    <enum-decl name='__anonymous_enum__2' is-anonymous='yes' filepath='../../include/sys/fs/zfs.h' line='258' column='1' id='type-id-141'>
      <underlying-type type-id='type-id-27'/>
      <enumerator name='ZPROP_SRC_NONE' value='1'/>
      <enumerator name='ZPROP_SRC_DEFAULT' value='2'/>
      <enumerator name='ZPROP_SRC_TEMPORARY' value='4'/>
      <enumerator name='ZPROP_SRC_LOCAL' value='8'/>
      <enumerator name='ZPROP_SRC_INHERITED' value='16'/>
      <enumerator name='ZPROP_SRC_RECEIVED' value='32'/>
    </enum-decl>
    <class-decl name='mnttab' size-in-bits='256' is-struct='yes' visibility='default' filepath='../../lib/libspl/include/os/linux/sys/mnttab.h' line='49' column='1' id='type-id-143'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mnt_special' type-id='type-id-49' visibility='default' filepath='../../lib/libspl/include/os/linux/sys/mnttab.h' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='mnt_mountp' type-id='type-id-49' visibility='default' filepath='../../lib/libspl/include/os/linux/sys/mnttab.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='mnt_fstype' type-id='type-id-49' visibility='default' filepath='../../lib/libspl/include/os/linux/sys/mnttab.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='mnt_mntopts' type-id='type-id-49' visibility='default' filepath='../../lib/libspl/include/os/linux/sys/mnttab.h' line='53' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='zfs_cmd_t' type-id='type-id-144' filepath='../../include/sys/zfs_ioctl.h' line='518' column='1' id='type-id-145'/>
    <class-decl name='zfs_cmd' size-in-bits='109952' is-struct='yes' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='477' column='1' id='type-id-144'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='zc_name' type-id='type-id-121' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='478' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32768'>
        <var-decl name='zc_nvlist_src' type-id='type-id-53' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='479' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32832'>
        <var-decl name='zc_nvlist_src_size' type-id='type-id-53' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='480' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32896'>
        <var-decl name='zc_nvlist_dst' type-id='type-id-53' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='481' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32960'>
        <var-decl name='zc_nvlist_dst_size' type-id='type-id-53' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='482' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='33024'>
        <var-decl name='zc_nvlist_dst_filled' type-id='type-id-37' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='483' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='33056'>
        <var-decl name='zc_pad2' type-id='type-id-22' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='484' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='33088'>
        <var-decl name='zc_history' type-id='type-id-53' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='490' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='33152'>
        <var-decl name='zc_value' type-id='type-id-123' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='491' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='98688'>
        <var-decl name='zc_string' type-id='type-id-12' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='492' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='100736'>
        <var-decl name='zc_guid' type-id='type-id-53' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='493' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='100800'>
        <var-decl name='zc_nvlist_conf' type-id='type-id-53' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='494' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='100864'>
        <var-decl name='zc_nvlist_conf_size' type-id='type-id-53' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='495' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='100928'>
        <var-decl name='zc_cookie' type-id='type-id-53' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='496' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='100992'>
        <var-decl name='zc_objset_type' type-id='type-id-53' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='497' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='101056'>
        <var-decl name='zc_perm_action' type-id='type-id-53' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='498' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='101120'>
        <var-decl name='zc_history_len' type-id='type-id-53' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='499' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='101184'>
        <var-decl name='zc_history_offset' type-id='type-id-53' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='500' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='101248'>
        <var-decl name='zc_obj' type-id='type-id-53' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='501' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='101312'>
        <var-decl name='zc_iflags' type-id='type-id-53' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='502' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='101376'>
        <var-decl name='zc_share' type-id='type-id-146' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='503' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='101632'>
        <var-decl name='zc_objset_stats' type-id='type-id-47' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='504' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='103936'>
        <var-decl name='zc_begin_record' type-id='type-id-147' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='505' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='106368'>
        <var-decl name='zc_inject_record' type-id='type-id-148' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='506' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109184'>
        <var-decl name='zc_defer_destroy' type-id='type-id-76' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='507' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109216'>
        <var-decl name='zc_flags' type-id='type-id-76' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='508' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109248'>
        <var-decl name='zc_action_handle' type-id='type-id-53' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='509' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109312'>
        <var-decl name='zc_cleanup_fd' type-id='type-id-22' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='510' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109344'>
        <var-decl name='zc_simple' type-id='type-id-99' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='511' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109352'>
        <var-decl name='zc_pad' type-id='type-id-126' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='512' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109376'>
        <var-decl name='zc_sendobj' type-id='type-id-53' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='513' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109440'>
        <var-decl name='zc_fromobj' type-id='type-id-53' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='514' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109504'>
        <var-decl name='zc_createtxg' type-id='type-id-53' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='515' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109568'>
        <var-decl name='zc_stat' type-id='type-id-149' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='516' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109888'>
        <var-decl name='zc_zoneid' type-id='type-id-53' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='517' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='zfs_share_t' type-id='type-id-150' filepath='../../include/sys/zfs_ioctl.h' line='457' column='1' id='type-id-146'/>
    <class-decl name='zfs_share' size-in-bits='256' is-struct='yes' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='452' column='1' id='type-id-150'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='z_exportdata' type-id='type-id-53' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='453' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='z_sharedata' type-id='type-id-53' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='454' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='z_sharetype' type-id='type-id-53' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='455' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='z_sharemax' type-id='type-id-53' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='456' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='drr_begin' size-in-bits='2432' is-struct='yes' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='231' column='1' id='type-id-147'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='drr_magic' type-id='type-id-53' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='232' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='drr_versioninfo' type-id='type-id-53' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='233' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='drr_creation_time' type-id='type-id-53' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='234' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='drr_type' type-id='type-id-98' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='235' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='drr_flags' type-id='type-id-76' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='236' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='drr_toguid' type-id='type-id-53' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='237' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='drr_fromguid' type-id='type-id-53' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='238' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='drr_toname' type-id='type-id-12' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='239' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='zinject_record_t' type-id='type-id-151' filepath='../../include/sys/zfs_ioctl.h' line='421' column='1' id='type-id-148'/>
    <class-decl name='zinject_record' size-in-bits='2816' is-struct='yes' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='403' column='1' id='type-id-151'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='zi_objset' type-id='type-id-53' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='404' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='zi_object' type-id='type-id-53' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='405' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='zi_start' type-id='type-id-53' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='406' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='zi_end' type-id='type-id-53' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='407' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='zi_guid' type-id='type-id-53' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='408' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='zi_level' type-id='type-id-76' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='409' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='zi_error' type-id='type-id-76' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='410' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='zi_type' type-id='type-id-53' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='411' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='zi_freq' type-id='type-id-76' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='412' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='zi_failfast' type-id='type-id-76' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='413' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='zi_func' type-id='type-id-12' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='414' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2560'>
        <var-decl name='zi_iotype' type-id='type-id-76' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='415' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2592'>
        <var-decl name='zi_duration' type-id='type-id-75' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='416' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2624'>
        <var-decl name='zi_timer' type-id='type-id-53' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='417' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2688'>
        <var-decl name='zi_nlanes' type-id='type-id-53' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='418' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2752'>
        <var-decl name='zi_cmd' type-id='type-id-76' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='419' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2784'>
        <var-decl name='zi_dvas' type-id='type-id-76' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='420' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='zfs_stat_t' type-id='type-id-152' filepath='../../include/sys/zfs_stat.h' line='47' column='1' id='type-id-149'/>
    <class-decl name='zfs_stat' size-in-bits='320' is-struct='yes' visibility='default' filepath='../../include/sys/zfs_stat.h' line='42' column='1' id='type-id-152'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='zs_gen' type-id='type-id-53' visibility='default' filepath='../../include/sys/zfs_stat.h' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='zs_mode' type-id='type-id-53' visibility='default' filepath='../../include/sys/zfs_stat.h' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='zs_links' type-id='type-id-53' visibility='default' filepath='../../include/sys/zfs_stat.h' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='zs_ctime' type-id='type-id-125' visibility='default' filepath='../../include/sys/zfs_stat.h' line='46' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-49' size-in-bits='64' id='type-id-153'/>
    <qualified-type-def type-id='type-id-43' const='yes' id='type-id-154'/>
    <pointer-type-def type-id='type-id-154' size-in-bits='64' id='type-id-155'/>
    <pointer-type-def type-id='type-id-156' size-in-bits='64' id='type-id-132'/>
    <pointer-type-def type-id='type-id-22' size-in-bits='64' id='type-id-157'/>
    <pointer-type-def type-id='type-id-143' size-in-bits='64' id='type-id-158'/>
    <pointer-type-def type-id='type-id-53' size-in-bits='64' id='type-id-159'/>
    <pointer-type-def type-id='type-id-145' size-in-bits='64' id='type-id-160'/>
    <pointer-type-def type-id='type-id-136' size-in-bits='64' id='type-id-138'/>
    <pointer-type-def type-id='type-id-137' size-in-bits='64' id='type-id-161'/>
    <pointer-type-def type-id='type-id-161' size-in-bits='64' id='type-id-162'/>
    <pointer-type-def type-id='type-id-142' size-in-bits='64' id='type-id-163'/>
    <function-decl name='zfs_wait_status' mangled-name='zfs_wait_status' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='5547' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_wait_status'>
      <parameter type-id='type-id-108' name='zhp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='5547' column='1'/>
      <parameter type-id='type-id-129' name='activity' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='5547' column='1'/>
      <parameter type-id='type-id-114' name='missing' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='5548' column='1'/>
      <parameter type-id='type-id-114' name='waited' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='5548' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zvol_volsize_to_reservation' mangled-name='zvol_volsize_to_reservation' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='5491' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zvol_volsize_to_reservation'>
      <parameter type-id='type-id-45' name='zph' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='5491' column='1'/>
      <parameter type-id='type-id-53' name='volsize' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='5491' column='1'/>
      <parameter type-id='type-id-48' name='props' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='5492' column='1'/>
      <return type-id='type-id-53'/>
    </function-decl>
    <function-decl name='zfs_get_holds' mangled-name='zfs_get_holds' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='5233' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_get_holds'>
      <parameter type-id='type-id-108' name='zhp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='5233' column='1'/>
      <parameter type-id='type-id-117' name='nvl' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='5233' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zfs_set_fsacl' mangled-name='zfs_set_fsacl' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='5179' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_set_fsacl'>
      <parameter type-id='type-id-108' name='zhp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='5179' column='1'/>
      <parameter type-id='type-id-37' name='un' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='5179' column='1'/>
      <parameter type-id='type-id-48' name='nvl' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='5179' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zfs_get_fsacl' mangled-name='zfs_get_fsacl' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='5112' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_get_fsacl'>
      <parameter type-id='type-id-108' name='zhp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='5112' column='1'/>
      <parameter type-id='type-id-117' name='nvl' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='5112' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zfs_release' mangled-name='zfs_release' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='5031' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_release'>
      <parameter type-id='type-id-108' name='zhp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='5031' column='1'/>
      <parameter type-id='type-id-105' name='snapname' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='5031' column='1'/>
      <parameter type-id='type-id-105' name='tag' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='5031' column='1'/>
      <parameter type-id='type-id-37' name='recursive' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='5032' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zfs_hold_nvl' mangled-name='zfs_hold_nvl' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='4932' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_hold_nvl'>
      <parameter type-id='type-id-108' name='zhp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='4932' column='1'/>
      <parameter type-id='type-id-22' name='cleanup_fd' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='4932' column='1'/>
      <parameter type-id='type-id-48' name='holds' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='4932' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zfs_hold' mangled-name='zfs_hold' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='4900' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_hold'>
      <parameter type-id='type-id-108' name='zhp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='4900' column='1'/>
      <parameter type-id='type-id-105' name='snapname' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='4900' column='1'/>
      <parameter type-id='type-id-105' name='tag' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='4900' column='1'/>
      <parameter type-id='type-id-37' name='recursive' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='4901' column='1'/>
      <parameter type-id='type-id-22' name='cleanup_fd' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='4901' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zfs_userspace' mangled-name='zfs_userspace' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='4820' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_userspace'>
      <parameter type-id='type-id-108' name='zhp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='4820' column='1'/>
      <parameter type-id='type-id-131' name='type' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='4820' column='1'/>
      <parameter type-id='type-id-133' name='func' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='4821' column='1'/>
      <parameter type-id='type-id-66' name='arg' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='4821' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zfs_smb_acl_rename' mangled-name='zfs_smb_acl_rename' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='4812' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_smb_acl_rename'>
      <parameter type-id='type-id-44' name='hdl' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='4812' column='1'/>
      <parameter type-id='type-id-49' name='dataset' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='4812' column='1'/>
      <parameter type-id='type-id-49' name='path' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='4812' column='1'/>
      <parameter type-id='type-id-49' name='oldname' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='4813' column='1'/>
      <parameter type-id='type-id-49' name='newname' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='4813' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zfs_smb_acl_purge' mangled-name='zfs_smb_acl_purge' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='4805' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_smb_acl_purge'>
      <parameter type-id='type-id-44' name='hdl' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='4805' column='1'/>
      <parameter type-id='type-id-49' name='dataset' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='4805' column='1'/>
      <parameter type-id='type-id-49' name='path' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='4805' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zfs_smb_acl_remove' mangled-name='zfs_smb_acl_remove' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='4797' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_smb_acl_remove'>
      <parameter type-id='type-id-44' name='hdl' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='4797' column='1'/>
      <parameter type-id='type-id-49' name='dataset' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='4797' column='1'/>
      <parameter type-id='type-id-49' name='path' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='4798' column='1'/>
      <parameter type-id='type-id-49' name='resource' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='4798' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zfs_smb_acl_add' mangled-name='zfs_smb_acl_add' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='4789' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_smb_acl_add'>
      <parameter type-id='type-id-44' name='hdl' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='4789' column='1'/>
      <parameter type-id='type-id-49' name='dataset' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='4789' column='1'/>
      <parameter type-id='type-id-49' name='path' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='4790' column='1'/>
      <parameter type-id='type-id-49' name='resource' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='4790' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zfs_prune_proplist' mangled-name='zfs_prune_proplist' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='4707' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prune_proplist'>
      <parameter type-id='type-id-108' name='zhp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='4707' column='1'/>
      <parameter type-id='type-id-50' name='props' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='4707' column='1'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='zfs_expand_proplist' mangled-name='zfs_expand_proplist' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='4610' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_expand_proplist'>
      <parameter type-id='type-id-108' name='zhp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='4610' column='1'/>
      <parameter type-id='type-id-162' name='plp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='4610' column='1'/>
      <parameter type-id='type-id-37' name='received' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='4610' column='1'/>
      <parameter type-id='type-id-37' name='literal' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='4611' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zfs_get_user_props' mangled-name='zfs_get_user_props' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='4591' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_get_user_props'>
      <parameter type-id='type-id-108' name='zhp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='4591' column='1'/>
      <return type-id='type-id-48'/>
    </function-decl>
    <function-decl name='zfs_get_recvd_props' mangled-name='zfs_get_recvd_props' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='4582' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_get_recvd_props'>
      <parameter type-id='type-id-108' name='zhp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='4582' column='1'/>
      <return type-id='type-id-48'/>
    </function-decl>
    <function-decl name='zfs_get_all_props' mangled-name='zfs_get_all_props' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='4576' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_get_all_props'>
      <parameter type-id='type-id-108' name='zhp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='4576' column='1'/>
      <return type-id='type-id-48'/>
    </function-decl>
    <function-decl name='zfs_rename' mangled-name='zfs_rename' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='4374' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_rename'>
      <parameter type-id='type-id-108' name='zhp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='4374' column='1'/>
      <parameter type-id='type-id-105' name='target' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='4374' column='1'/>
      <parameter type-id='type-id-140' name='flags' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='4374' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zfs_rollback' mangled-name='zfs_rollback' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='4274' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_rollback'>
      <parameter type-id='type-id-108' name='zhp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='4274' column='1'/>
      <parameter type-id='type-id-108' name='snap' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='4274' column='1'/>
      <parameter type-id='type-id-37' name='force' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='4274' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zfs_snapshot' mangled-name='zfs_snapshot' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='4173' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_snapshot'>
      <parameter type-id='type-id-44' name='hdl' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='4173' column='1'/>
      <parameter type-id='type-id-105' name='path' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='4173' column='1'/>
      <parameter type-id='type-id-37' name='recursive' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='4173' column='1'/>
      <parameter type-id='type-id-48' name='props' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='4174' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zfs_snapshot_nvl' mangled-name='zfs_snapshot_nvl' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='4093' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_snapshot_nvl'>
      <parameter type-id='type-id-44' name='hdl' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='4093' column='1'/>
      <parameter type-id='type-id-48' name='snaps' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='4093' column='1'/>
      <parameter type-id='type-id-48' name='props' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='4093' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zfs_promote' mangled-name='zfs_promote' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='4009' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_promote'>
      <parameter type-id='type-id-108' name='zhp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='4009' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zfs_clone' mangled-name='zfs_clone' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='3923' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_clone'>
      <parameter type-id='type-id-108' name='zhp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='3923' column='1'/>
      <parameter type-id='type-id-105' name='target' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='3923' column='1'/>
      <parameter type-id='type-id-48' name='props' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='3923' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zfs_destroy_snaps_nvl' mangled-name='zfs_destroy_snaps_nvl' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='3876' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_destroy_snaps_nvl'>
      <parameter type-id='type-id-44' name='hdl' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='3876' column='1'/>
      <parameter type-id='type-id-48' name='snaps' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='3876' column='1'/>
      <parameter type-id='type-id-37' name='defer' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='3876' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zfs_destroy_snaps' mangled-name='zfs_destroy_snaps' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='3852' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_destroy_snaps'>
      <parameter type-id='type-id-108' name='zhp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='3852' column='1'/>
      <parameter type-id='type-id-49' name='snapname' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='3852' column='1'/>
      <parameter type-id='type-id-37' name='defer' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='3852' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zfs_destroy' mangled-name='zfs_destroy' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='3784' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_destroy'>
      <parameter type-id='type-id-108' name='zhp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='3784' column='1'/>
      <parameter type-id='type-id-37' name='defer' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='3784' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zfs_create' mangled-name='zfs_create' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='3609' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_create'>
      <parameter type-id='type-id-44' name='hdl' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='3609' column='1'/>
      <parameter type-id='type-id-105' name='path' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='3609' column='1'/>
      <parameter type-id='type-id-46' name='type' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='3609' column='1'/>
      <parameter type-id='type-id-48' name='props' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='3610' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zfs_create_ancestors' mangled-name='zfs_create_ancestors' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='3572' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_create_ancestors'>
      <parameter type-id='type-id-44' name='hdl' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='3572' column='1'/>
      <parameter type-id='type-id-105' name='path' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='3572' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='create_parents' mangled-name='create_parents' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='3498' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='create_parents'>
      <parameter type-id='type-id-44' name='hdl' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='3498' column='1'/>
      <parameter type-id='type-id-49' name='target' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='3498' column='1'/>
      <parameter type-id='type-id-22' name='prefixlen' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='3498' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zfs_parent_name' mangled-name='zfs_parent_name' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='3377' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_parent_name'>
      <parameter type-id='type-id-108' name='zhp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='3377' column='1'/>
      <parameter type-id='type-id-49' name='buf' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='3377' column='1'/>
      <parameter type-id='type-id-67' name='buflen' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='3377' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zfs_get_type' mangled-name='zfs_get_type' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='3331' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_get_type'>
      <parameter type-id='type-id-155' name='zhp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='3331' column='1'/>
      <return type-id='type-id-46'/>
    </function-decl>
    <function-decl name='zfs_get_pool_name' mangled-name='zfs_get_pool_name' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='3322' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_get_pool_name'>
      <parameter type-id='type-id-155' name='zhp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='3322' column='1'/>
      <return type-id='type-id-105'/>
    </function-decl>
    <function-decl name='zfs_get_name' mangled-name='zfs_get_name' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='3313' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_get_name'>
      <parameter type-id='type-id-155' name='zhp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='3313' column='1'/>
      <return type-id='type-id-105'/>
    </function-decl>
    <function-decl name='zfs_prop_get_written' mangled-name='zfs_prop_get_written' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='3288' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_get_written'>
      <parameter type-id='type-id-108' name='zhp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='3288' column='1'/>
      <parameter type-id='type-id-105' name='propname' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='3288' column='1'/>
      <parameter type-id='type-id-49' name='propbuf' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='3289' column='1'/>
      <parameter type-id='type-id-22' name='proplen' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='3289' column='1'/>
      <parameter type-id='type-id-37' name='literal' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='3289' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zfs_prop_get_written_int' mangled-name='zfs_prop_get_written_int' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='3253' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_get_written_int'>
      <parameter type-id='type-id-108' name='zhp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='3253' column='1'/>
      <parameter type-id='type-id-105' name='propname' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='3253' column='1'/>
      <parameter type-id='type-id-159' name='propvalue' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='3254' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zfs_prop_get_userquota' mangled-name='zfs_prop_get_userquota' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='3217' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_get_userquota'>
      <parameter type-id='type-id-108' name='zhp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='3217' column='1'/>
      <parameter type-id='type-id-105' name='propname' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='3217' column='1'/>
      <parameter type-id='type-id-49' name='propbuf' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='3218' column='1'/>
      <parameter type-id='type-id-22' name='proplen' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='3218' column='1'/>
      <parameter type-id='type-id-37' name='literal' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='3218' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zfs_prop_get_userquota_int' mangled-name='zfs_prop_get_userquota_int' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='3207' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_get_userquota_int'>
      <parameter type-id='type-id-108' name='zhp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='3207' column='1'/>
      <parameter type-id='type-id-105' name='propname' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='3207' column='1'/>
      <parameter type-id='type-id-159' name='propvalue' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='3208' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zfs_prop_get_numeric' mangled-name='zfs_prop_get_numeric' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='3003' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_get_numeric'>
      <parameter type-id='type-id-108' name='zhp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='3003' column='1'/>
      <parameter type-id='type-id-34' name='prop' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='3003' column='1'/>
      <parameter type-id='type-id-159' name='value' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='3003' column='1'/>
      <parameter type-id='type-id-163' name='src' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='3004' column='1'/>
      <parameter type-id='type-id-49' name='statbuf' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='3004' column='1'/>
      <parameter type-id='type-id-67' name='statlen' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='3004' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zfs_prop_get_int' mangled-name='zfs_prop_get_int' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='2980' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_get_int'>
      <parameter type-id='type-id-108' name='zhp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='2980' column='1'/>
      <parameter type-id='type-id-34' name='prop' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='2980' column='1'/>
      <return type-id='type-id-53'/>
    </function-decl>
    <function-decl name='zfs_prop_get' mangled-name='zfs_prop_get' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='2605' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_get'>
      <parameter type-id='type-id-108' name='zhp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='2605' column='1'/>
      <parameter type-id='type-id-34' name='prop' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='2605' column='1'/>
      <parameter type-id='type-id-49' name='propbuf' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='2605' column='1'/>
      <parameter type-id='type-id-67' name='proplen' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='2605' column='1'/>
      <parameter type-id='type-id-163' name='src' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='2606' column='1'/>
      <parameter type-id='type-id-49' name='statbuf' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='2606' column='1'/>
      <parameter type-id='type-id-67' name='statlen' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='2606' column='1'/>
      <parameter type-id='type-id-37' name='literal' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='2606' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zfs_get_clones_nvl' mangled-name='zfs_get_clones_nvl' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='2436' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_get_clones_nvl'>
      <parameter type-id='type-id-108' name='zhp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='2436' column='1'/>
      <return type-id='type-id-48'/>
    </function-decl>
    <function-decl name='zfs_prop_get_recvd' mangled-name='zfs_prop_get_recvd' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='2349' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_get_recvd'>
      <parameter type-id='type-id-108' name='zhp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='2349' column='1'/>
      <parameter type-id='type-id-105' name='propname' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='2349' column='1'/>
      <parameter type-id='type-id-49' name='propbuf' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='2349' column='1'/>
      <parameter type-id='type-id-67' name='proplen' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='2350' column='1'/>
      <parameter type-id='type-id-37' name='literal' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='2350' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='getprop_uint64' mangled-name='getprop_uint64' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='2038' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getprop_uint64'>
      <parameter type-id='type-id-108' name='zhp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='2038' column='1'/>
      <parameter type-id='type-id-34' name='prop' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='2038' column='1'/>
      <parameter type-id='type-id-153' name='source' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='2038' column='1'/>
      <return type-id='type-id-53'/>
    </function-decl>
    <function-decl name='zfs_prop_inherit' mangled-name='zfs_prop_inherit' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='1927' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_inherit'>
      <parameter type-id='type-id-108' name='zhp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='1927' column='1'/>
      <parameter type-id='type-id-105' name='propname' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='1927' column='1'/>
      <parameter type-id='type-id-37' name='received' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='1927' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zfs_prop_set_list' mangled-name='zfs_prop_set_list' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='1745' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_set_list'>
      <parameter type-id='type-id-108' name='zhp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='1745' column='1'/>
      <parameter type-id='type-id-48' name='props' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='1745' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zfs_prop_set' mangled-name='zfs_prop_set' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='1714' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_prop_set'>
      <parameter type-id='type-id-108' name='zhp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='1714' column='1'/>
      <parameter type-id='type-id-105' name='propname' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='1714' column='1'/>
      <parameter type-id='type-id-105' name='propval' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='1714' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zfs_valid_proplist' mangled-name='zfs_valid_proplist' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='1005' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_valid_proplist'>
      <parameter type-id='type-id-44' name='hdl' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='1005' column='1'/>
      <parameter type-id='type-id-46' name='type' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='1005' column='1'/>
      <parameter type-id='type-id-48' name='nvl' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='1005' column='1'/>
      <parameter type-id='type-id-53' name='zoned' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='1006' column='1'/>
      <parameter type-id='type-id-108' name='zhp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='1006' column='1'/>
      <parameter type-id='type-id-45' name='zpool_hdl' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='1006' column='1'/>
      <parameter type-id='type-id-37' name='key_params_ok' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='1007' column='1'/>
      <parameter type-id='type-id-105' name='errbuf' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='1007' column='1'/>
      <return type-id='type-id-48'/>
    </function-decl>
    <function-decl name='zfs_spa_version' mangled-name='zfs_spa_version' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='968' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_spa_version'>
      <parameter type-id='type-id-108' name='zhp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='968' column='1'/>
      <parameter type-id='type-id-157' name='spa_version' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='968' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='libzfs_mnttab_remove' mangled-name='libzfs_mnttab_remove' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='948' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='libzfs_mnttab_remove'>
      <parameter type-id='type-id-44' name='hdl' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='948' column='1'/>
      <parameter type-id='type-id-105' name='fsname' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='948' column='1'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='libzfs_mnttab_add' mangled-name='libzfs_mnttab_add' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='918' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='libzfs_mnttab_add'>
      <parameter type-id='type-id-44' name='hdl' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='918' column='1'/>
      <parameter type-id='type-id-105' name='special' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='918' column='1'/>
      <parameter type-id='type-id-105' name='mountp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='919' column='1'/>
      <parameter type-id='type-id-105' name='mntopts' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='919' column='1'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='libzfs_mnttab_find' mangled-name='libzfs_mnttab_find' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='872' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='libzfs_mnttab_find'>
      <parameter type-id='type-id-44' name='hdl' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='872' column='1'/>
      <parameter type-id='type-id-105' name='fsname' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='872' column='1'/>
      <parameter type-id='type-id-158' name='entry' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='873' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='libzfs_mnttab_cache' mangled-name='libzfs_mnttab_cache' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='866' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='libzfs_mnttab_cache'>
      <parameter type-id='type-id-44' name='hdl' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='866' column='1'/>
      <parameter type-id='type-id-37' name='enable' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='866' column='1'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='libzfs_mnttab_fini' mangled-name='libzfs_mnttab_fini' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='848' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='libzfs_mnttab_fini'>
      <parameter type-id='type-id-44' name='hdl' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='848' column='1'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='libzfs_mnttab_init' mangled-name='libzfs_mnttab_init' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='801' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='libzfs_mnttab_init'>
      <parameter type-id='type-id-44' name='hdl' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='801' column='1'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='zfs_close' mangled-name='zfs_close' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='773' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_close'>
      <parameter type-id='type-id-108' name='zhp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='773' column='1'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='zfs_open' mangled-name='zfs_open' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='684' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_open'>
      <parameter type-id='type-id-44' name='hdl' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='684' column='1'/>
      <parameter type-id='type-id-105' name='path' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='684' column='1'/>
      <parameter type-id='type-id-22' name='types' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='684' column='1'/>
      <return type-id='type-id-108'/>
    </function-decl>
    <function-decl name='make_bookmark_handle' mangled-name='make_bookmark_handle' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='619' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='make_bookmark_handle'>
      <parameter type-id='type-id-108' name='parent' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='619' column='1'/>
      <parameter type-id='type-id-105' name='path' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='619' column='1'/>
      <parameter type-id='type-id-48' name='bmark_props' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='620' column='1'/>
      <return type-id='type-id-108'/>
    </function-decl>
    <function-decl name='zfs_bookmark_exists' mangled-name='zfs_bookmark_exists' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='588' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_bookmark_exists'>
      <parameter type-id='type-id-105' name='path' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='588' column='1'/>
      <return type-id='type-id-37'/>
    </function-decl>
    <function-decl name='zfs_handle_dup' mangled-name='zfs_handle_dup' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='541' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_handle_dup'>
      <parameter type-id='type-id-108' name='zhp_orig' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='541' column='1'/>
      <return type-id='type-id-108'/>
    </function-decl>
    <function-decl name='make_dataset_simple_handle_zc' mangled-name='make_dataset_simple_handle_zc' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='524' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='make_dataset_simple_handle_zc'>
      <parameter type-id='type-id-108' name='pzhp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='524' column='1'/>
      <parameter type-id='type-id-160' name='zc' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='524' column='1'/>
      <return type-id='type-id-108'/>
    </function-decl>
    <function-decl name='make_dataset_handle_zc' mangled-name='make_dataset_handle_zc' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='507' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='make_dataset_handle_zc'>
      <parameter type-id='type-id-44' name='hdl' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='507' column='1'/>
      <parameter type-id='type-id-160' name='zc' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='507' column='1'/>
      <return type-id='type-id-108'/>
    </function-decl>
    <function-decl name='make_dataset_handle' mangled-name='make_dataset_handle' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='478' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='make_dataset_handle'>
      <parameter type-id='type-id-44' name='hdl' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='478' column='1'/>
      <parameter type-id='type-id-105' name='path' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='478' column='1'/>
      <return type-id='type-id-108'/>
    </function-decl>
    <function-decl name='zfs_refresh_properties' mangled-name='zfs_refresh_properties' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='434' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_refresh_properties'>
      <parameter type-id='type-id-108' name='zhp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='434' column='1'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='zpool_free_handles' mangled-name='zpool_free_handles' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='313' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_free_handles'>
      <parameter type-id='type-id-44' name='hdl' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='313' column='1'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='zfs_name_valid' mangled-name='zfs_name_valid' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='222' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_name_valid'>
      <parameter type-id='type-id-105' name='name' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='222' column='1'/>
      <parameter type-id='type-id-46' name='type' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='222' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zfs_validate_name' mangled-name='zfs_validate_name' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='106' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_validate_name'>
      <parameter type-id='type-id-44' name='hdl' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='106' column='1'/>
      <parameter type-id='type-id-105' name='path' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='106' column='1'/>
      <parameter type-id='type-id-22' name='type' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='106' column='1'/>
      <parameter type-id='type-id-37' name='modifying' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='107' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zfs_type_to_name' mangled-name='zfs_type_to_name' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='80' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_type_to_name'>
      <parameter type-id='type-id-46' name='type' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='80' column='1'/>
      <return type-id='type-id-105'/>
    </function-decl>
    <function-decl name='zfs_dataset_exists' mangled-name='zfs_dataset_exists' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='3472' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_dataset_exists'>
      <parameter type-id='type-id-44' name='hdl' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='3472' column='1'/>
      <parameter type-id='type-id-105' name='path' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='3472' column='1'/>
      <parameter type-id='type-id-46' name='types' filepath='/home/fedora/zfs/lib/libzfs/libzfs_dataset.c' line='3472' column='1'/>
      <return type-id='type-id-37'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-156'>
      <parameter type-id='type-id-66'/>
      <parameter type-id='type-id-105'/>
      <parameter type-id='type-id-135'/>
      <parameter type-id='type-id-53'/>
      <return type-id='type-id-22'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='libzfs_diff.c' comp-dir-path='/home/fedora/zfs/lib/libzfs' language='LANG_C99'>
    <function-decl name='zfs_show_diffs' mangled-name='zfs_show_diffs' filepath='/home/fedora/zfs/lib/libzfs/libzfs_diff.c' line='716' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_show_diffs'>
      <parameter type-id='type-id-108' name='zhp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_diff.c' line='716' column='1'/>
      <parameter type-id='type-id-22' name='outfd' filepath='/home/fedora/zfs/lib/libzfs/libzfs_diff.c' line='716' column='1'/>
      <parameter type-id='type-id-105' name='fromsnap' filepath='/home/fedora/zfs/lib/libzfs/libzfs_diff.c' line='716' column='1'/>
      <parameter type-id='type-id-105' name='tosnap' filepath='/home/fedora/zfs/lib/libzfs/libzfs_diff.c' line='717' column='1'/>
      <parameter type-id='type-id-22' name='flags' filepath='/home/fedora/zfs/lib/libzfs/libzfs_diff.c' line='717' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='__builtin_fputc' mangled-name='fputc' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='__builtin_fwrite' mangled-name='fwrite' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-31'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='libzfs_import.c' comp-dir-path='/home/fedora/zfs/lib/libzfs' language='LANG_C99'>
    <typedef-decl name='pool_config_ops_t' type-id='type-id-164' filepath='../../include/libzutil.h' line='54' column='1' id='type-id-165'/>
    <class-decl name='pool_config_ops' size-in-bits='128' is-struct='yes' visibility='default' filepath='../../include/libzutil.h' line='51' column='1' id='type-id-166'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='pco_refresh_config' type-id='type-id-167' visibility='default' filepath='../../include/libzutil.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='pco_pool_active' type-id='type-id-168' visibility='default' filepath='../../include/libzutil.h' line='53' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='refresh_config_func_t' type-id='type-id-169' filepath='../../include/libzutil.h' line='47' column='1' id='type-id-170'/>
    <typedef-decl name='pool_active_func_t' type-id='type-id-171' filepath='../../include/libzutil.h' line='49' column='1' id='type-id-172'/>
    <typedef-decl name='pool_state_t' type-id='type-id-173' filepath='../../include/sys/fs/zfs.h' line='908' column='1' id='type-id-174'/>
    <enum-decl name='pool_state' filepath='../../include/sys/fs/zfs.h' line='899' column='1' id='type-id-173'>
      <underlying-type type-id='type-id-27'/>
      <enumerator name='POOL_STATE_ACTIVE' value='0'/>
      <enumerator name='POOL_STATE_EXPORTED' value='1'/>
      <enumerator name='POOL_STATE_DESTROYED' value='2'/>
      <enumerator name='POOL_STATE_SPARE' value='3'/>
      <enumerator name='POOL_STATE_L2CACHE' value='4'/>
      <enumerator name='POOL_STATE_UNINITIALIZED' value='5'/>
      <enumerator name='POOL_STATE_UNAVAIL' value='6'/>
      <enumerator name='POOL_STATE_POTENTIALLY_ACTIVE' value='7'/>
    </enum-decl>
    <qualified-type-def type-id='type-id-166' const='yes' id='type-id-164'/>
    <pointer-type-def type-id='type-id-172' size-in-bits='64' id='type-id-168'/>
    <pointer-type-def type-id='type-id-174' size-in-bits='64' id='type-id-175'/>
    <pointer-type-def type-id='type-id-170' size-in-bits='64' id='type-id-167'/>
    <var-decl name='libzfs_config_ops' type-id='type-id-165' mangled-name='libzfs_config_ops' visibility='default' filepath='../../include/libzutil.h' line='59' column='1' elf-symbol-id='libzfs_config_ops'/>
    <function-decl name='zpool_in_use' mangled-name='zpool_in_use' filepath='/home/fedora/zfs/lib/libzfs/libzfs_import.c' line='300' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_in_use'>
      <parameter type-id='type-id-44' name='hdl' filepath='/home/fedora/zfs/lib/libzfs/libzfs_import.c' line='300' column='1'/>
      <parameter type-id='type-id-22' name='fd' filepath='/home/fedora/zfs/lib/libzfs/libzfs_import.c' line='300' column='1'/>
      <parameter type-id='type-id-175' name='state' filepath='/home/fedora/zfs/lib/libzfs/libzfs_import.c' line='300' column='1'/>
      <parameter type-id='type-id-153' name='namestr' filepath='/home/fedora/zfs/lib/libzfs/libzfs_import.c' line='300' column='1'/>
      <parameter type-id='type-id-114' name='inuse' filepath='/home/fedora/zfs/lib/libzfs/libzfs_import.c' line='301' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zpool_clear_label' mangled-name='zpool_clear_label' filepath='/home/fedora/zfs/lib/libzfs/libzfs_import.c' line='144' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_clear_label'>
      <parameter type-id='type-id-22' name='fd' filepath='/home/fedora/zfs/lib/libzfs/libzfs_import.c' line='144' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-171'>
      <parameter type-id='type-id-66'/>
      <parameter type-id='type-id-105'/>
      <parameter type-id='type-id-53'/>
      <parameter type-id='type-id-114'/>
      <return type-id='type-id-22'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-169'>
      <parameter type-id='type-id-66'/>
      <parameter type-id='type-id-48'/>
      <return type-id='type-id-48'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='libzfs_iter.c' comp-dir-path='/home/fedora/zfs/lib/libzfs' language='LANG_C99'>
    <function-decl name='zfs_iter_mounted' mangled-name='zfs_iter_mounted' filepath='/home/fedora/zfs/lib/libzfs/libzfs_iter.c' line='559' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_iter_mounted'>
      <parameter type-id='type-id-108' name='zhp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_iter.c' line='559' column='1'/>
      <parameter type-id='type-id-111' name='func' filepath='/home/fedora/zfs/lib/libzfs/libzfs_iter.c' line='559' column='1'/>
      <parameter type-id='type-id-66' name='data' filepath='/home/fedora/zfs/lib/libzfs/libzfs_iter.c' line='559' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zfs_iter_dependents' mangled-name='zfs_iter_dependents' filepath='/home/fedora/zfs/lib/libzfs/libzfs_iter.c' line='543' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_iter_dependents'>
      <parameter type-id='type-id-108' name='zhp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_iter.c' line='543' column='1'/>
      <parameter type-id='type-id-37' name='allowrecursion' filepath='/home/fedora/zfs/lib/libzfs/libzfs_iter.c' line='543' column='1'/>
      <parameter type-id='type-id-111' name='func' filepath='/home/fedora/zfs/lib/libzfs/libzfs_iter.c' line='544' column='1'/>
      <parameter type-id='type-id-66' name='data' filepath='/home/fedora/zfs/lib/libzfs/libzfs_iter.c' line='544' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zfs_iter_children' mangled-name='zfs_iter_children' filepath='/home/fedora/zfs/lib/libzfs/libzfs_iter.c' line='460' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_iter_children'>
      <parameter type-id='type-id-108' name='zhp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_iter.c' line='460' column='1'/>
      <parameter type-id='type-id-111' name='func' filepath='/home/fedora/zfs/lib/libzfs/libzfs_iter.c' line='460' column='1'/>
      <parameter type-id='type-id-66' name='data' filepath='/home/fedora/zfs/lib/libzfs/libzfs_iter.c' line='460' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zfs_iter_snapspec' mangled-name='zfs_iter_snapspec' filepath='/home/fedora/zfs/lib/libzfs/libzfs_iter.c' line='383' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_iter_snapspec'>
      <parameter type-id='type-id-108' name='fs_zhp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_iter.c' line='383' column='1'/>
      <parameter type-id='type-id-105' name='spec_orig' filepath='/home/fedora/zfs/lib/libzfs/libzfs_iter.c' line='383' column='1'/>
      <parameter type-id='type-id-111' name='func' filepath='/home/fedora/zfs/lib/libzfs/libzfs_iter.c' line='384' column='1'/>
      <parameter type-id='type-id-66' name='arg' filepath='/home/fedora/zfs/lib/libzfs/libzfs_iter.c' line='384' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zfs_iter_snapshots_sorted' mangled-name='zfs_iter_snapshots_sorted' filepath='/home/fedora/zfs/lib/libzfs/libzfs_iter.c' line='309' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_iter_snapshots_sorted'>
      <parameter type-id='type-id-108' name='zhp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_iter.c' line='309' column='1'/>
      <parameter type-id='type-id-111' name='callback' filepath='/home/fedora/zfs/lib/libzfs/libzfs_iter.c' line='309' column='1'/>
      <parameter type-id='type-id-66' name='data' filepath='/home/fedora/zfs/lib/libzfs/libzfs_iter.c' line='309' column='1'/>
      <parameter type-id='type-id-53' name='min_txg' filepath='/home/fedora/zfs/lib/libzfs/libzfs_iter.c' line='310' column='1'/>
      <parameter type-id='type-id-53' name='max_txg' filepath='/home/fedora/zfs/lib/libzfs/libzfs_iter.c' line='310' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zfs_iter_bookmarks' mangled-name='zfs_iter_bookmarks' filepath='/home/fedora/zfs/lib/libzfs/libzfs_iter.c' line='202' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_iter_bookmarks'>
      <parameter type-id='type-id-108' name='zhp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_iter.c' line='202' column='1'/>
      <parameter type-id='type-id-111' name='func' filepath='/home/fedora/zfs/lib/libzfs/libzfs_iter.c' line='202' column='1'/>
      <parameter type-id='type-id-66' name='data' filepath='/home/fedora/zfs/lib/libzfs/libzfs_iter.c' line='202' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zfs_iter_snapshots' mangled-name='zfs_iter_snapshots' filepath='/home/fedora/zfs/lib/libzfs/libzfs_iter.c' line='143' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_iter_snapshots'>
      <parameter type-id='type-id-108' name='zhp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_iter.c' line='143' column='1'/>
      <parameter type-id='type-id-37' name='simple' filepath='/home/fedora/zfs/lib/libzfs/libzfs_iter.c' line='143' column='1'/>
      <parameter type-id='type-id-111' name='func' filepath='/home/fedora/zfs/lib/libzfs/libzfs_iter.c' line='143' column='1'/>
      <parameter type-id='type-id-66' name='data' filepath='/home/fedora/zfs/lib/libzfs/libzfs_iter.c' line='144' column='1'/>
      <parameter type-id='type-id-53' name='min_txg' filepath='/home/fedora/zfs/lib/libzfs/libzfs_iter.c' line='144' column='1'/>
      <parameter type-id='type-id-53' name='max_txg' filepath='/home/fedora/zfs/lib/libzfs/libzfs_iter.c' line='144' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zfs_iter_filesystems' mangled-name='zfs_iter_filesystems' filepath='/home/fedora/zfs/lib/libzfs/libzfs_iter.c' line='107' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_iter_filesystems'>
      <parameter type-id='type-id-108' name='zhp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_iter.c' line='107' column='1'/>
      <parameter type-id='type-id-111' name='func' filepath='/home/fedora/zfs/lib/libzfs/libzfs_iter.c' line='107' column='1'/>
      <parameter type-id='type-id-66' name='data' filepath='/home/fedora/zfs/lib/libzfs/libzfs_iter.c' line='107' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='libzfs_mount.c' comp-dir-path='/home/fedora/zfs/lib/libzfs' language='LANG_C99'>
    <array-type-def dimensions='1' type-id='type-id-176' size-in-bits='384' id='type-id-177'>
      <subrange length='2' type-id='type-id-3' id='type-id-4'/>

    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-103' size-in-bits='64' alignment-in-bits='32' id='type-id-178'>
      <subrange length='2' type-id='type-id-3' id='type-id-4'/>

    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-103' size-in-bits='96' alignment-in-bits='32' id='type-id-179'>
      <subrange length='3' type-id='type-id-3' id='type-id-127'/>

    </array-type-def>
    <typedef-decl name='proto_table_t' type-id='type-id-180' filepath='../../include/libzfs_impl.h' line='219' column='1' id='type-id-176'/>
    <class-decl name='__anonymous_struct__' size-in-bits='192' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-176' visibility='default' filepath='../../include/libzfs_impl.h' line='214' column='1' id='type-id-180'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='p_prop' type-id='type-id-34' visibility='default' filepath='../../include/libzfs_impl.h' line='215' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='p_name' type-id='type-id-49' visibility='default' filepath='../../include/libzfs_impl.h' line='216' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='p_share_err' type-id='type-id-22' visibility='default' filepath='../../include/libzfs_impl.h' line='217' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='p_unshare_err' type-id='type-id-22' visibility='default' filepath='../../include/libzfs_impl.h' line='218' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='get_all_cb_t' type-id='type-id-181' filepath='../../include/libzfs.h' line='626' column='1' id='type-id-182'/>
    <class-decl name='get_all_cb' size-in-bits='192' is-struct='yes' visibility='default' filepath='../../include/libzfs.h' line='622' column='1' id='type-id-181'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cb_handles' type-id='type-id-183' visibility='default' filepath='../../include/libzfs.h' line='623' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='cb_alloc' type-id='type-id-67' visibility='default' filepath='../../include/libzfs.h' line='624' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='cb_used' type-id='type-id-67' visibility='default' filepath='../../include/libzfs.h' line='625' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='zfs_share_type_t' type-id='type-id-184' filepath='../../include/libzfs_impl.h' line='124' column='1' id='type-id-185'/>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' filepath='../../include/libzfs_impl.h' line='120' column='1' id='type-id-184'>
      <underlying-type type-id='type-id-27'/>
      <enumerator name='SHARED_NOT_SHARED' value='0'/>
      <enumerator name='SHARED_NFS' value='2'/>
      <enumerator name='SHARED_SMB' value='4'/>
    </enum-decl>
    <pointer-type-def type-id='type-id-182' size-in-bits='64' id='type-id-186'/>
    <pointer-type-def type-id='type-id-108' size-in-bits='64' id='type-id-183'/>
    <var-decl name='proto_table' type-id='type-id-177' mangled-name='proto_table' visibility='default' filepath='../../include/libzfs_impl.h' line='242' column='1' elf-symbol-id='proto_table'/>
    <var-decl name='nfs_only' type-id='type-id-178' mangled-name='nfs_only' visibility='default' filepath='/home/fedora/zfs/lib/libzfs/libzfs_mount.c' line='110' column='1' elf-symbol-id='nfs_only'/>
    <var-decl name='smb_only' type-id='type-id-178' mangled-name='smb_only' visibility='default' filepath='/home/fedora/zfs/lib/libzfs/libzfs_mount.c' line='115' column='1' elf-symbol-id='smb_only'/>
    <var-decl name='share_all_proto' type-id='type-id-179' mangled-name='share_all_proto' visibility='default' filepath='/home/fedora/zfs/lib/libzfs/libzfs_mount.c' line='119' column='1' elf-symbol-id='share_all_proto'/>
    <function-decl name='zpool_disable_datasets' mangled-name='zpool_unmount_datasets' filepath='/home/fedora/zfs/lib/libzfs/libzfs_mount.c' line='1484' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_unmount_datasets'>
      <parameter type-id='type-id-45' name='zhp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_mount.c' line='1484' column='1'/>
      <parameter type-id='type-id-37' name='force' filepath='/home/fedora/zfs/lib/libzfs/libzfs_mount.c' line='1484' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zpool_enable_datasets' mangled-name='zpool_enable_datasets' filepath='/home/fedora/zfs/lib/libzfs/libzfs_mount.c' line='1414' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_enable_datasets'>
      <parameter type-id='type-id-45' name='zhp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_mount.c' line='1414' column='1'/>
      <parameter type-id='type-id-105' name='mntopts' filepath='/home/fedora/zfs/lib/libzfs/libzfs_mount.c' line='1414' column='1'/>
      <parameter type-id='type-id-22' name='flags' filepath='/home/fedora/zfs/lib/libzfs/libzfs_mount.c' line='1414' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zfs_foreach_mountpoint' mangled-name='zfs_foreach_mountpoint' filepath='/home/fedora/zfs/lib/libzfs/libzfs_mount.c' line='1353' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_foreach_mountpoint'>
      <parameter type-id='type-id-44' name='hdl' filepath='/home/fedora/zfs/lib/libzfs/libzfs_mount.c' line='1353' column='1'/>
      <parameter type-id='type-id-183' name='handles' filepath='/home/fedora/zfs/lib/libzfs/libzfs_mount.c' line='1353' column='1'/>
      <parameter type-id='type-id-67' name='num_handles' filepath='/home/fedora/zfs/lib/libzfs/libzfs_mount.c' line='1354' column='1'/>
      <parameter type-id='type-id-111' name='func' filepath='/home/fedora/zfs/lib/libzfs/libzfs_mount.c' line='1354' column='1'/>
      <parameter type-id='type-id-66' name='data' filepath='/home/fedora/zfs/lib/libzfs/libzfs_mount.c' line='1354' column='1'/>
      <parameter type-id='type-id-37' name='parallel' filepath='/home/fedora/zfs/lib/libzfs/libzfs_mount.c' line='1354' column='1'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='libzfs_add_handle' mangled-name='libzfs_add_handle' filepath='/home/fedora/zfs/lib/libzfs/libzfs_mount.c' line='1031' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='libzfs_add_handle'>
      <parameter type-id='type-id-186' name='cbp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_mount.c' line='1031' column='1'/>
      <parameter type-id='type-id-108' name='zhp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_mount.c' line='1031' column='1'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='remove_mountpoint' mangled-name='remove_mountpoint' filepath='/home/fedora/zfs/lib/libzfs/libzfs_mount.c' line='1005' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='remove_mountpoint'>
      <parameter type-id='type-id-108' name='zhp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_mount.c' line='1005' column='1'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='zfs_unshareall_bytype' mangled-name='zfs_unshareall_bytype' filepath='/home/fedora/zfs/lib/libzfs/libzfs_mount.c' line='980' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_unshareall_bytype'>
      <parameter type-id='type-id-108' name='zhp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_mount.c' line='980' column='1'/>
      <parameter type-id='type-id-105' name='mountpoint' filepath='/home/fedora/zfs/lib/libzfs/libzfs_mount.c' line='980' column='1'/>
      <parameter type-id='type-id-105' name='proto' filepath='/home/fedora/zfs/lib/libzfs/libzfs_mount.c' line='981' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zfs_unshareall_bypath' mangled-name='zfs_unshareall_bypath' filepath='/home/fedora/zfs/lib/libzfs/libzfs_mount.c' line='974' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_unshareall_bypath'>
      <parameter type-id='type-id-108' name='zhp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_mount.c' line='974' column='1'/>
      <parameter type-id='type-id-105' name='mountpoint' filepath='/home/fedora/zfs/lib/libzfs/libzfs_mount.c' line='974' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zfs_unshareall' mangled-name='zfs_unshareall' filepath='/home/fedora/zfs/lib/libzfs/libzfs_mount.c' line='968' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_unshareall'>
      <parameter type-id='type-id-108' name='zhp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_mount.c' line='968' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zfs_unshareall_smb' mangled-name='zfs_unshareall_smb' filepath='/home/fedora/zfs/lib/libzfs/libzfs_mount.c' line='962' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_unshareall_smb'>
      <parameter type-id='type-id-108' name='zhp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_mount.c' line='962' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zfs_unshareall_nfs' mangled-name='zfs_unshareall_nfs' filepath='/home/fedora/zfs/lib/libzfs/libzfs_mount.c' line='956' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_unshareall_nfs'>
      <parameter type-id='type-id-108' name='zhp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_mount.c' line='956' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zfs_unshare_smb' mangled-name='zfs_unshare_smb' filepath='/home/fedora/zfs/lib/libzfs/libzfs_mount.c' line='931' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_unshare_smb'>
      <parameter type-id='type-id-108' name='zhp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_mount.c' line='931' column='1'/>
      <parameter type-id='type-id-105' name='mountpoint' filepath='/home/fedora/zfs/lib/libzfs/libzfs_mount.c' line='931' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zfs_unshare_nfs' mangled-name='zfs_unshare_nfs' filepath='/home/fedora/zfs/lib/libzfs/libzfs_mount.c' line='925' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_unshare_nfs'>
      <parameter type-id='type-id-108' name='zhp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_mount.c' line='925' column='1'/>
      <parameter type-id='type-id-105' name='mountpoint' filepath='/home/fedora/zfs/lib/libzfs/libzfs_mount.c' line='925' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zfs_unshare_proto' mangled-name='zfs_unshare_proto' filepath='/home/fedora/zfs/lib/libzfs/libzfs_mount.c' line='887' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_unshare_proto'>
      <parameter type-id='type-id-108' name='zhp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_mount.c' line='887' column='1'/>
      <parameter type-id='type-id-105' name='mountpoint' filepath='/home/fedora/zfs/lib/libzfs/libzfs_mount.c' line='887' column='1'/>
      <parameter type-id='type-id-109' name='proto' filepath='/home/fedora/zfs/lib/libzfs/libzfs_mount.c' line='888' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zfs_share_smb' mangled-name='zfs_share_smb' filepath='/home/fedora/zfs/lib/libzfs/libzfs_mount.c' line='872' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_share_smb'>
      <parameter type-id='type-id-108' name='zhp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_mount.c' line='872' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zfs_share_nfs' mangled-name='zfs_share_nfs' filepath='/home/fedora/zfs/lib/libzfs/libzfs_mount.c' line='866' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_share_nfs'>
      <parameter type-id='type-id-108' name='zhp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_mount.c' line='866' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zfs_commit_shares' mangled-name='zfs_commit_shares' filepath='/home/fedora/zfs/lib/libzfs/libzfs_mount.c' line='855' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_commit_shares'>
      <parameter type-id='type-id-105' name='proto' filepath='/home/fedora/zfs/lib/libzfs/libzfs_mount.c' line='855' column='1'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='zfs_commit_all_shares' mangled-name='zfs_commit_all_shares' filepath='/home/fedora/zfs/lib/libzfs/libzfs_mount.c' line='849' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_commit_all_shares'>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='zfs_commit_smb_shares' mangled-name='zfs_commit_smb_shares' filepath='/home/fedora/zfs/lib/libzfs/libzfs_mount.c' line='843' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_commit_smb_shares'>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='zfs_commit_nfs_shares' mangled-name='zfs_commit_nfs_shares' filepath='/home/fedora/zfs/lib/libzfs/libzfs_mount.c' line='837' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_commit_nfs_shares'>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='zfs_commit_proto' mangled-name='zfs_commit_proto' filepath='/home/fedora/zfs/lib/libzfs/libzfs_mount.c' line='828' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_commit_proto'>
      <parameter type-id='type-id-109' name='proto' filepath='/home/fedora/zfs/lib/libzfs/libzfs_mount.c' line='828' column='1'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='zfs_parse_options' mangled-name='zfs_parse_options' filepath='/home/fedora/zfs/lib/libzfs/libzfs_mount.c' line='822' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_parse_options'>
      <parameter type-id='type-id-49' name='options' filepath='/home/fedora/zfs/lib/libzfs/libzfs_mount.c' line='822' column='1'/>
      <parameter type-id='type-id-103' name='proto' filepath='/home/fedora/zfs/lib/libzfs/libzfs_mount.c' line='822' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zfs_is_shared_smb' mangled-name='zfs_is_shared_smb' filepath='/home/fedora/zfs/lib/libzfs/libzfs_mount.c' line='809' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_is_shared_smb'>
      <parameter type-id='type-id-108' name='zhp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_mount.c' line='809' column='1'/>
      <parameter type-id='type-id-153' name='where' filepath='/home/fedora/zfs/lib/libzfs/libzfs_mount.c' line='809' column='1'/>
      <return type-id='type-id-37'/>
    </function-decl>
    <function-decl name='zfs_is_shared_nfs' mangled-name='zfs_is_shared_nfs' filepath='/home/fedora/zfs/lib/libzfs/libzfs_mount.c' line='802' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_is_shared_nfs'>
      <parameter type-id='type-id-108' name='zhp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_mount.c' line='802' column='1'/>
      <parameter type-id='type-id-153' name='where' filepath='/home/fedora/zfs/lib/libzfs/libzfs_mount.c' line='802' column='1'/>
      <return type-id='type-id-37'/>
    </function-decl>
    <function-decl name='zfs_is_shared_proto' mangled-name='zfs_is_shared_proto' filepath='/home/fedora/zfs/lib/libzfs/libzfs_mount.c' line='780' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_is_shared_proto'>
      <parameter type-id='type-id-108' name='zhp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_mount.c' line='780' column='1'/>
      <parameter type-id='type-id-153' name='where' filepath='/home/fedora/zfs/lib/libzfs/libzfs_mount.c' line='780' column='1'/>
      <parameter type-id='type-id-103' name='proto' filepath='/home/fedora/zfs/lib/libzfs/libzfs_mount.c' line='780' column='1'/>
      <return type-id='type-id-185'/>
    </function-decl>
    <function-decl name='zfs_unshare' mangled-name='zfs_unshare' filepath='/home/fedora/zfs/lib/libzfs/libzfs_mount.c' line='770' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_unshare'>
      <parameter type-id='type-id-108' name='zhp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_mount.c' line='770' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zfs_share_proto' mangled-name='zfs_share_proto' filepath='/home/fedora/zfs/lib/libzfs/libzfs_mount.c' line='718' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_share_proto'>
      <parameter type-id='type-id-108' name='zhp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_mount.c' line='718' column='1'/>
      <parameter type-id='type-id-109' name='proto' filepath='/home/fedora/zfs/lib/libzfs/libzfs_mount.c' line='718' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='unshare_one' mangled-name='unshare_one' filepath='/home/fedora/zfs/lib/libzfs/libzfs_mount.c' line='678' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='unshare_one'>
      <parameter type-id='type-id-44' name='hdl' filepath='/home/fedora/zfs/lib/libzfs/libzfs_mount.c' line='678' column='1'/>
      <parameter type-id='type-id-105' name='name' filepath='/home/fedora/zfs/lib/libzfs/libzfs_mount.c' line='678' column='1'/>
      <parameter type-id='type-id-105' name='mountpoint' filepath='/home/fedora/zfs/lib/libzfs/libzfs_mount.c' line='678' column='1'/>
      <parameter type-id='type-id-103' name='proto' filepath='/home/fedora/zfs/lib/libzfs/libzfs_mount.c' line='679' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zfs_is_shared' mangled-name='zfs_is_shared' filepath='/home/fedora/zfs/lib/libzfs/libzfs_mount.c' line='659' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_is_shared'>
      <parameter type-id='type-id-108' name='zhp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_mount.c' line='659' column='1'/>
      <return type-id='type-id-37'/>
    </function-decl>
    <function-decl name='zfs_unmountall' mangled-name='zfs_unmountall' filepath='/home/fedora/zfs/lib/libzfs/libzfs_mount.c' line='642' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_unmountall'>
      <parameter type-id='type-id-108' name='zhp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_mount.c' line='642' column='1'/>
      <parameter type-id='type-id-22' name='flags' filepath='/home/fedora/zfs/lib/libzfs/libzfs_mount.c' line='642' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zfs_unmount' mangled-name='zfs_unmount' filepath='/home/fedora/zfs/lib/libzfs/libzfs_mount.c' line='568' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_unmount'>
      <parameter type-id='type-id-108' name='zhp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_mount.c' line='568' column='1'/>
      <parameter type-id='type-id-105' name='mountpoint' filepath='/home/fedora/zfs/lib/libzfs/libzfs_mount.c' line='568' column='1'/>
      <parameter type-id='type-id-22' name='flags' filepath='/home/fedora/zfs/lib/libzfs/libzfs_mount.c' line='568' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zfs_mount_at' mangled-name='zfs_mount_at' filepath='/home/fedora/zfs/lib/libzfs/libzfs_mount.c' line='382' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_mount_at'>
      <parameter type-id='type-id-108' name='zhp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_mount.c' line='382' column='1'/>
      <parameter type-id='type-id-105' name='options' filepath='/home/fedora/zfs/lib/libzfs/libzfs_mount.c' line='382' column='1'/>
      <parameter type-id='type-id-22' name='flags' filepath='/home/fedora/zfs/lib/libzfs/libzfs_mount.c' line='382' column='1'/>
      <parameter type-id='type-id-105' name='mountpoint' filepath='/home/fedora/zfs/lib/libzfs/libzfs_mount.c' line='383' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zfs_mount' mangled-name='zfs_mount' filepath='/home/fedora/zfs/lib/libzfs/libzfs_mount.c' line='367' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_mount'>
      <parameter type-id='type-id-108' name='zhp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_mount.c' line='367' column='1'/>
      <parameter type-id='type-id-105' name='options' filepath='/home/fedora/zfs/lib/libzfs/libzfs_mount.c' line='367' column='1'/>
      <parameter type-id='type-id-22' name='flags' filepath='/home/fedora/zfs/lib/libzfs/libzfs_mount.c' line='367' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zfs_is_mounted' mangled-name='zfs_is_mounted' filepath='/home/fedora/zfs/lib/libzfs/libzfs_mount.c' line='238' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_is_mounted'>
      <parameter type-id='type-id-108' name='zhp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_mount.c' line='238' column='1'/>
      <parameter type-id='type-id-153' name='where' filepath='/home/fedora/zfs/lib/libzfs/libzfs_mount.c' line='238' column='1'/>
      <return type-id='type-id-37'/>
    </function-decl>
    <function-decl name='is_mounted' mangled-name='is_mounted' filepath='/home/fedora/zfs/lib/libzfs/libzfs_mount.c' line='224' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='is_mounted'>
      <parameter type-id='type-id-44' name='zfs_hdl' filepath='/home/fedora/zfs/lib/libzfs/libzfs_mount.c' line='224' column='1'/>
      <parameter type-id='type-id-105' name='special' filepath='/home/fedora/zfs/lib/libzfs/libzfs_mount.c' line='224' column='1'/>
      <parameter type-id='type-id-153' name='where' filepath='/home/fedora/zfs/lib/libzfs/libzfs_mount.c' line='224' column='1'/>
      <return type-id='type-id-37'/>
    </function-decl>
    <function-decl name='zfs_is_mountable' mangled-name='zfs_is_mountable' filepath='/home/fedora/zfs/lib/libzfs/libzfs_mount.c' line='265' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_is_mountable'>
      <parameter type-id='type-id-108' name='zhp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_mount.c' line='265' column='1'/>
      <parameter type-id='type-id-49' name='buf' filepath='/home/fedora/zfs/lib/libzfs/libzfs_mount.c' line='265' column='1'/>
      <parameter type-id='type-id-67' name='buflen' filepath='/home/fedora/zfs/lib/libzfs/libzfs_mount.c' line='265' column='1'/>
      <parameter type-id='type-id-163' name='source' filepath='/home/fedora/zfs/lib/libzfs/libzfs_mount.c' line='266' column='1'/>
      <parameter type-id='type-id-22' name='flags' filepath='/home/fedora/zfs/lib/libzfs/libzfs_mount.c' line='266' column='1'/>
      <return type-id='type-id-37'/>
    </function-decl>
    <function-decl name='is_shared' mangled-name='is_shared' filepath='/home/fedora/zfs/lib/libzfs/libzfs_mount.c' line='697' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='is_shared'>
      <parameter type-id='type-id-105' name='mountpoint' filepath='/home/fedora/zfs/lib/libzfs/libzfs_mount.c' line='697' column='1'/>
      <parameter type-id='type-id-103' name='proto' filepath='/home/fedora/zfs/lib/libzfs/libzfs_mount.c' line='697' column='1'/>
      <return type-id='type-id-185'/>
    </function-decl>
    <function-decl name='zfs_share' mangled-name='zfs_share' filepath='/home/fedora/zfs/lib/libzfs/libzfs_mount.c' line='763' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_share'>
      <parameter type-id='type-id-108' name='zhp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_mount.c' line='763' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='libzfs_pool.c' comp-dir-path='/home/fedora/zfs/lib/libzfs' language='LANG_C99'>
    <typedef-decl name='zpool_wait_activity_t' type-id='type-id-187' filepath='../../include/sys/fs/zfs.h' line='1422' column='1' id='type-id-188'/>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' filepath='../../include/sys/fs/zfs.h' line='1412' column='1' id='type-id-187'>
      <underlying-type type-id='type-id-27'/>
      <enumerator name='ZPOOL_WAIT_CKPT_DISCARD' value='0'/>
      <enumerator name='ZPOOL_WAIT_FREE' value='1'/>
      <enumerator name='ZPOOL_WAIT_INITIALIZE' value='2'/>
      <enumerator name='ZPOOL_WAIT_REPLACE' value='3'/>
      <enumerator name='ZPOOL_WAIT_REMOVE' value='4'/>
      <enumerator name='ZPOOL_WAIT_RESILVER' value='5'/>
      <enumerator name='ZPOOL_WAIT_SCRUB' value='6'/>
      <enumerator name='ZPOOL_WAIT_TRIM' value='7'/>
      <enumerator name='ZPOOL_WAIT_NUM_ACTIVITIES' value='8'/>
    </enum-decl>
    <typedef-decl name='splitflags_t' type-id='type-id-189' filepath='../../include/libzfs.h' line='264' column='1' id='type-id-190'/>
    <class-decl name='splitflags' size-in-bits='64' is-struct='yes' visibility='default' filepath='../../include/libzfs.h' line='257' column='1' id='type-id-189'>
      <data-member access='public' layout-offset-in-bits='31'>
        <var-decl name='dryrun' type-id='type-id-22' visibility='default' filepath='../../include/libzfs.h' line='259' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='30'>
        <var-decl name='import' type-id='type-id-22' visibility='default' filepath='../../include/libzfs.h' line='262' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='name_flags' type-id='type-id-22' visibility='default' filepath='../../include/libzfs.h' line='263' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='vdev_aux_t' type-id='type-id-191' filepath='../../include/sys/fs/zfs.h' line='891' column='1' id='type-id-192'/>
    <enum-decl name='vdev_aux' filepath='../../include/sys/fs/zfs.h' line='869' column='1' id='type-id-191'>
      <underlying-type type-id='type-id-27'/>
      <enumerator name='VDEV_AUX_NONE' value='0'/>
      <enumerator name='VDEV_AUX_OPEN_FAILED' value='1'/>
      <enumerator name='VDEV_AUX_CORRUPT_DATA' value='2'/>
      <enumerator name='VDEV_AUX_NO_REPLICAS' value='3'/>
      <enumerator name='VDEV_AUX_BAD_GUID_SUM' value='4'/>
      <enumerator name='VDEV_AUX_TOO_SMALL' value='5'/>
      <enumerator name='VDEV_AUX_BAD_LABEL' value='6'/>
      <enumerator name='VDEV_AUX_VERSION_NEWER' value='7'/>
      <enumerator name='VDEV_AUX_VERSION_OLDER' value='8'/>
      <enumerator name='VDEV_AUX_UNSUP_FEAT' value='9'/>
      <enumerator name='VDEV_AUX_SPARED' value='10'/>
      <enumerator name='VDEV_AUX_ERR_EXCEEDED' value='11'/>
      <enumerator name='VDEV_AUX_IO_FAILURE' value='12'/>
      <enumerator name='VDEV_AUX_BAD_LOG' value='13'/>
      <enumerator name='VDEV_AUX_EXTERNAL' value='14'/>
      <enumerator name='VDEV_AUX_SPLIT_POOL' value='15'/>
      <enumerator name='VDEV_AUX_BAD_ASHIFT' value='16'/>
      <enumerator name='VDEV_AUX_EXTERNAL_PERSIST' value='17'/>
      <enumerator name='VDEV_AUX_ACTIVE' value='18'/>
      <enumerator name='VDEV_AUX_CHILDREN_OFFLINE' value='19'/>
      <enumerator name='VDEV_AUX_ASHIFT_TOO_BIG' value='20'/>
    </enum-decl>
    <typedef-decl name='vdev_state_t' type-id='type-id-193' filepath='../../include/sys/fs/zfs.h' line='861' column='1' id='type-id-194'/>
    <enum-decl name='vdev_state' filepath='../../include/sys/fs/zfs.h' line='852' column='1' id='type-id-193'>
      <underlying-type type-id='type-id-27'/>
      <enumerator name='VDEV_STATE_UNKNOWN' value='0'/>
      <enumerator name='VDEV_STATE_CLOSED' value='1'/>
      <enumerator name='VDEV_STATE_OFFLINE' value='2'/>
      <enumerator name='VDEV_STATE_REMOVED' value='3'/>
      <enumerator name='VDEV_STATE_CANT_OPEN' value='4'/>
      <enumerator name='VDEV_STATE_FAULTED' value='5'/>
      <enumerator name='VDEV_STATE_DEGRADED' value='6'/>
      <enumerator name='VDEV_STATE_HEALTHY' value='7'/>
    </enum-decl>
    <typedef-decl name='pool_scan_func_t' type-id='type-id-195' filepath='../../include/sys/fs/zfs.h' line='928' column='1' id='type-id-196'/>
    <enum-decl name='pool_scan_func' filepath='../../include/sys/fs/zfs.h' line='923' column='1' id='type-id-195'>
      <underlying-type type-id='type-id-27'/>
      <enumerator name='POOL_SCAN_NONE' value='0'/>
      <enumerator name='POOL_SCAN_SCRUB' value='1'/>
      <enumerator name='POOL_SCAN_RESILVER' value='2'/>
      <enumerator name='POOL_SCAN_FUNCS' value='3'/>
    </enum-decl>
    <typedef-decl name='pool_scrub_cmd_t' type-id='type-id-197' filepath='../../include/sys/fs/zfs.h' line='937' column='1' id='type-id-198'/>
    <enum-decl name='pool_scrub_cmd' filepath='../../include/sys/fs/zfs.h' line='933' column='1' id='type-id-197'>
      <underlying-type type-id='type-id-27'/>
      <enumerator name='POOL_SCRUB_NORMAL' value='0'/>
      <enumerator name='POOL_SCRUB_PAUSE' value='1'/>
      <enumerator name='POOL_SCRUB_FLAGS_END' value='2'/>
    </enum-decl>
    <typedef-decl name='pool_trim_func_t' type-id='type-id-199' filepath='../../include/sys/fs/zfs.h' line='1167' column='1' id='type-id-200'/>
    <enum-decl name='pool_trim_func' filepath='../../include/sys/fs/zfs.h' line='1162' column='1' id='type-id-199'>
      <underlying-type type-id='type-id-27'/>
      <enumerator name='POOL_TRIM_START' value='0'/>
      <enumerator name='POOL_TRIM_CANCEL' value='1'/>
      <enumerator name='POOL_TRIM_SUSPEND' value='2'/>
      <enumerator name='POOL_TRIM_FUNCS' value='3'/>
    </enum-decl>
    <typedef-decl name='trimflags_t' type-id='type-id-201' filepath='../../include/libzfs.h' line='278' column='1' id='type-id-202'/>
    <class-decl name='trimflags' size-in-bits='192' is-struct='yes' visibility='default' filepath='../../include/libzfs.h' line='266' column='1' id='type-id-201'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fullpool' type-id='type-id-37' visibility='default' filepath='../../include/libzfs.h' line='268' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='secure' type-id='type-id-37' visibility='default' filepath='../../include/libzfs.h' line='271' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='wait' type-id='type-id-37' visibility='default' filepath='../../include/libzfs.h' line='274' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='rate' type-id='type-id-53' visibility='default' filepath='../../include/libzfs.h' line='277' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='pool_initialize_func_t' type-id='type-id-203' filepath='../../include/sys/fs/zfs.h' line='1157' column='1' id='type-id-204'/>
    <enum-decl name='pool_initialize_func' filepath='../../include/sys/fs/zfs.h' line='1152' column='1' id='type-id-203'>
      <underlying-type type-id='type-id-27'/>
      <enumerator name='POOL_INITIALIZE_START' value='0'/>
      <enumerator name='POOL_INITIALIZE_CANCEL' value='1'/>
      <enumerator name='POOL_INITIALIZE_SUSPEND' value='2'/>
      <enumerator name='POOL_INITIALIZE_FUNCS' value='3'/>
    </enum-decl>
    <typedef-decl name='zpool_prop_t' type-id='type-id-205' filepath='../../include/sys/fs/zfs.h' line='250' column='1' id='type-id-206'/>
    <enum-decl name='__anonymous_enum__1' is-anonymous='yes' filepath='../../include/sys/fs/zfs.h' line='215' column='1' id='type-id-205'>
      <underlying-type type-id='type-id-27'/>
      <enumerator name='ZPOOL_PROP_INVAL' value='-1'/>
      <enumerator name='ZPOOL_PROP_NAME' value='0'/>
      <enumerator name='ZPOOL_PROP_SIZE' value='1'/>
      <enumerator name='ZPOOL_PROP_CAPACITY' value='2'/>
      <enumerator name='ZPOOL_PROP_ALTROOT' value='3'/>
      <enumerator name='ZPOOL_PROP_HEALTH' value='4'/>
      <enumerator name='ZPOOL_PROP_GUID' value='5'/>
      <enumerator name='ZPOOL_PROP_VERSION' value='6'/>
      <enumerator name='ZPOOL_PROP_BOOTFS' value='7'/>
      <enumerator name='ZPOOL_PROP_DELEGATION' value='8'/>
      <enumerator name='ZPOOL_PROP_AUTOREPLACE' value='9'/>
      <enumerator name='ZPOOL_PROP_CACHEFILE' value='10'/>
      <enumerator name='ZPOOL_PROP_FAILUREMODE' value='11'/>
      <enumerator name='ZPOOL_PROP_LISTSNAPS' value='12'/>
      <enumerator name='ZPOOL_PROP_AUTOEXPAND' value='13'/>
      <enumerator name='ZPOOL_PROP_DEDUPDITTO' value='14'/>
      <enumerator name='ZPOOL_PROP_DEDUPRATIO' value='15'/>
      <enumerator name='ZPOOL_PROP_FREE' value='16'/>
      <enumerator name='ZPOOL_PROP_ALLOCATED' value='17'/>
      <enumerator name='ZPOOL_PROP_READONLY' value='18'/>
      <enumerator name='ZPOOL_PROP_ASHIFT' value='19'/>
      <enumerator name='ZPOOL_PROP_COMMENT' value='20'/>
      <enumerator name='ZPOOL_PROP_EXPANDSZ' value='21'/>
      <enumerator name='ZPOOL_PROP_FREEING' value='22'/>
      <enumerator name='ZPOOL_PROP_FRAGMENTATION' value='23'/>
      <enumerator name='ZPOOL_PROP_LEAKED' value='24'/>
      <enumerator name='ZPOOL_PROP_MAXBLOCKSIZE' value='25'/>
      <enumerator name='ZPOOL_PROP_TNAME' value='26'/>
      <enumerator name='ZPOOL_PROP_MAXDNODESIZE' value='27'/>
      <enumerator name='ZPOOL_PROP_MULTIHOST' value='28'/>
      <enumerator name='ZPOOL_PROP_CHECKPOINT' value='29'/>
      <enumerator name='ZPOOL_PROP_LOAD_GUID' value='30'/>
      <enumerator name='ZPOOL_PROP_AUTOTRIM' value='31'/>
      <enumerator name='ZPOOL_NUM_PROPS' value='32'/>
    </enum-decl>
    <qualified-type-def type-id='type-id-74' const='yes' id='type-id-207'/>
    <pointer-type-def type-id='type-id-207' size-in-bits='64' id='type-id-208'/>
    <pointer-type-def type-id='type-id-202' size-in-bits='64' id='type-id-209'/>
    <pointer-type-def type-id='type-id-194' size-in-bits='64' id='type-id-210'/>
    <pointer-type-def type-id='type-id-45' size-in-bits='64' id='type-id-211'/>
    <function-decl name='zpool_get_bootenv' mangled-name='zpool_get_bootenv' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='4582' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_get_bootenv'>
      <parameter type-id='type-id-45' name='zhp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='4582' column='1'/>
      <parameter type-id='type-id-117' name='nvlp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='4582' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zpool_set_bootenv' mangled-name='zpool_set_bootenv' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='4569' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_set_bootenv'>
      <parameter type-id='type-id-45' name='zhp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='4569' column='1'/>
      <parameter type-id='type-id-208' name='envmap' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='4569' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zpool_wait_status' mangled-name='zpool_wait_status' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='4551' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_wait_status'>
      <parameter type-id='type-id-45' name='zhp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='4551' column='1'/>
      <parameter type-id='type-id-188' name='activity' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='4551' column='1'/>
      <parameter type-id='type-id-114' name='missing' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='4552' column='1'/>
      <parameter type-id='type-id-114' name='waited' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='4552' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zpool_wait' mangled-name='zpool_wait' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='4524' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_wait'>
      <parameter type-id='type-id-45' name='zhp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='4524' column='1'/>
      <parameter type-id='type-id-188' name='activity' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='4524' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zpool_obj_to_path_ds' mangled-name='zpool_obj_to_path_ds' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='4515' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_obj_to_path_ds'>
      <parameter type-id='type-id-45' name='zhp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='4515' column='1'/>
      <parameter type-id='type-id-53' name='dsobj' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='4515' column='1'/>
      <parameter type-id='type-id-53' name='obj' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='4515' column='1'/>
      <parameter type-id='type-id-49' name='pathname' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='4516' column='1'/>
      <parameter type-id='type-id-67' name='len' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='4516' column='1'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='zpool_obj_to_path' mangled-name='zpool_obj_to_path' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='4508' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_obj_to_path'>
      <parameter type-id='type-id-45' name='zhp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='4508' column='1'/>
      <parameter type-id='type-id-53' name='dsobj' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='4508' column='1'/>
      <parameter type-id='type-id-53' name='obj' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='4508' column='1'/>
      <parameter type-id='type-id-49' name='pathname' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='4509' column='1'/>
      <parameter type-id='type-id-67' name='len' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='4509' column='1'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='zpool_events_seek' mangled-name='zpool_events_seek' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='4426' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_events_seek'>
      <parameter type-id='type-id-44' name='hdl' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='4426' column='1'/>
      <parameter type-id='type-id-53' name='eid' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='4426' column='1'/>
      <parameter type-id='type-id-22' name='zevent_fd' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='4426' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zpool_events_clear' mangled-name='zpool_events_clear' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='4403' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_events_clear'>
      <parameter type-id='type-id-44' name='hdl' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='4403' column='1'/>
      <parameter type-id='type-id-157' name='count' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='4403' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zpool_events_next' mangled-name='zpool_events_next' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='4343' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_events_next'>
      <parameter type-id='type-id-44' name='hdl' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='4343' column='1'/>
      <parameter type-id='type-id-117' name='nvp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='4343' column='1'/>
      <parameter type-id='type-id-157' name='dropped' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='4344' column='1'/>
      <parameter type-id='type-id-29' name='flags' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='4344' column='1'/>
      <parameter type-id='type-id-22' name='zevent_fd' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='4344' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zpool_get_history' mangled-name='zpool_get_history' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='4273' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_get_history'>
      <parameter type-id='type-id-45' name='zhp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='4273' column='1'/>
      <parameter type-id='type-id-117' name='nvhisp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='4273' column='1'/>
      <parameter type-id='type-id-159' name='off' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='4273' column='1'/>
      <parameter type-id='type-id-114' name='eof' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='4274' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zpool_log_history' mangled-name='zpool_log_history' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='4204' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_log_history'>
      <parameter type-id='type-id-44' name='hdl' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='4204' column='1'/>
      <parameter type-id='type-id-105' name='message' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='4204' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zfs_save_arguments' mangled-name='zfs_save_arguments' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='4192' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_save_arguments'>
      <parameter type-id='type-id-22' name='argc' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='4192' column='1'/>
      <parameter type-id='type-id-153' name='argv' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='4192' column='1'/>
      <parameter type-id='type-id-49' name='string' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='4192' column='1'/>
      <parameter type-id='type-id-22' name='len' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='4192' column='1'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='zpool_upgrade' mangled-name='zpool_upgrade' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='4176' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_upgrade'>
      <parameter type-id='type-id-45' name='zhp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='4176' column='1'/>
      <parameter type-id='type-id-53' name='new_version' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='4176' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zpool_get_errlog' mangled-name='zpool_get_errlog' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='4077' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_get_errlog'>
      <parameter type-id='type-id-45' name='zhp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='4077' column='1'/>
      <parameter type-id='type-id-117' name='nverrlistp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='4077' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zpool_vdev_name' mangled-name='zpool_vdev_name' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='3952' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_vdev_name'>
      <parameter type-id='type-id-44' name='hdl' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='3952' column='1'/>
      <parameter type-id='type-id-45' name='zhp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='3952' column='1'/>
      <parameter type-id='type-id-48' name='nv' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='3952' column='1'/>
      <parameter type-id='type-id-22' name='name_flags' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='3953' column='1'/>
      <return type-id='type-id-49'/>
    </function-decl>
    <function-decl name='zpool_sync_one' mangled-name='zpool_sync_one' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='3915' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_sync_one'>
      <parameter type-id='type-id-45' name='zhp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='3915' column='1'/>
      <parameter type-id='type-id-66' name='data' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='3915' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zpool_reopen_one' mangled-name='zpool_reopen_one' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='3897' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_reopen_one'>
      <parameter type-id='type-id-45' name='zhp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='3897' column='1'/>
      <parameter type-id='type-id-66' name='data' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='3897' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zpool_reguid' mangled-name='zpool_reguid' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='3877' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_reguid'>
      <parameter type-id='type-id-45' name='zhp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='3877' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zpool_vdev_clear' mangled-name='zpool_vdev_clear' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='3853' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_vdev_clear'>
      <parameter type-id='type-id-45' name='zhp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='3853' column='1'/>
      <parameter type-id='type-id-53' name='guid' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='3853' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zpool_clear' mangled-name='zpool_clear' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='3777' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_clear'>
      <parameter type-id='type-id-45' name='zhp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='3777' column='1'/>
      <parameter type-id='type-id-105' name='path' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='3777' column='1'/>
      <parameter type-id='type-id-48' name='rewindnvl' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='3777' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zpool_vdev_indirect_size' mangled-name='zpool_vdev_indirect_size' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='3744' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_vdev_indirect_size'>
      <parameter type-id='type-id-45' name='zhp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='3744' column='1'/>
      <parameter type-id='type-id-105' name='path' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='3744' column='1'/>
      <parameter type-id='type-id-159' name='sizep' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='3745' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zpool_vdev_remove_cancel' mangled-name='zpool_vdev_remove_cancel' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='3724' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_vdev_remove_cancel'>
      <parameter type-id='type-id-45' name='zhp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='3724' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zpool_vdev_remove' mangled-name='zpool_vdev_remove' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='3652' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_vdev_remove'>
      <parameter type-id='type-id-45' name='zhp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='3652' column='1'/>
      <parameter type-id='type-id-105' name='path' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='3652' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zpool_vdev_split' mangled-name='zpool_vdev_split' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='3430' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_vdev_split'>
      <parameter type-id='type-id-45' name='zhp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='3430' column='1'/>
      <parameter type-id='type-id-49' name='newname' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='3430' column='1'/>
      <parameter type-id='type-id-117' name='newroot' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='3430' column='1'/>
      <parameter type-id='type-id-48' name='props' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='3431' column='1'/>
      <parameter type-id='type-id-190' name='flags' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='3431' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zpool_vdev_detach' mangled-name='zpool_vdev_detach' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='3333' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_vdev_detach'>
      <parameter type-id='type-id-45' name='zhp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='3333' column='1'/>
      <parameter type-id='type-id-105' name='path' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='3333' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zpool_vdev_attach' mangled-name='zpool_vdev_attach' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='3160' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_vdev_attach'>
      <parameter type-id='type-id-45' name='zhp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='3160' column='1'/>
      <parameter type-id='type-id-105' name='old_disk' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='3160' column='1'/>
      <parameter type-id='type-id-105' name='new_disk' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='3161' column='1'/>
      <parameter type-id='type-id-48' name='nvroot' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='3161' column='1'/>
      <parameter type-id='type-id-22' name='replacing' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='3161' column='1'/>
      <parameter type-id='type-id-37' name='rebuild' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='3161' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zpool_vdev_degrade' mangled-name='zpool_vdev_degrade' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='3106' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_vdev_degrade'>
      <parameter type-id='type-id-45' name='zhp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='3106' column='1'/>
      <parameter type-id='type-id-53' name='guid' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='3106' column='1'/>
      <parameter type-id='type-id-192' name='aux' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='3106' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zpool_vdev_fault' mangled-name='zpool_vdev_fault' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='3071' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_vdev_fault'>
      <parameter type-id='type-id-45' name='zhp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='3071' column='1'/>
      <parameter type-id='type-id-53' name='guid' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='3071' column='1'/>
      <parameter type-id='type-id-192' name='aux' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='3071' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zpool_vdev_offline' mangled-name='zpool_vdev_offline' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='3021' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_vdev_offline'>
      <parameter type-id='type-id-45' name='zhp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='3021' column='1'/>
      <parameter type-id='type-id-105' name='path' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='3021' column='1'/>
      <parameter type-id='type-id-37' name='istmp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='3021' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zpool_vdev_online' mangled-name='zpool_vdev_online' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='2934' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_vdev_online'>
      <parameter type-id='type-id-45' name='zhp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='2934' column='1'/>
      <parameter type-id='type-id-105' name='path' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='2934' column='1'/>
      <parameter type-id='type-id-22' name='flags' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='2934' column='1'/>
      <parameter type-id='type-id-210' name='newstate' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='2935' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zpool_vdev_path_to_guid' mangled-name='zpool_vdev_path_to_guid' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='2924' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_vdev_path_to_guid'>
      <parameter type-id='type-id-45' name='zhp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='2924' column='1'/>
      <parameter type-id='type-id-105' name='path' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='2924' column='1'/>
      <return type-id='type-id-53'/>
    </function-decl>
    <function-decl name='zpool_get_physpath' mangled-name='zpool_get_physpath' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='2886' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_get_physpath'>
      <parameter type-id='type-id-45' name='zhp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='2886' column='1'/>
      <parameter type-id='type-id-49' name='physpath' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='2886' column='1'/>
      <parameter type-id='type-id-67' name='phypath_size' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='2886' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zpool_find_vdev' mangled-name='zpool_find_vdev' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='2713' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_find_vdev'>
      <parameter type-id='type-id-45' name='zhp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='2713' column='1'/>
      <parameter type-id='type-id-105' name='path' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='2713' column='1'/>
      <parameter type-id='type-id-114' name='avail_spare' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='2713' column='1'/>
      <parameter type-id='type-id-114' name='l2cache' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='2714' column='1'/>
      <parameter type-id='type-id-114' name='log' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='2714' column='1'/>
      <return type-id='type-id-48'/>
    </function-decl>
    <function-decl name='zpool_find_vdev_by_physpath' mangled-name='zpool_find_vdev_by_physpath' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='2662' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_find_vdev_by_physpath'>
      <parameter type-id='type-id-45' name='zhp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='2662' column='1'/>
      <parameter type-id='type-id-105' name='ppath' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='2662' column='1'/>
      <parameter type-id='type-id-114' name='avail_spare' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='2663' column='1'/>
      <parameter type-id='type-id-114' name='l2cache' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='2663' column='1'/>
      <parameter type-id='type-id-114' name='log' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='2663' column='1'/>
      <return type-id='type-id-48'/>
    </function-decl>
    <function-decl name='zpool_scan' mangled-name='zpool_scan' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='2417' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_scan'>
      <parameter type-id='type-id-45' name='zhp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='2417' column='1'/>
      <parameter type-id='type-id-196' name='func' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='2417' column='1'/>
      <parameter type-id='type-id-198' name='cmd' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='2417' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zpool_trim' mangled-name='zpool_trim' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='2361' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_trim'>
      <parameter type-id='type-id-45' name='zhp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='2361' column='1'/>
      <parameter type-id='type-id-200' name='cmd_type' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='2361' column='1'/>
      <parameter type-id='type-id-48' name='vds' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='2361' column='1'/>
      <parameter type-id='type-id-209' name='trim_flags' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='2362' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zpool_initialize_wait' mangled-name='zpool_initialize_wait' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='2252' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_initialize_wait'>
      <parameter type-id='type-id-45' name='zhp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='2252' column='1'/>
      <parameter type-id='type-id-204' name='cmd_type' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='2252' column='1'/>
      <parameter type-id='type-id-48' name='vds' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='2253' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zpool_initialize' mangled-name='zpool_initialize' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='2245' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_initialize'>
      <parameter type-id='type-id-45' name='zhp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='2245' column='1'/>
      <parameter type-id='type-id-204' name='cmd_type' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='2245' column='1'/>
      <parameter type-id='type-id-48' name='vds' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='2246' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zpool_import_props' mangled-name='zpool_import_props' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='1856' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_import_props'>
      <parameter type-id='type-id-44' name='hdl' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='1856' column='1'/>
      <parameter type-id='type-id-48' name='config' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='1856' column='1'/>
      <parameter type-id='type-id-105' name='newname' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='1856' column='1'/>
      <parameter type-id='type-id-48' name='props' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='1857' column='1'/>
      <parameter type-id='type-id-22' name='flags' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='1857' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zpool_print_unsup_feat' mangled-name='zpool_print_unsup_feat' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='1825' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_print_unsup_feat'>
      <parameter type-id='type-id-48' name='config' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='1825' column='1'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='zpool_import' mangled-name='zpool_import' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='1767' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_import'>
      <parameter type-id='type-id-44' name='hdl' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='1767' column='1'/>
      <parameter type-id='type-id-48' name='config' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='1767' column='1'/>
      <parameter type-id='type-id-105' name='newname' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='1767' column='1'/>
      <parameter type-id='type-id-49' name='altroot' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='1768' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zpool_explain_recover' mangled-name='zpool_explain_recover' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='1680' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_explain_recover'>
      <parameter type-id='type-id-44' name='hdl' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='1680' column='1'/>
      <parameter type-id='type-id-105' name='name' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='1680' column='1'/>
      <parameter type-id='type-id-22' name='reason' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='1680' column='1'/>
      <parameter type-id='type-id-48' name='config' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='1681' column='1'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='zpool_export_force' mangled-name='zpool_export_force' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='1622' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_export_force'>
      <parameter type-id='type-id-45' name='zhp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='1622' column='1'/>
      <parameter type-id='type-id-105' name='log_str' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='1622' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zpool_export' mangled-name='zpool_export' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='1616' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_export'>
      <parameter type-id='type-id-45' name='zhp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='1616' column='1'/>
      <parameter type-id='type-id-37' name='force' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='1616' column='1'/>
      <parameter type-id='type-id-105' name='log_str' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='1616' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zpool_add' mangled-name='zpool_add' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='1482' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_add'>
      <parameter type-id='type-id-45' name='zhp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='1482' column='1'/>
      <parameter type-id='type-id-48' name='nvroot' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='1482' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zpool_discard_checkpoint' mangled-name='zpool_discard_checkpoint' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='1460' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_discard_checkpoint'>
      <parameter type-id='type-id-45' name='zhp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='1460' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zpool_checkpoint' mangled-name='zpool_checkpoint' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='1439' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_checkpoint'>
      <parameter type-id='type-id-45' name='zhp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='1439' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zpool_destroy' mangled-name='zpool_destroy' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='1396' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_destroy'>
      <parameter type-id='type-id-45' name='zhp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='1396' column='1'/>
      <parameter type-id='type-id-105' name='log_str' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='1396' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zpool_create' mangled-name='zpool_create' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='1228' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_create'>
      <parameter type-id='type-id-44' name='hdl' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='1228' column='1'/>
      <parameter type-id='type-id-105' name='pool' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='1228' column='1'/>
      <parameter type-id='type-id-48' name='nvroot' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='1228' column='1'/>
      <parameter type-id='type-id-48' name='props' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='1229' column='1'/>
      <parameter type-id='type-id-48' name='fsprops' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='1229' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zpool_is_draid_spare' mangled-name='zpool_is_draid_spare' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='1209' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_is_draid_spare'>
      <parameter type-id='type-id-105' name='name' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='1209' column='1'/>
      <return type-id='type-id-37'/>
    </function-decl>
    <function-decl name='zpool_get_state' mangled-name='zpool_get_state' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='1162' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_get_state'>
      <parameter type-id='type-id-45' name='zhp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='1162' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zpool_get_name' mangled-name='zpool_get_name' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='1152' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_get_name'>
      <parameter type-id='type-id-45' name='zhp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='1152' column='1'/>
      <return type-id='type-id-105'/>
    </function-decl>
    <function-decl name='zpool_close' mangled-name='zpool_close' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='1140' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_close'>
      <parameter type-id='type-id-45' name='zhp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='1140' column='1'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='zpool_open' mangled-name='zpool_open' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='1119' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_open'>
      <parameter type-id='type-id-44' name='hdl' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='1119' column='1'/>
      <parameter type-id='type-id-105' name='pool' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='1119' column='1'/>
      <return type-id='type-id-45'/>
    </function-decl>
    <function-decl name='zpool_open_silent' mangled-name='zpool_open_silent' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='1088' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_open_silent'>
      <parameter type-id='type-id-44' name='hdl' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='1088' column='1'/>
      <parameter type-id='type-id-105' name='pool' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='1088' column='1'/>
      <parameter type-id='type-id-211' name='ret' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='1088' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zpool_open_canfail' mangled-name='zpool_open_canfail' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='1046' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_open_canfail'>
      <parameter type-id='type-id-44' name='hdl' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='1046' column='1'/>
      <parameter type-id='type-id-105' name='pool' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='1046' column='1'/>
      <return type-id='type-id-45'/>
    </function-decl>
    <function-decl name='zpool_name_valid' mangled-name='zpool_name_valid' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='947' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_name_valid'>
      <parameter type-id='type-id-44' name='hdl' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='947' column='1'/>
      <parameter type-id='type-id-37' name='isopen' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='947' column='1'/>
      <parameter type-id='type-id-105' name='pool' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='947' column='1'/>
      <return type-id='type-id-37'/>
    </function-decl>
    <function-decl name='zpool_prop_get_feature' mangled-name='zpool_prop_get_feature' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='885' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_prop_get_feature'>
      <parameter type-id='type-id-45' name='zhp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='885' column='1'/>
      <parameter type-id='type-id-105' name='propname' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='885' column='1'/>
      <parameter type-id='type-id-49' name='buf' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='885' column='1'/>
      <parameter type-id='type-id-67' name='len' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='886' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zpool_expand_proplist' mangled-name='zpool_expand_proplist' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='787' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_expand_proplist'>
      <parameter type-id='type-id-45' name='zhp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='787' column='1'/>
      <parameter type-id='type-id-162' name='plp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='787' column='1'/>
      <parameter type-id='type-id-37' name='literal' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='788' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zpool_set_prop' mangled-name='zpool_set_prop' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='731' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_set_prop'>
      <parameter type-id='type-id-45' name='zhp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='731' column='1'/>
      <parameter type-id='type-id-105' name='propname' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='731' column='1'/>
      <parameter type-id='type-id-105' name='propval' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='731' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zpool_get_prop' mangled-name='zpool_get_prop' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='280' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_get_prop'>
      <parameter type-id='type-id-45' name='zhp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='280' column='1'/>
      <parameter type-id='type-id-206' name='prop' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='280' column='1'/>
      <parameter type-id='type-id-49' name='buf' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='280' column='1'/>
      <parameter type-id='type-id-67' name='len' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='281' column='1'/>
      <parameter type-id='type-id-163' name='srctype' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='281' column='1'/>
      <parameter type-id='type-id-37' name='literal' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='281' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zpool_get_state_str' mangled-name='zpool_get_state_str' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='248' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_get_state_str'>
      <parameter type-id='type-id-45' name='zhp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='248' column='1'/>
      <return type-id='type-id-105'/>
    </function-decl>
    <function-decl name='zpool_pool_state_to_name' mangled-name='zpool_pool_state_to_name' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='217' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_pool_state_to_name'>
      <parameter type-id='type-id-174' name='state' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='217' column='1'/>
      <return type-id='type-id-105'/>
    </function-decl>
    <function-decl name='zpool_state_to_name' mangled-name='zpool_state_to_name' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='184' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_state_to_name'>
      <parameter type-id='type-id-194' name='state' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='184' column='1'/>
      <parameter type-id='type-id-192' name='aux' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='184' column='1'/>
      <return type-id='type-id-105'/>
    </function-decl>
    <function-decl name='zpool_get_prop_int' mangled-name='zpool_get_prop_int' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='142' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_get_prop_int'>
      <parameter type-id='type-id-45' name='zhp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='142' column='1'/>
      <parameter type-id='type-id-206' name='prop' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='142' column='1'/>
      <parameter type-id='type-id-163' name='src' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='142' column='1'/>
      <return type-id='type-id-53'/>
    </function-decl>
    <function-decl name='zpool_props_refresh' mangled-name='zpool_props_refresh' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='102' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_props_refresh'>
      <parameter type-id='type-id-45' name='zhp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_pool.c' line='102' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='libzfs_sendrecv.c' comp-dir-path='/home/fedora/zfs/lib/libzfs' language='LANG_C99'>
    <typedef-decl name='recvflags_t' type-id='type-id-212' filepath='../../include/libzfs.h' line='786' column='1' id='type-id-213'/>
    <class-decl name='recvflags' size-in-bits='416' is-struct='yes' visibility='default' filepath='../../include/libzfs.h' line='741' column='1' id='type-id-212'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='verbose' type-id='type-id-37' visibility='default' filepath='../../include/libzfs.h' line='743' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='isprefix' type-id='type-id-37' visibility='default' filepath='../../include/libzfs.h' line='746' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='istail' type-id='type-id-37' visibility='default' filepath='../../include/libzfs.h' line='752' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='dryrun' type-id='type-id-37' visibility='default' filepath='../../include/libzfs.h' line='755' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='force' type-id='type-id-37' visibility='default' filepath='../../include/libzfs.h' line='758' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='canmountoff' type-id='type-id-37' visibility='default' filepath='../../include/libzfs.h' line='761' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='resumable' type-id='type-id-37' visibility='default' filepath='../../include/libzfs.h' line='767' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='byteswap' type-id='type-id-37' visibility='default' filepath='../../include/libzfs.h' line='770' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='nomount' type-id='type-id-37' visibility='default' filepath='../../include/libzfs.h' line='773' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='holds' type-id='type-id-37' visibility='default' filepath='../../include/libzfs.h' line='776' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='skipholds' type-id='type-id-37' visibility='default' filepath='../../include/libzfs.h' line='779' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='domount' type-id='type-id-37' visibility='default' filepath='../../include/libzfs.h' line='782' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='forceunmount' type-id='type-id-37' visibility='default' filepath='../../include/libzfs.h' line='785' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='sendflags_t' type-id='type-id-214' filepath='../../include/libzfs.h' line='708' column='1' id='type-id-215'/>
    <class-decl name='sendflags' size-in-bits='512' is-struct='yes' visibility='default' filepath='../../include/libzfs.h' line='660' column='1' id='type-id-214'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='verbosity' type-id='type-id-22' visibility='default' filepath='../../include/libzfs.h' line='662' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='replicate' type-id='type-id-37' visibility='default' filepath='../../include/libzfs.h' line='665' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='doall' type-id='type-id-37' visibility='default' filepath='../../include/libzfs.h' line='668' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='fromorigin' type-id='type-id-37' visibility='default' filepath='../../include/libzfs.h' line='671' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='pad' type-id='type-id-37' visibility='default' filepath='../../include/libzfs.h' line='674' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='props' type-id='type-id-37' visibility='default' filepath='../../include/libzfs.h' line='677' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='dryrun' type-id='type-id-37' visibility='default' filepath='../../include/libzfs.h' line='680' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='parsable' type-id='type-id-37' visibility='default' filepath='../../include/libzfs.h' line='683' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='progress' type-id='type-id-37' visibility='default' filepath='../../include/libzfs.h' line='686' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='largeblock' type-id='type-id-37' visibility='default' filepath='../../include/libzfs.h' line='689' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='embed_data' type-id='type-id-37' visibility='default' filepath='../../include/libzfs.h' line='692' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='compress' type-id='type-id-37' visibility='default' filepath='../../include/libzfs.h' line='695' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='raw' type-id='type-id-37' visibility='default' filepath='../../include/libzfs.h' line='698' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='backup' type-id='type-id-37' visibility='default' filepath='../../include/libzfs.h' line='701' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='holds' type-id='type-id-37' visibility='default' filepath='../../include/libzfs.h' line='704' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='saved' type-id='type-id-37' visibility='default' filepath='../../include/libzfs.h' line='707' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='snapfilter_cb_t' type-id='type-id-216' filepath='../../include/libzfs.h' line='710' column='1' id='type-id-217'/>
    <pointer-type-def type-id='type-id-55' size-in-bits='64' id='type-id-218'/>
    <pointer-type-def type-id='type-id-213' size-in-bits='64' id='type-id-219'/>
    <pointer-type-def type-id='type-id-215' size-in-bits='64' id='type-id-220'/>
    <pointer-type-def type-id='type-id-217' size-in-bits='64' id='type-id-221'/>
    <function-decl name='zfs_receive' mangled-name='zfs_receive' filepath='/home/fedora/zfs/lib/libzfs/libzfs_sendrecv.c' line='5118' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_receive'>
      <parameter type-id='type-id-44' name='hdl' filepath='/home/fedora/zfs/lib/libzfs/libzfs_sendrecv.c' line='5118' column='1'/>
      <parameter type-id='type-id-105' name='tosnap' filepath='/home/fedora/zfs/lib/libzfs/libzfs_sendrecv.c' line='5118' column='1'/>
      <parameter type-id='type-id-48' name='props' filepath='/home/fedora/zfs/lib/libzfs/libzfs_sendrecv.c' line='5118' column='1'/>
      <parameter type-id='type-id-219' name='flags' filepath='/home/fedora/zfs/lib/libzfs/libzfs_sendrecv.c' line='5119' column='1'/>
      <parameter type-id='type-id-22' name='infd' filepath='/home/fedora/zfs/lib/libzfs/libzfs_sendrecv.c' line='5119' column='1'/>
      <parameter type-id='type-id-218' name='stream_avl' filepath='/home/fedora/zfs/lib/libzfs/libzfs_sendrecv.c' line='5119' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zfs_send_one' mangled-name='zfs_send_one' filepath='/home/fedora/zfs/lib/libzfs/libzfs_sendrecv.c' line='2385' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_send_one'>
      <parameter type-id='type-id-108' name='zhp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_sendrecv.c' line='2385' column='1'/>
      <parameter type-id='type-id-105' name='from' filepath='/home/fedora/zfs/lib/libzfs/libzfs_sendrecv.c' line='2385' column='1'/>
      <parameter type-id='type-id-22' name='fd' filepath='/home/fedora/zfs/lib/libzfs/libzfs_sendrecv.c' line='2385' column='1'/>
      <parameter type-id='type-id-220' name='flags' filepath='/home/fedora/zfs/lib/libzfs/libzfs_sendrecv.c' line='2385' column='1'/>
      <parameter type-id='type-id-105' name='redactbook' filepath='/home/fedora/zfs/lib/libzfs/libzfs_sendrecv.c' line='2386' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zfs_send' mangled-name='zfs_send' filepath='/home/fedora/zfs/lib/libzfs/libzfs_sendrecv.c' line='2111' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_send'>
      <parameter type-id='type-id-108' name='zhp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_sendrecv.c' line='2111' column='1'/>
      <parameter type-id='type-id-105' name='fromsnap' filepath='/home/fedora/zfs/lib/libzfs/libzfs_sendrecv.c' line='2111' column='1'/>
      <parameter type-id='type-id-105' name='tosnap' filepath='/home/fedora/zfs/lib/libzfs/libzfs_sendrecv.c' line='2111' column='1'/>
      <parameter type-id='type-id-220' name='flags' filepath='/home/fedora/zfs/lib/libzfs/libzfs_sendrecv.c' line='2112' column='1'/>
      <parameter type-id='type-id-22' name='outfd' filepath='/home/fedora/zfs/lib/libzfs/libzfs_sendrecv.c' line='2112' column='1'/>
      <parameter type-id='type-id-221' name='filter_func' filepath='/home/fedora/zfs/lib/libzfs/libzfs_sendrecv.c' line='2112' column='1'/>
      <parameter type-id='type-id-66' name='cb_arg' filepath='/home/fedora/zfs/lib/libzfs/libzfs_sendrecv.c' line='2113' column='1'/>
      <parameter type-id='type-id-117' name='debugnvp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_sendrecv.c' line='2113' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zfs_send_saved' mangled-name='zfs_send_saved' filepath='/home/fedora/zfs/lib/libzfs/libzfs_sendrecv.c' line='1859' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_send_saved'>
      <parameter type-id='type-id-108' name='zhp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_sendrecv.c' line='1859' column='1'/>
      <parameter type-id='type-id-220' name='flags' filepath='/home/fedora/zfs/lib/libzfs/libzfs_sendrecv.c' line='1859' column='1'/>
      <parameter type-id='type-id-22' name='outfd' filepath='/home/fedora/zfs/lib/libzfs/libzfs_sendrecv.c' line='1859' column='1'/>
      <parameter type-id='type-id-105' name='resume_token' filepath='/home/fedora/zfs/lib/libzfs/libzfs_sendrecv.c' line='1860' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zfs_send_resume' mangled-name='zfs_send_resume' filepath='/home/fedora/zfs/lib/libzfs/libzfs_sendrecv.c' line='1833' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_send_resume'>
      <parameter type-id='type-id-44' name='hdl' filepath='/home/fedora/zfs/lib/libzfs/libzfs_sendrecv.c' line='1833' column='1'/>
      <parameter type-id='type-id-220' name='flags' filepath='/home/fedora/zfs/lib/libzfs/libzfs_sendrecv.c' line='1833' column='1'/>
      <parameter type-id='type-id-22' name='outfd' filepath='/home/fedora/zfs/lib/libzfs/libzfs_sendrecv.c' line='1833' column='1'/>
      <parameter type-id='type-id-105' name='resume_token' filepath='/home/fedora/zfs/lib/libzfs/libzfs_sendrecv.c' line='1834' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zfs_send_resume_token_to_nvlist' mangled-name='zfs_send_resume_token_to_nvlist' filepath='/home/fedora/zfs/lib/libzfs/libzfs_sendrecv.c' line='1360' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_send_resume_token_to_nvlist'>
      <parameter type-id='type-id-44' name='hdl' filepath='/home/fedora/zfs/lib/libzfs/libzfs_sendrecv.c' line='1360' column='1'/>
      <parameter type-id='type-id-105' name='token' filepath='/home/fedora/zfs/lib/libzfs/libzfs_sendrecv.c' line='1360' column='1'/>
      <return type-id='type-id-48'/>
    </function-decl>
    <function-decl name='zfs_send_progress' mangled-name='zfs_send_progress' filepath='/home/fedora/zfs/lib/libzfs/libzfs_sendrecv.c' line='872' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_send_progress'>
      <parameter type-id='type-id-108' name='zhp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_sendrecv.c' line='872' column='1'/>
      <parameter type-id='type-id-22' name='fd' filepath='/home/fedora/zfs/lib/libzfs/libzfs_sendrecv.c' line='872' column='1'/>
      <parameter type-id='type-id-159' name='bytes_written' filepath='/home/fedora/zfs/lib/libzfs/libzfs_sendrecv.c' line='872' column='1'/>
      <parameter type-id='type-id-159' name='blocks_visited' filepath='/home/fedora/zfs/lib/libzfs/libzfs_sendrecv.c' line='873' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='__builtin_strcpy' mangled-name='strcpy' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='__builtin_puts' mangled-name='puts' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='__builtin_strlen' mangled-name='strlen' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-216'>
      <parameter type-id='type-id-108'/>
      <parameter type-id='type-id-66'/>
      <return type-id='type-id-37'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='libzfs_status.c' comp-dir-path='/home/fedora/zfs/lib/libzfs' language='LANG_C99'>
    <typedef-decl name='zpool_status_t' type-id='type-id-222' filepath='../../include/libzfs.h' line='399' column='1' id='type-id-223'/>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' filepath='../../include/libzfs.h' line='338' column='1' id='type-id-222'>
      <underlying-type type-id='type-id-27'/>
      <enumerator name='ZPOOL_STATUS_CORRUPT_CACHE' value='0'/>
      <enumerator name='ZPOOL_STATUS_MISSING_DEV_R' value='1'/>
      <enumerator name='ZPOOL_STATUS_MISSING_DEV_NR' value='2'/>
      <enumerator name='ZPOOL_STATUS_CORRUPT_LABEL_R' value='3'/>
      <enumerator name='ZPOOL_STATUS_CORRUPT_LABEL_NR' value='4'/>
      <enumerator name='ZPOOL_STATUS_BAD_GUID_SUM' value='5'/>
      <enumerator name='ZPOOL_STATUS_CORRUPT_POOL' value='6'/>
      <enumerator name='ZPOOL_STATUS_CORRUPT_DATA' value='7'/>
      <enumerator name='ZPOOL_STATUS_FAILING_DEV' value='8'/>
      <enumerator name='ZPOOL_STATUS_VERSION_NEWER' value='9'/>
      <enumerator name='ZPOOL_STATUS_HOSTID_MISMATCH' value='10'/>
      <enumerator name='ZPOOL_STATUS_HOSTID_ACTIVE' value='11'/>
      <enumerator name='ZPOOL_STATUS_HOSTID_REQUIRED' value='12'/>
      <enumerator name='ZPOOL_STATUS_IO_FAILURE_WAIT' value='13'/>
      <enumerator name='ZPOOL_STATUS_IO_FAILURE_CONTINUE' value='14'/>
      <enumerator name='ZPOOL_STATUS_IO_FAILURE_MMP' value='15'/>
      <enumerator name='ZPOOL_STATUS_BAD_LOG' value='16'/>
      <enumerator name='ZPOOL_STATUS_ERRATA' value='17'/>
      <enumerator name='ZPOOL_STATUS_UNSUP_FEAT_READ' value='18'/>
      <enumerator name='ZPOOL_STATUS_UNSUP_FEAT_WRITE' value='19'/>
      <enumerator name='ZPOOL_STATUS_FAULTED_DEV_R' value='20'/>
      <enumerator name='ZPOOL_STATUS_FAULTED_DEV_NR' value='21'/>
      <enumerator name='ZPOOL_STATUS_VERSION_OLDER' value='22'/>
      <enumerator name='ZPOOL_STATUS_FEAT_DISABLED' value='23'/>
      <enumerator name='ZPOOL_STATUS_RESILVERING' value='24'/>
      <enumerator name='ZPOOL_STATUS_OFFLINE_DEV' value='25'/>
      <enumerator name='ZPOOL_STATUS_REMOVED_DEV' value='26'/>
      <enumerator name='ZPOOL_STATUS_REBUILDING' value='27'/>
      <enumerator name='ZPOOL_STATUS_REBUILD_SCRUB' value='28'/>
      <enumerator name='ZPOOL_STATUS_NON_NATIVE_ASHIFT' value='29'/>
      <enumerator name='ZPOOL_STATUS_OK' value='30'/>
    </enum-decl>
    <typedef-decl name='zpool_errata_t' type-id='type-id-224' filepath='../../include/sys/fs/zfs.h' line='1041' column='1' id='type-id-225'/>
    <enum-decl name='zpool_errata' filepath='../../include/sys/fs/zfs.h' line='1035' column='1' id='type-id-224'>
      <underlying-type type-id='type-id-27'/>
      <enumerator name='ZPOOL_ERRATA_NONE' value='0'/>
      <enumerator name='ZPOOL_ERRATA_ZOL_2094_SCRUB' value='1'/>
      <enumerator name='ZPOOL_ERRATA_ZOL_2094_ASYNC_DESTROY' value='2'/>
      <enumerator name='ZPOOL_ERRATA_ZOL_6845_ENCRYPTION' value='3'/>
      <enumerator name='ZPOOL_ERRATA_ZOL_8308_ENCRYPTION' value='4'/>
    </enum-decl>
    <pointer-type-def type-id='type-id-225' size-in-bits='64' id='type-id-226'/>
    <function-decl name='zpool_import_status' mangled-name='zpool_import_status' filepath='/home/fedora/zfs/lib/libzfs/libzfs_status.c' line='498' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_import_status'>
      <parameter type-id='type-id-48' name='config' filepath='/home/fedora/zfs/lib/libzfs/libzfs_status.c' line='498' column='1'/>
      <parameter type-id='type-id-153' name='msgid' filepath='/home/fedora/zfs/lib/libzfs/libzfs_status.c' line='498' column='1'/>
      <parameter type-id='type-id-226' name='errata' filepath='/home/fedora/zfs/lib/libzfs/libzfs_status.c' line='498' column='1'/>
      <return type-id='type-id-223'/>
    </function-decl>
    <function-decl name='zpool_get_status' mangled-name='zpool_get_status' filepath='/home/fedora/zfs/lib/libzfs/libzfs_status.c' line='485' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_get_status'>
      <parameter type-id='type-id-45' name='zhp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_status.c' line='485' column='1'/>
      <parameter type-id='type-id-153' name='msgid' filepath='/home/fedora/zfs/lib/libzfs/libzfs_status.c' line='485' column='1'/>
      <parameter type-id='type-id-226' name='errata' filepath='/home/fedora/zfs/lib/libzfs/libzfs_status.c' line='485' column='1'/>
      <return type-id='type-id-223'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='libzfs_util.c' comp-dir-path='/home/fedora/zfs/lib/libzfs' language='LANG_C99'>


    <array-type-def dimensions='1' type-id='type-id-22' size-in-bits='192' id='type-id-227'>
      <subrange length='6' type-id='type-id-3' id='type-id-228'/>

    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-229' size-in-bits='160' alignment-in-bits='32' id='type-id-230'>
      <subrange length='5' type-id='type-id-3' id='type-id-231'/>

    </array-type-def>
    <typedef-decl name='zprop_func' type-id='type-id-232' filepath='../../include/sys/fs/zfs.h' line='286' column='1' id='type-id-233'/>
    <typedef-decl name='nvpair_t' type-id='type-id-234' filepath='../../include/sys/nvpair.h' line='82' column='1' id='type-id-235'/>
    <class-decl name='nvpair' size-in-bits='128' is-struct='yes' visibility='default' filepath='../../include/sys/nvpair.h' line='73' column='1' id='type-id-234'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nvp_size' type-id='type-id-75' visibility='default' filepath='../../include/sys/nvpair.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='nvp_name_sz' type-id='type-id-236' visibility='default' filepath='../../include/sys/nvpair.h' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='nvp_reserve' type-id='type-id-236' visibility='default' filepath='../../include/sys/nvpair.h' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='nvp_value_elem' type-id='type-id-75' visibility='default' filepath='../../include/sys/nvpair.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='nvp_type' type-id='type-id-237' visibility='default' filepath='../../include/sys/nvpair.h' line='78' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='int16_t' type-id='type-id-238' filepath='/usr/include/bits/stdint-intn.h' line='25' column='1' id='type-id-236'/>
    <typedef-decl name='__int16_t' type-id='type-id-25' filepath='/usr/include/bits/types.h' line='39' column='1' id='type-id-238'/>
    <typedef-decl name='data_type_t' type-id='type-id-239' filepath='../../include/sys/nvpair.h' line='71' column='1' id='type-id-237'/>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' filepath='../../include/sys/nvpair.h' line='37' column='1' id='type-id-239'>
      <underlying-type type-id='type-id-27'/>
      <enumerator name='DATA_TYPE_DONTCARE' value='-1'/>
      <enumerator name='DATA_TYPE_UNKNOWN' value='0'/>
      <enumerator name='DATA_TYPE_BOOLEAN' value='1'/>
      <enumerator name='DATA_TYPE_BYTE' value='2'/>
      <enumerator name='DATA_TYPE_INT16' value='3'/>
      <enumerator name='DATA_TYPE_UINT16' value='4'/>
      <enumerator name='DATA_TYPE_INT32' value='5'/>
      <enumerator name='DATA_TYPE_UINT32' value='6'/>
      <enumerator name='DATA_TYPE_INT64' value='7'/>
      <enumerator name='DATA_TYPE_UINT64' value='8'/>
      <enumerator name='DATA_TYPE_STRING' value='9'/>
      <enumerator name='DATA_TYPE_BYTE_ARRAY' value='10'/>
      <enumerator name='DATA_TYPE_INT16_ARRAY' value='11'/>
      <enumerator name='DATA_TYPE_UINT16_ARRAY' value='12'/>
      <enumerator name='DATA_TYPE_INT32_ARRAY' value='13'/>
      <enumerator name='DATA_TYPE_UINT32_ARRAY' value='14'/>
      <enumerator name='DATA_TYPE_INT64_ARRAY' value='15'/>
      <enumerator name='DATA_TYPE_UINT64_ARRAY' value='16'/>
      <enumerator name='DATA_TYPE_STRING_ARRAY' value='17'/>
      <enumerator name='DATA_TYPE_HRTIME' value='18'/>
      <enumerator name='DATA_TYPE_NVLIST' value='19'/>
      <enumerator name='DATA_TYPE_NVLIST_ARRAY' value='20'/>
      <enumerator name='DATA_TYPE_BOOLEAN_VALUE' value='21'/>
      <enumerator name='DATA_TYPE_INT8' value='22'/>
      <enumerator name='DATA_TYPE_UINT8' value='23'/>
      <enumerator name='DATA_TYPE_BOOLEAN_ARRAY' value='24'/>
      <enumerator name='DATA_TYPE_INT8_ARRAY' value='25'/>
      <enumerator name='DATA_TYPE_UINT8_ARRAY' value='26'/>
      <enumerator name='DATA_TYPE_DOUBLE' value='27'/>
    </enum-decl>
    <typedef-decl name='zprop_get_cbdata_t' type-id='type-id-240' filepath='../../include/libzfs.h' line='600' column='1' id='type-id-241'/>
    <class-decl name='zprop_get_cbdata' size-in-bits='640' is-struct='yes' visibility='default' filepath='../../include/libzfs.h' line='591' column='1' id='type-id-240'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cb_sources' type-id='type-id-22' visibility='default' filepath='../../include/libzfs.h' line='592' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='cb_columns' type-id='type-id-230' visibility='default' filepath='../../include/libzfs.h' line='593' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='cb_colwidths' type-id='type-id-227' visibility='default' filepath='../../include/libzfs.h' line='594' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='cb_scripted' type-id='type-id-37' visibility='default' filepath='../../include/libzfs.h' line='595' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='cb_literal' type-id='type-id-37' visibility='default' filepath='../../include/libzfs.h' line='596' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='cb_first' type-id='type-id-37' visibility='default' filepath='../../include/libzfs.h' line='597' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='cb_proplist' type-id='type-id-161' visibility='default' filepath='../../include/libzfs.h' line='598' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='cb_type' type-id='type-id-46' visibility='default' filepath='../../include/libzfs.h' line='599' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='zfs_get_column_t' type-id='type-id-242' filepath='../../include/libzfs.h' line='586' column='1' id='type-id-229'/>
    <enum-decl name='__anonymous_enum__1' is-anonymous='yes' filepath='../../include/libzfs.h' line='579' column='1' id='type-id-242'>
      <underlying-type type-id='type-id-27'/>
      <enumerator name='GET_COL_NONE' value='0'/>
      <enumerator name='GET_COL_NAME' value='1'/>
      <enumerator name='GET_COL_PROPERTY' value='2'/>
      <enumerator name='GET_COL_VALUE' value='3'/>
      <enumerator name='GET_COL_RECVD' value='4'/>
      <enumerator name='GET_COL_SOURCE' value='5'/>
    </enum-decl>
    <pointer-type-def type-id='type-id-153' size-in-bits='64' id='type-id-243'/>
    <pointer-type-def type-id='type-id-244' size-in-bits='64' id='type-id-232'/>
    <pointer-type-def type-id='type-id-235' size-in-bits='64' id='type-id-245'/>
    <pointer-type-def type-id='type-id-241' size-in-bits='64' id='type-id-246'/>
    <function-decl name='printf_color' mangled-name='printf_color' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='2088' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='printf_color'>
      <parameter type-id='type-id-49' name='color' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='2088' column='1'/>
      <parameter type-id='type-id-49' name='format' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='2088' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='color_end' mangled-name='color_end' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='2080' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='color_end'>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='color_start' mangled-name='color_start' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='2073' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='color_start'>
      <parameter type-id='type-id-49' name='color' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='2073' column='1'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='zfs_version_print' mangled-name='zfs_version_print' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='1994' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_version_print'>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zfs_version_userland' mangled-name='zfs_version_userland' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='1984' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_version_userland'>
      <parameter type-id='type-id-49' name='version' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='1984' column='1'/>
      <parameter type-id='type-id-22' name='len' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='1984' column='1'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='zprop_iter' mangled-name='zprop_iter' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='1974' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zprop_iter'>
      <parameter type-id='type-id-233' name='func' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='1974' column='1'/>
      <parameter type-id='type-id-66' name='cb' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='1974' column='1'/>
      <parameter type-id='type-id-37' name='show_all' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='1974' column='1'/>
      <parameter type-id='type-id-37' name='ordered' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='1974' column='1'/>
      <parameter type-id='type-id-46' name='type' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='1975' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zprop_expand_list' mangled-name='zprop_expand_list' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='1933' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zprop_expand_list'>
      <parameter type-id='type-id-44' name='hdl' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='1933' column='1'/>
      <parameter type-id='type-id-162' name='plp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='1933' column='1'/>
      <parameter type-id='type-id-46' name='type' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='1933' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zprop_free_list' mangled-name='zprop_free_list' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='1895' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zprop_free_list'>
      <parameter type-id='type-id-161' name='pl' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='1895' column='1'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='zprop_get_list' mangled-name='zprop_get_list' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='1814' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zprop_get_list'>
      <parameter type-id='type-id-44' name='hdl' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='1814' column='1'/>
      <parameter type-id='type-id-49' name='props' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='1814' column='1'/>
      <parameter type-id='type-id-162' name='listp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='1814' column='1'/>
      <parameter type-id='type-id-46' name='type' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='1815' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zprop_parse_value' mangled-name='zprop_parse_value' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='1606' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zprop_parse_value'>
      <parameter type-id='type-id-44' name='hdl' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='1606' column='1'/>
      <parameter type-id='type-id-245' name='elem' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='1606' column='1'/>
      <parameter type-id='type-id-22' name='prop' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='1606' column='1'/>
      <parameter type-id='type-id-46' name='type' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='1607' column='1'/>
      <parameter type-id='type-id-48' name='ret' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='1607' column='1'/>
      <parameter type-id='type-id-153' name='svalp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='1607' column='1'/>
      <parameter type-id='type-id-159' name='ivalp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='1607' column='1'/>
      <parameter type-id='type-id-105' name='errbuf' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='1608' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zfs_nicestrtonum' mangled-name='zfs_nicestrtonum' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='1521' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_nicestrtonum'>
      <parameter type-id='type-id-44' name='hdl' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='1521' column='1'/>
      <parameter type-id='type-id-105' name='value' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='1521' column='1'/>
      <parameter type-id='type-id-159' name='num' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='1521' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zprop_print_one_property' mangled-name='zprop_print_one_property' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='1389' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zprop_print_one_property'>
      <parameter type-id='type-id-105' name='name' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='1389' column='1'/>
      <parameter type-id='type-id-246' name='cbp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='1389' column='1'/>
      <parameter type-id='type-id-105' name='propname' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='1390' column='1'/>
      <parameter type-id='type-id-105' name='value' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='1390' column='1'/>
      <parameter type-id='type-id-142' name='sourcetype' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='1390' column='1'/>
      <parameter type-id='type-id-105' name='source' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='1391' column='1'/>
      <parameter type-id='type-id-105' name='recvd_value' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='1391' column='1'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='zcmd_read_dst_nvlist' mangled-name='zcmd_read_dst_nvlist' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='1249' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zcmd_read_dst_nvlist'>
      <parameter type-id='type-id-44' name='hdl' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='1249' column='1'/>
      <parameter type-id='type-id-160' name='zc' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='1249' column='1'/>
      <parameter type-id='type-id-117' name='nvlp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='1249' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zcmd_write_src_nvlist' mangled-name='zcmd_write_src_nvlist' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='1239' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zcmd_write_src_nvlist'>
      <parameter type-id='type-id-44' name='hdl' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='1239' column='1'/>
      <parameter type-id='type-id-160' name='zc' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='1239' column='1'/>
      <parameter type-id='type-id-48' name='nvl' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='1239' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zcmd_write_conf_nvlist' mangled-name='zcmd_write_conf_nvlist' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='1232' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zcmd_write_conf_nvlist'>
      <parameter type-id='type-id-44' name='hdl' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='1232' column='1'/>
      <parameter type-id='type-id-160' name='zc' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='1232' column='1'/>
      <parameter type-id='type-id-48' name='nvl' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='1232' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zcmd_free_nvlists' mangled-name='zcmd_free_nvlists' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='1201' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zcmd_free_nvlists'>
      <parameter type-id='type-id-160' name='zc' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='1201' column='1'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='zcmd_expand_dst_nvlist' mangled-name='zcmd_expand_dst_nvlist' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='1186' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zcmd_expand_dst_nvlist'>
      <parameter type-id='type-id-44' name='hdl' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='1186' column='1'/>
      <parameter type-id='type-id-160' name='zc' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='1186' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zcmd_alloc_dst_nvlist' mangled-name='zcmd_alloc_dst_nvlist' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='1167' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zcmd_alloc_dst_nvlist'>
      <parameter type-id='type-id-44' name='hdl' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='1167' column='1'/>
      <parameter type-id='type-id-160' name='zc' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='1167' column='1'/>
      <parameter type-id='type-id-67' name='len' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='1167' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zfs_path_to_zhandle' mangled-name='zfs_path_to_zhandle' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='1134' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_path_to_zhandle'>
      <parameter type-id='type-id-44' name='hdl' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='1134' column='1'/>
      <parameter type-id='type-id-105' name='path' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='1134' column='1'/>
      <parameter type-id='type-id-46' name='argtype' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='1134' column='1'/>
      <return type-id='type-id-108'/>
    </function-decl>
    <function-decl name='zfs_get_pool_handle' mangled-name='zfs_get_pool_handle' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='1122' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_get_pool_handle'>
      <parameter type-id='type-id-155' name='zhp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='1122' column='1'/>
      <return type-id='type-id-45'/>
    </function-decl>
    <function-decl name='zfs_get_handle' mangled-name='zfs_get_handle' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='1116' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_get_handle'>
      <parameter type-id='type-id-108' name='zhp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='1116' column='1'/>
      <return type-id='type-id-44'/>
    </function-decl>
    <function-decl name='zpool_get_handle' mangled-name='zpool_get_handle' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='1110' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_get_handle'>
      <parameter type-id='type-id-45' name='zhp' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='1110' column='1'/>
      <return type-id='type-id-44'/>
    </function-decl>
    <function-decl name='libzfs_fini' mangled-name='libzfs_fini' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='1091' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='libzfs_fini'>
      <parameter type-id='type-id-44' name='hdl' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='1091' column='1'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='libzfs_init' mangled-name='libzfs_init' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='1007' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='libzfs_init'>
      <return type-id='type-id-44'/>
    </function-decl>
    <function-decl name='libzfs_envvar_is_set' mangled-name='libzfs_envvar_is_set' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='995' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='libzfs_envvar_is_set'>
      <parameter type-id='type-id-49' name='envvar' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='995' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='libzfs_free_str_array' mangled-name='libzfs_free_str_array' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='980' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='libzfs_free_str_array'>
      <parameter type-id='type-id-153' name='strs' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='980' column='1'/>
      <parameter type-id='type-id-22' name='count' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='980' column='1'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='libzfs_run_process_get_stdout_nopath' mangled-name='libzfs_run_process_get_stdout_nopath' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='968' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='libzfs_run_process_get_stdout_nopath'>
      <parameter type-id='type-id-105' name='path' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='968' column='1'/>
      <parameter type-id='type-id-153' name='argv' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='968' column='1'/>
      <parameter type-id='type-id-153' name='env' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='969' column='1'/>
      <parameter type-id='type-id-243' name='lines' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='969' column='1'/>
      <parameter type-id='type-id-157' name='lines_cnt' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='969' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='libzfs_run_process_get_stdout' mangled-name='libzfs_run_process_get_stdout' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='957' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='libzfs_run_process_get_stdout'>
      <parameter type-id='type-id-105' name='path' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='957' column='1'/>
      <parameter type-id='type-id-153' name='argv' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='957' column='1'/>
      <parameter type-id='type-id-153' name='env' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='957' column='1'/>
      <parameter type-id='type-id-243' name='lines' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='958' column='1'/>
      <parameter type-id='type-id-157' name='lines_cnt' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='958' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='libzfs_run_process' mangled-name='libzfs_run_process' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='945' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='libzfs_run_process'>
      <parameter type-id='type-id-105' name='path' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='945' column='1'/>
      <parameter type-id='type-id-153' name='argv' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='945' column='1'/>
      <parameter type-id='type-id-22' name='flags' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='945' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='libzfs_print_on_error' mangled-name='libzfs_print_on_error' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='823' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='libzfs_print_on_error'>
      <parameter type-id='type-id-44' name='hdl' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='823' column='1'/>
      <parameter type-id='type-id-37' name='printerr' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='823' column='1'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='zfs_strdup' mangled-name='zfs_strdup' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='812' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_strdup'>
      <parameter type-id='type-id-44' name='hdl' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='812' column='1'/>
      <parameter type-id='type-id-105' name='str' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='812' column='1'/>
      <return type-id='type-id-49'/>
    </function-decl>
    <function-decl name='zfs_realloc' mangled-name='zfs_realloc' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='795' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_realloc'>
      <parameter type-id='type-id-44' name='hdl' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='795' column='1'/>
      <parameter type-id='type-id-66' name='ptr' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='795' column='1'/>
      <parameter type-id='type-id-67' name='oldsize' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='795' column='1'/>
      <parameter type-id='type-id-67' name='newsize' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='795' column='1'/>
      <return type-id='type-id-66'/>
    </function-decl>
    <function-decl name='zfs_asprintf' mangled-name='zfs_asprintf' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='773' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_asprintf'>
      <parameter type-id='type-id-44' name='hdl' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='773' column='1'/>
      <parameter type-id='type-id-105' name='fmt' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='773' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-49'/>
    </function-decl>
    <function-decl name='zfs_alloc' mangled-name='zfs_alloc' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='758' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_alloc'>
      <parameter type-id='type-id-44' name='hdl' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='758' column='1'/>
      <parameter type-id='type-id-67' name='size' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='758' column='1'/>
      <return type-id='type-id-66'/>
    </function-decl>
    <function-decl name='no_memory' mangled-name='no_memory' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='749' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='no_memory'>
      <parameter type-id='type-id-44' name='hdl' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='749' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zpool_standard_error_fmt' mangled-name='zpool_standard_error_fmt' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='615' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_standard_error_fmt'>
      <parameter type-id='type-id-44' name='hdl' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='615' column='1'/>
      <parameter type-id='type-id-22' name='error' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='615' column='1'/>
      <parameter type-id='type-id-105' name='fmt' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='615' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zpool_standard_error' mangled-name='zpool_standard_error' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='608' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_standard_error'>
      <parameter type-id='type-id-44' name='hdl' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='608' column='1'/>
      <parameter type-id='type-id-22' name='error' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='608' column='1'/>
      <parameter type-id='type-id-105' name='msg' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='608' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zfs_setprop_error' mangled-name='zfs_setprop_error' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='496' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_setprop_error'>
      <parameter type-id='type-id-44' name='hdl' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='496' column='1'/>
      <parameter type-id='type-id-34' name='prop' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='496' column='1'/>
      <parameter type-id='type-id-22' name='err' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='496' column='1'/>
      <parameter type-id='type-id-49' name='errbuf' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='497' column='1'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='zfs_standard_error_fmt' mangled-name='zfs_standard_error_fmt' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='405' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_standard_error_fmt'>
      <parameter type-id='type-id-44' name='hdl' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='405' column='1'/>
      <parameter type-id='type-id-22' name='error' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='405' column='1'/>
      <parameter type-id='type-id-105' name='fmt' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='405' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zfs_standard_error' mangled-name='zfs_standard_error' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='398' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_standard_error'>
      <parameter type-id='type-id-44' name='hdl' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='398' column='1'/>
      <parameter type-id='type-id-22' name='error' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='398' column='1'/>
      <parameter type-id='type-id-105' name='msg' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='398' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zfs_error_fmt' mangled-name='zfs_error_fmt' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='354' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_error_fmt'>
      <parameter type-id='type-id-44' name='hdl' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='354' column='1'/>
      <parameter type-id='type-id-22' name='error' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='354' column='1'/>
      <parameter type-id='type-id-105' name='fmt' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='354' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zfs_error' mangled-name='zfs_error' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='347' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_error'>
      <parameter type-id='type-id-44' name='hdl' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='347' column='1'/>
      <parameter type-id='type-id-22' name='error' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='347' column='1'/>
      <parameter type-id='type-id-105' name='msg' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='347' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zfs_error_aux' mangled-name='zfs_error_aux' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='306' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_error_aux'>
      <parameter type-id='type-id-44' name='hdl' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='306' column='1'/>
      <parameter type-id='type-id-105' name='fmt' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='306' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='libzfs_error_action' mangled-name='libzfs_error_action' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='76' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='libzfs_error_action'>
      <parameter type-id='type-id-44' name='hdl' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='76' column='1'/>
      <return type-id='type-id-105'/>
    </function-decl>
    <function-decl name='libzfs_errno' mangled-name='libzfs_errno' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='70' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='libzfs_errno'>
      <parameter type-id='type-id-44' name='hdl' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='70' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='libzfs_error_description' mangled-name='libzfs_error_description' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='82' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='libzfs_error_description'>
      <parameter type-id='type-id-44' name='hdl' filepath='/home/fedora/zfs/lib/libzfs/libzfs_util.c' line='82' column='1'/>
      <return type-id='type-id-105'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-244'>
      <parameter type-id='type-id-22'/>
      <parameter type-id='type-id-66'/>
      <return type-id='type-id-22'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='os/linux/libzfs_mount_os.c' comp-dir-path='/home/fedora/zfs/lib/libzfs' language='LANG_C99'>
    <pointer-type-def type-id='type-id-3' size-in-bits='64' id='type-id-247'/>
    <function-decl name='zfs_mount_delegation_check' mangled-name='zfs_mount_delegation_check' filepath='os/linux/libzfs_mount_os.c' line='408' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_mount_delegation_check'>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='do_unmount' mangled-name='do_unmount' filepath='os/linux/libzfs_mount_os.c' line='377' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='do_unmount'>
      <parameter type-id='type-id-105' name='mntpt' filepath='os/linux/libzfs_mount_os.c' line='377' column='1'/>
      <parameter type-id='type-id-22' name='flags' filepath='os/linux/libzfs_mount_os.c' line='377' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='do_mount' mangled-name='do_mount' filepath='os/linux/libzfs_mount_os.c' line='323' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='do_mount'>
      <parameter type-id='type-id-108' name='zhp' filepath='os/linux/libzfs_mount_os.c' line='323' column='1'/>
      <parameter type-id='type-id-105' name='mntpt' filepath='os/linux/libzfs_mount_os.c' line='323' column='1'/>
      <parameter type-id='type-id-49' name='opts' filepath='os/linux/libzfs_mount_os.c' line='323' column='1'/>
      <parameter type-id='type-id-22' name='flags' filepath='os/linux/libzfs_mount_os.c' line='323' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zfs_adjust_mount_options' mangled-name='zfs_adjust_mount_options' filepath='os/linux/libzfs_mount_os.c' line='273' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_adjust_mount_options'>
      <parameter type-id='type-id-108' name='zhp' filepath='os/linux/libzfs_mount_os.c' line='273' column='1'/>
      <parameter type-id='type-id-105' name='mntpoint' filepath='os/linux/libzfs_mount_os.c' line='273' column='1'/>
      <parameter type-id='type-id-49' name='mntopts' filepath='os/linux/libzfs_mount_os.c' line='274' column='1'/>
      <parameter type-id='type-id-49' name='mtabopt' filepath='os/linux/libzfs_mount_os.c' line='274' column='1'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='zfs_parse_mount_options' mangled-name='zfs_parse_mount_options' filepath='os/linux/libzfs_mount_os.c' line='183' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_parse_mount_options'>
      <parameter type-id='type-id-49' name='mntopts' filepath='os/linux/libzfs_mount_os.c' line='183' column='1'/>
      <parameter type-id='type-id-247' name='mntflags' filepath='os/linux/libzfs_mount_os.c' line='183' column='1'/>
      <parameter type-id='type-id-247' name='zfsflags' filepath='os/linux/libzfs_mount_os.c' line='184' column='1'/>
      <parameter type-id='type-id-22' name='sloppy' filepath='os/linux/libzfs_mount_os.c' line='184' column='1'/>
      <parameter type-id='type-id-49' name='badopt' filepath='os/linux/libzfs_mount_os.c' line='184' column='1'/>
      <parameter type-id='type-id-49' name='mtabopt' filepath='os/linux/libzfs_mount_os.c' line='184' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='os/linux/libzfs_pool_os.c' comp-dir-path='/home/fedora/zfs/lib/libzfs' language='LANG_C99'>
    <function-decl name='zpool_label_disk' mangled-name='zpool_label_disk' filepath='os/linux/libzfs_pool_os.c' line='212' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_label_disk'>
      <parameter type-id='type-id-44' name='hdl' filepath='os/linux/libzfs_pool_os.c' line='212' column='1'/>
      <parameter type-id='type-id-45' name='zhp' filepath='os/linux/libzfs_pool_os.c' line='212' column='1'/>
      <parameter type-id='type-id-105' name='name' filepath='os/linux/libzfs_pool_os.c' line='212' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='zpool_relabel_disk' mangled-name='zpool_relabel_disk' filepath='os/linux/libzfs_pool_os.c' line='61' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_relabel_disk'>
      <parameter type-id='type-id-44' name='hdl' filepath='os/linux/libzfs_pool_os.c' line='61' column='1'/>
      <parameter type-id='type-id-105' name='path' filepath='os/linux/libzfs_pool_os.c' line='61' column='1'/>
      <parameter type-id='type-id-105' name='msg' filepath='os/linux/libzfs_pool_os.c' line='61' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='os/linux/libzfs_sendrecv_os.c' comp-dir-path='/home/fedora/zfs/lib/libzfs' language='LANG_C99'>
    <function-decl name='libzfs_set_pipe_max' mangled-name='libzfs_set_pipe_max' filepath='os/linux/libzfs_sendrecv_os.c' line='36' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='libzfs_set_pipe_max'>
      <parameter type-id='type-id-22' name='infd' filepath='os/linux/libzfs_sendrecv_os.c' line='36' column='1'/>
      <return type-id='type-id-31'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='os/linux/libzfs_util_os.c' comp-dir-path='/home/fedora/zfs/lib/libzfs' language='LANG_C99'>
    <typedef-decl name='differ_info_t' type-id='type-id-248' filepath='../../include/libzfs_impl.h' line='240' column='1' id='type-id-249'/>
    <class-decl name='differ_info' size-in-bits='9024' is-struct='yes' visibility='default' filepath='../../include/libzfs_impl.h' line='221' column='1' id='type-id-248'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='zhp' type-id='type-id-108' visibility='default' filepath='../../include/libzfs_impl.h' line='222' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='fromsnap' type-id='type-id-49' visibility='default' filepath='../../include/libzfs_impl.h' line='223' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='frommnt' type-id='type-id-49' visibility='default' filepath='../../include/libzfs_impl.h' line='224' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='tosnap' type-id='type-id-49' visibility='default' filepath='../../include/libzfs_impl.h' line='225' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='tomnt' type-id='type-id-49' visibility='default' filepath='../../include/libzfs_impl.h' line='226' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='ds' type-id='type-id-49' visibility='default' filepath='../../include/libzfs_impl.h' line='227' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='dsmnt' type-id='type-id-49' visibility='default' filepath='../../include/libzfs_impl.h' line='228' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='tmpsnap' type-id='type-id-49' visibility='default' filepath='../../include/libzfs_impl.h' line='229' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='errbuf' type-id='type-id-6' visibility='default' filepath='../../include/libzfs_impl.h' line='230' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8704'>
        <var-decl name='isclone' type-id='type-id-37' visibility='default' filepath='../../include/libzfs_impl.h' line='231' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8736'>
        <var-decl name='scripted' type-id='type-id-37' visibility='default' filepath='../../include/libzfs_impl.h' line='232' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8768'>
        <var-decl name='classify' type-id='type-id-37' visibility='default' filepath='../../include/libzfs_impl.h' line='233' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8800'>
        <var-decl name='timestamped' type-id='type-id-37' visibility='default' filepath='../../include/libzfs_impl.h' line='234' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8832'>
        <var-decl name='shares' type-id='type-id-53' visibility='default' filepath='../../include/libzfs_impl.h' line='235' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8896'>
        <var-decl name='zerr' type-id='type-id-22' visibility='default' filepath='../../include/libzfs_impl.h' line='236' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8928'>
        <var-decl name='cleanupfd' type-id='type-id-22' visibility='default' filepath='../../include/libzfs_impl.h' line='237' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8960'>
        <var-decl name='outputfd' type-id='type-id-22' visibility='default' filepath='../../include/libzfs_impl.h' line='238' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8992'>
        <var-decl name='datafd' type-id='type-id-22' visibility='default' filepath='../../include/libzfs_impl.h' line='239' column='1'/>
      </data-member>
    </class-decl>
