<abi-corpus path='libzfs_core.so' architecture='elf-amd-x86_64' soname='libzfs_core.so.3'>
  <elf-needed>
    <dependency name='libatomic.so.1'/>
    <dependency name='libuuid.so.1'/>
    <dependency name='libz.so.1'/>
    <dependency name='librt.so.1'/>
    <dependency name='libm.so.6'/>
    <dependency name='libblkid.so.1'/>
    <dependency name='libudev.so.1'/>
    <dependency name='libnvpair.so.3'/>
    <dependency name='libpthread.so.0'/>
    <dependency name='libc.so.6'/>
    <dependency name='ld-linux-x86-64.so.2'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='_sol_getmntent' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='atomic_add_16' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='atomic_add_16_nv' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='atomic_add_32' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='atomic_add_32_nv' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='atomic_add_64' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='atomic_add_64_nv' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='tpool_member' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='tpool_resume' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='tpool_suspend' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='tpool_suspended' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='tpool_wait' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='update_vdev_config_dev_strs' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zfs_append_partition' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zfs_basename' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zfs_dev_flush' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zfs_dev_is_dm' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zfs_dev_is_whole_disk' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zfs_device_get_devid' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zfs_device_get_physical' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zfs_dirnamelen' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zfs_get_enclosure_sysfs_path' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zfs_get_underlying_path' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zfs_ioctl_fd' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zfs_isnumber' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zfs_nicebytes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zfs_nicenum' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zfs_nicenum_format' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zfs_niceraw' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zfs_nicetime' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zfs_resolve_shortname' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zfs_strcmp_pathname' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zfs_strip_partition' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zfs_strip_path' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zpool_default_search_paths' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zpool_dump_ddt' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zpool_find_config' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zpool_history_unpack' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zpool_label_disk_wait' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zpool_read_label' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zpool_search_import' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <elf-variable-symbols>
    <elf-symbol name='efi_debug' size='4' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='libspl_assert_ok' size='4' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-variable-symbols>
  <abi-instr version='1.0' address-size='64' path='libzfs_core.c' comp-dir-path='/home/nabijaczleweli/store/code/zfs/lib/libzfs_core' language='LANG_C99'>
    <type-decl name='int' size-in-bits='32' id='type-id-1'/>
    <function-decl name='libzfs_core_init' mangled-name='libzfs_core_init' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='libzfs_core_init'>
      <return type-id='type-id-1'/>
    </function-decl>
    <union-decl name='__anonymous_union__' size-in-bits='320' is-anonymous='yes' visibility='default' id='type-id-2'>
      <data-member access='private'>
        <var-decl name='__data' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='__size' type-id='type-id-4' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='__align' type-id='type-id-5' visibility='default'/>
      </data-member>
    </union-decl>
    <class-decl name='__pthread_mutex_s' size-in-bits='320' is-struct='yes' visibility='default' id='type-id-3'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__lock' type-id='type-id-1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='__count' type-id='type-id-6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__owner' type-id='type-id-1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='__nusers' type-id='type-id-6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='__kind' type-id='type-id-1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='__spins' type-id='type-id-7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='176'>
        <var-decl name='__elision' type-id='type-id-7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='__list' type-id='type-id-8' visibility='default'/>
      </data-member>
    </class-decl>
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-6'/>
    <type-decl name='short int' size-in-bits='16' id='type-id-7'/>
    <class-decl name='__pthread_internal_list' size-in-bits='128' is-struct='yes' visibility='default' id='type-id-9'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__prev' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__next' type-id='type-id-10' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-9' size-in-bits='64' id='type-id-10'/>
    <typedef-decl name='__pthread_list_t' type-id='type-id-9' id='type-id-8'/>
    <type-decl name='char' size-in-bits='8' id='type-id-11'/>
    <type-decl name='__ARRAY_SIZE_TYPE__' size-in-bits='64' id='type-id-12'/>

    <array-type-def dimensions='1' type-id='type-id-11' size-in-bits='320' id='type-id-4'>
      <subrange length='40' type-id='type-id-12' id='type-id-13'/>

    </array-type-def>
    <type-decl name='long int' size-in-bits='64' id='type-id-5'/>
    <pointer-type-def type-id='type-id-2' size-in-bits='64' id='type-id-14'/>
    <function-decl name='pthread_mutex_lock' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-14'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <qualified-type-def type-id='type-id-11' const='yes' id='type-id-15'/>
    <pointer-type-def type-id='type-id-15' size-in-bits='64' id='type-id-16'/>
    <function-decl name='open' mangled-name='open64' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='pthread_mutex_unlock' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-14'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <type-decl name='void' id='type-id-17'/>
    <function-decl name='libzfs_core_fini' mangled-name='libzfs_core_fini' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='libzfs_core_fini'>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='close' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <type-decl name='unnamed-enum-underlying-type' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='type-id-18'/>
    <enum-decl name='lzc_dataset_type' id='type-id-19'>
      <underlying-type type-id='type-id-18'/>
      <enumerator name='LZC_DATSET_TYPE_ZFS' value='2'/>
      <enumerator name='LZC_DATSET_TYPE_ZVOL' value='3'/>
    </enum-decl>
    <class-decl name='nvlist' size-in-bits='192' is-struct='yes' visibility='default' id='type-id-20'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nvl_version' type-id='type-id-21' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='nvl_nvflag' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='nvl_priv' type-id='type-id-23' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='nvl_flag' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='nvl_pad' type-id='type-id-21' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__int32_t' type-id='type-id-1' id='type-id-24'/>
    <typedef-decl name='int32_t' type-id='type-id-24' id='type-id-21'/>
    <typedef-decl name='__uint32_t' type-id='type-id-6' id='type-id-25'/>
    <typedef-decl name='uint32_t' type-id='type-id-25' id='type-id-22'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-26'/>
    <typedef-decl name='__uint64_t' type-id='type-id-26' id='type-id-27'/>
    <typedef-decl name='uint64_t' type-id='type-id-27' id='type-id-23'/>
    <typedef-decl name='nvlist_t' type-id='type-id-20' id='type-id-28'/>
    <pointer-type-def type-id='type-id-28' size-in-bits='64' id='type-id-29'/>
    <type-decl name='unsigned char' size-in-bits='8' id='type-id-30'/>
    <typedef-decl name='__uint8_t' type-id='type-id-30' id='type-id-31'/>
    <typedef-decl name='uint8_t' type-id='type-id-31' id='type-id-32'/>
    <pointer-type-def type-id='type-id-32' size-in-bits='64' id='type-id-33'/>
    <typedef-decl name='uint_t' type-id='type-id-6' id='type-id-34'/>
    <function-decl name='lzc_create' mangled-name='lzc_create' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_create'>
      <parameter type-id='type-id-16' name='fsname'/>
      <parameter type-id='type-id-19' name='type'/>
      <parameter type-id='type-id-29' name='props'/>
      <parameter type-id='type-id-33' name='wkeydata'/>
      <parameter type-id='type-id-34' name='wkeylen'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <pointer-type-def type-id='type-id-20' size-in-bits='64' id='type-id-35'/>
    <function-decl name='fnvlist_alloc' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-35'/>
    </function-decl>
    <function-decl name='fnvlist_add_int32' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-35'/>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='fnvlist_add_nvlist' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-35'/>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-35'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <pointer-type-def type-id='type-id-30' size-in-bits='64' id='type-id-36'/>
    <function-decl name='fnvlist_add_uint8_array' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-35'/>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-36'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='nvlist_free' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-35'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='libspl_assertf' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-16'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <pointer-type-def type-id='type-id-11' size-in-bits='64' id='type-id-37'/>
    <function-decl name='strlcpy' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-37'/>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-26'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <pointer-type-def type-id='type-id-26' size-in-bits='64' id='type-id-38'/>
    <function-decl name='fnvlist_pack' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-35'/>
      <parameter type-id='type-id-38'/>
      <return type-id='type-id-37'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_uint64' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-35'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <class-decl name='zfs_cmd' size-in-bits='109952' is-struct='yes' visibility='default' id='type-id-39'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='zc_name' type-id='type-id-40' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32768'>
        <var-decl name='zc_nvlist_src' type-id='type-id-23' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32832'>
        <var-decl name='zc_nvlist_src_size' type-id='type-id-23' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32896'>
        <var-decl name='zc_nvlist_dst' type-id='type-id-23' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32960'>
        <var-decl name='zc_nvlist_dst_size' type-id='type-id-23' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='33024'>
        <var-decl name='zc_nvlist_dst_filled' type-id='type-id-41' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='33056'>
        <var-decl name='zc_pad2' type-id='type-id-1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='33088'>
        <var-decl name='zc_history' type-id='type-id-23' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='33152'>
        <var-decl name='zc_value' type-id='type-id-42' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='98688'>
        <var-decl name='zc_string' type-id='type-id-43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='100736'>
        <var-decl name='zc_guid' type-id='type-id-23' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='100800'>
        <var-decl name='zc_nvlist_conf' type-id='type-id-23' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='100864'>
        <var-decl name='zc_nvlist_conf_size' type-id='type-id-23' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='100928'>
        <var-decl name='zc_cookie' type-id='type-id-23' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='100992'>
        <var-decl name='zc_objset_type' type-id='type-id-23' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='101056'>
        <var-decl name='zc_perm_action' type-id='type-id-23' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='101120'>
        <var-decl name='zc_history_len' type-id='type-id-23' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='101184'>
        <var-decl name='zc_history_offset' type-id='type-id-23' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='101248'>
        <var-decl name='zc_obj' type-id='type-id-23' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='101312'>
        <var-decl name='zc_iflags' type-id='type-id-23' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='101376'>
        <var-decl name='zc_share' type-id='type-id-44' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='101632'>
        <var-decl name='zc_objset_stats' type-id='type-id-45' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='103936'>
        <var-decl name='zc_begin_record' type-id='type-id-46' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='106368'>
        <var-decl name='zc_inject_record' type-id='type-id-47' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109184'>
        <var-decl name='zc_defer_destroy' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109216'>
        <var-decl name='zc_flags' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109248'>
        <var-decl name='zc_action_handle' type-id='type-id-23' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109312'>
        <var-decl name='zc_cleanup_fd' type-id='type-id-1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109344'>
        <var-decl name='zc_simple' type-id='type-id-32' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109352'>
        <var-decl name='zc_pad' type-id='type-id-48' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109376'>
        <var-decl name='zc_sendobj' type-id='type-id-23' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109440'>
        <var-decl name='zc_fromobj' type-id='type-id-23' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109504'>
        <var-decl name='zc_createtxg' type-id='type-id-23' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109568'>
        <var-decl name='zc_stat' type-id='type-id-49' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109888'>
        <var-decl name='zc_zoneid' type-id='type-id-23' visibility='default'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-11' size-in-bits='32768' id='type-id-40'>
      <subrange length='4096' type-id='type-id-12' id='type-id-50'/>

    </array-type-def>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' id='type-id-51'>
      <underlying-type type-id='type-id-18'/>
      <enumerator name='B_FALSE' value='0'/>
      <enumerator name='B_TRUE' value='1'/>
    </enum-decl>
    <typedef-decl name='boolean_t' type-id='type-id-51' id='type-id-41'/>

    <array-type-def dimensions='1' type-id='type-id-11' size-in-bits='65536' id='type-id-42'>
      <subrange length='8192' type-id='type-id-12' id='type-id-52'/>

    </array-type-def>

    <array-type-def dimensions='1' type-id='type-id-11' size-in-bits='2048' id='type-id-43'>
      <subrange length='256' type-id='type-id-12' id='type-id-53'/>

    </array-type-def>
    <class-decl name='zfs_share' size-in-bits='256' is-struct='yes' visibility='default' id='type-id-54'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='z_exportdata' type-id='type-id-23' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='z_sharedata' type-id='type-id-23' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='z_sharetype' type-id='type-id-23' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='z_sharemax' type-id='type-id-23' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='zfs_share_t' type-id='type-id-54' id='type-id-44'/>
    <class-decl name='dmu_objset_stats' size-in-bits='2304' is-struct='yes' visibility='default' id='type-id-55'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='dds_num_clones' type-id='type-id-23' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='dds_creation_txg' type-id='type-id-23' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='dds_guid' type-id='type-id-23' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='dds_type' type-id='type-id-56' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='dds_is_snapshot' type-id='type-id-32' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='232'>
        <var-decl name='dds_inconsistent' type-id='type-id-32' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='240'>
        <var-decl name='dds_redacted' type-id='type-id-32' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='248'>
        <var-decl name='dds_origin' type-id='type-id-43' visibility='default'/>
      </data-member>
    </class-decl>
    <enum-decl name='dmu_objset_type' id='type-id-57'>
      <underlying-type type-id='type-id-18'/>
      <enumerator name='DMU_OST_NONE' value='0'/>
      <enumerator name='DMU_OST_META' value='1'/>
      <enumerator name='DMU_OST_ZFS' value='2'/>
      <enumerator name='DMU_OST_ZVOL' value='3'/>
      <enumerator name='DMU_OST_OTHER' value='4'/>
      <enumerator name='DMU_OST_ANY' value='5'/>
      <enumerator name='DMU_OST_NUMTYPES' value='6'/>
    </enum-decl>
    <typedef-decl name='dmu_objset_type_t' type-id='type-id-57' id='type-id-56'/>
    <typedef-decl name='dmu_objset_stats_t' type-id='type-id-55' id='type-id-45'/>
    <class-decl name='drr_begin' size-in-bits='2432' is-struct='yes' visibility='default' id='type-id-46'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='drr_magic' type-id='type-id-23' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='drr_versioninfo' type-id='type-id-23' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='drr_creation_time' type-id='type-id-23' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='drr_type' type-id='type-id-56' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='drr_flags' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='drr_toguid' type-id='type-id-23' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='drr_fromguid' type-id='type-id-23' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='drr_toname' type-id='type-id-43' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='zinject_record' size-in-bits='2816' is-struct='yes' visibility='default' id='type-id-58'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='zi_objset' type-id='type-id-23' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='zi_object' type-id='type-id-23' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='zi_start' type-id='type-id-23' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='zi_end' type-id='type-id-23' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='zi_guid' type-id='type-id-23' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='zi_level' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='zi_error' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='zi_type' type-id='type-id-23' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='zi_freq' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='zi_failfast' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='zi_func' type-id='type-id-43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2560'>
        <var-decl name='zi_iotype' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2592'>
        <var-decl name='zi_duration' type-id='type-id-21' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2624'>
        <var-decl name='zi_timer' type-id='type-id-23' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2688'>
        <var-decl name='zi_nlanes' type-id='type-id-23' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2752'>
        <var-decl name='zi_cmd' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2784'>
        <var-decl name='zi_dvas' type-id='type-id-22' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='zinject_record_t' type-id='type-id-58' id='type-id-47'/>

    <array-type-def dimensions='1' type-id='type-id-32' size-in-bits='24' id='type-id-48'>
      <subrange length='3' type-id='type-id-12' id='type-id-59'/>

    </array-type-def>
    <class-decl name='zfs_stat' size-in-bits='320' is-struct='yes' visibility='default' id='type-id-60'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='zs_gen' type-id='type-id-23' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='zs_mode' type-id='type-id-23' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='zs_links' type-id='type-id-23' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='zs_ctime' type-id='type-id-61' visibility='default'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-23' size-in-bits='128' id='type-id-61'>
      <subrange length='2' type-id='type-id-12' id='type-id-62'/>

    </array-type-def>
    <typedef-decl name='zfs_stat_t' type-id='type-id-60' id='type-id-49'/>
    <pointer-type-def type-id='type-id-39' size-in-bits='64' id='type-id-63'/>
    <function-decl name='zfs_ioctl_fd' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-63'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='fnvlist_unpack' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-37'/>
      <parameter type-id='type-id-26'/>
      <return type-id='type-id-35'/>
    </function-decl>
    <function-decl name='fnvlist_pack_free' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-37'/>
      <parameter type-id='type-id-26'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='lzc_clone' mangled-name='lzc_clone' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_clone'>
      <parameter type-id='type-id-16' name='fsname'/>
      <parameter type-id='type-id-16' name='origin'/>
      <parameter type-id='type-id-29' name='props'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='fnvlist_add_string' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-35'/>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='lzc_promote' mangled-name='lzc_promote' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_promote'>
      <parameter type-id='type-id-16' name='fsname'/>
      <parameter type-id='type-id-37' name='snapnamebuf'/>
      <parameter type-id='type-id-1' name='snapnamelen'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='lzc_rename' mangled-name='lzc_rename' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_rename'>
      <parameter type-id='type-id-16' name='source'/>
      <parameter type-id='type-id-16' name='target'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='lzc_destroy' mangled-name='lzc_destroy' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_destroy'>
      <parameter type-id='type-id-16' name='fsname'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <pointer-type-def type-id='type-id-29' size-in-bits='64' id='type-id-64'/>
    <function-decl name='lzc_snapshot' mangled-name='lzc_snapshot' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_snapshot'>
      <parameter type-id='type-id-29' name='snaps'/>
      <parameter type-id='type-id-29' name='props'/>
      <parameter type-id='type-id-64' name='errlist'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <class-decl name='nvpair' size-in-bits='128' is-struct='yes' visibility='default' id='type-id-65'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nvp_size' type-id='type-id-21' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='nvp_name_sz' type-id='type-id-66' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='nvp_reserve' type-id='type-id-66' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='nvp_value_elem' type-id='type-id-21' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='nvp_type' type-id='type-id-67' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__int16_t' type-id='type-id-7' id='type-id-68'/>
    <typedef-decl name='int16_t' type-id='type-id-68' id='type-id-66'/>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' id='type-id-69'>
      <underlying-type type-id='type-id-18'/>
      <enumerator name='DATA_TYPE_DONTCARE' value='-1'/>
      <enumerator name='DATA_TYPE_UNKNOWN' value='0'/>
      <enumerator name='DATA_TYPE_BOOLEAN' value='1'/>
      <enumerator name='DATA_TYPE_BYTE' value='2'/>
      <enumerator name='DATA_TYPE_INT16' value='3'/>
      <enumerator name='DATA_TYPE_UINT16' value='4'/>
      <enumerator name='DATA_TYPE_INT32' value='5'/>
      <enumerator name='DATA_TYPE_UINT32' value='6'/>
      <enumerator name='DATA_TYPE_INT64' value='7'/>
      <enumerator name='DATA_TYPE_UINT64' value='8'/>
      <enumerator name='DATA_TYPE_STRING' value='9'/>
      <enumerator name='DATA_TYPE_BYTE_ARRAY' value='10'/>
      <enumerator name='DATA_TYPE_INT16_ARRAY' value='11'/>
      <enumerator name='DATA_TYPE_UINT16_ARRAY' value='12'/>
      <enumerator name='DATA_TYPE_INT32_ARRAY' value='13'/>
      <enumerator name='DATA_TYPE_UINT32_ARRAY' value='14'/>
      <enumerator name='DATA_TYPE_INT64_ARRAY' value='15'/>
      <enumerator name='DATA_TYPE_UINT64_ARRAY' value='16'/>
      <enumerator name='DATA_TYPE_STRING_ARRAY' value='17'/>
      <enumerator name='DATA_TYPE_HRTIME' value='18'/>
      <enumerator name='DATA_TYPE_NVLIST' value='19'/>
      <enumerator name='DATA_TYPE_NVLIST_ARRAY' value='20'/>
      <enumerator name='DATA_TYPE_BOOLEAN_VALUE' value='21'/>
      <enumerator name='DATA_TYPE_INT8' value='22'/>
      <enumerator name='DATA_TYPE_UINT8' value='23'/>
      <enumerator name='DATA_TYPE_BOOLEAN_ARRAY' value='24'/>
      <enumerator name='DATA_TYPE_INT8_ARRAY' value='25'/>
      <enumerator name='DATA_TYPE_UINT8_ARRAY' value='26'/>
      <enumerator name='DATA_TYPE_DOUBLE' value='27'/>
    </enum-decl>
    <typedef-decl name='data_type_t' type-id='type-id-69' id='type-id-67'/>
    <pointer-type-def type-id='type-id-65' size-in-bits='64' id='type-id-70'/>
    <function-decl name='nvlist_next_nvpair' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-35'/>
      <parameter type-id='type-id-70'/>
      <return type-id='type-id-70'/>
    </function-decl>
    <function-decl name='nvpair_name' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-70'/>
      <return type-id='type-id-37'/>
    </function-decl>
    <function-decl name='lzc_destroy_snaps' mangled-name='lzc_destroy_snaps' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_destroy_snaps'>
      <parameter type-id='type-id-29' name='snaps'/>
      <parameter type-id='type-id-41' name='defer'/>
      <parameter type-id='type-id-64' name='errlist'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='fnvlist_add_boolean' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-35'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <pointer-type-def type-id='type-id-23' size-in-bits='64' id='type-id-71'/>
    <function-decl name='lzc_snaprange_space' mangled-name='lzc_snaprange_space' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_snaprange_space'>
      <parameter type-id='type-id-16' name='firstsnap'/>
      <parameter type-id='type-id-16' name='lastsnap'/>
      <parameter type-id='type-id-71' name='usedp'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='fnvlist_free' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-35'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='lzc_exists' mangled-name='lzc_exists' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_exists'>
      <parameter type-id='type-id-16' name='dataset'/>
      <return type-id='type-id-41'/>
    </function-decl>
    <function-decl name='lzc_sync' mangled-name='lzc_sync' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_sync'>
      <parameter type-id='type-id-16' name='pool_name'/>
      <parameter type-id='type-id-29' name='innvl'/>
      <parameter type-id='type-id-64' name='outnvl'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='lzc_hold' mangled-name='lzc_hold' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_hold'>
      <parameter type-id='type-id-29' name='holds'/>
      <parameter type-id='type-id-1' name='cleanup_fd'/>
      <parameter type-id='type-id-64' name='errlist'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='lzc_release' mangled-name='lzc_release' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_release'>
      <parameter type-id='type-id-29' name='holds'/>
      <parameter type-id='type-id-64' name='errlist'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='lzc_get_holds' mangled-name='lzc_get_holds' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_get_holds'>
      <parameter type-id='type-id-16' name='snapname'/>
      <parameter type-id='type-id-64' name='holdsp'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <enum-decl name='lzc_send_flags' id='type-id-72'>
      <underlying-type type-id='type-id-18'/>
      <enumerator name='LZC_SEND_FLAG_EMBED_DATA' value='1'/>
      <enumerator name='LZC_SEND_FLAG_LARGE_BLOCK' value='2'/>
      <enumerator name='LZC_SEND_FLAG_COMPRESS' value='4'/>
      <enumerator name='LZC_SEND_FLAG_RAW' value='8'/>
      <enumerator name='LZC_SEND_FLAG_SAVED' value='16'/>
    </enum-decl>
    <function-decl name='lzc_send' mangled-name='lzc_send' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_send'>
      <parameter type-id='type-id-16' name='snapname'/>
      <parameter type-id='type-id-16' name='from'/>
      <parameter type-id='type-id-1' name='fd'/>
      <parameter type-id='type-id-72' name='flags'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='lzc_send_resume_redacted' mangled-name='lzc_send_resume_redacted' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_send_resume_redacted'>
      <parameter type-id='type-id-16' name='snapname'/>
      <parameter type-id='type-id-16' name='from'/>
      <parameter type-id='type-id-1' name='fd'/>
      <parameter type-id='type-id-72' name='flags'/>
      <parameter type-id='type-id-23' name='resumeobj'/>
      <parameter type-id='type-id-23' name='resumeoff'/>
      <parameter type-id='type-id-16' name='redactbook'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='fnvlist_add_uint64' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-35'/>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-26'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='lzc_send_redacted' mangled-name='lzc_send_redacted' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_send_redacted'>
      <parameter type-id='type-id-16' name='snapname'/>
      <parameter type-id='type-id-16' name='from'/>
      <parameter type-id='type-id-1' name='fd'/>
      <parameter type-id='type-id-72' name='flags'/>
      <parameter type-id='type-id-16' name='redactbook'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='lzc_send_resume' mangled-name='lzc_send_resume' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_send_resume'>
      <parameter type-id='type-id-16' name='snapname'/>
      <parameter type-id='type-id-16' name='from'/>
      <parameter type-id='type-id-1' name='fd'/>
      <parameter type-id='type-id-72' name='flags'/>
      <parameter type-id='type-id-23' name='resumeobj'/>
      <parameter type-id='type-id-23' name='resumeoff'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='lzc_send_space_resume_redacted' mangled-name='lzc_send_space_resume_redacted' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_send_space_resume_redacted'>
      <parameter type-id='type-id-16' name='snapname'/>
      <parameter type-id='type-id-16' name='from'/>
      <parameter type-id='type-id-72' name='flags'/>
      <parameter type-id='type-id-23' name='resumeobj'/>
      <parameter type-id='type-id-23' name='resumeoff'/>
      <parameter type-id='type-id-23' name='resume_bytes'/>
      <parameter type-id='type-id-16' name='redactbook'/>
      <parameter type-id='type-id-1' name='fd'/>
      <parameter type-id='type-id-71' name='spacep'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='lzc_send_space' mangled-name='lzc_send_space' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_send_space'>
      <parameter type-id='type-id-16' name='snapname'/>
      <parameter type-id='type-id-16' name='from'/>
      <parameter type-id='type-id-72' name='flags'/>
      <parameter type-id='type-id-71' name='spacep'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='lzc_receive' mangled-name='lzc_receive' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_receive'>
      <parameter type-id='type-id-16' name='snapname'/>
      <parameter type-id='type-id-29' name='props'/>
      <parameter type-id='type-id-16' name='origin'/>
      <parameter type-id='type-id-41' name='force'/>
      <parameter type-id='type-id-41' name='raw'/>
      <parameter type-id='type-id-1' name='fd'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <pointer-type-def type-id='type-id-17' size-in-bits='64' id='type-id-73'/>
    <function-decl name='read' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-73'/>
      <parameter type-id='type-id-26'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='fnvlist_add_byte_array' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-35'/>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-36'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='nvlist_lookup_uint64' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-35'/>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-38'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <pointer-type-def type-id='type-id-35' size-in-bits='64' id='type-id-74'/>
    <function-decl name='nvlist_lookup_nvlist' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-35'/>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-74'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='fnvlist_dup' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-35'/>
      <return type-id='type-id-35'/>
    </function-decl>
    <function-decl name='nvlist_unpack' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-37'/>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-74'/>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='lzc_receive_resumable' mangled-name='lzc_receive_resumable' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_receive_resumable'>
      <parameter type-id='type-id-16' name='snapname'/>
      <parameter type-id='type-id-29' name='props'/>
      <parameter type-id='type-id-16' name='origin'/>
      <parameter type-id='type-id-41' name='force'/>
      <parameter type-id='type-id-41' name='raw'/>
      <parameter type-id='type-id-1' name='fd'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <class-decl name='dmu_replay_record' size-in-bits='2496' is-struct='yes' visibility='default' id='type-id-75'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='drr_type' type-id='type-id-76' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='drr_payloadlen' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='drr_u' type-id='type-id-77' visibility='default'/>
      </data-member>
    </class-decl>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' id='type-id-76'>
      <underlying-type type-id='type-id-18'/>
      <enumerator name='DRR_BEGIN' value='0'/>
      <enumerator name='DRR_OBJECT' value='1'/>
      <enumerator name='DRR_FREEOBJECTS' value='2'/>
      <enumerator name='DRR_WRITE' value='3'/>
      <enumerator name='DRR_FREE' value='4'/>
      <enumerator name='DRR_END' value='5'/>
      <enumerator name='DRR_WRITE_BYREF' value='6'/>
      <enumerator name='DRR_SPILL' value='7'/>
      <enumerator name='DRR_WRITE_EMBEDDED' value='8'/>
      <enumerator name='DRR_OBJECT_RANGE' value='9'/>
      <enumerator name='DRR_REDACT' value='10'/>
      <enumerator name='DRR_NUMTYPES' value='11'/>
    </enum-decl>
    <union-decl name='__anonymous_union__' size-in-bits='2432' is-anonymous='yes' visibility='default' id='type-id-77'>
      <data-member access='private'>
        <var-decl name='drr_begin' type-id='type-id-46' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='drr_end' type-id='type-id-78' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='drr_object' type-id='type-id-79' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='drr_freeobjects' type-id='type-id-80' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='drr_write' type-id='type-id-81' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='drr_free' type-id='type-id-82' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='drr_write_byref' type-id='type-id-83' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='drr_spill' type-id='type-id-84' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='drr_write_embedded' type-id='type-id-85' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='drr_object_range' type-id='type-id-86' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='drr_redact' type-id='type-id-87' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='drr_checksum' type-id='type-id-88' visibility='default'/>
      </data-member>
    </union-decl>
    <class-decl name='drr_end' size-in-bits='320' is-struct='yes' visibility='default' id='type-id-78'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='drr_checksum' type-id='type-id-89' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='drr_toguid' type-id='type-id-23' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='zio_cksum' size-in-bits='256' is-struct='yes' visibility='default' id='type-id-90'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='zc_word' type-id='type-id-91' visibility='default'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-23' size-in-bits='256' id='type-id-91'>
      <subrange length='4' type-id='type-id-12' id='type-id-92'/>

    </array-type-def>
    <typedef-decl name='zio_cksum_t' type-id='type-id-90' id='type-id-89'/>
    <class-decl name='drr_object' size-in-bits='448' is-struct='yes' visibility='default' id='type-id-79'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='drr_object' type-id='type-id-23' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='drr_type' type-id='type-id-93' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='drr_bonustype' type-id='type-id-93' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='drr_blksz' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='drr_bonuslen' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='drr_checksumtype' type-id='type-id-32' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='200'>
        <var-decl name='drr_compress' type-id='type-id-32' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='208'>
        <var-decl name='drr_dn_slots' type-id='type-id-32' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='216'>
        <var-decl name='drr_flags' type-id='type-id-32' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='drr_raw_bonuslen' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='drr_toguid' type-id='type-id-23' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='drr_indblkshift' type-id='type-id-32' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='328'>
        <var-decl name='drr_nlevels' type-id='type-id-32' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='336'>
        <var-decl name='drr_nblkptr' type-id='type-id-32' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='344'>
        <var-decl name='drr_pad' type-id='type-id-94' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='drr_maxblkid' type-id='type-id-23' visibility='default'/>
      </data-member>
    </class-decl>
    <enum-decl name='dmu_object_type' id='type-id-95'>
      <underlying-type type-id='type-id-18'/>
      <enumerator name='DMU_OT_NONE' value='0'/>
      <enumerator name='DMU_OT_OBJECT_DIRECTORY' value='1'/>
      <enumerator name='DMU_OT_OBJECT_ARRAY' value='2'/>
      <enumerator name='DMU_OT_PACKED_NVLIST' value='3'/>
      <enumerator name='DMU_OT_PACKED_NVLIST_SIZE' value='4'/>
      <enumerator name='DMU_OT_BPOBJ' value='5'/>
      <enumerator name='DMU_OT_BPOBJ_HDR' value='6'/>
      <enumerator name='DMU_OT_SPACE_MAP_HEADER' value='7'/>
      <enumerator name='DMU_OT_SPACE_MAP' value='8'/>
      <enumerator name='DMU_OT_INTENT_LOG' value='9'/>
      <enumerator name='DMU_OT_DNODE' value='10'/>
      <enumerator name='DMU_OT_OBJSET' value='11'/>
      <enumerator name='DMU_OT_DSL_DIR' value='12'/>
      <enumerator name='DMU_OT_DSL_DIR_CHILD_MAP' value='13'/>
      <enumerator name='DMU_OT_DSL_DS_SNAP_MAP' value='14'/>
      <enumerator name='DMU_OT_DSL_PROPS' value='15'/>
      <enumerator name='DMU_OT_DSL_DATASET' value='16'/>
      <enumerator name='DMU_OT_ZNODE' value='17'/>
      <enumerator name='DMU_OT_OLDACL' value='18'/>
      <enumerator name='DMU_OT_PLAIN_FILE_CONTENTS' value='19'/>
      <enumerator name='DMU_OT_DIRECTORY_CONTENTS' value='20'/>
      <enumerator name='DMU_OT_MASTER_NODE' value='21'/>
      <enumerator name='DMU_OT_UNLINKED_SET' value='22'/>
      <enumerator name='DMU_OT_ZVOL' value='23'/>
      <enumerator name='DMU_OT_ZVOL_PROP' value='24'/>
      <enumerator name='DMU_OT_PLAIN_OTHER' value='25'/>
      <enumerator name='DMU_OT_UINT64_OTHER' value='26'/>
      <enumerator name='DMU_OT_ZAP_OTHER' value='27'/>
      <enumerator name='DMU_OT_ERROR_LOG' value='28'/>
      <enumerator name='DMU_OT_SPA_HISTORY' value='29'/>
      <enumerator name='DMU_OT_SPA_HISTORY_OFFSETS' value='30'/>
      <enumerator name='DMU_OT_POOL_PROPS' value='31'/>
      <enumerator name='DMU_OT_DSL_PERMS' value='32'/>
      <enumerator name='DMU_OT_ACL' value='33'/>
      <enumerator name='DMU_OT_SYSACL' value='34'/>
      <enumerator name='DMU_OT_FUID' value='35'/>
      <enumerator name='DMU_OT_FUID_SIZE' value='36'/>
      <enumerator name='DMU_OT_NEXT_CLONES' value='37'/>
      <enumerator name='DMU_OT_SCAN_QUEUE' value='38'/>
      <enumerator name='DMU_OT_USERGROUP_USED' value='39'/>
      <enumerator name='DMU_OT_USERGROUP_QUOTA' value='40'/>
      <enumerator name='DMU_OT_USERREFS' value='41'/>
      <enumerator name='DMU_OT_DDT_ZAP' value='42'/>
      <enumerator name='DMU_OT_DDT_STATS' value='43'/>
      <enumerator name='DMU_OT_SA' value='44'/>
      <enumerator name='DMU_OT_SA_MASTER_NODE' value='45'/>
      <enumerator name='DMU_OT_SA_ATTR_REGISTRATION' value='46'/>
      <enumerator name='DMU_OT_SA_ATTR_LAYOUTS' value='47'/>
      <enumerator name='DMU_OT_SCAN_XLATE' value='48'/>
      <enumerator name='DMU_OT_DEDUP' value='49'/>
      <enumerator name='DMU_OT_DEADLIST' value='50'/>
      <enumerator name='DMU_OT_DEADLIST_HDR' value='51'/>
      <enumerator name='DMU_OT_DSL_CLONES' value='52'/>
      <enumerator name='DMU_OT_BPOBJ_SUBOBJ' value='53'/>
      <enumerator name='DMU_OT_NUMTYPES' value='54'/>
      <enumerator name='DMU_OTN_UINT8_DATA' value='128'/>
      <enumerator name='DMU_OTN_UINT8_METADATA' value='192'/>
      <enumerator name='DMU_OTN_UINT16_DATA' value='129'/>
      <enumerator name='DMU_OTN_UINT16_METADATA' value='193'/>
      <enumerator name='DMU_OTN_UINT32_DATA' value='130'/>
      <enumerator name='DMU_OTN_UINT32_METADATA' value='194'/>
      <enumerator name='DMU_OTN_UINT64_DATA' value='131'/>
      <enumerator name='DMU_OTN_UINT64_METADATA' value='195'/>
      <enumerator name='DMU_OTN_ZAP_DATA' value='132'/>
      <enumerator name='DMU_OTN_ZAP_METADATA' value='196'/>
      <enumerator name='DMU_OTN_UINT8_ENC_DATA' value='160'/>
      <enumerator name='DMU_OTN_UINT8_ENC_METADATA' value='224'/>
      <enumerator name='DMU_OTN_UINT16_ENC_DATA' value='161'/>
      <enumerator name='DMU_OTN_UINT16_ENC_METADATA' value='225'/>
      <enumerator name='DMU_OTN_UINT32_ENC_DATA' value='162'/>
      <enumerator name='DMU_OTN_UINT32_ENC_METADATA' value='226'/>
      <enumerator name='DMU_OTN_UINT64_ENC_DATA' value='163'/>
      <enumerator name='DMU_OTN_UINT64_ENC_METADATA' value='227'/>
      <enumerator name='DMU_OTN_ZAP_ENC_DATA' value='164'/>
      <enumerator name='DMU_OTN_ZAP_ENC_METADATA' value='228'/>
    </enum-decl>
    <typedef-decl name='dmu_object_type_t' type-id='type-id-95' id='type-id-93'/>

    <array-type-def dimensions='1' type-id='type-id-32' size-in-bits='40' id='type-id-94'>
      <subrange length='5' type-id='type-id-12' id='type-id-96'/>

    </array-type-def>
    <class-decl name='drr_freeobjects' size-in-bits='192' is-struct='yes' visibility='default' id='type-id-80'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='drr_firstobj' type-id='type-id-23' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='drr_numobjs' type-id='type-id-23' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='drr_toguid' type-id='type-id-23' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='drr_write' size-in-bits='1088' is-struct='yes' visibility='default' id='type-id-81'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='drr_object' type-id='type-id-23' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='drr_type' type-id='type-id-93' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='drr_pad' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='drr_offset' type-id='type-id-23' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='drr_logical_size' type-id='type-id-23' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='drr_toguid' type-id='type-id-23' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='drr_checksumtype' type-id='type-id-32' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='328'>
        <var-decl name='drr_flags' type-id='type-id-32' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='336'>
        <var-decl name='drr_compressiontype' type-id='type-id-32' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='344'>
        <var-decl name='drr_pad2' type-id='type-id-94' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='drr_key' type-id='type-id-97' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='drr_compressed_size' type-id='type-id-23' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='drr_salt' type-id='type-id-98' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='drr_iv' type-id='type-id-99' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='drr_mac' type-id='type-id-100' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='ddt_key' size-in-bits='320' is-struct='yes' visibility='default' id='type-id-101'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ddk_cksum' type-id='type-id-89' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='ddk_prop' type-id='type-id-23' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='ddt_key_t' type-id='type-id-101' id='type-id-97'/>

    <array-type-def dimensions='1' type-id='type-id-32' size-in-bits='64' id='type-id-98'>
      <subrange length='8' type-id='type-id-12' id='type-id-102'/>

    </array-type-def>

    <array-type-def dimensions='1' type-id='type-id-32' size-in-bits='96' id='type-id-99'>
      <subrange length='12' type-id='type-id-12' id='type-id-103'/>

    </array-type-def>

    <array-type-def dimensions='1' type-id='type-id-32' size-in-bits='128' id='type-id-100'>
      <subrange length='16' type-id='type-id-12' id='type-id-104'/>

    </array-type-def>
    <class-decl name='drr_free' size-in-bits='256' is-struct='yes' visibility='default' id='type-id-82'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='drr_object' type-id='type-id-23' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='drr_offset' type-id='type-id-23' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='drr_length' type-id='type-id-23' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='drr_toguid' type-id='type-id-23' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='drr_write_byref' size-in-bits='832' is-struct='yes' visibility='default' id='type-id-83'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='drr_object' type-id='type-id-23' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='drr_offset' type-id='type-id-23' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='drr_length' type-id='type-id-23' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='drr_toguid' type-id='type-id-23' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='drr_refguid' type-id='type-id-23' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='drr_refobject' type-id='type-id-23' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='drr_refoffset' type-id='type-id-23' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='drr_checksumtype' type-id='type-id-32' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='456'>
        <var-decl name='drr_flags' type-id='type-id-32' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='464'>
        <var-decl name='drr_pad2' type-id='type-id-105' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='drr_key' type-id='type-id-97' visibility='default'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-32' size-in-bits='48' id='type-id-105'>
      <subrange length='6' type-id='type-id-12' id='type-id-106'/>

    </array-type-def>
    <class-decl name='drr_spill' size-in-bits='640' is-struct='yes' visibility='default' id='type-id-84'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='drr_object' type-id='type-id-23' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='drr_length' type-id='type-id-23' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='drr_toguid' type-id='type-id-23' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='drr_flags' type-id='type-id-32' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='200'>
        <var-decl name='drr_compressiontype' type-id='type-id-32' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='208'>
        <var-decl name='drr_pad' type-id='type-id-105' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='drr_compressed_size' type-id='type-id-23' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='drr_salt' type-id='type-id-98' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='drr_iv' type-id='type-id-99' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='drr_mac' type-id='type-id-100' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='608'>
        <var-decl name='drr_type' type-id='type-id-93' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='drr_write_embedded' size-in-bits='384' is-struct='yes' visibility='default' id='type-id-85'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='drr_object' type-id='type-id-23' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='drr_offset' type-id='type-id-23' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='drr_length' type-id='type-id-23' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='drr_toguid' type-id='type-id-23' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='drr_compression' type-id='type-id-32' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='264'>
        <var-decl name='drr_etype' type-id='type-id-32' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='272'>
        <var-decl name='drr_pad' type-id='type-id-105' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='drr_lsize' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='drr_psize' type-id='type-id-22' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='drr_object_range' size-in-bits='512' is-struct='yes' visibility='default' id='type-id-86'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='drr_firstobj' type-id='type-id-23' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='drr_numslots' type-id='type-id-23' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='drr_toguid' type-id='type-id-23' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='drr_salt' type-id='type-id-98' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='drr_iv' type-id='type-id-99' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='drr_mac' type-id='type-id-100' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='drr_flags' type-id='type-id-32' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='488'>
        <var-decl name='drr_pad' type-id='type-id-48' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='drr_redact' size-in-bits='256' is-struct='yes' visibility='default' id='type-id-87'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='drr_object' type-id='type-id-23' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='drr_offset' type-id='type-id-23' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='drr_length' type-id='type-id-23' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='drr_toguid' type-id='type-id-23' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='drr_checksum' size-in-bits='2432' is-struct='yes' visibility='default' id='type-id-88'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='drr_pad' type-id='type-id-107' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='drr_checksum' type-id='type-id-89' visibility='default'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-23' size-in-bits='2176' id='type-id-107'>
      <subrange length='34' type-id='type-id-12' id='type-id-108'/>

    </array-type-def>
    <typedef-decl name='dmu_replay_record_t' type-id='type-id-75' id='type-id-109'/>
    <qualified-type-def type-id='type-id-109' const='yes' id='type-id-110'/>
    <pointer-type-def type-id='type-id-110' size-in-bits='64' id='type-id-111'/>
    <function-decl name='lzc_receive_with_header' mangled-name='lzc_receive_with_header' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_receive_with_header'>
      <parameter type-id='type-id-16' name='snapname'/>
      <parameter type-id='type-id-29' name='props'/>
      <parameter type-id='type-id-16' name='origin'/>
      <parameter type-id='type-id-41' name='force'/>
      <parameter type-id='type-id-41' name='resumable'/>
      <parameter type-id='type-id-41' name='raw'/>
      <parameter type-id='type-id-1' name='fd'/>
      <parameter type-id='type-id-111' name='begin_record'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='lzc_receive_one' mangled-name='lzc_receive_one' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_receive_one'>
      <parameter type-id='type-id-16' name='snapname'/>
      <parameter type-id='type-id-29' name='props'/>
      <parameter type-id='type-id-16' name='origin'/>
      <parameter type-id='type-id-41' name='force'/>
      <parameter type-id='type-id-41' name='resumable'/>
      <parameter type-id='type-id-41' name='raw'/>
      <parameter type-id='type-id-1' name='input_fd'/>
      <parameter type-id='type-id-111' name='begin_record'/>
      <parameter type-id='type-id-1' name='cleanup_fd'/>
      <parameter type-id='type-id-71' name='read_bytes'/>
      <parameter type-id='type-id-71' name='errflags'/>
      <parameter type-id='type-id-71' name='action_handle'/>
      <parameter type-id='type-id-64' name='errors'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='lzc_receive_with_cmdprops' mangled-name='lzc_receive_with_cmdprops' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_receive_with_cmdprops'>
      <parameter type-id='type-id-16' name='snapname'/>
      <parameter type-id='type-id-29' name='props'/>
      <parameter type-id='type-id-29' name='cmdprops'/>
      <parameter type-id='type-id-33' name='wkeydata'/>
      <parameter type-id='type-id-34' name='wkeylen'/>
      <parameter type-id='type-id-16' name='origin'/>
      <parameter type-id='type-id-41' name='force'/>
      <parameter type-id='type-id-41' name='resumable'/>
      <parameter type-id='type-id-41' name='raw'/>
      <parameter type-id='type-id-1' name='input_fd'/>
      <parameter type-id='type-id-111' name='begin_record'/>
      <parameter type-id='type-id-1' name='cleanup_fd'/>
      <parameter type-id='type-id-71' name='read_bytes'/>
      <parameter type-id='type-id-71' name='errflags'/>
      <parameter type-id='type-id-71' name='action_handle'/>
      <parameter type-id='type-id-64' name='errors'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='lzc_rollback' mangled-name='lzc_rollback' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_rollback'>
      <parameter type-id='type-id-16' name='fsname'/>
      <parameter type-id='type-id-37' name='snapnamebuf'/>
      <parameter type-id='type-id-1' name='snapnamelen'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_string' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-35'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-37'/>
    </function-decl>
    <function-decl name='lzc_rollback_to' mangled-name='lzc_rollback_to' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_rollback_to'>
      <parameter type-id='type-id-16' name='fsname'/>
      <parameter type-id='type-id-16' name='snapname'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='lzc_bookmark' mangled-name='lzc_bookmark' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_bookmark'>
      <parameter type-id='type-id-29' name='bookmarks'/>
      <parameter type-id='type-id-64' name='errlist'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='lzc_get_bookmarks' mangled-name='lzc_get_bookmarks' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_get_bookmarks'>
      <parameter type-id='type-id-16' name='pool_name'/>
      <parameter type-id='type-id-29' name='innvl'/>
      <parameter type-id='type-id-64' name='outnvl'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='lzc_get_bookmark_props' mangled-name='lzc_get_bookmark_props' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_get_bookmark_props'>
      <parameter type-id='type-id-16' name='bookmark'/>
      <parameter type-id='type-id-64' name='props'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='lzc_destroy_bookmarks' mangled-name='lzc_destroy_bookmarks' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_destroy_bookmarks'>
      <parameter type-id='type-id-29' name='bookmarks'/>
      <parameter type-id='type-id-64' name='errlist'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='lzc_channel_program' mangled-name='lzc_channel_program' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_channel_program'>
      <parameter type-id='type-id-16' name='pool'/>
      <parameter type-id='type-id-16' name='program'/>
      <parameter type-id='type-id-23' name='instrlimit'/>
      <parameter type-id='type-id-23' name='memlimit'/>
      <parameter type-id='type-id-29' name='argnvl'/>
      <parameter type-id='type-id-64' name='outnvl'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='fnvlist_add_boolean_value' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-35'/>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-51'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='lzc_pool_checkpoint' mangled-name='lzc_pool_checkpoint' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_pool_checkpoint'>
      <parameter type-id='type-id-16' name='pool'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='lzc_pool_checkpoint_discard' mangled-name='lzc_pool_checkpoint_discard' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_pool_checkpoint_discard'>
      <parameter type-id='type-id-16' name='pool'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='lzc_channel_program_nosync' mangled-name='lzc_channel_program_nosync' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_channel_program_nosync'>
      <parameter type-id='type-id-16' name='pool'/>
      <parameter type-id='type-id-16' name='program'/>
      <parameter type-id='type-id-23' name='instrlimit'/>
      <parameter type-id='type-id-23' name='memlimit'/>
      <parameter type-id='type-id-29' name='argnvl'/>
      <parameter type-id='type-id-64' name='outnvl'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='lzc_load_key' mangled-name='lzc_load_key' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_load_key'>
      <parameter type-id='type-id-16' name='fsname'/>
      <parameter type-id='type-id-41' name='noop'/>
      <parameter type-id='type-id-33' name='wkeydata'/>
      <parameter type-id='type-id-34' name='wkeylen'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='lzc_unload_key' mangled-name='lzc_unload_key' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_unload_key'>
      <parameter type-id='type-id-16' name='fsname'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='lzc_change_key' mangled-name='lzc_change_key' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_change_key'>
      <parameter type-id='type-id-16' name='fsname'/>
      <parameter type-id='type-id-23' name='crypt_cmd'/>
      <parameter type-id='type-id-29' name='props'/>
      <parameter type-id='type-id-33' name='wkeydata'/>
      <parameter type-id='type-id-34' name='wkeylen'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='lzc_reopen' mangled-name='lzc_reopen' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_reopen'>
      <parameter type-id='type-id-16' name='pool_name'/>
      <parameter type-id='type-id-41' name='scrub_restart'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <enum-decl name='pool_initialize_func' id='type-id-112'>
      <underlying-type type-id='type-id-18'/>
      <enumerator name='POOL_INITIALIZE_START' value='0'/>
      <enumerator name='POOL_INITIALIZE_CANCEL' value='1'/>
      <enumerator name='POOL_INITIALIZE_SUSPEND' value='2'/>
      <enumerator name='POOL_INITIALIZE_FUNCS' value='3'/>
    </enum-decl>
    <typedef-decl name='pool_initialize_func_t' type-id='type-id-112' id='type-id-113'/>
    <function-decl name='lzc_initialize' mangled-name='lzc_initialize' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_initialize'>
      <parameter type-id='type-id-16' name='poolname'/>
      <parameter type-id='type-id-113' name='cmd_type'/>
      <parameter type-id='type-id-29' name='vdevs'/>
      <parameter type-id='type-id-64' name='errlist'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <enum-decl name='pool_trim_func' id='type-id-114'>
      <underlying-type type-id='type-id-18'/>
      <enumerator name='POOL_TRIM_START' value='0'/>
      <enumerator name='POOL_TRIM_CANCEL' value='1'/>
      <enumerator name='POOL_TRIM_SUSPEND' value='2'/>
      <enumerator name='POOL_TRIM_FUNCS' value='3'/>
    </enum-decl>
    <typedef-decl name='pool_trim_func_t' type-id='type-id-114' id='type-id-115'/>
    <function-decl name='lzc_trim' mangled-name='lzc_trim' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_trim'>
      <parameter type-id='type-id-16' name='poolname'/>
      <parameter type-id='type-id-115' name='cmd_type'/>
      <parameter type-id='type-id-23' name='rate'/>
      <parameter type-id='type-id-41' name='secure'/>
      <parameter type-id='type-id-29' name='vdevs'/>
      <parameter type-id='type-id-64' name='errlist'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='lzc_redact' mangled-name='lzc_redact' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_redact'>
      <parameter type-id='type-id-16' name='snapshot'/>
      <parameter type-id='type-id-16' name='bookname'/>
      <parameter type-id='type-id-29' name='snapnv'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' id='type-id-116'>
      <underlying-type type-id='type-id-18'/>
      <enumerator name='ZPOOL_WAIT_CKPT_DISCARD' value='0'/>
      <enumerator name='ZPOOL_WAIT_FREE' value='1'/>
      <enumerator name='ZPOOL_WAIT_INITIALIZE' value='2'/>
      <enumerator name='ZPOOL_WAIT_REPLACE' value='3'/>
      <enumerator name='ZPOOL_WAIT_REMOVE' value='4'/>
      <enumerator name='ZPOOL_WAIT_RESILVER' value='5'/>
      <enumerator name='ZPOOL_WAIT_SCRUB' value='6'/>
      <enumerator name='ZPOOL_WAIT_TRIM' value='7'/>
      <enumerator name='ZPOOL_WAIT_NUM_ACTIVITIES' value='8'/>
    </enum-decl>
    <typedef-decl name='zpool_wait_activity_t' type-id='type-id-116' id='type-id-117'/>
    <pointer-type-def type-id='type-id-41' size-in-bits='64' id='type-id-118'/>
    <function-decl name='lzc_wait' mangled-name='lzc_wait' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_wait'>
      <parameter type-id='type-id-16' name='pool'/>
      <parameter type-id='type-id-117' name='activity'/>
      <parameter type-id='type-id-118' name='waited'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_boolean_value' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-35'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='lzc_wait_tag' mangled-name='lzc_wait_tag' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_wait_tag'>
      <parameter type-id='type-id-16' name='pool'/>
      <parameter type-id='type-id-117' name='activity'/>
      <parameter type-id='type-id-23' name='tag'/>
      <parameter type-id='type-id-118' name='waited'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' id='type-id-119'>
      <underlying-type type-id='type-id-18'/>
      <enumerator name='ZFS_WAIT_DELETEQ' value='0'/>
      <enumerator name='ZFS_WAIT_NUM_ACTIVITIES' value='1'/>
    </enum-decl>
    <typedef-decl name='zfs_wait_activity_t' type-id='type-id-119' id='type-id-120'/>
    <function-decl name='lzc_wait_fs' mangled-name='lzc_wait_fs' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_wait_fs'>
      <parameter type-id='type-id-16' name='fs'/>
      <parameter type-id='type-id-120' name='activity'/>
      <parameter type-id='type-id-118' name='waited'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <qualified-type-def type-id='type-id-28' const='yes' id='type-id-121'/>
    <pointer-type-def type-id='type-id-121' size-in-bits='64' id='type-id-122'/>
    <function-decl name='lzc_set_bootenv' mangled-name='lzc_set_bootenv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_set_bootenv'>
      <parameter type-id='type-id-16' name='pool'/>
      <parameter type-id='type-id-122' name='env'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='lzc_get_bootenv' mangled-name='lzc_get_bootenv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_get_bootenv'>
      <parameter type-id='type-id-16' name='snapname'/>
      <parameter type-id='type-id-64' name='holdsp'/>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='zutil_device_path.c' comp-dir-path='/home/nabijaczleweli/store/code/zfs/lib/libzutil' language='LANG_C99'>
    <function-decl name='zfs_basename' mangled-name='zfs_basename' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_basename'>
      <parameter type-id='type-id-16' name='path'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <typedef-decl name='__ssize_t' type-id='type-id-5' id='type-id-123'/>
    <typedef-decl name='ssize_t' type-id='type-id-123' id='type-id-124'/>
    <function-decl name='zfs_dirnamelen' mangled-name='zfs_dirnamelen' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_dirnamelen'>
      <parameter type-id='type-id-16' name='path'/>
      <return type-id='type-id-124'/>
    </function-decl>
    <typedef-decl name='size_t' type-id='type-id-26' id='type-id-125'/>
    <function-decl name='zfs_resolve_shortname' mangled-name='zfs_resolve_shortname' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_resolve_shortname'>
      <parameter type-id='type-id-16' name='name'/>
      <parameter type-id='type-id-37' name='path'/>
      <parameter type-id='type-id-125' name='len'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='getenv' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-37'/>
    </function-decl>
    <pointer-type-def type-id='type-id-37' size-in-bits='64' id='type-id-126'/>
    <function-decl name='strtok_r' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-37'/>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-126'/>
      <return type-id='type-id-37'/>
    </function-decl>
    <function-decl name='access' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <qualified-type-def type-id='type-id-16' const='yes' id='type-id-127'/>
    <pointer-type-def type-id='type-id-127' size-in-bits='64' id='type-id-128'/>
    <function-decl name='zpool_default_search_paths' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-38'/>
      <return type-id='type-id-128'/>
    </function-decl>
    <function-decl name='zfs_strcmp_pathname' mangled-name='zfs_strcmp_pathname' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_strcmp_pathname'>
      <parameter type-id='type-id-16' name='name'/>
      <parameter type-id='type-id-16' name='cmp'/>
      <parameter type-id='type-id-1' name='wholedisk'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='strlcat' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-37'/>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-26'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='zfs_append_partition' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-37'/>
      <parameter type-id='type-id-26'/>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='zutil_import.c' comp-dir-path='/home/nabijaczleweli/store/code/zfs/lib/libzutil' language='LANG_C99'>
    <pointer-type-def type-id='type-id-1' size-in-bits='64' id='type-id-129'/>
    <function-decl name='zpool_read_label' mangled-name='zpool_read_label' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_read_label'>
      <parameter type-id='type-id-1' name='fd'/>
      <parameter type-id='type-id-64' name='config'/>
      <parameter type-id='type-id-129' name='num_labels'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='ioctl' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-26'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='spl_pagesize' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-26'/>
    </function-decl>
    <pointer-type-def type-id='type-id-73' size-in-bits='64' id='type-id-130'/>
    <function-decl name='posix_memalign' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-130'/>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-26'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <class-decl name='aiocb' size-in-bits='1344' is-struct='yes' visibility='default' id='type-id-131'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='aio_fildes' type-id='type-id-1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='aio_lio_opcode' type-id='type-id-1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='aio_reqprio' type-id='type-id-1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='aio_buf' type-id='type-id-132' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='aio_nbytes' type-id='type-id-125' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='aio_sigevent' type-id='type-id-133' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='__next_prio' type-id='type-id-134' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='__abs_prio' type-id='type-id-1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='864'>
        <var-decl name='__policy' type-id='type-id-1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='__error_code' type-id='type-id-1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='__return_value' type-id='type-id-123' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='aio_offset' type-id='type-id-135' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='__glibc_reserved' type-id='type-id-136' visibility='default'/>
      </data-member>
    </class-decl>
    <qualified-type-def type-id='type-id-17' volatile='yes' id='type-id-137'/>
    <pointer-type-def type-id='type-id-137' size-in-bits='64' id='type-id-132'/>
    <class-decl name='sigevent' size-in-bits='512' is-struct='yes' visibility='default' id='type-id-133'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sigev_value' type-id='type-id-138' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='sigev_signo' type-id='type-id-1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='sigev_notify' type-id='type-id-1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_sigev_un' type-id='type-id-139' visibility='default'/>
      </data-member>
    </class-decl>
    <union-decl name='sigval' size-in-bits='64' visibility='default' id='type-id-140'>
      <data-member access='private'>
        <var-decl name='sival_int' type-id='type-id-1' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='sival_ptr' type-id='type-id-73' visibility='default'/>
      </data-member>
    </union-decl>
    <typedef-decl name='__sigval_t' type-id='type-id-140' id='type-id-138'/>
    <union-decl name='__anonymous_union__' size-in-bits='384' is-anonymous='yes' visibility='default' id='type-id-139'>
      <data-member access='private'>
        <var-decl name='_pad' type-id='type-id-141' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='_tid' type-id='type-id-142' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='_sigev_thread' type-id='type-id-143' visibility='default'/>
      </data-member>
    </union-decl>

    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='384' id='type-id-141'>
      <subrange length='12' type-id='type-id-12' id='type-id-103'/>

    </array-type-def>
    <typedef-decl name='__pid_t' type-id='type-id-1' id='type-id-142'/>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-143'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_function' type-id='type-id-144' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_attribute' type-id='type-id-145' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-146' size-in-bits='64' id='type-id-144'/>
    <union-decl name='pthread_attr_t' size-in-bits='448' visibility='default' id='type-id-147'>
      <data-member access='private'>
        <var-decl name='__size' type-id='type-id-148' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='__align' type-id='type-id-5' visibility='default'/>
      </data-member>
    </union-decl>

    <array-type-def dimensions='1' type-id='type-id-11' size-in-bits='448' id='type-id-148'>
      <subrange length='56' type-id='type-id-12' id='type-id-149'/>

    </array-type-def>
    <typedef-decl name='pthread_attr_t' type-id='type-id-147' id='type-id-150'/>
    <pointer-type-def type-id='type-id-150' size-in-bits='64' id='type-id-145'/>
    <pointer-type-def type-id='type-id-131' size-in-bits='64' id='type-id-134'/>
    <typedef-decl name='__off64_t' type-id='type-id-5' id='type-id-135'/>

    <array-type-def dimensions='1' type-id='type-id-11' size-in-bits='256' id='type-id-136'>
      <subrange length='32' type-id='type-id-12' id='type-id-151'/>

    </array-type-def>
    <qualified-type-def type-id='type-id-134' const='yes' id='type-id-152'/>
    <pointer-type-def type-id='type-id-152' size-in-bits='64' id='type-id-153'/>
    <pointer-type-def type-id='type-id-133' size-in-bits='64' id='type-id-154'/>
    <function-decl name='lio_listio' mangled-name='lio_listio64' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-153'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-154'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <qualified-type-def type-id='type-id-131' const='yes' id='type-id-155'/>
    <pointer-type-def type-id='type-id-155' size-in-bits='64' id='type-id-156'/>
    <function-decl name='aio_error' mangled-name='aio_error64' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-156'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='aio_return' mangled-name='aio_return64' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-134'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='pread64' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-73'/>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <pointer-type-def type-id='type-id-74' size-in-bits='64' id='type-id-157'/>
    <pointer-type-def type-id='type-id-6' size-in-bits='64' id='type-id-158'/>
    <function-decl name='nvlist_lookup_nvlist_array' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-35'/>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-157'/>
      <parameter type-id='type-id-158'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='nvlist_lookup_string' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-35'/>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-126'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <class-decl name='importargs' size-in-bits='448' is-struct='yes' visibility='default' id='type-id-159'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='path' type-id='type-id-126' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='paths' type-id='type-id-1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='poolname' type-id='type-id-16' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='guid' type-id='type-id-23' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='cachefile' type-id='type-id-16' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='can_be_active' type-id='type-id-41' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='scan' type-id='type-id-41' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='policy' type-id='type-id-29' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='importargs_t' type-id='type-id-159' id='type-id-160'/>
    <pointer-type-def type-id='type-id-160' size-in-bits='64' id='type-id-161'/>
    <class-decl name='pool_config_ops' size-in-bits='128' is-struct='yes' visibility='default' id='type-id-162'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='pco_refresh_config' type-id='type-id-163' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='pco_pool_active' type-id='type-id-164' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='refresh_config_func_t' type-id='type-id-165' id='type-id-166'/>
    <pointer-type-def type-id='type-id-166' size-in-bits='64' id='type-id-163'/>
    <typedef-decl name='pool_active_func_t' type-id='type-id-167' id='type-id-168'/>
    <pointer-type-def type-id='type-id-168' size-in-bits='64' id='type-id-164'/>
    <qualified-type-def type-id='type-id-162' const='yes' id='type-id-169'/>
    <typedef-decl name='pool_config_ops_t' type-id='type-id-169' id='type-id-170'/>
    <pointer-type-def type-id='type-id-170' size-in-bits='64' id='type-id-172'/>
    <function-decl name='zpool_search_import' mangled-name='zpool_search_import' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_search_import'>
      <parameter type-id='type-id-73' name='hdl'/>
      <parameter type-id='type-id-161' name='import'/>
      <parameter type-id='type-id-172' name='pco'/>
      <return type-id='type-id-29'/>
    </function-decl>
    <function-decl name='dcgettext' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-37'/>
    </function-decl>
    <union-decl name='__anonymous_union__' size-in-bits='32' is-anonymous='yes' visibility='default' id='type-id-173'>
      <data-member access='private'>
        <var-decl name='__size' type-id='type-id-174' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='__align' type-id='type-id-1' visibility='default'/>
      </data-member>
    </union-decl>

    <array-type-def dimensions='1' type-id='type-id-11' size-in-bits='32' id='type-id-174'>
      <subrange length='4' type-id='type-id-12' id='type-id-92'/>

    </array-type-def>
    <qualified-type-def type-id='type-id-173' const='yes' id='type-id-175'/>
    <pointer-type-def type-id='type-id-175' size-in-bits='64' id='type-id-176'/>
    <function-decl name='pthread_mutex_init' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-176'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <class-decl name='libpc_handle' size-in-bits='8448' is-struct='yes' visibility='default' id='type-id-177'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='lpc_printerr' type-id='type-id-41' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='lpc_open_access_error' type-id='type-id-41' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='lpc_desc_active' type-id='type-id-41' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='lpc_desc' type-id='type-id-178' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8320'>
        <var-decl name='lpc_ops' type-id='type-id-172' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8384'>
        <var-decl name='lpc_lib_handle' type-id='type-id-73' visibility='default'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-11' size-in-bits='8192' id='type-id-178'>
      <subrange length='1024' type-id='type-id-12' id='type-id-179'/>

    </array-type-def>
    <pointer-type-def type-id='type-id-177' size-in-bits='64' id='type-id-180'/>
    <class-decl name='avl_tree' size-in-bits='320' is-struct='yes' visibility='default' id='type-id-181'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='avl_root' type-id='type-id-182' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='avl_compar' type-id='type-id-183' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='avl_offset' type-id='type-id-125' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='avl_numnodes' type-id='type-id-184' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='avl_size' type-id='type-id-125' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='avl_node' size-in-bits='192' is-struct='yes' visibility='default' id='type-id-185'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='avl_child' type-id='type-id-186' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='avl_pcb' type-id='type-id-187' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-185' size-in-bits='64' id='type-id-182'/>

    <array-type-def dimensions='1' type-id='type-id-182' size-in-bits='128' id='type-id-186'>
      <subrange length='2' type-id='type-id-12' id='type-id-62'/>

    </array-type-def>
    <typedef-decl name='uintptr_t' type-id='type-id-26' id='type-id-187'/>
    <pointer-type-def type-id='type-id-188' size-in-bits='64' id='type-id-183'/>
    <typedef-decl name='ulong_t' type-id='type-id-26' id='type-id-184'/>
    <pointer-type-def type-id='type-id-181' size-in-bits='64' id='type-id-189'/>
    <pointer-type-def type-id='type-id-189' size-in-bits='64' id='type-id-190'/>
    <function-decl name='zpool_find_import_blkid' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-180'/>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-190'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='avl_create' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-189'/>
      <parameter type-id='type-id-183'/>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-26'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='dirname' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-37'/>
      <return type-id='type-id-37'/>
    </function-decl>
    <function-decl name='realpath' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-37'/>
      <return type-id='type-id-37'/>
    </function-decl>
    <function-decl name='pthread_mutex_destroy' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-14'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='nvlist_alloc' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-74'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='fnvpair_value_nvlist' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-70'/>
      <return type-id='type-id-35'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_nvlist' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-35'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-35'/>
    </function-decl>
    <function-decl name='nvlist_add_string' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-35'/>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='nvlist_add_nvlist' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-35'/>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-35'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='avl_destroy_nodes' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-189'/>
      <parameter type-id='type-id-130'/>
      <return type-id='type-id-73'/>
    </function-decl>
    <function-decl name='nvlist_empty' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-35'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='geteuid' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zpool_find_config' mangled-name='zpool_find_config' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_find_config'>
      <parameter type-id='type-id-73' name='hdl'/>
      <parameter type-id='type-id-16' name='target'/>
      <parameter type-id='type-id-64' name='configp'/>
      <parameter type-id='type-id-161' name='args'/>
      <parameter type-id='type-id-172' name='pco'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='nvpair_value_nvlist' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-70'/>
      <parameter type-id='type-id-74'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='sysconf' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <class-decl name='tpool' size-in-bits='2496' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-191'/>
    <pointer-type-def type-id='type-id-191' size-in-bits='64' id='type-id-192'/>
    <function-decl name='tpool_create' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-145'/>
      <return type-id='type-id-192'/>
    </function-decl>
    <function-decl name='avl_first' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-189'/>
      <return type-id='type-id-73'/>
    </function-decl>
    <pointer-type-def type-id='type-id-193' size-in-bits='64' id='type-id-194'/>
    <function-decl name='tpool_dispatch' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-192'/>
      <parameter type-id='type-id-194'/>
      <parameter type-id='type-id-73'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='avl_walk' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-189'/>
      <parameter type-id='type-id-73'/>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-73'/>
    </function-decl>
    <function-decl name='tpool_wait' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-192'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='tpool_destroy' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-192'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='avl_destroy' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-189'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='nvlist_remove' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-35'/>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-69'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='nvlist_add_uint64' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-35'/>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-26'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <pointer-type-def type-id='type-id-38' size-in-bits='64' id='type-id-195'/>
    <function-decl name='nvlist_lookup_uint64_array' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-35'/>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-195'/>
      <parameter type-id='type-id-158'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='nvlist_add_uint64_array' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-35'/>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-38'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='nvlist_dup' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-35'/>
      <parameter type-id='type-id-74'/>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='nvlist_add_nvlist_array' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-35'/>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-74'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-196'/>
    <pointer-type-def type-id='type-id-196' size-in-bits='64' id='type-id-197'/>
    <function-decl name='opendir' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-197'/>
    </function-decl>
    <class-decl name='dirent64' size-in-bits='2240' is-struct='yes' visibility='default' id='type-id-198'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='d_ino' type-id='type-id-199' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='d_off' type-id='type-id-135' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='d_reclen' type-id='type-id-200' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='144'>
        <var-decl name='d_type' type-id='type-id-30' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='152'>
        <var-decl name='d_name' type-id='type-id-43' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__ino64_t' type-id='type-id-26' id='type-id-199'/>
    <type-decl name='unsigned short int' size-in-bits='16' id='type-id-200'/>
    <pointer-type-def type-id='type-id-198' size-in-bits='64' id='type-id-201'/>
    <function-decl name='readdir64' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-197'/>
      <return type-id='type-id-201'/>
    </function-decl>
    <function-decl name='closedir' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-197'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='asprintf' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-16'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='avl_find' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-189'/>
      <parameter type-id='type-id-73'/>
      <parameter type-id='type-id-38'/>
      <return type-id='type-id-73'/>
    </function-decl>
    <function-decl name='avl_insert' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-189'/>
      <parameter type-id='type-id-73'/>
      <parameter type-id='type-id-26'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='update_vdev_config_dev_strs' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-35'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-167'>
      <parameter type-id='type-id-73'/>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-118'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-188'>
      <parameter type-id='type-id-73'/>
      <parameter type-id='type-id-73'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-165'>
      <parameter type-id='type-id-73'/>
      <parameter type-id='type-id-29'/>
      <return type-id='type-id-29'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-146'>
      <parameter type-id='type-id-138'/>
      <return type-id='type-id-17'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-193'>
      <parameter type-id='type-id-73'/>
      <return type-id='type-id-17'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='zutil_nicenum.c' comp-dir-path='/home/nabijaczleweli/store/code/zfs/lib/libzutil' language='LANG_C99'>
    <function-decl name='zfs_isnumber' mangled-name='zfs_isnumber' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_isnumber'>
      <parameter type-id='type-id-16' name='str'/>
      <return type-id='type-id-41'/>
    </function-decl>
    <enum-decl name='zfs_nicenum_format' id='type-id-202'>
      <underlying-type type-id='type-id-18'/>
      <enumerator name='ZFS_NICENUM_1024' value='0'/>
      <enumerator name='ZFS_NICENUM_BYTES' value='1'/>
      <enumerator name='ZFS_NICENUM_TIME' value='2'/>
      <enumerator name='ZFS_NICENUM_RAW' value='3'/>
      <enumerator name='ZFS_NICENUM_RAWTIME' value='4'/>
    </enum-decl>
    <function-decl name='zfs_nicenum_format' mangled-name='zfs_nicenum_format' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_nicenum_format'>
      <parameter type-id='type-id-23' name='num'/>
      <parameter type-id='type-id-37' name='buf'/>
      <parameter type-id='type-id-125' name='buflen'/>
      <parameter type-id='type-id-202' name='format'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='zfs_nicenum' mangled-name='zfs_nicenum' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_nicenum'>
      <parameter type-id='type-id-23' name='num'/>
      <parameter type-id='type-id-37' name='buf'/>
      <parameter type-id='type-id-125' name='buflen'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='zfs_nicetime' mangled-name='zfs_nicetime' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_nicetime'>
      <parameter type-id='type-id-23' name='num'/>
      <parameter type-id='type-id-37' name='buf'/>
      <parameter type-id='type-id-125' name='buflen'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='zfs_niceraw' mangled-name='zfs_niceraw' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_niceraw'>
      <parameter type-id='type-id-23' name='num'/>
      <parameter type-id='type-id-37' name='buf'/>
      <parameter type-id='type-id-125' name='buflen'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='zfs_nicebytes' mangled-name='zfs_nicebytes' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_nicebytes'>
      <parameter type-id='type-id-23' name='num'/>
      <parameter type-id='type-id-37' name='buf'/>
      <parameter type-id='type-id-125' name='buflen'/>
      <return type-id='type-id-17'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='zutil_pool.c' comp-dir-path='/home/nabijaczleweli/store/code/zfs/lib/libzutil' language='LANG_C99'>
    <class-decl name='ddt_stat' size-in-bits='512' is-struct='yes' visibility='default' id='type-id-203'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='dds_blocks' type-id='type-id-23' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='dds_lsize' type-id='type-id-23' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='dds_psize' type-id='type-id-23' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='dds_dsize' type-id='type-id-23' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='dds_ref_blocks' type-id='type-id-23' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='dds_ref_lsize' type-id='type-id-23' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='dds_ref_psize' type-id='type-id-23' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='dds_ref_dsize' type-id='type-id-23' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='ddt_stat_t' type-id='type-id-203' id='type-id-204'/>
    <qualified-type-def type-id='type-id-204' const='yes' id='type-id-205'/>
    <pointer-type-def type-id='type-id-205' size-in-bits='64' id='type-id-206'/>
    <class-decl name='ddt_histogram' size-in-bits='32768' is-struct='yes' visibility='default' id='type-id-207'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ddh_stat' type-id='type-id-208' visibility='default'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-204' size-in-bits='32768' id='type-id-208'>
      <subrange length='64' type-id='type-id-12' id='type-id-209'/>

    </array-type-def>
    <typedef-decl name='ddt_histogram_t' type-id='type-id-207' id='type-id-210'/>
    <qualified-type-def type-id='type-id-210' const='yes' id='type-id-211'/>
    <pointer-type-def type-id='type-id-211' size-in-bits='64' id='type-id-212'/>
    <function-decl name='zpool_dump_ddt' mangled-name='zpool_dump_ddt' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_dump_ddt'>
      <parameter type-id='type-id-206' name='dds_total'/>
      <parameter type-id='type-id-212' name='ddh'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='zfs_nicenum' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-37'/>
      <parameter type-id='type-id-26'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='zfs_nicebytes' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-37'/>
      <parameter type-id='type-id-26'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <pointer-type-def type-id='type-id-64' size-in-bits='64' id='type-id-213'/>
    <pointer-type-def type-id='type-id-34' size-in-bits='64' id='type-id-214'/>
    <function-decl name='zpool_history_unpack' mangled-name='zpool_history_unpack' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_history_unpack'>
      <parameter type-id='type-id-37' name='buf'/>
      <parameter type-id='type-id-23' name='bytes_read'/>
      <parameter type-id='type-id-71' name='leftover'/>
      <parameter type-id='type-id-213' name='records'/>
      <parameter type-id='type-id-214' name='numrecords'/>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='os/linux/zutil_device_path_os.c' comp-dir-path='/home/nabijaczleweli/store/code/zfs/lib/libzutil' language='LANG_C99'>
    <function-decl name='zfs_append_partition' mangled-name='zfs_append_partition' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_append_partition'>
      <parameter type-id='type-id-37' name='path'/>
      <parameter type-id='type-id-125' name='max_len'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='zfs_strip_partition' mangled-name='zfs_strip_partition' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_strip_partition'>
      <parameter type-id='type-id-37' name='path'/>
      <return type-id='type-id-37'/>
    </function-decl>
    <function-decl name='zfs_strip_path' mangled-name='zfs_strip_path' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_strip_path'>
      <parameter type-id='type-id-37'/>
      <return type-id='type-id-37'/>
    </function-decl>
    <function-decl name='zfs_get_enclosure_sysfs_path' mangled-name='zfs_get_enclosure_sysfs_path' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_get_enclosure_sysfs_path'>
      <parameter type-id='type-id-16' name='dev_name'/>
      <return type-id='type-id-37'/>
    </function-decl>
    <class-decl name='dirent' size-in-bits='2240' is-struct='yes' visibility='default' id='type-id-215'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='d_ino' type-id='type-id-199' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='d_off' type-id='type-id-135' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='d_reclen' type-id='type-id-200' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='144'>
        <var-decl name='d_type' type-id='type-id-30' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='152'>
        <var-decl name='d_name' type-id='type-id-43' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-215' size-in-bits='64' id='type-id-216'/>
    <function-decl name='readdir' mangled-name='readdir64' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-197'/>
      <return type-id='type-id-216'/>
    </function-decl>
    <function-decl name='readlink' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-37'/>
      <parameter type-id='type-id-26'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='zfs_dev_is_dm' mangled-name='zfs_dev_is_dm' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_dev_is_dm'>
      <parameter type-id='type-id-16' name='dev_name'/>
      <return type-id='type-id-41'/>
    </function-decl>
    <function-decl name='zfs_dev_is_whole_disk' mangled-name='zfs_dev_is_whole_disk' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_dev_is_whole_disk'>
      <parameter type-id='type-id-16' name='dev_name'/>
      <return type-id='type-id-41'/>
    </function-decl>
    <class-decl name='dk_gpt' size-in-bits='1920' is-struct='yes' visibility='default' id='type-id-217'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='efi_version' type-id='type-id-34' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='efi_nparts' type-id='type-id-34' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='efi_part_size' type-id='type-id-34' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='efi_lbasize' type-id='type-id-34' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='efi_last_lba' type-id='type-id-218' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='efi_first_u_lba' type-id='type-id-218' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='efi_last_u_lba' type-id='type-id-218' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='efi_disk_uguid' type-id='type-id-219' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='efi_flags' type-id='type-id-34' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='efi_reserved1' type-id='type-id-34' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='efi_altern_lba' type-id='type-id-218' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='efi_reserved' type-id='type-id-220' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='efi_parts' type-id='type-id-221' visibility='default'/>
      </data-member>
    </class-decl>
    <type-decl name='long long int' size-in-bits='64' id='type-id-222'/>
    <typedef-decl name='longlong_t' type-id='type-id-222' id='type-id-223'/>
    <typedef-decl name='diskaddr_t' type-id='type-id-223' id='type-id-218'/>
    <class-decl name='uuid' size-in-bits='128' is-struct='yes' visibility='default' id='type-id-219'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='time_low' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='time_mid' type-id='type-id-224' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='time_hi_and_version' type-id='type-id-224' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='clock_seq_hi_and_reserved' type-id='type-id-32' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='72'>
        <var-decl name='clock_seq_low' type-id='type-id-32' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='node_addr' type-id='type-id-105' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__uint16_t' type-id='type-id-200' id='type-id-225'/>
    <typedef-decl name='uint16_t' type-id='type-id-225' id='type-id-224'/>

    <array-type-def dimensions='1' type-id='type-id-34' size-in-bits='384' id='type-id-220'>
      <subrange length='12' type-id='type-id-12' id='type-id-103'/>

    </array-type-def>
    <class-decl name='dk_part' size-in-bits='960' is-struct='yes' visibility='default' id='type-id-226'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='p_start' type-id='type-id-218' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='p_size' type-id='type-id-218' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='p_guid' type-id='type-id-219' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='p_tag' type-id='type-id-227' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='272'>
        <var-decl name='p_flag' type-id='type-id-227' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='p_name' type-id='type-id-228' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='p_uguid' type-id='type-id-219' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='p_resv' type-id='type-id-229' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='ushort_t' type-id='type-id-200' id='type-id-227'/>

    <array-type-def dimensions='1' type-id='type-id-11' size-in-bits='288' id='type-id-228'>
      <subrange length='36' type-id='type-id-12' id='type-id-230'/>

    </array-type-def>

    <array-type-def dimensions='1' type-id='type-id-34' size-in-bits='256' id='type-id-229'>
      <subrange length='8' type-id='type-id-12' id='type-id-102'/>

    </array-type-def>

    <array-type-def dimensions='1' type-id='type-id-226' size-in-bits='960' id='type-id-221'>
      <subrange length='1' type-id='type-id-12' id='type-id-231'/>

    </array-type-def>
    <pointer-type-def type-id='type-id-217' size-in-bits='64' id='type-id-232'/>
    <pointer-type-def type-id='type-id-232' size-in-bits='64' id='type-id-233'/>
    <function-decl name='efi_alloc_and_init' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-233'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='efi_free' mangled-name='efi_free' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_free'>
      <parameter type-id='type-id-232'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='zfs_get_underlying_path' mangled-name='zfs_get_underlying_path' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_get_underlying_path'>
      <parameter type-id='type-id-16' name='dev_name'/>
      <return type-id='type-id-37'/>
    </function-decl>
    <function-decl name='is_mpath_whole_disk' mangled-name='is_mpath_whole_disk' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='is_mpath_whole_disk'>
      <parameter type-id='type-id-16' name='path'/>
      <return type-id='type-id-41'/>
    </function-decl>
    <class-decl name='udev' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-234'/>
    <pointer-type-def type-id='type-id-234' size-in-bits='64' id='type-id-235'/>
    <function-decl name='udev_new' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-235'/>
    </function-decl>
    <class-decl name='udev_device' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-236'/>
    <pointer-type-def type-id='type-id-236' size-in-bits='64' id='type-id-237'/>
    <function-decl name='udev_device_new_from_subsystem_sysname' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-235'/>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-237'/>
    </function-decl>
    <function-decl name='udev_device_get_property_value' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-237'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='udev_device_unref' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-237'/>
      <return type-id='type-id-237'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='os/linux/zutil_import_os.c' comp-dir-path='/home/nabijaczleweli/store/code/zfs/lib/libzutil' language='LANG_C99'>
    <function-decl name='zfs_dev_flush' mangled-name='zfs_dev_flush' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_dev_flush'>
      <parameter type-id='type-id-1' name='fd'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='zutil_strdup' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-180'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-37'/>
    </function-decl>
    <function-decl name='zpool_read_label' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-74'/>
      <parameter type-id='type-id-129'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='label_paths' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-180'/>
      <parameter type-id='type-id-35'/>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-126'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='zpool_label_disk_wait' mangled-name='zpool_label_disk_wait' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_label_disk_wait'>
      <parameter type-id='type-id-16' name='path'/>
      <parameter type-id='type-id-1' name='timeout_ms'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='zutil_alloc' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-180'/>
      <parameter type-id='type-id-26'/>
      <return type-id='type-id-73'/>
    </function-decl>
    <class-decl name='timespec' size-in-bits='128' is-struct='yes' visibility='default' id='type-id-238'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tv_sec' type-id='type-id-239' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tv_nsec' type-id='type-id-240' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__time_t' type-id='type-id-5' id='type-id-239'/>
    <typedef-decl name='__syscall_slong_t' type-id='type-id-5' id='type-id-240'/>
    <pointer-type-def type-id='type-id-238' size-in-bits='64' id='type-id-241'/>
    <function-decl name='clock_gettime' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-241'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='usleep' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <class-decl name='udev_list_entry' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-242'/>
    <pointer-type-def type-id='type-id-242' size-in-bits='64' id='type-id-243'/>
    <function-decl name='udev_device_get_devlinks_list_entry' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-237'/>
      <return type-id='type-id-243'/>
    </function-decl>
    <function-decl name='udev_list_entry_get_name' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-243'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='udev_list_entry_get_next' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-243'/>
      <return type-id='type-id-243'/>
    </function-decl>
    <function-decl name='udev_unref' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-235'/>
      <return type-id='type-id-235'/>
    </function-decl>
    <pointer-type-def type-id='type-id-125' size-in-bits='64' id='type-id-244'/>
    <function-decl name='zpool_default_search_paths' mangled-name='zpool_default_search_paths' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_default_search_paths'>
      <parameter type-id='type-id-244' name='count'/>
      <return type-id='type-id-128'/>
    </function-decl>
    <class-decl name='blkid_struct_cache' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-245'/>
    <pointer-type-def type-id='type-id-245' size-in-bits='64' id='type-id-246'/>
    <pointer-type-def type-id='type-id-246' size-in-bits='64' id='type-id-247'/>
    <function-decl name='blkid_get_cache' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-247'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='blkid_probe_all_new' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-246'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <class-decl name='blkid_struct_dev_iterate' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-248'/>
    <pointer-type-def type-id='type-id-248' size-in-bits='64' id='type-id-249'/>
    <function-decl name='blkid_dev_iterate_begin' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-246'/>
      <return type-id='type-id-249'/>
    </function-decl>
    <function-decl name='blkid_dev_set_search' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-249'/>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='blkid_dev_iterate_end' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-249'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <class-decl name='blkid_struct_dev' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-250'/>
    <pointer-type-def type-id='type-id-250' size-in-bits='64' id='type-id-251'/>
    <pointer-type-def type-id='type-id-251' size-in-bits='64' id='type-id-252'/>
    <function-decl name='blkid_dev_next' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-249'/>
      <parameter type-id='type-id-252'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='blkid_put_cache' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-246'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='blkid_dev_devname' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-251'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='zfs_device_get_devid' mangled-name='zfs_device_get_devid' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_device_get_devid'>
      <parameter type-id='type-id-237' name='dev'/>
      <parameter type-id='type-id-37' name='bufptr'/>
      <parameter type-id='type-id-125' name='buflen'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='udev_device_get_parent_with_subsystem_devtype' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-237'/>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-237'/>
    </function-decl>
    <function-decl name='zfs_device_get_physical' mangled-name='zfs_device_get_physical' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_device_get_physical'>
      <parameter type-id='type-id-237' name='dev'/>
      <parameter type-id='type-id-37' name='bufptr'/>
      <parameter type-id='type-id-125' name='buflen'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='update_vdev_config_dev_strs' mangled-name='update_vdev_config_dev_strs' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='update_vdev_config_dev_strs'>
      <parameter type-id='type-id-29' name='nv'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='nvlist_remove_all' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-35'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='sched_yield' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='os/linux/zutil_compat.c' comp-dir-path='/home/nabijaczleweli/store/code/zfs/lib/libzutil' language='LANG_C99'>
    <typedef-decl name='zfs_cmd_t' type-id='type-id-39' id='type-id-253'/>
    <pointer-type-def type-id='type-id-253' size-in-bits='64' id='type-id-254'/>
    <function-decl name='zfs_ioctl_fd' mangled-name='zfs_ioctl_fd' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_ioctl_fd'>
      <parameter type-id='type-id-1' name='fd'/>
      <parameter type-id='type-id-26' name='request'/>
      <parameter type-id='type-id-254' name='zc'/>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../../module/avl/avl.c' comp-dir-path='/home/nabijaczleweli/store/code/zfs/lib/libavl' language='LANG_C99'>
    <typedef-decl name='avl_tree_t' type-id='type-id-181' id='type-id-255'/>
    <pointer-type-def type-id='type-id-255' size-in-bits='64' id='type-id-256'/>
    <function-decl name='avl_walk' mangled-name='avl_walk' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_walk'>
      <parameter type-id='type-id-256' name='tree'/>
      <parameter type-id='type-id-73' name='oldnode'/>
      <parameter type-id='type-id-1' name='left'/>
      <return type-id='type-id-73'/>
    </function-decl>
    <function-decl name='avl_first' mangled-name='avl_first' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_first'>
      <parameter type-id='type-id-256' name='tree'/>
      <return type-id='type-id-73'/>
    </function-decl>
    <function-decl name='avl_last' mangled-name='avl_last' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_last'>
      <parameter type-id='type-id-256' name='tree'/>
      <return type-id='type-id-73'/>
    </function-decl>
    <typedef-decl name='avl_index_t' type-id='type-id-187' id='type-id-257'/>
    <function-decl name='avl_nearest' mangled-name='avl_nearest' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_nearest'>
      <parameter type-id='type-id-256' name='tree'/>
      <parameter type-id='type-id-257' name='where'/>
      <parameter type-id='type-id-1' name='direction'/>
      <return type-id='type-id-73'/>
    </function-decl>
    <pointer-type-def type-id='type-id-257' size-in-bits='64' id='type-id-258'/>
    <function-decl name='avl_find' mangled-name='avl_find' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_find'>
      <parameter type-id='type-id-256' name='tree'/>
      <parameter type-id='type-id-73' name='value'/>
      <parameter type-id='type-id-258' name='where'/>
      <return type-id='type-id-73'/>
    </function-decl>
    <function-decl name='avl_insert' mangled-name='avl_insert' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_insert'>
      <parameter type-id='type-id-256' name='tree'/>
      <parameter type-id='type-id-73' name='new_data'/>
      <parameter type-id='type-id-257' name='where'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='avl_insert_here' mangled-name='avl_insert_here' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_insert_here'>
      <parameter type-id='type-id-256' name='tree'/>
      <parameter type-id='type-id-73' name='new_data'/>
      <parameter type-id='type-id-73' name='here'/>
      <parameter type-id='type-id-1' name='direction'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='avl_add' mangled-name='avl_add' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_add'>
      <parameter type-id='type-id-256' name='tree'/>
      <parameter type-id='type-id-73' name='new_node'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='avl_remove' mangled-name='avl_remove' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_remove'>
      <parameter type-id='type-id-256' name='tree'/>
      <parameter type-id='type-id-73' name='data'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='avl_update_lt' mangled-name='avl_update_lt' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_update_lt'>
      <parameter type-id='type-id-256' name='t'/>
      <parameter type-id='type-id-73' name='obj'/>
      <return type-id='type-id-41'/>
    </function-decl>
    <function-decl name='avl_update_gt' mangled-name='avl_update_gt' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_update_gt'>
      <parameter type-id='type-id-256' name='t'/>
      <parameter type-id='type-id-73' name='obj'/>
      <return type-id='type-id-41'/>
    </function-decl>
    <function-decl name='avl_update' mangled-name='avl_update' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_update'>
      <parameter type-id='type-id-256' name='t'/>
      <parameter type-id='type-id-73' name='obj'/>
      <return type-id='type-id-41'/>
    </function-decl>
    <function-decl name='avl_swap' mangled-name='avl_swap' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_swap'>
      <parameter type-id='type-id-256' name='tree1'/>
      <parameter type-id='type-id-256' name='tree2'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='avl_create' mangled-name='avl_create' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_create'>
      <parameter type-id='type-id-256' name='tree'/>
      <parameter type-id='type-id-183' name='compar'/>
      <parameter type-id='type-id-125' name='size'/>
      <parameter type-id='type-id-125' name='offset'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='avl_destroy' mangled-name='avl_destroy' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_destroy'>
      <parameter type-id='type-id-256' name='tree'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='avl_numnodes' mangled-name='avl_numnodes' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_numnodes'>
      <parameter type-id='type-id-256' name='tree'/>
      <return type-id='type-id-184'/>
    </function-decl>
    <function-decl name='avl_is_empty' mangled-name='avl_is_empty' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_is_empty'>
      <parameter type-id='type-id-256' name='tree'/>
      <return type-id='type-id-41'/>
    </function-decl>
    <function-decl name='avl_destroy_nodes' mangled-name='avl_destroy_nodes' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_destroy_nodes'>
      <parameter type-id='type-id-256' name='tree'/>
      <parameter type-id='type-id-130' name='cookie'/>
      <return type-id='type-id-73'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='thread_pool.c' comp-dir-path='/home/nabijaczleweli/store/code/zfs/lib/libtpool' language='LANG_C99'>
    <class-decl name='tpool' size-in-bits='2496' is-struct='yes' visibility='default' id='type-id-191'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tp_forw' type-id='type-id-259' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tp_back' type-id='type-id-259' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='tp_mutex' type-id='type-id-260' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='tp_busycv' type-id='type-id-261' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='tp_workcv' type-id='type-id-261' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='tp_waitcv' type-id='type-id-261' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='tp_active' type-id='type-id-262' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='tp_head' type-id='type-id-263' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='tp_tail' type-id='type-id-263' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='tp_attr' type-id='type-id-150' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <var-decl name='tp_flags' type-id='type-id-1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2272'>
        <var-decl name='tp_linger' type-id='type-id-34' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2304'>
        <var-decl name='tp_njobs' type-id='type-id-1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2336'>
        <var-decl name='tp_minimum' type-id='type-id-1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2368'>
        <var-decl name='tp_maximum' type-id='type-id-1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2400'>
        <var-decl name='tp_current' type-id='type-id-1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2432'>
        <var-decl name='tp_idle' type-id='type-id-1' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='tpool_t' type-id='type-id-191' id='type-id-264'/>
    <pointer-type-def type-id='type-id-264' size-in-bits='64' id='type-id-259'/>
    <typedef-decl name='pthread_mutex_t' type-id='type-id-2' id='type-id-260'/>
    <union-decl name='__anonymous_union__' size-in-bits='384' is-anonymous='yes' visibility='default' id='type-id-265'>
      <data-member access='private'>
        <var-decl name='__data' type-id='type-id-266' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='__size' type-id='type-id-267' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='__align' type-id='type-id-222' visibility='default'/>
      </data-member>
    </union-decl>
    <class-decl name='__pthread_cond_s' size-in-bits='384' is-struct='yes' visibility='default' id='type-id-266'>
      <member-type access='public'>
        <union-decl name='__anonymous_union__' size-in-bits='64' is-anonymous='yes' visibility='default' id='type-id-268'>
          <data-member access='private'>
            <var-decl name='__g1_start' type-id='type-id-269' visibility='default'/>
          </data-member>
          <data-member access='private'>
            <var-decl name='__g1_start32' type-id='type-id-270' visibility='default'/>
          </data-member>
        </union-decl>
      </member-type>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='' type-id='type-id-271' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='__g_refs' type-id='type-id-272' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='__g_size' type-id='type-id-272' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='__g1_orig_size' type-id='type-id-6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='__wrefs' type-id='type-id-6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='__g_signals' type-id='type-id-272' visibility='default'/>
      </data-member>
    </class-decl>
    <union-decl name='__anonymous_union__' size-in-bits='64' is-anonymous='yes' visibility='default' id='type-id-271'>
      <data-member access='private'>
        <var-decl name='__wseq' type-id='type-id-269' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='__wseq32' type-id='type-id-270' visibility='default'/>
      </data-member>
    </union-decl>
    <type-decl name='long long unsigned int' size-in-bits='64' id='type-id-269'/>
    <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-270'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__low' type-id='type-id-6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='__high' type-id='type-id-6' visibility='default'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-6' size-in-bits='64' id='type-id-272'>
      <subrange length='2' type-id='type-id-12' id='type-id-62'/>

    </array-type-def>

    <array-type-def dimensions='1' type-id='type-id-11' size-in-bits='384' id='type-id-267'>
      <subrange length='48' type-id='type-id-12' id='type-id-273'/>

    </array-type-def>
    <typedef-decl name='pthread_cond_t' type-id='type-id-265' id='type-id-261'/>
    <class-decl name='tpool_active' size-in-bits='128' is-struct='yes' visibility='default' id='type-id-274'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tpa_next' type-id='type-id-262' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tpa_tid' type-id='type-id-275' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='tpool_active_t' type-id='type-id-274' id='type-id-276'/>
    <pointer-type-def type-id='type-id-276' size-in-bits='64' id='type-id-262'/>
    <typedef-decl name='pthread_t' type-id='type-id-26' id='type-id-275'/>
    <class-decl name='tpool_job' size-in-bits='192' is-struct='yes' visibility='default' id='type-id-277'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tpj_next' type-id='type-id-263' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tpj_func' type-id='type-id-194' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='tpj_arg' type-id='type-id-73' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='tpool_job_t' type-id='type-id-277' id='type-id-278'/>
    <pointer-type-def type-id='type-id-278' size-in-bits='64' id='type-id-263'/>
    <function-decl name='tpool_create' mangled-name='tpool_create' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='tpool_create'>
      <parameter type-id='type-id-34' name='min_threads'/>
      <parameter type-id='type-id-34' name='max_threads'/>
      <parameter type-id='type-id-34' name='linger'/>
      <parameter type-id='type-id-145' name='attr'/>
      <return type-id='type-id-259'/>
    </function-decl>
    <qualified-type-def type-id='type-id-147' const='yes' id='type-id-279'/>
    <pointer-type-def type-id='type-id-279' size-in-bits='64' id='type-id-280'/>
    <function-decl name='pthread_attr_getstack' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-280'/>
      <parameter type-id='type-id-130'/>
      <parameter type-id='type-id-38'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <pointer-type-def type-id='type-id-265' size-in-bits='64' id='type-id-281'/>
    <function-decl name='pthread_cond_init' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-281'/>
      <parameter type-id='type-id-176'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <pointer-type-def type-id='type-id-147' size-in-bits='64' id='type-id-282'/>
    <function-decl name='pthread_attr_init' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-282'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='1024' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-283'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__bits' type-id='type-id-284' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__cpu_mask' type-id='type-id-26' id='type-id-285'/>

    <array-type-def dimensions='1' type-id='type-id-285' size-in-bits='1024' id='type-id-284'>
      <subrange length='16' type-id='type-id-12' id='type-id-104'/>

    </array-type-def>
    <pointer-type-def type-id='type-id-283' size-in-bits='64' id='type-id-286'/>
    <function-decl name='pthread_attr_getaffinity_np' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-280'/>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-286'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <qualified-type-def type-id='type-id-283' const='yes' id='type-id-287'/>
    <pointer-type-def type-id='type-id-287' size-in-bits='64' id='type-id-288'/>
    <function-decl name='pthread_attr_setaffinity_np' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-282'/>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-288'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='pthread_attr_getdetachstate' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-280'/>
      <parameter type-id='type-id-129'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='pthread_attr_setdetachstate' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-282'/>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='pthread_attr_getguardsize' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-280'/>
      <parameter type-id='type-id-38'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='pthread_attr_setguardsize' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-282'/>
      <parameter type-id='type-id-26'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='pthread_attr_getinheritsched' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-280'/>
      <parameter type-id='type-id-129'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='pthread_attr_setinheritsched' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-282'/>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <class-decl name='sched_param' size-in-bits='32' is-struct='yes' visibility='default' id='type-id-289'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sched_priority' type-id='type-id-1' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-289' size-in-bits='64' id='type-id-290'/>
    <function-decl name='pthread_attr_getschedparam' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-280'/>
      <parameter type-id='type-id-290'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <qualified-type-def type-id='type-id-289' const='yes' id='type-id-291'/>
    <pointer-type-def type-id='type-id-291' size-in-bits='64' id='type-id-292'/>
    <function-decl name='pthread_attr_setschedparam' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-282'/>
      <parameter type-id='type-id-292'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='pthread_attr_getschedpolicy' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-280'/>
      <parameter type-id='type-id-129'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='pthread_attr_setschedpolicy' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-282'/>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='pthread_attr_getscope' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-280'/>
      <parameter type-id='type-id-129'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='pthread_attr_setscope' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-282'/>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='pthread_attr_setstack' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-282'/>
      <parameter type-id='type-id-73'/>
      <parameter type-id='type-id-26'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='pthread_attr_destroy' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-282'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='tpool_dispatch' mangled-name='tpool_dispatch' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='tpool_dispatch'>
      <parameter type-id='type-id-259' name='tpool'/>
      <parameter type-id='type-id-194' name='func'/>
      <parameter type-id='type-id-73' name='arg'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='pthread_cond_signal' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-281'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='1024' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-293'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__val' type-id='type-id-294' visibility='default'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-26' size-in-bits='1024' id='type-id-294'>
      <subrange length='16' type-id='type-id-12' id='type-id-104'/>

    </array-type-def>
    <qualified-type-def type-id='type-id-293' const='yes' id='type-id-295'/>
    <pointer-type-def type-id='type-id-293' size-in-bits='64' id='type-id-296'/>
    <function-decl name='pthread_sigmask' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-288'/>
      <parameter type-id='type-id-296'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <pointer-type-def type-id='type-id-297' size-in-bits='64' id='type-id-298'/>
    <function-decl name='pthread_create' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-38'/>
      <parameter type-id='type-id-280'/>
      <parameter type-id='type-id-298'/>
      <parameter type-id='type-id-73'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='tpool_destroy' mangled-name='tpool_destroy' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='tpool_destroy'>
      <parameter type-id='type-id-259' name='tpool'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='pthread_cond_broadcast' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-281'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='pthread_cancel' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-26'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='pthread_cond_wait' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-281'/>
      <parameter type-id='type-id-14'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='tpool_abandon' mangled-name='tpool_abandon' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='tpool_abandon'>
      <parameter type-id='type-id-259' name='tpool'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='tpool_wait' mangled-name='tpool_wait' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='tpool_wait'>
      <parameter type-id='type-id-259' name='tpool'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='tpool_suspend' mangled-name='tpool_suspend' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='tpool_suspend'>
      <parameter type-id='type-id-259' name='tpool'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='tpool_suspended' mangled-name='tpool_suspended' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='tpool_suspended'>
      <parameter type-id='type-id-259' name='tpool'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='tpool_resume' mangled-name='tpool_resume' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='tpool_resume'>
      <parameter type-id='type-id-259' name='tpool'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='tpool_member' mangled-name='tpool_member' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='tpool_member'>
      <parameter type-id='type-id-259' name='tpool'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='pthread_self' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-26'/>
    </function-decl>
    <qualified-type-def type-id='type-id-238' const='yes' id='type-id-299'/>
    <pointer-type-def type-id='type-id-299' size-in-bits='64' id='type-id-300'/>
    <function-decl name='pthread_cond_timedwait' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-281'/>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-300'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='pthread_setcanceltype' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-129'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='pthread_setcancelstate' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-129'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-297'>
      <parameter type-id='type-id-73'/>
      <return type-id='type-id-73'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='assert.c' comp-dir-path='/home/nabijaczleweli/store/code/zfs/lib/libspl' language='LANG_C99'>
    <var-decl name='libspl_assert_ok' type-id='type-id-1' mangled-name='libspl_assert_ok' visibility='default' elf-symbol-id='libspl_assert_ok'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='atomic.c' comp-dir-path='/home/nabijaczleweli/store/code/zfs/lib/libspl' language='LANG_C99'>
    <qualified-type-def type-id='type-id-32' volatile='yes' id='type-id-301'/>
    <pointer-type-def type-id='type-id-301' size-in-bits='64' id='type-id-302'/>
    <function-decl name='atomic_inc_8' mangled-name='atomic_inc_8' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_inc_8'>
      <parameter type-id='type-id-302' name='target'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <typedef-decl name='uchar_t' type-id='type-id-30' id='type-id-303'/>
    <qualified-type-def type-id='type-id-303' volatile='yes' id='type-id-304'/>
    <pointer-type-def type-id='type-id-304' size-in-bits='64' id='type-id-305'/>
    <function-decl name='atomic_inc_uchar' mangled-name='atomic_inc_uchar' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_inc_uchar'>
      <parameter type-id='type-id-305' name='target'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <qualified-type-def type-id='type-id-224' volatile='yes' id='type-id-306'/>
    <pointer-type-def type-id='type-id-306' size-in-bits='64' id='type-id-307'/>
    <function-decl name='atomic_inc_16' mangled-name='atomic_inc_16' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_inc_16'>
      <parameter type-id='type-id-307' name='target'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <qualified-type-def type-id='type-id-227' volatile='yes' id='type-id-308'/>
    <pointer-type-def type-id='type-id-308' size-in-bits='64' id='type-id-309'/>
    <function-decl name='atomic_inc_ushort' mangled-name='atomic_inc_ushort' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_inc_ushort'>
      <parameter type-id='type-id-309' name='target'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <qualified-type-def type-id='type-id-22' volatile='yes' id='type-id-310'/>
    <pointer-type-def type-id='type-id-310' size-in-bits='64' id='type-id-311'/>
    <function-decl name='atomic_inc_32' mangled-name='atomic_inc_32' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_inc_32'>
      <parameter type-id='type-id-311' name='target'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <qualified-type-def type-id='type-id-34' volatile='yes' id='type-id-312'/>
    <pointer-type-def type-id='type-id-312' size-in-bits='64' id='type-id-313'/>
    <function-decl name='atomic_inc_uint' mangled-name='atomic_inc_uint' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_inc_uint'>
      <parameter type-id='type-id-313' name='target'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <qualified-type-def type-id='type-id-184' volatile='yes' id='type-id-314'/>
    <pointer-type-def type-id='type-id-314' size-in-bits='64' id='type-id-315'/>
    <function-decl name='atomic_inc_ulong' mangled-name='atomic_inc_ulong' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_inc_ulong'>
      <parameter type-id='type-id-315' name='target'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <qualified-type-def type-id='type-id-23' volatile='yes' id='type-id-316'/>
    <pointer-type-def type-id='type-id-316' size-in-bits='64' id='type-id-317'/>
    <function-decl name='atomic_inc_64' mangled-name='atomic_inc_64' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_inc_64'>
      <parameter type-id='type-id-317' name='target'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='atomic_dec_8' mangled-name='atomic_dec_8' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_dec_8'>
      <parameter type-id='type-id-302' name='target'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='atomic_dec_uchar' mangled-name='atomic_dec_uchar' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_dec_uchar'>
      <parameter type-id='type-id-305' name='target'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='atomic_dec_16' mangled-name='atomic_dec_16' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_dec_16'>
      <parameter type-id='type-id-307' name='target'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='atomic_dec_ushort' mangled-name='atomic_dec_ushort' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_dec_ushort'>
      <parameter type-id='type-id-309' name='target'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='atomic_dec_32' mangled-name='atomic_dec_32' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_dec_32'>
      <parameter type-id='type-id-311' name='target'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='atomic_dec_uint' mangled-name='atomic_dec_uint' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_dec_uint'>
      <parameter type-id='type-id-313' name='target'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='atomic_dec_ulong' mangled-name='atomic_dec_ulong' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_dec_ulong'>
      <parameter type-id='type-id-315' name='target'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='atomic_dec_64' mangled-name='atomic_dec_64' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_dec_64'>
      <parameter type-id='type-id-317' name='target'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <type-decl name='signed char' size-in-bits='8' id='type-id-318'/>
    <typedef-decl name='__int8_t' type-id='type-id-318' id='type-id-319'/>
    <typedef-decl name='int8_t' type-id='type-id-319' id='type-id-320'/>
    <function-decl name='atomic_add_8' mangled-name='atomic_add_8' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_8'>
      <parameter type-id='type-id-302' name='target'/>
      <parameter type-id='type-id-320' name='bits'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='atomic_add_char' mangled-name='atomic_add_char' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_char'>
      <parameter type-id='type-id-305' name='target'/>
      <parameter type-id='type-id-318' name='bits'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='atomic_add_16' mangled-name='atomic_add_16' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_16'>
      <parameter type-id='type-id-307' name='target'/>
      <parameter type-id='type-id-66' name='bits'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='atomic_add_short' mangled-name='atomic_add_short' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_short'>
      <parameter type-id='type-id-309' name='target'/>
      <parameter type-id='type-id-7' name='bits'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='atomic_add_32' mangled-name='atomic_add_32' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_32'>
      <parameter type-id='type-id-311' name='target'/>
      <parameter type-id='type-id-21' name='bits'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='atomic_add_int' mangled-name='atomic_add_int' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_int'>
      <parameter type-id='type-id-313' name='target'/>
      <parameter type-id='type-id-1' name='bits'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='atomic_add_long' mangled-name='atomic_add_long' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_long'>
      <parameter type-id='type-id-315' name='target'/>
      <parameter type-id='type-id-5' name='bits'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <typedef-decl name='__int64_t' type-id='type-id-5' id='type-id-321'/>
    <typedef-decl name='int64_t' type-id='type-id-321' id='type-id-322'/>
    <function-decl name='atomic_add_64' mangled-name='atomic_add_64' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_64'>
      <parameter type-id='type-id-317' name='target'/>
      <parameter type-id='type-id-322' name='bits'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='atomic_add_ptr' mangled-name='atomic_add_ptr' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_ptr'>
      <parameter type-id='type-id-132' name='target'/>
      <parameter type-id='type-id-124' name='bits'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='atomic_sub_8' mangled-name='atomic_sub_8' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_sub_8'>
      <parameter type-id='type-id-302' name='target'/>
      <parameter type-id='type-id-320' name='bits'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='atomic_sub_char' mangled-name='atomic_sub_char' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_sub_char'>
      <parameter type-id='type-id-305' name='target'/>
      <parameter type-id='type-id-318' name='bits'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='atomic_sub_16' mangled-name='atomic_sub_16' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_sub_16'>
      <parameter type-id='type-id-307' name='target'/>
      <parameter type-id='type-id-66' name='bits'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='atomic_sub_short' mangled-name='atomic_sub_short' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_sub_short'>
      <parameter type-id='type-id-309' name='target'/>
      <parameter type-id='type-id-7' name='bits'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='atomic_sub_32' mangled-name='atomic_sub_32' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_sub_32'>
      <parameter type-id='type-id-311' name='target'/>
      <parameter type-id='type-id-21' name='bits'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='atomic_sub_int' mangled-name='atomic_sub_int' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_sub_int'>
      <parameter type-id='type-id-313' name='target'/>
      <parameter type-id='type-id-1' name='bits'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='atomic_sub_long' mangled-name='atomic_sub_long' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_sub_long'>
      <parameter type-id='type-id-315' name='target'/>
      <parameter type-id='type-id-5' name='bits'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='atomic_sub_64' mangled-name='atomic_sub_64' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_sub_64'>
      <parameter type-id='type-id-317' name='target'/>
      <parameter type-id='type-id-322' name='bits'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='atomic_sub_ptr' mangled-name='atomic_sub_ptr' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_sub_ptr'>
      <parameter type-id='type-id-132' name='target'/>
      <parameter type-id='type-id-124' name='bits'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='atomic_or_8' mangled-name='atomic_or_8' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_or_8'>
      <parameter type-id='type-id-302' name='target'/>
      <parameter type-id='type-id-32' name='bits'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='atomic_or_uchar' mangled-name='atomic_or_uchar' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_or_uchar'>
      <parameter type-id='type-id-305' name='target'/>
      <parameter type-id='type-id-303' name='bits'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='atomic_or_16' mangled-name='atomic_or_16' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_or_16'>
      <parameter type-id='type-id-307' name='target'/>
      <parameter type-id='type-id-224' name='bits'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='atomic_or_ushort' mangled-name='atomic_or_ushort' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_or_ushort'>
      <parameter type-id='type-id-309' name='target'/>
      <parameter type-id='type-id-227' name='bits'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='atomic_or_32' mangled-name='atomic_or_32' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_or_32'>
      <parameter type-id='type-id-311' name='target'/>
      <parameter type-id='type-id-22' name='bits'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='atomic_or_uint' mangled-name='atomic_or_uint' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_or_uint'>
      <parameter type-id='type-id-313' name='target'/>
      <parameter type-id='type-id-34' name='bits'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='atomic_or_ulong' mangled-name='atomic_or_ulong' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_or_ulong'>
      <parameter type-id='type-id-315' name='target'/>
      <parameter type-id='type-id-184' name='bits'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='atomic_or_64' mangled-name='atomic_or_64' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_or_64'>
      <parameter type-id='type-id-317' name='target'/>
      <parameter type-id='type-id-23' name='bits'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='atomic_and_8' mangled-name='atomic_and_8' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_and_8'>
      <parameter type-id='type-id-302' name='target'/>
      <parameter type-id='type-id-32' name='bits'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='atomic_and_uchar' mangled-name='atomic_and_uchar' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_and_uchar'>
      <parameter type-id='type-id-305' name='target'/>
      <parameter type-id='type-id-303' name='bits'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='atomic_and_16' mangled-name='atomic_and_16' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_and_16'>
      <parameter type-id='type-id-307' name='target'/>
      <parameter type-id='type-id-224' name='bits'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='atomic_and_ushort' mangled-name='atomic_and_ushort' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_and_ushort'>
      <parameter type-id='type-id-309' name='target'/>
      <parameter type-id='type-id-227' name='bits'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='atomic_and_32' mangled-name='atomic_and_32' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_and_32'>
      <parameter type-id='type-id-311' name='target'/>
      <parameter type-id='type-id-22' name='bits'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='atomic_and_uint' mangled-name='atomic_and_uint' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_and_uint'>
      <parameter type-id='type-id-313' name='target'/>
      <parameter type-id='type-id-34' name='bits'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='atomic_and_ulong' mangled-name='atomic_and_ulong' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_and_ulong'>
      <parameter type-id='type-id-315' name='target'/>
      <parameter type-id='type-id-184' name='bits'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='atomic_and_64' mangled-name='atomic_and_64' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_and_64'>
      <parameter type-id='type-id-317' name='target'/>
      <parameter type-id='type-id-23' name='bits'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='atomic_inc_8_nv' mangled-name='atomic_inc_8_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_inc_8_nv'>
      <parameter type-id='type-id-302' name='target'/>
      <return type-id='type-id-32'/>
    </function-decl>
    <function-decl name='atomic_inc_uchar_nv' mangled-name='atomic_inc_uchar_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_inc_uchar_nv'>
      <parameter type-id='type-id-305' name='target'/>
      <return type-id='type-id-303'/>
    </function-decl>
    <function-decl name='atomic_inc_16_nv' mangled-name='atomic_inc_16_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_inc_16_nv'>
      <parameter type-id='type-id-307' name='target'/>
      <return type-id='type-id-224'/>
    </function-decl>
    <function-decl name='atomic_inc_ushort_nv' mangled-name='atomic_inc_ushort_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_inc_ushort_nv'>
      <parameter type-id='type-id-309' name='target'/>
      <return type-id='type-id-227'/>
    </function-decl>
    <function-decl name='atomic_inc_32_nv' mangled-name='atomic_inc_32_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_inc_32_nv'>
      <parameter type-id='type-id-311' name='target'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='atomic_inc_uint_nv' mangled-name='atomic_inc_uint_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_inc_uint_nv'>
      <parameter type-id='type-id-313' name='target'/>
      <return type-id='type-id-34'/>
    </function-decl>
    <function-decl name='atomic_inc_ulong_nv' mangled-name='atomic_inc_ulong_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_inc_ulong_nv'>
      <parameter type-id='type-id-315' name='target'/>
      <return type-id='type-id-184'/>
    </function-decl>
    <function-decl name='atomic_inc_64_nv' mangled-name='atomic_inc_64_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_inc_64_nv'>
      <parameter type-id='type-id-317' name='target'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='atomic_dec_8_nv' mangled-name='atomic_dec_8_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_dec_8_nv'>
      <parameter type-id='type-id-302' name='target'/>
      <return type-id='type-id-32'/>
    </function-decl>
    <function-decl name='atomic_dec_uchar_nv' mangled-name='atomic_dec_uchar_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_dec_uchar_nv'>
      <parameter type-id='type-id-305' name='target'/>
      <return type-id='type-id-303'/>
    </function-decl>
    <function-decl name='atomic_dec_16_nv' mangled-name='atomic_dec_16_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_dec_16_nv'>
      <parameter type-id='type-id-307' name='target'/>
      <return type-id='type-id-224'/>
    </function-decl>
    <function-decl name='atomic_dec_ushort_nv' mangled-name='atomic_dec_ushort_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_dec_ushort_nv'>
      <parameter type-id='type-id-309' name='target'/>
      <return type-id='type-id-227'/>
    </function-decl>
    <function-decl name='atomic_dec_32_nv' mangled-name='atomic_dec_32_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_dec_32_nv'>
      <parameter type-id='type-id-311' name='target'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='atomic_dec_uint_nv' mangled-name='atomic_dec_uint_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_dec_uint_nv'>
      <parameter type-id='type-id-313' name='target'/>
      <return type-id='type-id-34'/>
    </function-decl>
    <function-decl name='atomic_dec_ulong_nv' mangled-name='atomic_dec_ulong_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_dec_ulong_nv'>
      <parameter type-id='type-id-315' name='target'/>
      <return type-id='type-id-184'/>
    </function-decl>
    <function-decl name='atomic_dec_64_nv' mangled-name='atomic_dec_64_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_dec_64_nv'>
      <parameter type-id='type-id-317' name='target'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='atomic_add_8_nv' mangled-name='atomic_add_8_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_8_nv'>
      <parameter type-id='type-id-302' name='target'/>
      <parameter type-id='type-id-320' name='bits'/>
      <return type-id='type-id-32'/>
    </function-decl>
    <function-decl name='atomic_add_char_nv' mangled-name='atomic_add_char_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_char_nv'>
      <parameter type-id='type-id-305' name='target'/>
      <parameter type-id='type-id-318' name='bits'/>
      <return type-id='type-id-303'/>
    </function-decl>
    <function-decl name='atomic_add_16_nv' mangled-name='atomic_add_16_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_16_nv'>
      <parameter type-id='type-id-307' name='target'/>
      <parameter type-id='type-id-66' name='bits'/>
      <return type-id='type-id-224'/>
    </function-decl>
    <function-decl name='atomic_add_short_nv' mangled-name='atomic_add_short_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_short_nv'>
      <parameter type-id='type-id-309' name='target'/>
      <parameter type-id='type-id-7' name='bits'/>
      <return type-id='type-id-227'/>
    </function-decl>
    <function-decl name='atomic_add_32_nv' mangled-name='atomic_add_32_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_32_nv'>
      <parameter type-id='type-id-311' name='target'/>
      <parameter type-id='type-id-21' name='bits'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='atomic_add_int_nv' mangled-name='atomic_add_int_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_int_nv'>
      <parameter type-id='type-id-313' name='target'/>
      <parameter type-id='type-id-1' name='bits'/>
      <return type-id='type-id-34'/>
    </function-decl>
    <function-decl name='atomic_add_long_nv' mangled-name='atomic_add_long_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_long_nv'>
      <parameter type-id='type-id-315' name='target'/>
      <parameter type-id='type-id-5' name='bits'/>
      <return type-id='type-id-184'/>
    </function-decl>
    <function-decl name='atomic_add_64_nv' mangled-name='atomic_add_64_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_64_nv'>
      <parameter type-id='type-id-317' name='target'/>
      <parameter type-id='type-id-322' name='bits'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='atomic_add_ptr_nv' mangled-name='atomic_add_ptr_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_ptr_nv'>
      <parameter type-id='type-id-132' name='target'/>
      <parameter type-id='type-id-124' name='bits'/>
      <return type-id='type-id-73'/>
    </function-decl>
    <function-decl name='atomic_sub_8_nv' mangled-name='atomic_sub_8_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_sub_8_nv'>
      <parameter type-id='type-id-302' name='target'/>
      <parameter type-id='type-id-320' name='bits'/>
      <return type-id='type-id-32'/>
    </function-decl>
    <function-decl name='atomic_sub_char_nv' mangled-name='atomic_sub_char_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_sub_char_nv'>
      <parameter type-id='type-id-305' name='target'/>
      <parameter type-id='type-id-318' name='bits'/>
      <return type-id='type-id-303'/>
    </function-decl>
    <function-decl name='atomic_sub_16_nv' mangled-name='atomic_sub_16_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_sub_16_nv'>
      <parameter type-id='type-id-307' name='target'/>
      <parameter type-id='type-id-66' name='bits'/>
      <return type-id='type-id-224'/>
    </function-decl>
    <function-decl name='atomic_sub_short_nv' mangled-name='atomic_sub_short_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_sub_short_nv'>
      <parameter type-id='type-id-309' name='target'/>
      <parameter type-id='type-id-7' name='bits'/>
      <return type-id='type-id-227'/>
    </function-decl>
    <function-decl name='atomic_sub_32_nv' mangled-name='atomic_sub_32_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_sub_32_nv'>
      <parameter type-id='type-id-311' name='target'/>
      <parameter type-id='type-id-21' name='bits'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='atomic_sub_int_nv' mangled-name='atomic_sub_int_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_sub_int_nv'>
      <parameter type-id='type-id-313' name='target'/>
      <parameter type-id='type-id-1' name='bits'/>
      <return type-id='type-id-34'/>
    </function-decl>
    <function-decl name='atomic_sub_long_nv' mangled-name='atomic_sub_long_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_sub_long_nv'>
      <parameter type-id='type-id-315' name='target'/>
      <parameter type-id='type-id-5' name='bits'/>
      <return type-id='type-id-184'/>
    </function-decl>
    <function-decl name='atomic_sub_64_nv' mangled-name='atomic_sub_64_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_sub_64_nv'>
      <parameter type-id='type-id-317' name='target'/>
      <parameter type-id='type-id-322' name='bits'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='atomic_sub_ptr_nv' mangled-name='atomic_sub_ptr_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_sub_ptr_nv'>
      <parameter type-id='type-id-132' name='target'/>
      <parameter type-id='type-id-124' name='bits'/>
      <return type-id='type-id-73'/>
    </function-decl>
    <function-decl name='atomic_or_8_nv' mangled-name='atomic_or_8_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_or_8_nv'>
      <parameter type-id='type-id-302' name='target'/>
      <parameter type-id='type-id-32' name='bits'/>
      <return type-id='type-id-32'/>
    </function-decl>
    <function-decl name='atomic_or_uchar_nv' mangled-name='atomic_or_uchar_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_or_uchar_nv'>
      <parameter type-id='type-id-305' name='target'/>
      <parameter type-id='type-id-303' name='bits'/>
      <return type-id='type-id-303'/>
    </function-decl>
    <function-decl name='atomic_or_16_nv' mangled-name='atomic_or_16_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_or_16_nv'>
      <parameter type-id='type-id-307' name='target'/>
      <parameter type-id='type-id-224' name='bits'/>
      <return type-id='type-id-224'/>
    </function-decl>
    <function-decl name='atomic_or_ushort_nv' mangled-name='atomic_or_ushort_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_or_ushort_nv'>
      <parameter type-id='type-id-309' name='target'/>
      <parameter type-id='type-id-227' name='bits'/>
      <return type-id='type-id-227'/>
    </function-decl>
    <function-decl name='atomic_or_32_nv' mangled-name='atomic_or_32_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_or_32_nv'>
      <parameter type-id='type-id-311' name='target'/>
      <parameter type-id='type-id-22' name='bits'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='atomic_or_uint_nv' mangled-name='atomic_or_uint_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_or_uint_nv'>
      <parameter type-id='type-id-313' name='target'/>
      <parameter type-id='type-id-34' name='bits'/>
      <return type-id='type-id-34'/>
    </function-decl>
    <function-decl name='atomic_or_ulong_nv' mangled-name='atomic_or_ulong_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_or_ulong_nv'>
      <parameter type-id='type-id-315' name='target'/>
      <parameter type-id='type-id-184' name='bits'/>
      <return type-id='type-id-184'/>
    </function-decl>
    <function-decl name='atomic_or_64_nv' mangled-name='atomic_or_64_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_or_64_nv'>
      <parameter type-id='type-id-317' name='target'/>
      <parameter type-id='type-id-23' name='bits'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='atomic_and_8_nv' mangled-name='atomic_and_8_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_and_8_nv'>
      <parameter type-id='type-id-302' name='target'/>
      <parameter type-id='type-id-32' name='bits'/>
      <return type-id='type-id-32'/>
    </function-decl>
    <function-decl name='atomic_and_uchar_nv' mangled-name='atomic_and_uchar_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_and_uchar_nv'>
      <parameter type-id='type-id-305' name='target'/>
      <parameter type-id='type-id-303' name='bits'/>
      <return type-id='type-id-303'/>
    </function-decl>
    <function-decl name='atomic_and_16_nv' mangled-name='atomic_and_16_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_and_16_nv'>
      <parameter type-id='type-id-307' name='target'/>
      <parameter type-id='type-id-224' name='bits'/>
      <return type-id='type-id-224'/>
    </function-decl>
    <function-decl name='atomic_and_ushort_nv' mangled-name='atomic_and_ushort_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_and_ushort_nv'>
      <parameter type-id='type-id-309' name='target'/>
      <parameter type-id='type-id-227' name='bits'/>
      <return type-id='type-id-227'/>
    </function-decl>
    <function-decl name='atomic_and_32_nv' mangled-name='atomic_and_32_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_and_32_nv'>
      <parameter type-id='type-id-311' name='target'/>
      <parameter type-id='type-id-22' name='bits'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='atomic_and_uint_nv' mangled-name='atomic_and_uint_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_and_uint_nv'>
      <parameter type-id='type-id-313' name='target'/>
      <parameter type-id='type-id-34' name='bits'/>
      <return type-id='type-id-34'/>
    </function-decl>
    <function-decl name='atomic_and_ulong_nv' mangled-name='atomic_and_ulong_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_and_ulong_nv'>
      <parameter type-id='type-id-315' name='target'/>
      <parameter type-id='type-id-184' name='bits'/>
      <return type-id='type-id-184'/>
    </function-decl>
    <function-decl name='atomic_and_64_nv' mangled-name='atomic_and_64_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_and_64_nv'>
      <parameter type-id='type-id-317' name='target'/>
      <parameter type-id='type-id-23' name='bits'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='atomic_cas_8' mangled-name='atomic_cas_8' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_cas_8'>
      <parameter type-id='type-id-302' name='target'/>
      <parameter type-id='type-id-32' name='exp'/>
      <parameter type-id='type-id-32' name='des'/>
      <return type-id='type-id-32'/>
    </function-decl>
    <function-decl name='atomic_cas_uchar' mangled-name='atomic_cas_uchar' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_cas_uchar'>
      <parameter type-id='type-id-305' name='target'/>
      <parameter type-id='type-id-303' name='exp'/>
      <parameter type-id='type-id-303' name='des'/>
      <return type-id='type-id-303'/>
    </function-decl>
    <function-decl name='atomic_cas_16' mangled-name='atomic_cas_16' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_cas_16'>
      <parameter type-id='type-id-307' name='target'/>
      <parameter type-id='type-id-224' name='exp'/>
      <parameter type-id='type-id-224' name='des'/>
      <return type-id='type-id-224'/>
    </function-decl>
    <function-decl name='atomic_cas_ushort' mangled-name='atomic_cas_ushort' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_cas_ushort'>
      <parameter type-id='type-id-309' name='target'/>
      <parameter type-id='type-id-227' name='exp'/>
      <parameter type-id='type-id-227' name='des'/>
      <return type-id='type-id-227'/>
    </function-decl>
    <function-decl name='atomic_cas_32' mangled-name='atomic_cas_32' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_cas_32'>
      <parameter type-id='type-id-311' name='target'/>
      <parameter type-id='type-id-22' name='exp'/>
      <parameter type-id='type-id-22' name='des'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='atomic_cas_uint' mangled-name='atomic_cas_uint' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_cas_uint'>
      <parameter type-id='type-id-313' name='target'/>
      <parameter type-id='type-id-34' name='exp'/>
      <parameter type-id='type-id-34' name='des'/>
      <return type-id='type-id-34'/>
    </function-decl>
    <function-decl name='atomic_cas_ulong' mangled-name='atomic_cas_ulong' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_cas_ulong'>
      <parameter type-id='type-id-315' name='target'/>
      <parameter type-id='type-id-184' name='exp'/>
      <parameter type-id='type-id-184' name='des'/>
      <return type-id='type-id-184'/>
    </function-decl>
    <function-decl name='atomic_cas_64' mangled-name='atomic_cas_64' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_cas_64'>
      <parameter type-id='type-id-317' name='target'/>
      <parameter type-id='type-id-23' name='exp'/>
      <parameter type-id='type-id-23' name='des'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='atomic_cas_ptr' mangled-name='atomic_cas_ptr' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_cas_ptr'>
      <parameter type-id='type-id-132' name='target'/>
      <parameter type-id='type-id-73' name='exp'/>
      <parameter type-id='type-id-73' name='des'/>
      <return type-id='type-id-73'/>
    </function-decl>
    <function-decl name='atomic_swap_8' mangled-name='atomic_swap_8' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_swap_8'>
      <parameter type-id='type-id-302' name='target'/>
      <parameter type-id='type-id-32' name='bits'/>
      <return type-id='type-id-32'/>
    </function-decl>
    <function-decl name='atomic_swap_uchar' mangled-name='atomic_swap_uchar' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_swap_uchar'>
      <parameter type-id='type-id-305' name='target'/>
      <parameter type-id='type-id-303' name='bits'/>
      <return type-id='type-id-303'/>
    </function-decl>
    <function-decl name='atomic_swap_16' mangled-name='atomic_swap_16' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_swap_16'>
      <parameter type-id='type-id-307' name='target'/>
      <parameter type-id='type-id-224' name='bits'/>
      <return type-id='type-id-224'/>
    </function-decl>
    <function-decl name='atomic_swap_ushort' mangled-name='atomic_swap_ushort' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_swap_ushort'>
      <parameter type-id='type-id-309' name='target'/>
      <parameter type-id='type-id-227' name='bits'/>
      <return type-id='type-id-227'/>
    </function-decl>
    <function-decl name='atomic_swap_32' mangled-name='atomic_swap_32' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_swap_32'>
      <parameter type-id='type-id-311' name='target'/>
      <parameter type-id='type-id-22' name='bits'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='atomic_swap_uint' mangled-name='atomic_swap_uint' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_swap_uint'>
      <parameter type-id='type-id-313' name='target'/>
      <parameter type-id='type-id-34' name='bits'/>
      <return type-id='type-id-34'/>
    </function-decl>
    <function-decl name='atomic_swap_ulong' mangled-name='atomic_swap_ulong' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_swap_ulong'>
      <parameter type-id='type-id-315' name='target'/>
      <parameter type-id='type-id-184' name='bits'/>
      <return type-id='type-id-184'/>
    </function-decl>
    <function-decl name='atomic_swap_64' mangled-name='atomic_swap_64' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_swap_64'>
      <parameter type-id='type-id-317' name='target'/>
      <parameter type-id='type-id-23' name='bits'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='atomic_swap_ptr' mangled-name='atomic_swap_ptr' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_swap_ptr'>
      <parameter type-id='type-id-132' name='target'/>
      <parameter type-id='type-id-73' name='bits'/>
      <return type-id='type-id-73'/>
    </function-decl>
    <function-decl name='atomic_set_long_excl' mangled-name='atomic_set_long_excl' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_set_long_excl'>
      <parameter type-id='type-id-315' name='target'/>
      <parameter type-id='type-id-34' name='value'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='atomic_clear_long_excl' mangled-name='atomic_clear_long_excl' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_clear_long_excl'>
      <parameter type-id='type-id-315' name='target'/>
      <parameter type-id='type-id-34' name='value'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='membar_enter' mangled-name='membar_enter' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='membar_enter'>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='membar_exit' mangled-name='membar_exit' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='membar_exit'>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='membar_producer' mangled-name='membar_producer' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='membar_producer'>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='membar_consumer' mangled-name='membar_consumer' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='membar_consumer'>
      <return type-id='type-id-17'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='getexecname.c' comp-dir-path='/home/nabijaczleweli/store/code/zfs/lib/libspl' language='LANG_C99'>
    <function-decl name='getexecname' mangled-name='getexecname' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getexecname'>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='getexecname_impl' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-37'/>
      <return type-id='type-id-5'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='os/linux/gethostid.c' comp-dir-path='/home/nabijaczleweli/store/code/zfs/lib/libspl' language='LANG_C99'>
    <function-decl name='get_system_hostid' mangled-name='get_system_hostid' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='get_system_hostid'>
      <return type-id='type-id-26'/>
    </function-decl>
    <class-decl name='_IO_FILE' size-in-bits='1728' is-struct='yes' visibility='default' id='type-id-323'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_flags' type-id='type-id-1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_IO_read_ptr' type-id='type-id-37' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_IO_read_end' type-id='type-id-37' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_IO_read_base' type-id='type-id-37' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='_IO_write_base' type-id='type-id-37' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='_IO_write_ptr' type-id='type-id-37' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_IO_write_end' type-id='type-id-37' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='_IO_buf_base' type-id='type-id-37' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='_IO_buf_end' type-id='type-id-37' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='_IO_save_base' type-id='type-id-37' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='_IO_backup_base' type-id='type-id-37' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='_IO_save_end' type-id='type-id-37' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='_markers' type-id='type-id-324' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='_chain' type-id='type-id-325' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='_fileno' type-id='type-id-1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='_flags2' type-id='type-id-1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='_old_offset' type-id='type-id-326' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='_cur_column' type-id='type-id-200' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1040'>
        <var-decl name='_vtable_offset' type-id='type-id-318' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1048'>
        <var-decl name='_shortbuf' type-id='type-id-327' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='_offset' type-id='type-id-135' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='_codecvt' type-id='type-id-328' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='_wide_data' type-id='type-id-329' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='_freeres_list' type-id='type-id-325' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='_freeres_buf' type-id='type-id-73' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='__pad5' type-id='type-id-125' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='_mode' type-id='type-id-1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='_unused2' type-id='type-id-330' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='_IO_marker' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-331'/>
    <pointer-type-def type-id='type-id-331' size-in-bits='64' id='type-id-324'/>
    <pointer-type-def type-id='type-id-323' size-in-bits='64' id='type-id-325'/>
    <typedef-decl name='__off_t' type-id='type-id-5' id='type-id-326'/>

    <array-type-def dimensions='1' type-id='type-id-11' size-in-bits='8' id='type-id-327'>
      <subrange length='1' type-id='type-id-12' id='type-id-231'/>

    </array-type-def>
    <class-decl name='_IO_codecvt' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-332'/>
    <pointer-type-def type-id='type-id-332' size-in-bits='64' id='type-id-328'/>
    <class-decl name='_IO_wide_data' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-333'/>
    <pointer-type-def type-id='type-id-333' size-in-bits='64' id='type-id-329'/>

    <array-type-def dimensions='1' type-id='type-id-11' size-in-bits='160' id='type-id-330'>
      <subrange length='20' type-id='type-id-12' id='type-id-334'/>

    </array-type-def>
    <function-decl name='fclose' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-325'/>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='os/linux/getmntany.c' comp-dir-path='/home/nabijaczleweli/store/code/zfs/lib/libspl' language='LANG_C99'>
    <typedef-decl name='FILE' type-id='type-id-323' id='type-id-335'/>
    <pointer-type-def type-id='type-id-335' size-in-bits='64' id='type-id-336'/>
    <class-decl name='mnttab' size-in-bits='256' is-struct='yes' visibility='default' id='type-id-337'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mnt_special' type-id='type-id-37' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='mnt_mountp' type-id='type-id-37' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='mnt_fstype' type-id='type-id-37' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='mnt_mntopts' type-id='type-id-37' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-337' size-in-bits='64' id='type-id-338'/>
    <function-decl name='getmntany' mangled-name='getmntany' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getmntany'>
      <parameter type-id='type-id-336' name='fp'/>
      <parameter type-id='type-id-338' name='mgetp'/>
      <parameter type-id='type-id-338' name='mrefp'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <class-decl name='mntent' size-in-bits='320' is-struct='yes' visibility='default' id='type-id-339'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mnt_fsname' type-id='type-id-37' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='mnt_dir' type-id='type-id-37' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='mnt_type' type-id='type-id-37' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='mnt_opts' type-id='type-id-37' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='mnt_freq' type-id='type-id-1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='mnt_passno' type-id='type-id-1' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-339' size-in-bits='64' id='type-id-340'/>
    <function-decl name='getmntent_r' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-325'/>
      <parameter type-id='type-id-340'/>
      <parameter type-id='type-id-37'/>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-340'/>
    </function-decl>
    <function-decl name='feof' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-325'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_sol_getmntent' mangled-name='_sol_getmntent' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_sol_getmntent'>
      <parameter type-id='type-id-336' name='fp'/>
      <parameter type-id='type-id-338' name='mgetp'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <class-decl name='extmnttab' size-in-bits='320' is-struct='yes' visibility='default' id='type-id-341'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mnt_special' type-id='type-id-37' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='mnt_mountp' type-id='type-id-37' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='mnt_fstype' type-id='type-id-37' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='mnt_mntopts' type-id='type-id-37' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='mnt_major' type-id='type-id-34' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='mnt_minor' type-id='type-id-34' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-341' size-in-bits='64' id='type-id-342'/>
    <class-decl name='stat64' size-in-bits='1152' is-struct='yes' visibility='default' id='type-id-343'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='st_dev' type-id='type-id-344' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='st_ino' type-id='type-id-199' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='st_nlink' type-id='type-id-345' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='st_mode' type-id='type-id-346' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='st_uid' type-id='type-id-347' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='st_gid' type-id='type-id-348' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='__pad0' type-id='type-id-1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='st_rdev' type-id='type-id-344' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='st_size' type-id='type-id-326' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='st_blksize' type-id='type-id-349' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='st_blocks' type-id='type-id-350' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='st_atim' type-id='type-id-238' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='st_mtim' type-id='type-id-238' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='st_ctim' type-id='type-id-238' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='__glibc_reserved' type-id='type-id-351' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__dev_t' type-id='type-id-26' id='type-id-344'/>
    <typedef-decl name='__nlink_t' type-id='type-id-26' id='type-id-345'/>
    <typedef-decl name='__mode_t' type-id='type-id-6' id='type-id-346'/>
    <typedef-decl name='__uid_t' type-id='type-id-6' id='type-id-347'/>
    <typedef-decl name='__gid_t' type-id='type-id-6' id='type-id-348'/>
    <typedef-decl name='__blksize_t' type-id='type-id-5' id='type-id-349'/>
    <typedef-decl name='__blkcnt64_t' type-id='type-id-5' id='type-id-350'/>

    <array-type-def dimensions='1' type-id='type-id-240' size-in-bits='192' id='type-id-351'>
      <subrange length='3' type-id='type-id-12' id='type-id-59'/>

    </array-type-def>
    <pointer-type-def type-id='type-id-343' size-in-bits='64' id='type-id-352'/>
    <function-decl name='getextmntent' mangled-name='getextmntent' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getextmntent'>
      <parameter type-id='type-id-16' name='path'/>
      <parameter type-id='type-id-342' name='entry'/>
      <parameter type-id='type-id-352' name='statbuf'/>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='list.c' comp-dir-path='/home/nabijaczleweli/store/code/zfs/lib/libspl' language='LANG_C99'>
    <class-decl name='list' size-in-bits='256' is-struct='yes' visibility='default' id='type-id-353'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='list_size' type-id='type-id-125' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='list_offset' type-id='type-id-125' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='list_head' type-id='type-id-354' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='list_node' size-in-bits='128' is-struct='yes' visibility='default' id='type-id-354'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-355' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='prev' type-id='type-id-355' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-354' size-in-bits='64' id='type-id-355'/>
    <typedef-decl name='list_t' type-id='type-id-353' id='type-id-356'/>
    <pointer-type-def type-id='type-id-356' size-in-bits='64' id='type-id-357'/>
    <function-decl name='list_create' mangled-name='list_create' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_create'>
      <parameter type-id='type-id-357' name='list'/>
      <parameter type-id='type-id-125' name='size'/>
      <parameter type-id='type-id-125' name='offset'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='list_destroy' mangled-name='list_destroy' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_destroy'>
      <parameter type-id='type-id-357' name='list'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='list_insert_after' mangled-name='list_insert_after' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_insert_after'>
      <parameter type-id='type-id-357' name='list'/>
      <parameter type-id='type-id-73' name='object'/>
      <parameter type-id='type-id-73' name='nobject'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='list_insert_head' mangled-name='list_insert_head' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_insert_head'>
      <parameter type-id='type-id-357' name='list'/>
      <parameter type-id='type-id-73' name='object'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='list_insert_before' mangled-name='list_insert_before' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_insert_before'>
      <parameter type-id='type-id-357' name='list'/>
      <parameter type-id='type-id-73' name='object'/>
      <parameter type-id='type-id-73' name='nobject'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='list_insert_tail' mangled-name='list_insert_tail' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_insert_tail'>
      <parameter type-id='type-id-357' name='list'/>
      <parameter type-id='type-id-73' name='object'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='list_remove' mangled-name='list_remove' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_remove'>
      <parameter type-id='type-id-357' name='list'/>
      <parameter type-id='type-id-73' name='object'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='list_remove_head' mangled-name='list_remove_head' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_remove_head'>
      <parameter type-id='type-id-357' name='list'/>
      <return type-id='type-id-73'/>
    </function-decl>
    <function-decl name='list_remove_tail' mangled-name='list_remove_tail' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_remove_tail'>
      <parameter type-id='type-id-357' name='list'/>
      <return type-id='type-id-73'/>
    </function-decl>
    <function-decl name='list_head' mangled-name='list_head' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_head'>
      <parameter type-id='type-id-357' name='list'/>
      <return type-id='type-id-73'/>
    </function-decl>
    <function-decl name='list_tail' mangled-name='list_tail' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_tail'>
      <parameter type-id='type-id-357' name='list'/>
      <return type-id='type-id-73'/>
    </function-decl>
    <function-decl name='list_next' mangled-name='list_next' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_next'>
      <parameter type-id='type-id-357' name='list'/>
      <parameter type-id='type-id-73' name='object'/>
      <return type-id='type-id-73'/>
    </function-decl>
    <function-decl name='list_prev' mangled-name='list_prev' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_prev'>
      <parameter type-id='type-id-357' name='list'/>
      <parameter type-id='type-id-73' name='object'/>
      <return type-id='type-id-73'/>
    </function-decl>
    <function-decl name='list_move_tail' mangled-name='list_move_tail' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_move_tail'>
      <parameter type-id='type-id-357' name='dst'/>
      <parameter type-id='type-id-357' name='src'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <typedef-decl name='list_node_t' type-id='type-id-354' id='type-id-358'/>
    <pointer-type-def type-id='type-id-358' size-in-bits='64' id='type-id-359'/>
    <function-decl name='list_link_replace' mangled-name='list_link_replace' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_link_replace'>
      <parameter type-id='type-id-359' name='lold'/>
      <parameter type-id='type-id-359' name='lnew'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='list_link_init' mangled-name='list_link_init' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_link_init'>
      <parameter type-id='type-id-359' name='ln'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='list_link_active' mangled-name='list_link_active' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_link_active'>
      <parameter type-id='type-id-359' name='ln'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='list_is_empty' mangled-name='list_is_empty' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_is_empty'>
      <parameter type-id='type-id-357' name='list'/>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='mkdirp.c' comp-dir-path='/home/nabijaczleweli/store/code/zfs/lib/libspl' language='LANG_C99'>
    <typedef-decl name='mode_t' type-id='type-id-346' id='type-id-360'/>
    <function-decl name='mkdirp' mangled-name='mkdirp' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='mkdirp'>
      <parameter type-id='type-id-16' name='d'/>
      <parameter type-id='type-id-360' name='mode'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='mbstowcs' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-129'/>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-26'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <qualified-type-def type-id='type-id-1' const='yes' id='type-id-361'/>
    <pointer-type-def type-id='type-id-361' size-in-bits='64' id='type-id-362'/>
    <function-decl name='wcstombs' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-37'/>
      <parameter type-id='type-id-362'/>
      <parameter type-id='type-id-26'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='mkdir' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='page.c' comp-dir-path='/home/nabijaczleweli/store/code/zfs/lib/libspl' language='LANG_C99'>
    <function-decl name='spl_pagesize' mangled-name='spl_pagesize' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spl_pagesize'>
      <return type-id='type-id-125'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='strlcat.c' comp-dir-path='/home/nabijaczleweli/store/code/zfs/lib/libspl' language='LANG_C99'>
    <function-decl name='strlcat' mangled-name='strlcat' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strlcat'>
      <parameter type-id='type-id-37' name='dst'/>
      <parameter type-id='type-id-16' name='src'/>
      <parameter type-id='type-id-125' name='dstsize'/>
      <return type-id='type-id-125'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='strlcpy.c' comp-dir-path='/home/nabijaczleweli/store/code/zfs/lib/libspl' language='LANG_C99'>
    <function-decl name='strlcpy' mangled-name='strlcpy' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strlcpy'>
      <parameter type-id='type-id-37' name='dst'/>
      <parameter type-id='type-id-16' name='src'/>
      <parameter type-id='type-id-125' name='len'/>
      <return type-id='type-id-125'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='timestamp.c' comp-dir-path='/home/nabijaczleweli/store/code/zfs/lib/libspl' language='LANG_C99'>
    <function-decl name='print_timestamp' mangled-name='print_timestamp' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='print_timestamp'>
      <parameter type-id='type-id-34' name='timestamp_fmt'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <pointer-type-def type-id='type-id-5' size-in-bits='64' id='type-id-363'/>
    <function-decl name='time' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-363'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nl_langinfo' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-37'/>
    </function-decl>
    <class-decl name='tm' size-in-bits='448' is-struct='yes' visibility='default' id='type-id-364'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tm_sec' type-id='type-id-1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='tm_min' type-id='type-id-1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tm_hour' type-id='type-id-1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='tm_mday' type-id='type-id-1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='tm_mon' type-id='type-id-1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='tm_year' type-id='type-id-1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='tm_wday' type-id='type-id-1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='tm_yday' type-id='type-id-1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='tm_isdst' type-id='type-id-1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='tm_gmtoff' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='tm_zone' type-id='type-id-16' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-364' size-in-bits='64' id='type-id-365'/>
    <qualified-type-def type-id='type-id-5' const='yes' id='type-id-366'/>
    <pointer-type-def type-id='type-id-366' size-in-bits='64' id='type-id-367'/>
    <function-decl name='localtime' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-367'/>
      <return type-id='type-id-365'/>
    </function-decl>
    <qualified-type-def type-id='type-id-364' const='yes' id='type-id-368'/>
    <pointer-type-def type-id='type-id-368' size-in-bits='64' id='type-id-369'/>
    <function-decl name='strftime' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-37'/>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-369'/>
      <return type-id='type-id-26'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='os/linux/zone.c' comp-dir-path='/home/nabijaczleweli/store/code/zfs/lib/libspl' language='LANG_C99'>
    <typedef-decl name='zoneid_t' type-id='type-id-1' id='type-id-370'/>
    <function-decl name='getzoneid' mangled-name='getzoneid' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getzoneid'>
      <return type-id='type-id-370'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='rdwr_efi.c' comp-dir-path='/home/nabijaczleweli/store/code/zfs/lib/libefi' language='LANG_C99'>
    <var-decl name='efi_debug' type-id='type-id-1' mangled-name='efi_debug' visibility='default' elf-symbol-id='efi_debug'/>
    <function-decl name='efi_alloc_and_init' mangled-name='efi_alloc_and_init' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_alloc_and_init'>
      <parameter type-id='type-id-1' name='fd'/>
      <parameter type-id='type-id-22' name='nparts'/>
      <parameter type-id='type-id-233' name='vtoc'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='uuid_generate' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-36'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='efi_alloc_and_read' mangled-name='efi_alloc_and_read' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_alloc_and_read'>
      <parameter type-id='type-id-1' name='fd'/>
      <parameter type-id='type-id-233' name='vtoc'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='efi_rescan' mangled-name='efi_rescan' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_rescan'>
      <parameter type-id='type-id-1' name='fd'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='efi_use_whole_disk' mangled-name='efi_use_whole_disk' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_use_whole_disk'>
      <parameter type-id='type-id-1' name='fd'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='efi_write' mangled-name='efi_write' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_write'>
      <parameter type-id='type-id-1' name='fd'/>
      <parameter type-id='type-id-232' name='vtoc'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <qualified-type-def type-id='type-id-30' const='yes' id='type-id-371'/>
    <pointer-type-def type-id='type-id-371' size-in-bits='64' id='type-id-372'/>
    <function-decl name='uuid_is_null' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-372'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='crc32' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-26'/>
