<abi-corpus architecture='elf-amd-x86_64' soname='libzfs_core.so.3'>
  <elf-needed>
    <dependency name='libuuid.so.1'/>
    <dependency name='libz.so.1'/>
    <dependency name='librt.so.1'/>
    <dependency name='libm.so.6'/>
    <dependency name='libblkid.so.1'/>
    <dependency name='libudev.so.1'/>
    <dependency name='libnvpair.so.3'/>
    <dependency name='libpthread.so.0'/>
    <dependency name='libc.so.6'/>
    <dependency name='ld-linux-x86-64.so.2'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='_fini' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_init' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_sol_getmntent' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='atomic_add_16' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='atomic_add_16_nv' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='atomic_add_32' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='atomic_add_32_nv' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='strlcpy' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='tpool_abandon' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='tpool_create' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='tpool_destroy' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='tpool_dispatch' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='tpool_member' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='tpool_resume' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='tpool_suspend' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='tpool_suspended' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='tpool_wait' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='update_vdev_config_dev_strs' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zfs_append_partition' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zfs_basename' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zfs_dev_flush' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zfs_dev_is_dm' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zfs_dev_is_whole_disk' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zfs_device_get_devid' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zfs_device_get_physical' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zfs_dirnamelen' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zfs_get_enclosure_sysfs_path' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zfs_get_underlying_path' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zfs_ioctl_fd' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zfs_isnumber' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zfs_nicebytes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zfs_nicenum' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zfs_nicenum_format' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zfs_niceraw' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zfs_nicetime' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zfs_resolve_shortname' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zfs_strcmp_pathname' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zfs_strip_partition' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zfs_strip_path' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zpool_default_search_paths' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zpool_dump_ddt' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zpool_find_config' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zpool_history_unpack' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zpool_label_disk_wait' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zpool_read_label' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zpool_search_import' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <elf-variable-symbols>
    <elf-symbol name='efi_debug' size='4' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='libspl_assert_ok' size='4' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-variable-symbols>
  <abi-instr version='1.0' address-size='64' path='libzfs_core.c' comp-dir-path='/home/runner/work/zfs/zfs/lib/libzfs_core' language='LANG_C99'>
    <type-decl name='int' size-in-bits='32' id='type-id-1'/>
    <type-decl name='char' size-in-bits='8' id='type-id-2'/>
    <qualified-type-def type-id='type-id-2' const='yes' id='type-id-3'/>
    <pointer-type-def type-id='type-id-3' size-in-bits='64' id='type-id-4'/>
    <class-decl name='nvlist' size-in-bits='192' is-struct='yes' visibility='default' id='type-id-5'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nvl_version' type-id='type-id-6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='nvl_nvflag' type-id='type-id-7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='nvl_priv' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='nvl_flag' type-id='type-id-7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='nvl_pad' type-id='type-id-6' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__int32_t' type-id='type-id-1' id='type-id-9'/>
    <typedef-decl name='int32_t' type-id='type-id-9' id='type-id-6'/>
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-10'/>
    <typedef-decl name='__uint32_t' type-id='type-id-10' id='type-id-11'/>
    <typedef-decl name='uint32_t' type-id='type-id-11' id='type-id-7'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-12'/>
    <typedef-decl name='__uint64_t' type-id='type-id-12' id='type-id-13'/>
    <typedef-decl name='uint64_t' type-id='type-id-13' id='type-id-8'/>
    <typedef-decl name='nvlist_t' type-id='type-id-5' id='type-id-14'/>
    <pointer-type-def type-id='type-id-14' size-in-bits='64' id='type-id-15'/>
    <pointer-type-def type-id='type-id-15' size-in-bits='64' id='type-id-16'/>
    <function-decl name='lzc_get_bootenv' mangled-name='lzc_get_bootenv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_get_bootenv'>
      <parameter type-id='type-id-4' name='pool'/>
      <parameter type-id='type-id-16' name='outnvl'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <qualified-type-def type-id='type-id-14' const='yes' id='type-id-17'/>
    <pointer-type-def type-id='type-id-17' size-in-bits='64' id='type-id-18'/>
    <function-decl name='lzc_set_bootenv' mangled-name='lzc_set_bootenv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_set_bootenv'>
      <parameter type-id='type-id-4' name='pool'/>
      <parameter type-id='type-id-18' name='env'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <type-decl name='unnamed-enum-underlying-type' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='type-id-19'/>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' id='type-id-20'>
      <underlying-type type-id='type-id-19'/>
      <enumerator name='ZFS_WAIT_DELETEQ' value='0'/>
      <enumerator name='ZFS_WAIT_NUM_ACTIVITIES' value='1'/>
    </enum-decl>
    <typedef-decl name='zfs_wait_activity_t' type-id='type-id-20' id='type-id-21'/>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' id='type-id-22'>
      <underlying-type type-id='type-id-19'/>
      <enumerator name='B_FALSE' value='0'/>
      <enumerator name='B_TRUE' value='1'/>
    </enum-decl>
    <typedef-decl name='boolean_t' type-id='type-id-22' id='type-id-23'/>
    <pointer-type-def type-id='type-id-23' size-in-bits='64' id='type-id-24'/>
    <function-decl name='lzc_wait_fs' mangled-name='lzc_wait_fs' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_wait_fs'>
      <parameter type-id='type-id-4' name='fs'/>
      <parameter type-id='type-id-21' name='activity'/>
      <parameter type-id='type-id-24' name='waited'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' id='type-id-25'>
      <underlying-type type-id='type-id-19'/>
      <enumerator name='ZPOOL_WAIT_CKPT_DISCARD' value='0'/>
      <enumerator name='ZPOOL_WAIT_FREE' value='1'/>
      <enumerator name='ZPOOL_WAIT_INITIALIZE' value='2'/>
      <enumerator name='ZPOOL_WAIT_REPLACE' value='3'/>
      <enumerator name='ZPOOL_WAIT_REMOVE' value='4'/>
      <enumerator name='ZPOOL_WAIT_RESILVER' value='5'/>
      <enumerator name='ZPOOL_WAIT_SCRUB' value='6'/>
      <enumerator name='ZPOOL_WAIT_TRIM' value='7'/>
      <enumerator name='ZPOOL_WAIT_NUM_ACTIVITIES' value='8'/>
    </enum-decl>
    <typedef-decl name='zpool_wait_activity_t' type-id='type-id-25' id='type-id-26'/>
    <function-decl name='lzc_wait_tag' mangled-name='lzc_wait_tag' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_wait_tag'>
      <parameter type-id='type-id-4' name='pool'/>
      <parameter type-id='type-id-26' name='activity'/>
      <parameter type-id='type-id-8' name='tag'/>
      <parameter type-id='type-id-24' name='waited'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='lzc_wait' mangled-name='lzc_wait' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_wait'>
      <parameter type-id='type-id-4' name='pool'/>
      <parameter type-id='type-id-26' name='activity'/>
      <parameter type-id='type-id-24' name='waited'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='lzc_redact' mangled-name='lzc_redact' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_redact'>
      <parameter type-id='type-id-4' name='snapshot'/>
      <parameter type-id='type-id-4' name='bookname'/>
      <parameter type-id='type-id-15' name='snapnv'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <enum-decl name='pool_trim_func' id='type-id-27'>
      <underlying-type type-id='type-id-19'/>
      <enumerator name='POOL_TRIM_START' value='0'/>
      <enumerator name='POOL_TRIM_CANCEL' value='1'/>
      <enumerator name='POOL_TRIM_SUSPEND' value='2'/>
      <enumerator name='POOL_TRIM_FUNCS' value='3'/>
    </enum-decl>
    <typedef-decl name='pool_trim_func_t' type-id='type-id-27' id='type-id-28'/>
    <function-decl name='lzc_trim' mangled-name='lzc_trim' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_trim'>
      <parameter type-id='type-id-4' name='poolname'/>
      <parameter type-id='type-id-28' name='cmd_type'/>
      <parameter type-id='type-id-8' name='rate'/>
      <parameter type-id='type-id-23' name='secure'/>
      <parameter type-id='type-id-15' name='vdevs'/>
      <parameter type-id='type-id-16' name='errlist'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <enum-decl name='pool_initialize_func' id='type-id-29'>
      <underlying-type type-id='type-id-19'/>
      <enumerator name='POOL_INITIALIZE_START' value='0'/>
      <enumerator name='POOL_INITIALIZE_CANCEL' value='1'/>
      <enumerator name='POOL_INITIALIZE_SUSPEND' value='2'/>
      <enumerator name='POOL_INITIALIZE_FUNCS' value='3'/>
    </enum-decl>
    <typedef-decl name='pool_initialize_func_t' type-id='type-id-29' id='type-id-30'/>
    <function-decl name='lzc_initialize' mangled-name='lzc_initialize' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_initialize'>
      <parameter type-id='type-id-4' name='poolname'/>
      <parameter type-id='type-id-30' name='cmd_type'/>
      <parameter type-id='type-id-15' name='vdevs'/>
      <parameter type-id='type-id-16' name='errlist'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='lzc_reopen' mangled-name='lzc_reopen' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_reopen'>
      <parameter type-id='type-id-4' name='pool_name'/>
      <parameter type-id='type-id-23' name='scrub_restart'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <type-decl name='unsigned char' size-in-bits='8' id='type-id-31'/>
    <typedef-decl name='__uint8_t' type-id='type-id-31' id='type-id-32'/>
    <typedef-decl name='uint8_t' type-id='type-id-32' id='type-id-33'/>
    <pointer-type-def type-id='type-id-33' size-in-bits='64' id='type-id-34'/>
    <typedef-decl name='uint_t' type-id='type-id-10' id='type-id-35'/>
    <function-decl name='lzc_change_key' mangled-name='lzc_change_key' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_change_key'>
      <parameter type-id='type-id-4' name='fsname'/>
      <parameter type-id='type-id-8' name='crypt_cmd'/>
      <parameter type-id='type-id-15' name='props'/>
      <parameter type-id='type-id-34' name='wkeydata'/>
      <parameter type-id='type-id-35' name='wkeylen'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='lzc_unload_key' mangled-name='lzc_unload_key' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_unload_key'>
      <parameter type-id='type-id-4' name='fsname'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='lzc_load_key' mangled-name='lzc_load_key' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_load_key'>
      <parameter type-id='type-id-4' name='fsname'/>
      <parameter type-id='type-id-23' name='noop'/>
      <parameter type-id='type-id-34' name='wkeydata'/>
      <parameter type-id='type-id-35' name='wkeylen'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='lzc_channel_program_nosync' mangled-name='lzc_channel_program_nosync' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_channel_program_nosync'>
      <parameter type-id='type-id-4' name='pool'/>
      <parameter type-id='type-id-4' name='program'/>
      <parameter type-id='type-id-8' name='timeout'/>
      <parameter type-id='type-id-8' name='memlimit'/>
      <parameter type-id='type-id-15' name='argnvl'/>
      <parameter type-id='type-id-16' name='outnvl'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='lzc_pool_checkpoint_discard' mangled-name='lzc_pool_checkpoint_discard' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_pool_checkpoint_discard'>
      <parameter type-id='type-id-4' name='pool'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='lzc_pool_checkpoint' mangled-name='lzc_pool_checkpoint' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_pool_checkpoint'>
      <parameter type-id='type-id-4' name='pool'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='lzc_channel_program' mangled-name='lzc_channel_program' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_channel_program'>
      <parameter type-id='type-id-4' name='pool'/>
      <parameter type-id='type-id-4' name='program'/>
      <parameter type-id='type-id-8' name='timeout'/>
      <parameter type-id='type-id-8' name='memlimit'/>
      <parameter type-id='type-id-15' name='argnvl'/>
      <parameter type-id='type-id-16' name='outnvl'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='lzc_destroy_bookmarks' mangled-name='lzc_destroy_bookmarks' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_destroy_bookmarks'>
      <parameter type-id='type-id-15' name='bmarks'/>
      <parameter type-id='type-id-16' name='errlist'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='lzc_get_bookmark_props' mangled-name='lzc_get_bookmark_props' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_get_bookmark_props'>
      <parameter type-id='type-id-4' name='bookmark'/>
      <parameter type-id='type-id-16' name='props'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='lzc_get_bookmarks' mangled-name='lzc_get_bookmarks' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_get_bookmarks'>
      <parameter type-id='type-id-4' name='fsname'/>
      <parameter type-id='type-id-15' name='props'/>
      <parameter type-id='type-id-16' name='bmarks'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='lzc_bookmark' mangled-name='lzc_bookmark' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_bookmark'>
      <parameter type-id='type-id-15' name='bmarks'/>
      <parameter type-id='type-id-16' name='errlist'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='lzc_rollback_to' mangled-name='lzc_rollback_to' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_rollback_to'>
      <parameter type-id='type-id-4' name='fsname'/>
      <parameter type-id='type-id-4' name='snapname'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <pointer-type-def type-id='type-id-2' size-in-bits='64' id='type-id-36'/>
    <function-decl name='lzc_rollback' mangled-name='lzc_rollback' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_rollback'>
      <parameter type-id='type-id-4' name='fsname'/>
      <parameter type-id='type-id-36' name='snapnamebuf'/>
      <parameter type-id='type-id-1' name='snapnamelen'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <class-decl name='dmu_replay_record' size-in-bits='2496' is-struct='yes' visibility='default' id='type-id-37'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='drr_type' type-id='type-id-38' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='drr_payloadlen' type-id='type-id-7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='drr_u' type-id='type-id-39' visibility='default'/>
      </data-member>
    </class-decl>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' id='type-id-38'>
      <underlying-type type-id='type-id-19'/>
      <enumerator name='DRR_BEGIN' value='0'/>
      <enumerator name='DRR_OBJECT' value='1'/>
      <enumerator name='DRR_FREEOBJECTS' value='2'/>
      <enumerator name='DRR_WRITE' value='3'/>
      <enumerator name='DRR_FREE' value='4'/>
      <enumerator name='DRR_END' value='5'/>
      <enumerator name='DRR_WRITE_BYREF' value='6'/>
      <enumerator name='DRR_SPILL' value='7'/>
      <enumerator name='DRR_WRITE_EMBEDDED' value='8'/>
      <enumerator name='DRR_OBJECT_RANGE' value='9'/>
      <enumerator name='DRR_REDACT' value='10'/>
      <enumerator name='DRR_NUMTYPES' value='11'/>
    </enum-decl>
    <union-decl name='__anonymous_union__' size-in-bits='2432' is-anonymous='yes' visibility='default' id='type-id-39'>
      <data-member access='private'>
        <var-decl name='drr_begin' type-id='type-id-40' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='drr_end' type-id='type-id-41' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='drr_object' type-id='type-id-42' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='drr_freeobjects' type-id='type-id-43' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='drr_write' type-id='type-id-44' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='drr_free' type-id='type-id-45' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='drr_write_byref' type-id='type-id-46' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='drr_spill' type-id='type-id-47' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='drr_write_embedded' type-id='type-id-48' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='drr_object_range' type-id='type-id-49' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='drr_redact' type-id='type-id-50' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='drr_checksum' type-id='type-id-51' visibility='default'/>
      </data-member>
    </union-decl>
    <class-decl name='drr_begin' size-in-bits='2432' is-struct='yes' visibility='default' id='type-id-40'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='drr_magic' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='drr_versioninfo' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='drr_creation_time' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='drr_type' type-id='type-id-52' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='drr_flags' type-id='type-id-7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='drr_toguid' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='drr_fromguid' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='drr_toname' type-id='type-id-53' visibility='default'/>
      </data-member>
    </class-decl>
    <enum-decl name='dmu_objset_type' id='type-id-54'>
      <underlying-type type-id='type-id-19'/>
      <enumerator name='DMU_OST_NONE' value='0'/>
      <enumerator name='DMU_OST_META' value='1'/>
      <enumerator name='DMU_OST_ZFS' value='2'/>
      <enumerator name='DMU_OST_ZVOL' value='3'/>
      <enumerator name='DMU_OST_OTHER' value='4'/>
      <enumerator name='DMU_OST_ANY' value='5'/>
      <enumerator name='DMU_OST_NUMTYPES' value='6'/>
    </enum-decl>
    <typedef-decl name='dmu_objset_type_t' type-id='type-id-54' id='type-id-52'/>

    <array-type-def dimensions='1' type-id='type-id-2' size-in-bits='2048' id='type-id-53'>
      <subrange length='256' type-id='type-id-12' id='type-id-55'/>

    </array-type-def>
    <class-decl name='drr_end' size-in-bits='320' is-struct='yes' visibility='default' id='type-id-41'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='drr_checksum' type-id='type-id-56' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='drr_toguid' type-id='type-id-8' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='zio_cksum' size-in-bits='256' is-struct='yes' visibility='default' id='type-id-57'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='zc_word' type-id='type-id-58' visibility='default'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-8' size-in-bits='256' id='type-id-58'>
      <subrange length='4' type-id='type-id-12' id='type-id-59'/>

    </array-type-def>
    <typedef-decl name='zio_cksum_t' type-id='type-id-57' id='type-id-56'/>
    <class-decl name='drr_object' size-in-bits='448' is-struct='yes' visibility='default' id='type-id-42'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='drr_object' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='drr_type' type-id='type-id-60' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='drr_bonustype' type-id='type-id-60' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='drr_blksz' type-id='type-id-7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='drr_bonuslen' type-id='type-id-7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='drr_checksumtype' type-id='type-id-33' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='200'>
        <var-decl name='drr_compress' type-id='type-id-33' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='208'>
        <var-decl name='drr_dn_slots' type-id='type-id-33' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='216'>
        <var-decl name='drr_flags' type-id='type-id-33' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='drr_raw_bonuslen' type-id='type-id-7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='drr_toguid' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='drr_indblkshift' type-id='type-id-33' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='328'>
        <var-decl name='drr_nlevels' type-id='type-id-33' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='336'>
        <var-decl name='drr_nblkptr' type-id='type-id-33' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='344'>
        <var-decl name='drr_pad' type-id='type-id-61' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='drr_maxblkid' type-id='type-id-8' visibility='default'/>
      </data-member>
    </class-decl>
    <enum-decl name='dmu_object_type' id='type-id-62'>
      <underlying-type type-id='type-id-19'/>
      <enumerator name='DMU_OT_NONE' value='0'/>
      <enumerator name='DMU_OT_OBJECT_DIRECTORY' value='1'/>
      <enumerator name='DMU_OT_OBJECT_ARRAY' value='2'/>
      <enumerator name='DMU_OT_PACKED_NVLIST' value='3'/>
      <enumerator name='DMU_OT_PACKED_NVLIST_SIZE' value='4'/>
      <enumerator name='DMU_OT_BPOBJ' value='5'/>
      <enumerator name='DMU_OT_BPOBJ_HDR' value='6'/>
      <enumerator name='DMU_OT_SPACE_MAP_HEADER' value='7'/>
      <enumerator name='DMU_OT_SPACE_MAP' value='8'/>
      <enumerator name='DMU_OT_INTENT_LOG' value='9'/>
      <enumerator name='DMU_OT_DNODE' value='10'/>
      <enumerator name='DMU_OT_OBJSET' value='11'/>
      <enumerator name='DMU_OT_DSL_DIR' value='12'/>
      <enumerator name='DMU_OT_DSL_DIR_CHILD_MAP' value='13'/>
      <enumerator name='DMU_OT_DSL_DS_SNAP_MAP' value='14'/>
      <enumerator name='DMU_OT_DSL_PROPS' value='15'/>
      <enumerator name='DMU_OT_DSL_DATASET' value='16'/>
      <enumerator name='DMU_OT_ZNODE' value='17'/>
      <enumerator name='DMU_OT_OLDACL' value='18'/>
      <enumerator name='DMU_OT_PLAIN_FILE_CONTENTS' value='19'/>
      <enumerator name='DMU_OT_DIRECTORY_CONTENTS' value='20'/>
      <enumerator name='DMU_OT_MASTER_NODE' value='21'/>
      <enumerator name='DMU_OT_UNLINKED_SET' value='22'/>
      <enumerator name='DMU_OT_ZVOL' value='23'/>
      <enumerator name='DMU_OT_ZVOL_PROP' value='24'/>
      <enumerator name='DMU_OT_PLAIN_OTHER' value='25'/>
      <enumerator name='DMU_OT_UINT64_OTHER' value='26'/>
      <enumerator name='DMU_OT_ZAP_OTHER' value='27'/>
      <enumerator name='DMU_OT_ERROR_LOG' value='28'/>
      <enumerator name='DMU_OT_SPA_HISTORY' value='29'/>
      <enumerator name='DMU_OT_SPA_HISTORY_OFFSETS' value='30'/>
      <enumerator name='DMU_OT_POOL_PROPS' value='31'/>
      <enumerator name='DMU_OT_DSL_PERMS' value='32'/>
      <enumerator name='DMU_OT_ACL' value='33'/>
      <enumerator name='DMU_OT_SYSACL' value='34'/>
      <enumerator name='DMU_OT_FUID' value='35'/>
      <enumerator name='DMU_OT_FUID_SIZE' value='36'/>
      <enumerator name='DMU_OT_NEXT_CLONES' value='37'/>
      <enumerator name='DMU_OT_SCAN_QUEUE' value='38'/>
      <enumerator name='DMU_OT_USERGROUP_USED' value='39'/>
      <enumerator name='DMU_OT_USERGROUP_QUOTA' value='40'/>
      <enumerator name='DMU_OT_USERREFS' value='41'/>
      <enumerator name='DMU_OT_DDT_ZAP' value='42'/>
      <enumerator name='DMU_OT_DDT_STATS' value='43'/>
      <enumerator name='DMU_OT_SA' value='44'/>
      <enumerator name='DMU_OT_SA_MASTER_NODE' value='45'/>
      <enumerator name='DMU_OT_SA_ATTR_REGISTRATION' value='46'/>
      <enumerator name='DMU_OT_SA_ATTR_LAYOUTS' value='47'/>
      <enumerator name='DMU_OT_SCAN_XLATE' value='48'/>
      <enumerator name='DMU_OT_DEDUP' value='49'/>
      <enumerator name='DMU_OT_DEADLIST' value='50'/>
      <enumerator name='DMU_OT_DEADLIST_HDR' value='51'/>
      <enumerator name='DMU_OT_DSL_CLONES' value='52'/>
      <enumerator name='DMU_OT_BPOBJ_SUBOBJ' value='53'/>
      <enumerator name='DMU_OT_NUMTYPES' value='54'/>
      <enumerator name='DMU_OTN_UINT8_DATA' value='128'/>
      <enumerator name='DMU_OTN_UINT8_METADATA' value='192'/>
      <enumerator name='DMU_OTN_UINT16_DATA' value='129'/>
      <enumerator name='DMU_OTN_UINT16_METADATA' value='193'/>
      <enumerator name='DMU_OTN_UINT32_DATA' value='130'/>
      <enumerator name='DMU_OTN_UINT32_METADATA' value='194'/>
      <enumerator name='DMU_OTN_UINT64_DATA' value='131'/>
      <enumerator name='DMU_OTN_UINT64_METADATA' value='195'/>
      <enumerator name='DMU_OTN_ZAP_DATA' value='132'/>
      <enumerator name='DMU_OTN_ZAP_METADATA' value='196'/>
      <enumerator name='DMU_OTN_UINT8_ENC_DATA' value='160'/>
      <enumerator name='DMU_OTN_UINT8_ENC_METADATA' value='224'/>
      <enumerator name='DMU_OTN_UINT16_ENC_DATA' value='161'/>
      <enumerator name='DMU_OTN_UINT16_ENC_METADATA' value='225'/>
      <enumerator name='DMU_OTN_UINT32_ENC_DATA' value='162'/>
      <enumerator name='DMU_OTN_UINT32_ENC_METADATA' value='226'/>
      <enumerator name='DMU_OTN_UINT64_ENC_DATA' value='163'/>
      <enumerator name='DMU_OTN_UINT64_ENC_METADATA' value='227'/>
      <enumerator name='DMU_OTN_ZAP_ENC_DATA' value='164'/>
      <enumerator name='DMU_OTN_ZAP_ENC_METADATA' value='228'/>
    </enum-decl>
    <typedef-decl name='dmu_object_type_t' type-id='type-id-62' id='type-id-60'/>

    <array-type-def dimensions='1' type-id='type-id-33' size-in-bits='40' id='type-id-61'>
      <subrange length='5' type-id='type-id-12' id='type-id-63'/>

    </array-type-def>
    <class-decl name='drr_freeobjects' size-in-bits='192' is-struct='yes' visibility='default' id='type-id-43'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='drr_firstobj' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='drr_numobjs' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='drr_toguid' type-id='type-id-8' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='drr_write' size-in-bits='1088' is-struct='yes' visibility='default' id='type-id-44'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='drr_object' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='drr_type' type-id='type-id-60' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='drr_pad' type-id='type-id-7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='drr_offset' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='drr_logical_size' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='drr_toguid' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='drr_checksumtype' type-id='type-id-33' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='328'>
        <var-decl name='drr_flags' type-id='type-id-33' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='336'>
        <var-decl name='drr_compressiontype' type-id='type-id-33' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='344'>
        <var-decl name='drr_pad2' type-id='type-id-61' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='drr_key' type-id='type-id-64' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='drr_compressed_size' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='drr_salt' type-id='type-id-65' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='drr_iv' type-id='type-id-66' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='drr_mac' type-id='type-id-67' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='ddt_key' size-in-bits='320' is-struct='yes' visibility='default' id='type-id-68'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ddk_cksum' type-id='type-id-56' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='ddk_prop' type-id='type-id-8' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='ddt_key_t' type-id='type-id-68' id='type-id-64'/>

    <array-type-def dimensions='1' type-id='type-id-33' size-in-bits='64' id='type-id-65'>
      <subrange length='8' type-id='type-id-12' id='type-id-69'/>

    </array-type-def>

    <array-type-def dimensions='1' type-id='type-id-33' size-in-bits='96' id='type-id-66'>
      <subrange length='12' type-id='type-id-12' id='type-id-70'/>

    </array-type-def>

    <array-type-def dimensions='1' type-id='type-id-33' size-in-bits='128' id='type-id-67'>
      <subrange length='16' type-id='type-id-12' id='type-id-71'/>

    </array-type-def>
    <class-decl name='drr_free' size-in-bits='256' is-struct='yes' visibility='default' id='type-id-45'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='drr_object' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='drr_offset' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='drr_length' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='drr_toguid' type-id='type-id-8' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='drr_write_byref' size-in-bits='832' is-struct='yes' visibility='default' id='type-id-46'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='drr_object' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='drr_offset' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='drr_length' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='drr_toguid' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='drr_refguid' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='drr_refobject' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='drr_refoffset' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='drr_checksumtype' type-id='type-id-33' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='456'>
        <var-decl name='drr_flags' type-id='type-id-33' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='464'>
        <var-decl name='drr_pad2' type-id='type-id-72' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='drr_key' type-id='type-id-64' visibility='default'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-33' size-in-bits='48' id='type-id-72'>
      <subrange length='6' type-id='type-id-12' id='type-id-73'/>

    </array-type-def>
    <class-decl name='drr_spill' size-in-bits='640' is-struct='yes' visibility='default' id='type-id-47'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='drr_object' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='drr_length' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='drr_toguid' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='drr_flags' type-id='type-id-33' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='200'>
        <var-decl name='drr_compressiontype' type-id='type-id-33' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='208'>
        <var-decl name='drr_pad' type-id='type-id-72' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='drr_compressed_size' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='drr_salt' type-id='type-id-65' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='drr_iv' type-id='type-id-66' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='drr_mac' type-id='type-id-67' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='608'>
        <var-decl name='drr_type' type-id='type-id-60' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='drr_write_embedded' size-in-bits='384' is-struct='yes' visibility='default' id='type-id-48'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='drr_object' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='drr_offset' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='drr_length' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='drr_toguid' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='drr_compression' type-id='type-id-33' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='264'>
        <var-decl name='drr_etype' type-id='type-id-33' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='272'>
        <var-decl name='drr_pad' type-id='type-id-72' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='drr_lsize' type-id='type-id-7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='drr_psize' type-id='type-id-7' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='drr_object_range' size-in-bits='512' is-struct='yes' visibility='default' id='type-id-49'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='drr_firstobj' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='drr_numslots' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='drr_toguid' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='drr_salt' type-id='type-id-65' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='drr_iv' type-id='type-id-66' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='drr_mac' type-id='type-id-67' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='drr_flags' type-id='type-id-33' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='488'>
        <var-decl name='drr_pad' type-id='type-id-74' visibility='default'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-33' size-in-bits='24' id='type-id-74'>
      <subrange length='3' type-id='type-id-12' id='type-id-75'/>

    </array-type-def>
    <class-decl name='drr_redact' size-in-bits='256' is-struct='yes' visibility='default' id='type-id-50'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='drr_object' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='drr_offset' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='drr_length' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='drr_toguid' type-id='type-id-8' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='drr_checksum' size-in-bits='2432' is-struct='yes' visibility='default' id='type-id-51'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='drr_pad' type-id='type-id-76' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='drr_checksum' type-id='type-id-56' visibility='default'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-8' size-in-bits='2176' id='type-id-76'>
      <subrange length='34' type-id='type-id-12' id='type-id-77'/>

    </array-type-def>
    <typedef-decl name='dmu_replay_record_t' type-id='type-id-37' id='type-id-78'/>
    <qualified-type-def type-id='type-id-78' const='yes' id='type-id-79'/>
    <pointer-type-def type-id='type-id-79' size-in-bits='64' id='type-id-80'/>
    <pointer-type-def type-id='type-id-8' size-in-bits='64' id='type-id-81'/>
    <function-decl name='lzc_receive_with_cmdprops' mangled-name='lzc_receive_with_cmdprops' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_receive_with_cmdprops'>
      <parameter type-id='type-id-4' name='snapname'/>
      <parameter type-id='type-id-15' name='props'/>
      <parameter type-id='type-id-15' name='cmdprops'/>
      <parameter type-id='type-id-34' name='wkeydata'/>
      <parameter type-id='type-id-35' name='wkeylen'/>
      <parameter type-id='type-id-4' name='origin'/>
      <parameter type-id='type-id-23' name='force'/>
      <parameter type-id='type-id-23' name='resumable'/>
      <parameter type-id='type-id-23' name='raw'/>
      <parameter type-id='type-id-1' name='input_fd'/>
      <parameter type-id='type-id-80' name='begin_record'/>
      <parameter type-id='type-id-1' name='cleanup_fd'/>
      <parameter type-id='type-id-81' name='read_bytes'/>
      <parameter type-id='type-id-81' name='errflags'/>
      <parameter type-id='type-id-81' name='action_handle'/>
      <parameter type-id='type-id-16' name='errors'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='lzc_receive_one' mangled-name='lzc_receive_one' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_receive_one'>
      <parameter type-id='type-id-4' name='snapname'/>
      <parameter type-id='type-id-15' name='props'/>
      <parameter type-id='type-id-4' name='origin'/>
      <parameter type-id='type-id-23' name='force'/>
      <parameter type-id='type-id-23' name='resumable'/>
      <parameter type-id='type-id-23' name='raw'/>
      <parameter type-id='type-id-1' name='input_fd'/>
      <parameter type-id='type-id-80' name='begin_record'/>
      <parameter type-id='type-id-1' name='cleanup_fd'/>
      <parameter type-id='type-id-81' name='read_bytes'/>
      <parameter type-id='type-id-81' name='errflags'/>
      <parameter type-id='type-id-81' name='action_handle'/>
      <parameter type-id='type-id-16' name='errors'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='lzc_receive_with_header' mangled-name='lzc_receive_with_header' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_receive_with_header'>
      <parameter type-id='type-id-4' name='snapname'/>
      <parameter type-id='type-id-15' name='props'/>
      <parameter type-id='type-id-4' name='origin'/>
      <parameter type-id='type-id-23' name='force'/>
      <parameter type-id='type-id-23' name='resumable'/>
      <parameter type-id='type-id-23' name='raw'/>
      <parameter type-id='type-id-1' name='fd'/>
      <parameter type-id='type-id-80' name='begin_record'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='lzc_receive_resumable' mangled-name='lzc_receive_resumable' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_receive_resumable'>
      <parameter type-id='type-id-4' name='snapname'/>
      <parameter type-id='type-id-15' name='props'/>
      <parameter type-id='type-id-4' name='origin'/>
      <parameter type-id='type-id-23' name='force'/>
      <parameter type-id='type-id-23' name='raw'/>
      <parameter type-id='type-id-1' name='fd'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='lzc_receive' mangled-name='lzc_receive' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_receive'>
      <parameter type-id='type-id-4' name='snapname'/>
      <parameter type-id='type-id-15' name='props'/>
      <parameter type-id='type-id-4' name='origin'/>
      <parameter type-id='type-id-23' name='force'/>
      <parameter type-id='type-id-23' name='raw'/>
      <parameter type-id='type-id-1' name='fd'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <enum-decl name='lzc_send_flags' id='type-id-82'>
      <underlying-type type-id='type-id-19'/>
      <enumerator name='LZC_SEND_FLAG_EMBED_DATA' value='1'/>
      <enumerator name='LZC_SEND_FLAG_LARGE_BLOCK' value='2'/>
      <enumerator name='LZC_SEND_FLAG_COMPRESS' value='4'/>
      <enumerator name='LZC_SEND_FLAG_RAW' value='8'/>
      <enumerator name='LZC_SEND_FLAG_SAVED' value='16'/>
    </enum-decl>
    <function-decl name='lzc_send_space' mangled-name='lzc_send_space' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_send_space'>
      <parameter type-id='type-id-4' name='snapname'/>
      <parameter type-id='type-id-4' name='from'/>
      <parameter type-id='type-id-82' name='flags'/>
      <parameter type-id='type-id-81' name='spacep'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='lzc_send_space_resume_redacted' mangled-name='lzc_send_space_resume_redacted' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_send_space_resume_redacted'>
      <parameter type-id='type-id-4' name='snapname'/>
      <parameter type-id='type-id-4' name='from'/>
      <parameter type-id='type-id-82' name='flags'/>
      <parameter type-id='type-id-8' name='resumeobj'/>
      <parameter type-id='type-id-8' name='resumeoff'/>
      <parameter type-id='type-id-8' name='resume_bytes'/>
      <parameter type-id='type-id-4' name='redactbook'/>
      <parameter type-id='type-id-1' name='fd'/>
      <parameter type-id='type-id-81' name='spacep'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='lzc_send_resume_redacted' mangled-name='lzc_send_resume_redacted' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_send_resume_redacted'>
      <parameter type-id='type-id-4' name='snapname'/>
      <parameter type-id='type-id-4' name='from'/>
      <parameter type-id='type-id-1' name='fd'/>
      <parameter type-id='type-id-82' name='flags'/>
      <parameter type-id='type-id-8' name='resumeobj'/>
      <parameter type-id='type-id-8' name='resumeoff'/>
      <parameter type-id='type-id-4' name='redactbook'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='lzc_send_resume' mangled-name='lzc_send_resume' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_send_resume'>
      <parameter type-id='type-id-4' name='snapname'/>
      <parameter type-id='type-id-4' name='from'/>
      <parameter type-id='type-id-1' name='fd'/>
      <parameter type-id='type-id-82' name='flags'/>
      <parameter type-id='type-id-8' name='resumeobj'/>
      <parameter type-id='type-id-8' name='resumeoff'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='lzc_send_redacted' mangled-name='lzc_send_redacted' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_send_redacted'>
      <parameter type-id='type-id-4' name='snapname'/>
      <parameter type-id='type-id-4' name='from'/>
      <parameter type-id='type-id-1' name='fd'/>
      <parameter type-id='type-id-82' name='flags'/>
      <parameter type-id='type-id-4' name='redactbook'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='lzc_send' mangled-name='lzc_send' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_send'>
      <parameter type-id='type-id-4' name='snapname'/>
      <parameter type-id='type-id-4' name='from'/>
      <parameter type-id='type-id-1' name='fd'/>
      <parameter type-id='type-id-82' name='flags'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='lzc_get_holds' mangled-name='lzc_get_holds' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_get_holds'>
      <parameter type-id='type-id-4' name='pool'/>
      <parameter type-id='type-id-16' name='outnvl'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='lzc_release' mangled-name='lzc_release' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_release'>
      <parameter type-id='type-id-15' name='holds'/>
      <parameter type-id='type-id-16' name='errlist'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='lzc_hold' mangled-name='lzc_hold' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_hold'>
      <parameter type-id='type-id-15' name='holds'/>
      <parameter type-id='type-id-1' name='cleanup_fd'/>
      <parameter type-id='type-id-16' name='errlist'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='lzc_sync' mangled-name='lzc_sync' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_sync'>
      <parameter type-id='type-id-4' name='fsname'/>
      <parameter type-id='type-id-15' name='props'/>
      <parameter type-id='type-id-16' name='bmarks'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='lzc_exists' mangled-name='lzc_exists' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_exists'>
      <parameter type-id='type-id-4' name='dataset'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='lzc_snaprange_space' mangled-name='lzc_snaprange_space' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_snaprange_space'>
      <parameter type-id='type-id-4' name='firstsnap'/>
      <parameter type-id='type-id-4' name='lastsnap'/>
      <parameter type-id='type-id-81' name='usedp'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='lzc_destroy_snaps' mangled-name='lzc_destroy_snaps' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_destroy_snaps'>
      <parameter type-id='type-id-15' name='snaps'/>
      <parameter type-id='type-id-23' name='defer'/>
      <parameter type-id='type-id-16' name='errlist'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='lzc_snapshot' mangled-name='lzc_snapshot' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_snapshot'>
      <parameter type-id='type-id-15' name='snaps'/>
      <parameter type-id='type-id-15' name='props'/>
      <parameter type-id='type-id-16' name='errlist'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='lzc_destroy' mangled-name='lzc_destroy' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_destroy'>
      <parameter type-id='type-id-4' name='fsname'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='lzc_rename' mangled-name='lzc_rename' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_rename'>
      <parameter type-id='type-id-4' name='source'/>
      <parameter type-id='type-id-4' name='target'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='lzc_promote' mangled-name='lzc_promote' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_promote'>
      <parameter type-id='type-id-4' name='fsname'/>
      <parameter type-id='type-id-36' name='snapnamebuf'/>
      <parameter type-id='type-id-1' name='snapnamelen'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='lzc_clone' mangled-name='lzc_clone' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_clone'>
      <parameter type-id='type-id-4' name='fsname'/>
      <parameter type-id='type-id-4' name='origin'/>
      <parameter type-id='type-id-15' name='props'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <enum-decl name='lzc_dataset_type' id='type-id-83'>
      <underlying-type type-id='type-id-19'/>
      <enumerator name='LZC_DATSET_TYPE_ZFS' value='2'/>
      <enumerator name='LZC_DATSET_TYPE_ZVOL' value='3'/>
    </enum-decl>
    <function-decl name='lzc_create' mangled-name='lzc_create' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_create'>
      <parameter type-id='type-id-4' name='fsname'/>
      <parameter type-id='type-id-83' name='type'/>
      <parameter type-id='type-id-15' name='props'/>
      <parameter type-id='type-id-34' name='wkeydata'/>
      <parameter type-id='type-id-35' name='wkeylen'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <type-decl name='void' id='type-id-84'/>
    <function-decl name='libzfs_core_fini' mangled-name='libzfs_core_fini' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='libzfs_core_fini'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='libzfs_core_init' mangled-name='libzfs_core_init' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='libzfs_core_init'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='fnvlist_alloc' mangled-name='fnvlist_alloc' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='fnvlist_add_int32' mangled-name='fnvlist_add_int32' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_boolean_value' mangled-name='fnvlist_lookup_boolean_value' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='fnvlist_free' mangled-name='fnvlist_free' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='__stack_chk_fail' mangled-name='__stack_chk_fail' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='fnvlist_add_uint64' mangled-name='fnvlist_add_uint64' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='fnvlist_add_string' mangled-name='fnvlist_add_string' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='fnvlist_add_nvlist' mangled-name='fnvlist_add_nvlist' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='fnvlist_add_boolean_value' mangled-name='fnvlist_add_boolean_value' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='nvlist_free' mangled-name='nvlist_free' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='fnvlist_add_uint8_array' mangled-name='fnvlist_add_uint8_array' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='fnvlist_add_boolean' mangled-name='fnvlist_add_boolean' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='nvlist_next_nvpair' mangled-name='nvlist_next_nvpair' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='nvpair_name' mangled-name='nvpair_name' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='strlcpy' mangled-name='strlcpy' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='strcspn' mangled-name='strcspn' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_string' mangled-name='fnvlist_lookup_string' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='libspl_assertf' mangled-name='libspl_assertf' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='strrchr' mangled-name='strrchr' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='nvlist_lookup_nvlist' mangled-name='nvlist_lookup_nvlist' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='fnvlist_dup' mangled-name='fnvlist_dup' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='fnvlist_add_byte_array' mangled-name='fnvlist_add_byte_array' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='nvlist_lookup_uint64' mangled-name='nvlist_lookup_uint64' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='nvlist_unpack' mangled-name='nvlist_unpack' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='__builtin_memset' mangled-name='memset' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='fnvlist_pack' mangled-name='fnvlist_pack' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='malloc' mangled-name='malloc' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='zfs_ioctl_fd' mangled-name='zfs_ioctl_fd' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='__errno_location' mangled-name='__errno_location' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='fnvlist_pack_free' mangled-name='fnvlist_pack_free' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='free' mangled-name='free' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='__read_alias' mangled-name='read' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='strchr' mangled-name='strchr' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_uint64' mangled-name='fnvlist_lookup_uint64' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='fnvlist_unpack' mangled-name='fnvlist_unpack' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='pthread_mutex_lock' mangled-name='pthread_mutex_lock' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='close' mangled-name='close' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='pthread_mutex_unlock' mangled-name='pthread_mutex_unlock' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='__open_alias' mangled-name='open64' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='zutil_device_path.c' comp-dir-path='/home/runner/work/zfs/zfs/lib/libzutil' language='LANG_C99'>
    <function-decl name='zfs_strcmp_pathname' mangled-name='zfs_strcmp_pathname' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_strcmp_pathname'>
      <parameter type-id='type-id-4' name='name'/>
      <parameter type-id='type-id-4' name='cmp'/>
      <parameter type-id='type-id-1' name='wholedisk'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <typedef-decl name='size_t' type-id='type-id-12' id='type-id-85'/>
    <function-decl name='zfs_resolve_shortname' mangled-name='zfs_resolve_shortname' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_resolve_shortname'>
      <parameter type-id='type-id-4' name='name'/>
      <parameter type-id='type-id-36' name='path'/>
      <parameter type-id='type-id-85' name='len'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <type-decl name='long int' size-in-bits='64' id='type-id-86'/>
    <typedef-decl name='__ssize_t' type-id='type-id-86' id='type-id-87'/>
    <typedef-decl name='ssize_t' type-id='type-id-87' id='type-id-88'/>
    <function-decl name='zfs_dirnamelen' mangled-name='zfs_dirnamelen' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_dirnamelen'>
      <parameter type-id='type-id-4' name='path'/>
      <return type-id='type-id-88'/>
    </function-decl>
    <function-decl name='zfs_basename' mangled-name='zfs_basename' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_basename'>
      <parameter type-id='type-id-4' name='path'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='__builtin___snprintf_chk' mangled-name='__snprintf_chk' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='getenv' mangled-name='getenv' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='strdup' mangled-name='strdup' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='strtok_r' mangled-name='strtok_r' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='strlen' mangled-name='strlen' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='strcmp' mangled-name='strcmp' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='zfs_append_partition' mangled-name='zfs_append_partition' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='zpool_default_search_paths' mangled-name='zpool_default_search_paths' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='strlcat' mangled-name='strlcat' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='access' mangled-name='access' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='zutil_import.c' comp-dir-path='/home/runner/work/zfs/zfs/lib/libzutil' language='LANG_C99'>
    <pointer-type-def type-id='type-id-84' size-in-bits='64' id='type-id-89'/>
    <class-decl name='importargs' size-in-bits='448' is-struct='yes' visibility='default' id='type-id-90'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='path' type-id='type-id-91' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='paths' type-id='type-id-1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='poolname' type-id='type-id-4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='guid' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='cachefile' type-id='type-id-4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='can_be_active' type-id='type-id-23' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='scan' type-id='type-id-23' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='policy' type-id='type-id-15' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-36' size-in-bits='64' id='type-id-91'/>
    <typedef-decl name='importargs_t' type-id='type-id-90' id='type-id-92'/>
    <pointer-type-def type-id='type-id-92' size-in-bits='64' id='type-id-93'/>
    <class-decl name='pool_config_ops' size-in-bits='128' is-struct='yes' visibility='default' id='type-id-94'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='pco_refresh_config' type-id='type-id-95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='pco_pool_active' type-id='type-id-96' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='refresh_config_func_t' type-id='type-id-97' id='type-id-98'/>
    <pointer-type-def type-id='type-id-98' size-in-bits='64' id='type-id-95'/>
    <typedef-decl name='pool_active_func_t' type-id='type-id-99' id='type-id-100'/>
    <pointer-type-def type-id='type-id-100' size-in-bits='64' id='type-id-96'/>
    <qualified-type-def type-id='type-id-94' const='yes' id='type-id-101'/>
    <typedef-decl name='pool_config_ops_t' type-id='type-id-101' id='type-id-102'/>
    <pointer-type-def type-id='type-id-102' size-in-bits='64' id='type-id-103'/>
    <function-decl name='zpool_find_config' mangled-name='zpool_find_config' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_find_config'>
      <parameter type-id='type-id-89' name='hdl'/>
      <parameter type-id='type-id-4' name='target'/>
      <parameter type-id='type-id-16' name='configp'/>
      <parameter type-id='type-id-93' name='args'/>
      <parameter type-id='type-id-103' name='pco'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='zpool_search_import' mangled-name='zpool_search_import' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_search_import'>
      <parameter type-id='type-id-89' name='hdl'/>
      <parameter type-id='type-id-93' name='import'/>
      <parameter type-id='type-id-103' name='pco'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <pointer-type-def type-id='type-id-1' size-in-bits='64' id='type-id-104'/>
    <function-decl name='zpool_read_label' mangled-name='zpool_read_label' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_read_label'>
      <parameter type-id='type-id-1' name='fd'/>
      <parameter type-id='type-id-16' name='config'/>
      <parameter type-id='type-id-104' name='num_labels'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='nvpair_value_nvlist' mangled-name='nvpair_value_nvlist' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='strtoull' mangled-name='strtoull' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='nvlist_lookup_string' mangled-name='nvlist_lookup_string' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='strpbrk' mangled-name='strpbrk' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='__fxstat64' mangled-name='__fxstat64' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='calloc' mangled-name='calloc' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='avl_create' mangled-name='avl_create' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_nvlist' mangled-name='fnvlist_lookup_nvlist' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='pthread_mutex_init' mangled-name='pthread_mutex_init' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='pthread_mutex_destroy' mangled-name='pthread_mutex_destroy' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='fnvpair_value_nvlist' mangled-name='fnvpair_value_nvlist' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='nvlist_alloc' mangled-name='nvlist_alloc' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='nvlist_add_string' mangled-name='nvlist_add_string' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='nvlist_add_nvlist' mangled-name='nvlist_add_nvlist' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='dcgettext' mangled-name='dcgettext' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='strerror' mangled-name='strerror' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='__realpath_chk' mangled-name='__realpath_chk' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='strndup' mangled-name='strndup' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='zfs_basename' mangled-name='zfs_basename' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='zfs_dirnamelen' mangled-name='zfs_dirnamelen' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='__xstat' mangled-name='__xstat64' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='avl_destroy_nodes' mangled-name='avl_destroy_nodes' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='zpool_find_import_blkid' mangled-name='zpool_find_import_blkid' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='nvlist_empty' mangled-name='nvlist_empty' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='geteuid' mangled-name='geteuid' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='nvlist_lookup_nvlist_array' mangled-name='nvlist_lookup_nvlist_array' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='opendir' mangled-name='opendir' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='readdir64' mangled-name='readdir64' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='closedir' mangled-name='closedir' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='__asprintf_chk' mangled-name='__asprintf_chk' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='avl_find' mangled-name='avl_find' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='avl_insert' mangled-name='avl_insert' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='ioctl' mangled-name='ioctl' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='__pread64_alias' mangled-name='pread64' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='spl_pagesize' mangled-name='spl_pagesize' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='posix_memalign' mangled-name='posix_memalign' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='aio_error' mangled-name='aio_error64' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='aio_return' mangled-name='aio_return64' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='lio_listio' mangled-name='lio_listio64' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='exit' mangled-name='exit' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='__builtin___vsnprintf_chk' mangled-name='__vsnprintf_chk' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='__fprintf_chk' mangled-name='__fprintf_chk' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='update_vdev_config_dev_strs' mangled-name='update_vdev_config_dev_strs' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='strncmp' mangled-name='strncmp' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='nvlist_add_uint64' mangled-name='nvlist_add_uint64' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='nvlist_dup' mangled-name='nvlist_dup' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='nvlist_add_nvlist_array' mangled-name='nvlist_add_nvlist_array' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='nvlist_remove' mangled-name='nvlist_remove' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='nvlist_lookup_uint64_array' mangled-name='nvlist_lookup_uint64_array' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='nvlist_add_uint64_array' mangled-name='nvlist_add_uint64_array' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='sysconf' mangled-name='sysconf' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='tpool_create' mangled-name='tpool_create' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='avl_first' mangled-name='avl_first' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='tpool_dispatch' mangled-name='tpool_dispatch' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='avl_walk' mangled-name='avl_walk' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='tpool_wait' mangled-name='tpool_wait' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='tpool_destroy' mangled-name='tpool_destroy' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='avl_destroy' mangled-name='avl_destroy' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-99'>
      <parameter type-id='type-id-89'/>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-24'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-97'>
      <parameter type-id='type-id-89'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-15'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='zutil_nicenum.c' comp-dir-path='/home/runner/work/zfs/zfs/lib/libzutil' language='LANG_C99'>
    <function-decl name='zfs_nicebytes' mangled-name='zfs_nicebytes' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_nicebytes'>
      <parameter type-id='type-id-8' name='num'/>
      <parameter type-id='type-id-36' name='buf'/>
      <parameter type-id='type-id-85' name='buflen'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='zfs_niceraw' mangled-name='zfs_niceraw' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_niceraw'>
      <parameter type-id='type-id-8' name='num'/>
      <parameter type-id='type-id-36' name='buf'/>
      <parameter type-id='type-id-85' name='buflen'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='zfs_nicetime' mangled-name='zfs_nicetime' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_nicetime'>
      <parameter type-id='type-id-8' name='num'/>
      <parameter type-id='type-id-36' name='buf'/>
      <parameter type-id='type-id-85' name='buflen'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='zfs_nicenum' mangled-name='zfs_nicenum' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_nicenum'>
      <parameter type-id='type-id-8' name='num'/>
      <parameter type-id='type-id-36' name='buf'/>
      <parameter type-id='type-id-85' name='buflen'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <enum-decl name='zfs_nicenum_format' id='type-id-105'>
      <underlying-type type-id='type-id-19'/>
      <enumerator name='ZFS_NICENUM_1024' value='0'/>
      <enumerator name='ZFS_NICENUM_BYTES' value='1'/>
      <enumerator name='ZFS_NICENUM_TIME' value='2'/>
      <enumerator name='ZFS_NICENUM_RAW' value='3'/>
      <enumerator name='ZFS_NICENUM_RAWTIME' value='4'/>
    </enum-decl>
    <function-decl name='zfs_nicenum_format' mangled-name='zfs_nicenum_format' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_nicenum_format'>
      <parameter type-id='type-id-8' name='num'/>
      <parameter type-id='type-id-36' name='buf'/>
      <parameter type-id='type-id-85' name='buflen'/>
      <parameter type-id='type-id-105' name='format'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='zfs_isnumber' mangled-name='zfs_isnumber' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_isnumber'>
      <parameter type-id='type-id-4' name='str'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='powl' mangled-name='powl' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='__builtin_snprintf' mangled-name='snprintf' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='__ctype_b_loc' mangled-name='__ctype_b_loc' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='zutil_pool.c' comp-dir-path='/home/runner/work/zfs/zfs/lib/libzutil' language='LANG_C99'>
    <pointer-type-def type-id='type-id-16' size-in-bits='64' id='type-id-106'/>
    <pointer-type-def type-id='type-id-35' size-in-bits='64' id='type-id-107'/>
    <function-decl name='zpool_history_unpack' mangled-name='zpool_history_unpack' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_history_unpack'>
      <parameter type-id='type-id-36' name='buf'/>
      <parameter type-id='type-id-8' name='bytes_read'/>
      <parameter type-id='type-id-81' name='leftover'/>
      <parameter type-id='type-id-106' name='records'/>
      <parameter type-id='type-id-107' name='numrecords'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <class-decl name='ddt_stat' size-in-bits='512' is-struct='yes' visibility='default' id='type-id-108'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='dds_blocks' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='dds_lsize' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='dds_psize' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='dds_dsize' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='dds_ref_blocks' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='dds_ref_lsize' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='dds_ref_psize' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='dds_ref_dsize' type-id='type-id-8' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='ddt_stat_t' type-id='type-id-108' id='type-id-109'/>
    <qualified-type-def type-id='type-id-109' const='yes' id='type-id-110'/>
    <pointer-type-def type-id='type-id-110' size-in-bits='64' id='type-id-111'/>
    <class-decl name='ddt_histogram' size-in-bits='32768' is-struct='yes' visibility='default' id='type-id-112'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ddh_stat' type-id='type-id-113' visibility='default'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-109' size-in-bits='32768' id='type-id-113'>
      <subrange length='64' type-id='type-id-12' id='type-id-114'/>

    </array-type-def>
    <typedef-decl name='ddt_histogram_t' type-id='type-id-112' id='type-id-115'/>
    <qualified-type-def type-id='type-id-115' const='yes' id='type-id-116'/>
    <pointer-type-def type-id='type-id-116' size-in-bits='64' id='type-id-117'/>
    <function-decl name='zpool_dump_ddt' mangled-name='zpool_dump_ddt' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_dump_ddt'>
      <parameter type-id='type-id-111' name='dds_total'/>
      <parameter type-id='type-id-117' name='ddh'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='realloc' mangled-name='realloc' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='__builtin_putchar' mangled-name='putchar' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='__builtin_puts' mangled-name='puts' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='__printf_chk' mangled-name='__printf_chk' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='zfs_nicenum' mangled-name='zfs_nicenum' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='zfs_nicebytes' mangled-name='zfs_nicebytes' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='os/linux/zutil_device_path_os.c' comp-dir-path='/home/runner/work/zfs/zfs/lib/libzutil' language='LANG_C99'>
    <function-decl name='is_mpath_whole_disk' mangled-name='is_mpath_whole_disk' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='is_mpath_whole_disk'>
      <parameter type-id='type-id-4' name='path'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='zfs_get_underlying_path' mangled-name='zfs_get_underlying_path' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_get_underlying_path'>
      <parameter type-id='type-id-4' name='dev_name'/>
      <return type-id='type-id-36'/>
    </function-decl>
    <function-decl name='zfs_dev_is_whole_disk' mangled-name='zfs_dev_is_whole_disk' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_dev_is_whole_disk'>
      <parameter type-id='type-id-4' name='dev_name'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='zfs_dev_is_dm' mangled-name='zfs_dev_is_dm' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_dev_is_dm'>
      <parameter type-id='type-id-4' name='dev_name'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='zfs_get_enclosure_sysfs_path' mangled-name='zfs_get_enclosure_sysfs_path' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_get_enclosure_sysfs_path'>
      <parameter type-id='type-id-4' name='dev_name'/>
      <return type-id='type-id-36'/>
    </function-decl>
    <function-decl name='zfs_strip_path' mangled-name='zfs_strip_path' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_strip_path'>
      <parameter type-id='type-id-36' name='path'/>
      <return type-id='type-id-36'/>
    </function-decl>
    <function-decl name='zfs_strip_partition' mangled-name='zfs_strip_partition' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_strip_partition'>
      <parameter type-id='type-id-36' name='path'/>
      <return type-id='type-id-36'/>
    </function-decl>
    <function-decl name='zfs_append_partition' mangled-name='zfs_append_partition' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_append_partition'>
      <parameter type-id='type-id-36' name='path'/>
      <parameter type-id='type-id-85' name='max_len'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='udev_device_get_property_value' mangled-name='udev_device_get_property_value' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='udev_new' mangled-name='udev_new' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='udev_device_new_from_subsystem_sysname' mangled-name='udev_device_new_from_subsystem_sysname' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='udev_device_unref' mangled-name='udev_device_unref' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='__realpath_alias' mangled-name='realpath' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='efi_alloc_and_init' mangled-name='efi_alloc_and_init' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='efi_free' mangled-name='efi_free' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='__readlink_alias' mangled-name='readlink' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='strstr' mangled-name='strstr' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='os/linux/zutil_import_os.c' comp-dir-path='/home/runner/work/zfs/zfs/lib/libzutil' language='LANG_C99'>
    <function-decl name='update_vdev_config_dev_strs' mangled-name='update_vdev_config_dev_strs' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='update_vdev_config_dev_strs'>
      <parameter type-id='type-id-15' name='nv'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='zpool_label_disk_wait' mangled-name='zpool_label_disk_wait' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_label_disk_wait'>
      <parameter type-id='type-id-4' name='path'/>
      <parameter type-id='type-id-1' name='timeout_ms'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <class-decl name='udev_device' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-118'/>
    <pointer-type-def type-id='type-id-118' size-in-bits='64' id='type-id-119'/>
    <function-decl name='zfs_device_get_devid' mangled-name='zfs_device_get_devid' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_device_get_devid'>
      <parameter type-id='type-id-119' name='dev'/>
      <parameter type-id='type-id-36' name='bufptr'/>
      <parameter type-id='type-id-85' name='buflen'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <qualified-type-def type-id='type-id-4' const='yes' id='type-id-120'/>
    <pointer-type-def type-id='type-id-120' size-in-bits='64' id='type-id-121'/>
    <pointer-type-def type-id='type-id-85' size-in-bits='64' id='type-id-122'/>
    <function-decl name='zpool_default_search_paths' mangled-name='zpool_default_search_paths' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_default_search_paths'>
      <parameter type-id='type-id-122' name='count'/>
      <return type-id='type-id-121'/>
    </function-decl>
    <function-decl name='zfs_dev_flush' mangled-name='zfs_dev_flush' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_dev_flush'>
      <parameter type-id='type-id-1' name='fd'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='zfs_device_get_physical' mangled-name='zfs_device_get_physical' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_device_get_physical'>
      <parameter type-id='type-id-119' name='dev'/>
      <parameter type-id='type-id-36' name='bufptr'/>
      <parameter type-id='type-id-85' name='buflen'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='strtoul' mangled-name='strtoul' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='strncasecmp' mangled-name='strncasecmp' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='nvlist_remove_all' mangled-name='nvlist_remove_all' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='zfs_get_underlying_path' mangled-name='zfs_get_underlying_path' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='zfs_get_enclosure_sysfs_path' mangled-name='zfs_get_enclosure_sysfs_path' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='clock_gettime' mangled-name='clock_gettime' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='sched_yield' mangled-name='sched_yield' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='usleep' mangled-name='usleep' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='udev_unref' mangled-name='udev_unref' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='udev_list_entry_get_name' mangled-name='udev_list_entry_get_name' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='udev_device_get_devlinks_list_entry' mangled-name='udev_device_get_devlinks_list_entry' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='udev_list_entry_get_next' mangled-name='udev_list_entry_get_next' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='udev_device_get_parent_with_subsystem_devtype' mangled-name='udev_device_get_parent_with_subsystem_devtype' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='blkid_get_cache' mangled-name='blkid_get_cache' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='blkid_probe_all_new' mangled-name='blkid_probe_all_new' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='blkid_dev_iterate_begin' mangled-name='blkid_dev_iterate_begin' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='blkid_dev_set_search' mangled-name='blkid_dev_set_search' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='zutil_alloc' mangled-name='zutil_alloc' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='blkid_dev_next' mangled-name='blkid_dev_next' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='blkid_dev_devname' mangled-name='blkid_dev_devname' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='zutil_strdup' mangled-name='zutil_strdup' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='blkid_dev_iterate_end' mangled-name='blkid_dev_iterate_end' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='blkid_put_cache' mangled-name='blkid_put_cache' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='label_paths' mangled-name='label_paths' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='sscanf' mangled-name='sscanf' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='zpool_read_label' mangled-name='zpool_read_label' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='os/linux/zutil_compat.c' comp-dir-path='/home/runner/work/zfs/zfs/lib/libzutil' language='LANG_C99'>
    <class-decl name='zfs_cmd' size-in-bits='109952' is-struct='yes' visibility='default' id='type-id-123'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='zc_name' type-id='type-id-124' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32768'>
        <var-decl name='zc_nvlist_src' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32832'>
        <var-decl name='zc_nvlist_src_size' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32896'>
        <var-decl name='zc_nvlist_dst' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32960'>
        <var-decl name='zc_nvlist_dst_size' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='33024'>
        <var-decl name='zc_nvlist_dst_filled' type-id='type-id-23' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='33056'>
        <var-decl name='zc_pad2' type-id='type-id-1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='33088'>
        <var-decl name='zc_history' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='33152'>
        <var-decl name='zc_value' type-id='type-id-125' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='98688'>
        <var-decl name='zc_string' type-id='type-id-53' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='100736'>
        <var-decl name='zc_guid' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='100800'>
        <var-decl name='zc_nvlist_conf' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='100864'>
        <var-decl name='zc_nvlist_conf_size' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='100928'>
        <var-decl name='zc_cookie' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='100992'>
        <var-decl name='zc_objset_type' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='101056'>
        <var-decl name='zc_perm_action' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='101120'>
        <var-decl name='zc_history_len' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='101184'>
        <var-decl name='zc_history_offset' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='101248'>
        <var-decl name='zc_obj' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='101312'>
        <var-decl name='zc_iflags' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='101376'>
        <var-decl name='zc_share' type-id='type-id-126' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='101632'>
        <var-decl name='zc_objset_stats' type-id='type-id-127' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='103936'>
        <var-decl name='zc_begin_record' type-id='type-id-40' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='106368'>
        <var-decl name='zc_inject_record' type-id='type-id-128' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109184'>
        <var-decl name='zc_defer_destroy' type-id='type-id-7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109216'>
        <var-decl name='zc_flags' type-id='type-id-7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109248'>
        <var-decl name='zc_action_handle' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109312'>
        <var-decl name='zc_cleanup_fd' type-id='type-id-1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109344'>
        <var-decl name='zc_simple' type-id='type-id-33' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109352'>
        <var-decl name='zc_pad' type-id='type-id-74' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109376'>
        <var-decl name='zc_sendobj' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109440'>
        <var-decl name='zc_fromobj' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109504'>
        <var-decl name='zc_createtxg' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109568'>
        <var-decl name='zc_stat' type-id='type-id-129' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109888'>
        <var-decl name='zc_zoneid' type-id='type-id-8' visibility='default'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-2' size-in-bits='32768' id='type-id-124'>
      <subrange length='4096' type-id='type-id-12' id='type-id-130'/>

    </array-type-def>

    <array-type-def dimensions='1' type-id='type-id-2' size-in-bits='65536' id='type-id-125'>
      <subrange length='8192' type-id='type-id-12' id='type-id-131'/>

    </array-type-def>
    <class-decl name='zfs_share' size-in-bits='256' is-struct='yes' visibility='default' id='type-id-132'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='z_exportdata' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='z_sharedata' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='z_sharetype' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='z_sharemax' type-id='type-id-8' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='zfs_share_t' type-id='type-id-132' id='type-id-126'/>
    <class-decl name='dmu_objset_stats' size-in-bits='2304' is-struct='yes' visibility='default' id='type-id-133'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='dds_num_clones' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='dds_creation_txg' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='dds_guid' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='dds_type' type-id='type-id-52' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='dds_is_snapshot' type-id='type-id-33' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='232'>
        <var-decl name='dds_inconsistent' type-id='type-id-33' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='240'>
        <var-decl name='dds_redacted' type-id='type-id-33' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='248'>
        <var-decl name='dds_origin' type-id='type-id-53' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='dmu_objset_stats_t' type-id='type-id-133' id='type-id-127'/>
    <class-decl name='zinject_record' size-in-bits='2816' is-struct='yes' visibility='default' id='type-id-134'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='zi_objset' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='zi_object' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='zi_start' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='zi_end' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='zi_guid' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='zi_level' type-id='type-id-7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='zi_error' type-id='type-id-7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='zi_type' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='zi_freq' type-id='type-id-7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='zi_failfast' type-id='type-id-7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='zi_func' type-id='type-id-53' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2560'>
        <var-decl name='zi_iotype' type-id='type-id-7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2592'>
        <var-decl name='zi_duration' type-id='type-id-6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2624'>
        <var-decl name='zi_timer' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2688'>
        <var-decl name='zi_nlanes' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2752'>
        <var-decl name='zi_cmd' type-id='type-id-7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2784'>
        <var-decl name='zi_dvas' type-id='type-id-7' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='zinject_record_t' type-id='type-id-134' id='type-id-128'/>
    <class-decl name='zfs_stat' size-in-bits='320' is-struct='yes' visibility='default' id='type-id-135'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='zs_gen' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='zs_mode' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='zs_links' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='zs_ctime' type-id='type-id-136' visibility='default'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-8' size-in-bits='128' id='type-id-136'>
      <subrange length='2' type-id='type-id-12' id='type-id-137'/>

    </array-type-def>
    <typedef-decl name='zfs_stat_t' type-id='type-id-135' id='type-id-129'/>
    <typedef-decl name='zfs_cmd_t' type-id='type-id-123' id='type-id-138'/>
    <pointer-type-def type-id='type-id-138' size-in-bits='64' id='type-id-139'/>
    <function-decl name='zfs_ioctl_fd' mangled-name='zfs_ioctl_fd' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_ioctl_fd'>
      <parameter type-id='type-id-1' name='fd'/>
      <parameter type-id='type-id-12' name='request'/>
      <parameter type-id='type-id-139' name='zc'/>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../../module/avl/avl.c' comp-dir-path='/home/runner/work/zfs/zfs/lib/libavl' language='LANG_C99'>
    <class-decl name='avl_tree' size-in-bits='320' is-struct='yes' visibility='default' id='type-id-140'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='avl_root' type-id='type-id-141' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='avl_compar' type-id='type-id-142' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='avl_offset' type-id='type-id-85' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='avl_numnodes' type-id='type-id-143' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='avl_pad' type-id='type-id-85' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='avl_node' size-in-bits='192' is-struct='yes' visibility='default' id='type-id-144'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='avl_child' type-id='type-id-145' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='avl_pcb' type-id='type-id-146' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-144' size-in-bits='64' id='type-id-141'/>

    <array-type-def dimensions='1' type-id='type-id-141' size-in-bits='128' id='type-id-145'>
      <subrange length='2' type-id='type-id-12' id='type-id-137'/>

    </array-type-def>
    <typedef-decl name='uintptr_t' type-id='type-id-12' id='type-id-146'/>
    <pointer-type-def type-id='type-id-147' size-in-bits='64' id='type-id-142'/>
    <typedef-decl name='ulong_t' type-id='type-id-12' id='type-id-143'/>
    <typedef-decl name='avl_tree_t' type-id='type-id-140' id='type-id-148'/>
    <pointer-type-def type-id='type-id-148' size-in-bits='64' id='type-id-149'/>
    <pointer-type-def type-id='type-id-89' size-in-bits='64' id='type-id-150'/>
    <function-decl name='avl_destroy_nodes' mangled-name='avl_destroy_nodes' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_destroy_nodes'>
      <parameter type-id='type-id-149' name='tree'/>
      <parameter type-id='type-id-150' name='cookie'/>
      <return type-id='type-id-89'/>
    </function-decl>
    <function-decl name='avl_is_empty' mangled-name='avl_is_empty' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_is_empty'>
      <parameter type-id='type-id-149' name='tree'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='avl_numnodes' mangled-name='avl_numnodes' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_numnodes'>
      <parameter type-id='type-id-149' name='tree'/>
      <return type-id='type-id-143'/>
    </function-decl>
    <function-decl name='avl_destroy' mangled-name='avl_destroy' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_destroy'>
      <parameter type-id='type-id-149' name='tree'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='avl_create' mangled-name='avl_create' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_create'>
      <parameter type-id='type-id-149' name='tree'/>
      <parameter type-id='type-id-142' name='compar'/>
      <parameter type-id='type-id-85' name='size'/>
      <parameter type-id='type-id-85' name='offset'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='avl_swap' mangled-name='avl_swap' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_swap'>
      <parameter type-id='type-id-149' name='tree1'/>
      <parameter type-id='type-id-149' name='tree2'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='avl_update' mangled-name='avl_update' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_update'>
      <parameter type-id='type-id-149' name='t'/>
      <parameter type-id='type-id-89' name='obj'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='avl_update_gt' mangled-name='avl_update_gt' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_update_gt'>
      <parameter type-id='type-id-149' name='t'/>
      <parameter type-id='type-id-89' name='obj'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='avl_update_lt' mangled-name='avl_update_lt' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_update_lt'>
      <parameter type-id='type-id-149' name='t'/>
      <parameter type-id='type-id-89' name='obj'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='avl_remove' mangled-name='avl_remove' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_remove'>
      <parameter type-id='type-id-149' name='tree'/>
      <parameter type-id='type-id-89' name='data'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='avl_add' mangled-name='avl_add' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_add'>
      <parameter type-id='type-id-149' name='tree'/>
      <parameter type-id='type-id-89' name='new_node'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='avl_insert_here' mangled-name='avl_insert_here' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_insert_here'>
      <parameter type-id='type-id-149' name='tree'/>
      <parameter type-id='type-id-89' name='new_data'/>
      <parameter type-id='type-id-89' name='here'/>
      <parameter type-id='type-id-1' name='direction'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <typedef-decl name='avl_index_t' type-id='type-id-146' id='type-id-151'/>
    <function-decl name='avl_insert' mangled-name='avl_insert' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_insert'>
      <parameter type-id='type-id-149' name='tree'/>
      <parameter type-id='type-id-89' name='new_data'/>
      <parameter type-id='type-id-151' name='where'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <pointer-type-def type-id='type-id-151' size-in-bits='64' id='type-id-152'/>
    <function-decl name='avl_find' mangled-name='avl_find' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_find'>
      <parameter type-id='type-id-149' name='tree'/>
      <parameter type-id='type-id-89' name='value'/>
      <parameter type-id='type-id-152' name='where'/>
      <return type-id='type-id-89'/>
    </function-decl>
    <function-decl name='avl_nearest' mangled-name='avl_nearest' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_nearest'>
      <parameter type-id='type-id-149' name='tree'/>
      <parameter type-id='type-id-151' name='where'/>
      <parameter type-id='type-id-1' name='direction'/>
      <return type-id='type-id-89'/>
    </function-decl>
    <function-decl name='avl_last' mangled-name='avl_last' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_last'>
      <parameter type-id='type-id-149' name='tree'/>
      <return type-id='type-id-89'/>
    </function-decl>
    <function-decl name='avl_first' mangled-name='avl_first' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_first'>
      <parameter type-id='type-id-149' name='tree'/>
      <return type-id='type-id-89'/>
    </function-decl>
    <function-decl name='avl_walk' mangled-name='avl_walk' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_walk'>
      <parameter type-id='type-id-149' name='tree'/>
      <parameter type-id='type-id-89' name='oldnode'/>
      <parameter type-id='type-id-1' name='left'/>
      <return type-id='type-id-89'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-147'>
      <parameter type-id='type-id-89'/>
      <parameter type-id='type-id-89'/>
      <return type-id='type-id-1'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='thread_pool.c' comp-dir-path='/home/runner/work/zfs/zfs/lib/libtpool' language='LANG_C99'>
    <class-decl name='tpool' size-in-bits='2496' is-struct='yes' visibility='default' id='type-id-153'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tp_forw' type-id='type-id-154' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tp_back' type-id='type-id-154' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='tp_mutex' type-id='type-id-155' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='tp_busycv' type-id='type-id-156' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='tp_workcv' type-id='type-id-156' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='tp_waitcv' type-id='type-id-156' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='tp_active' type-id='type-id-157' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='tp_head' type-id='type-id-158' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='tp_tail' type-id='type-id-158' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='tp_attr' type-id='type-id-159' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <var-decl name='tp_flags' type-id='type-id-1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2272'>
        <var-decl name='tp_linger' type-id='type-id-35' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2304'>
        <var-decl name='tp_njobs' type-id='type-id-1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2336'>
        <var-decl name='tp_minimum' type-id='type-id-1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2368'>
        <var-decl name='tp_maximum' type-id='type-id-1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2400'>
        <var-decl name='tp_current' type-id='type-id-1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2432'>
        <var-decl name='tp_idle' type-id='type-id-1' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='tpool_t' type-id='type-id-153' id='type-id-160'/>
    <pointer-type-def type-id='type-id-160' size-in-bits='64' id='type-id-154'/>
    <union-decl name='__anonymous_union__' size-in-bits='320' is-anonymous='yes' visibility='default' id='type-id-161'>
      <data-member access='private'>
        <var-decl name='__data' type-id='type-id-162' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='__size' type-id='type-id-163' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='__align' type-id='type-id-86' visibility='default'/>
      </data-member>
    </union-decl>
    <class-decl name='__pthread_mutex_s' size-in-bits='320' is-struct='yes' visibility='default' id='type-id-162'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__lock' type-id='type-id-1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='__count' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__owner' type-id='type-id-1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='__nusers' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='__kind' type-id='type-id-1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='__spins' type-id='type-id-164' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='176'>
        <var-decl name='__elision' type-id='type-id-164' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='__list' type-id='type-id-165' visibility='default'/>
      </data-member>
    </class-decl>
    <type-decl name='short int' size-in-bits='16' id='type-id-164'/>
    <class-decl name='__pthread_internal_list' size-in-bits='128' is-struct='yes' visibility='default' id='type-id-166'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__prev' type-id='type-id-167' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__next' type-id='type-id-167' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-166' size-in-bits='64' id='type-id-167'/>
    <typedef-decl name='__pthread_list_t' type-id='type-id-166' id='type-id-165'/>

    <array-type-def dimensions='1' type-id='type-id-2' size-in-bits='320' id='type-id-163'>
      <subrange length='40' type-id='type-id-12' id='type-id-168'/>

    </array-type-def>
    <typedef-decl name='pthread_mutex_t' type-id='type-id-161' id='type-id-155'/>
    <union-decl name='__anonymous_union__' size-in-bits='384' is-anonymous='yes' visibility='default' id='type-id-169'>
      <data-member access='private'>
        <var-decl name='__data' type-id='type-id-170' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='__size' type-id='type-id-171' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='__align' type-id='type-id-172' visibility='default'/>
      </data-member>
    </union-decl>
    <class-decl name='__pthread_cond_s' size-in-bits='384' is-struct='yes' visibility='default' id='type-id-170'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='' type-id='type-id-173' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='__g_refs' type-id='type-id-174' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='__g_size' type-id='type-id-174' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='__g1_orig_size' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='__wrefs' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='__g_signals' type-id='type-id-174' visibility='default'/>
      </data-member>
    </class-decl>
    <union-decl name='__anonymous_union__' size-in-bits='64' is-anonymous='yes' visibility='default' id='type-id-173'>
      <data-member access='private'>
        <var-decl name='__wseq' type-id='type-id-175' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='__wseq32' type-id='type-id-176' visibility='default'/>
      </data-member>
    </union-decl>
    <type-decl name='long long unsigned int' size-in-bits='64' id='type-id-175'/>
    <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-176'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__low' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='__high' type-id='type-id-10' visibility='default'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-10' size-in-bits='64' id='type-id-174'>
      <subrange length='2' type-id='type-id-12' id='type-id-137'/>

    </array-type-def>

    <array-type-def dimensions='1' type-id='type-id-2' size-in-bits='384' id='type-id-171'>
      <subrange length='48' type-id='type-id-12' id='type-id-177'/>

    </array-type-def>
    <type-decl name='long long int' size-in-bits='64' id='type-id-172'/>
    <typedef-decl name='pthread_cond_t' type-id='type-id-169' id='type-id-156'/>
    <class-decl name='tpool_active' size-in-bits='128' is-struct='yes' visibility='default' id='type-id-178'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tpa_next' type-id='type-id-157' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tpa_tid' type-id='type-id-179' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='tpool_active_t' type-id='type-id-178' id='type-id-180'/>
    <pointer-type-def type-id='type-id-180' size-in-bits='64' id='type-id-157'/>
    <typedef-decl name='pthread_t' type-id='type-id-12' id='type-id-179'/>
    <class-decl name='tpool_job' size-in-bits='192' is-struct='yes' visibility='default' id='type-id-181'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tpj_next' type-id='type-id-158' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tpj_func' type-id='type-id-182' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='tpj_arg' type-id='type-id-89' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='tpool_job_t' type-id='type-id-181' id='type-id-183'/>
    <pointer-type-def type-id='type-id-183' size-in-bits='64' id='type-id-158'/>
    <pointer-type-def type-id='type-id-184' size-in-bits='64' id='type-id-182'/>
    <union-decl name='pthread_attr_t' size-in-bits='448' visibility='default' id='type-id-185'>
      <data-member access='private'>
        <var-decl name='__size' type-id='type-id-186' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='__align' type-id='type-id-86' visibility='default'/>
      </data-member>
    </union-decl>

    <array-type-def dimensions='1' type-id='type-id-2' size-in-bits='448' id='type-id-186'>
      <subrange length='56' type-id='type-id-12' id='type-id-187'/>

    </array-type-def>
    <typedef-decl name='pthread_attr_t' type-id='type-id-185' id='type-id-159'/>
    <function-decl name='tpool_member' mangled-name='tpool_member' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='tpool_member'>
      <parameter type-id='type-id-154' name='tpool'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='tpool_resume' mangled-name='tpool_resume' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='tpool_resume'>
      <parameter type-id='type-id-154' name='tpool'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='tpool_suspended' mangled-name='tpool_suspended' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='tpool_suspended'>
      <parameter type-id='type-id-154' name='tpool'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='tpool_suspend' mangled-name='tpool_suspend' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='tpool_suspend'>
      <parameter type-id='type-id-154' name='tpool'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='tpool_wait' mangled-name='tpool_wait' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='tpool_wait'>
      <parameter type-id='type-id-154' name='tpool'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='tpool_abandon' mangled-name='tpool_abandon' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='tpool_abandon'>
      <parameter type-id='type-id-154' name='tpool'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='tpool_destroy' mangled-name='tpool_destroy' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='tpool_destroy'>
      <parameter type-id='type-id-154' name='tpool'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='tpool_dispatch' mangled-name='tpool_dispatch' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='tpool_dispatch'>
      <parameter type-id='type-id-154' name='tpool'/>
      <parameter type-id='type-id-182' name='func'/>
      <parameter type-id='type-id-89' name='arg'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <pointer-type-def type-id='type-id-159' size-in-bits='64' id='type-id-188'/>
    <function-decl name='tpool_create' mangled-name='tpool_create' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='tpool_create'>
      <parameter type-id='type-id-35' name='min_threads'/>
      <parameter type-id='type-id-35' name='max_threads'/>
      <parameter type-id='type-id-35' name='linger'/>
      <parameter type-id='type-id-188' name='attr'/>
      <return type-id='type-id-154'/>
    </function-decl>
    <function-decl name='pthread_self' mangled-name='pthread_self' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='pthread_cond_broadcast' mangled-name='pthread_cond_broadcast' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='__sigsetjmp' mangled-name='__sigsetjmp' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='__pthread_register_cancel' mangled-name='__pthread_register_cancel' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='pthread_cond_wait' mangled-name='pthread_cond_wait' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='__pthread_unregister_cancel' mangled-name='__pthread_unregister_cancel' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='__pthread_unwind_next' mangled-name='__pthread_unwind_next' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='pthread_cancel' mangled-name='pthread_cancel' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='pthread_cond_signal' mangled-name='pthread_cond_signal' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='pthread_attr_init' mangled-name='pthread_attr_init' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='pthread_attr_getaffinity_np' mangled-name='pthread_attr_getaffinity_np' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='pthread_attr_destroy' mangled-name='pthread_attr_destroy' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='pthread_attr_setaffinity_np' mangled-name='pthread_attr_setaffinity_np' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='pthread_attr_getdetachstate' mangled-name='pthread_attr_getdetachstate' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='pthread_attr_setdetachstate' mangled-name='pthread_attr_setdetachstate' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='pthread_attr_getguardsize' mangled-name='pthread_attr_getguardsize' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='pthread_attr_setguardsize' mangled-name='pthread_attr_setguardsize' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='pthread_attr_getinheritsched' mangled-name='pthread_attr_getinheritsched' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='pthread_attr_setinheritsched' mangled-name='pthread_attr_setinheritsched' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='pthread_attr_getschedparam' mangled-name='pthread_attr_getschedparam' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='pthread_attr_setschedparam' mangled-name='pthread_attr_setschedparam' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='pthread_attr_getschedpolicy' mangled-name='pthread_attr_getschedpolicy' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='pthread_attr_setschedpolicy' mangled-name='pthread_attr_setschedpolicy' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='pthread_attr_getscope' mangled-name='pthread_attr_getscope' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='pthread_attr_setscope' mangled-name='pthread_attr_setscope' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='pthread_attr_getstack' mangled-name='pthread_attr_getstack' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='pthread_attr_setstack' mangled-name='pthread_attr_setstack' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='pthread_cond_init' mangled-name='pthread_cond_init' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='pthread_sigmask' mangled-name='pthread_sigmask' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='pthread_create' mangled-name='pthread_create' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='pthread_cond_timedwait' mangled-name='pthread_cond_timedwait' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='pthread_setcanceltype' mangled-name='pthread_setcanceltype' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='pthread_setcancelstate' mangled-name='pthread_setcancelstate' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-184'>
      <parameter type-id='type-id-89'/>
      <return type-id='type-id-84'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='assert.c' comp-dir-path='/home/runner/work/zfs/zfs/lib/libspl' language='LANG_C99'>
    <var-decl name='libspl_assert_ok' type-id='type-id-1' mangled-name='libspl_assert_ok' visibility='default' elf-symbol-id='libspl_assert_ok'/>
    <function-decl name='libspl_assertf' mangled-name='libspl_assertf' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='libspl_assertf'>
      <parameter type-id='type-id-4' name='file'/>
      <parameter type-id='type-id-4' name='func'/>
      <parameter type-id='type-id-1' name='line'/>
      <parameter type-id='type-id-4' name='format'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='__vfprintf_chk' mangled-name='__vfprintf_chk' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='__builtin_fputc' mangled-name='fputc' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='abort' mangled-name='abort' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='atomic.c' comp-dir-path='/home/runner/work/zfs/zfs/lib/libspl' language='LANG_C99'>
    <function-decl name='membar_consumer' mangled-name='membar_consumer' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='membar_consumer'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='membar_producer' mangled-name='membar_producer' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='membar_producer'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='membar_enter' mangled-name='membar_enter' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='membar_enter'>
      <return type-id='type-id-84'/>
    </function-decl>
    <qualified-type-def type-id='type-id-143' volatile='yes' id='type-id-189'/>
    <pointer-type-def type-id='type-id-189' size-in-bits='64' id='type-id-190'/>
    <function-decl name='atomic_clear_long_excl' mangled-name='atomic_clear_long_excl' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_clear_long_excl'>
      <parameter type-id='type-id-190' name='target'/>
      <parameter type-id='type-id-35' name='value'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='atomic_set_long_excl' mangled-name='atomic_set_long_excl' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_set_long_excl'>
      <parameter type-id='type-id-190' name='target'/>
      <parameter type-id='type-id-35' name='value'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <qualified-type-def type-id='type-id-84' volatile='yes' id='type-id-191'/>
    <pointer-type-def type-id='type-id-191' size-in-bits='64' id='type-id-192'/>
    <function-decl name='atomic_swap_ptr' mangled-name='atomic_swap_ptr' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_swap_ptr'>
      <parameter type-id='type-id-192' name='target'/>
      <parameter type-id='type-id-89' name='bits'/>
      <return type-id='type-id-89'/>
    </function-decl>
    <function-decl name='atomic_swap_ulong' mangled-name='atomic_swap_ulong' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_swap_ulong'>
      <parameter type-id='type-id-190' name='target'/>
      <parameter type-id='type-id-143' name='bits'/>
      <return type-id='type-id-143'/>
    </function-decl>
    <qualified-type-def type-id='type-id-7' volatile='yes' id='type-id-193'/>
    <pointer-type-def type-id='type-id-193' size-in-bits='64' id='type-id-194'/>
    <function-decl name='atomic_swap_32' mangled-name='atomic_swap_32' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_swap_32'>
      <parameter type-id='type-id-194' name='target'/>
      <parameter type-id='type-id-7' name='bits'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <type-decl name='unsigned short int' size-in-bits='16' id='type-id-195'/>
    <typedef-decl name='__uint16_t' type-id='type-id-195' id='type-id-196'/>
    <typedef-decl name='uint16_t' type-id='type-id-196' id='type-id-197'/>
    <qualified-type-def type-id='type-id-197' volatile='yes' id='type-id-198'/>
    <pointer-type-def type-id='type-id-198' size-in-bits='64' id='type-id-199'/>
    <function-decl name='atomic_swap_16' mangled-name='atomic_swap_16' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_swap_16'>
      <parameter type-id='type-id-199' name='target'/>
      <parameter type-id='type-id-197' name='bits'/>
      <return type-id='type-id-197'/>
    </function-decl>
    <qualified-type-def type-id='type-id-33' volatile='yes' id='type-id-200'/>
    <pointer-type-def type-id='type-id-200' size-in-bits='64' id='type-id-201'/>
    <function-decl name='atomic_swap_8' mangled-name='atomic_swap_8' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_swap_8'>
      <parameter type-id='type-id-201' name='target'/>
      <parameter type-id='type-id-33' name='bits'/>
      <return type-id='type-id-33'/>
    </function-decl>
    <function-decl name='atomic_cas_ptr' mangled-name='atomic_cas_ptr' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_cas_ptr'>
      <parameter type-id='type-id-192' name='target'/>
      <parameter type-id='type-id-89' name='exp'/>
      <parameter type-id='type-id-89' name='des'/>
      <return type-id='type-id-89'/>
    </function-decl>
    <function-decl name='atomic_and_ulong_nv' mangled-name='atomic_and_ulong_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_and_ulong_nv'>
      <parameter type-id='type-id-190' name='target'/>
      <parameter type-id='type-id-143' name='bits'/>
      <return type-id='type-id-143'/>
    </function-decl>
    <function-decl name='atomic_and_32_nv' mangled-name='atomic_and_32_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_and_32_nv'>
      <parameter type-id='type-id-194' name='target'/>
      <parameter type-id='type-id-7' name='bits'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='atomic_and_16_nv' mangled-name='atomic_and_16_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_and_16_nv'>
      <parameter type-id='type-id-199' name='target'/>
      <parameter type-id='type-id-197' name='bits'/>
      <return type-id='type-id-197'/>
    </function-decl>
    <function-decl name='atomic_and_8_nv' mangled-name='atomic_and_8_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_and_8_nv'>
      <parameter type-id='type-id-201' name='target'/>
      <parameter type-id='type-id-33' name='bits'/>
      <return type-id='type-id-33'/>
    </function-decl>
    <function-decl name='atomic_or_ulong_nv' mangled-name='atomic_or_ulong_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_or_ulong_nv'>
      <parameter type-id='type-id-190' name='target'/>
      <parameter type-id='type-id-143' name='bits'/>
      <return type-id='type-id-143'/>
    </function-decl>
    <function-decl name='atomic_or_32_nv' mangled-name='atomic_or_32_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_or_32_nv'>
      <parameter type-id='type-id-194' name='target'/>
      <parameter type-id='type-id-7' name='bits'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='atomic_or_16_nv' mangled-name='atomic_or_16_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_or_16_nv'>
      <parameter type-id='type-id-199' name='target'/>
      <parameter type-id='type-id-197' name='bits'/>
      <return type-id='type-id-197'/>
    </function-decl>
    <function-decl name='atomic_or_8_nv' mangled-name='atomic_or_8_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_or_8_nv'>
      <parameter type-id='type-id-201' name='target'/>
      <parameter type-id='type-id-33' name='bits'/>
      <return type-id='type-id-33'/>
    </function-decl>
    <function-decl name='atomic_sub_ptr_nv' mangled-name='atomic_sub_ptr_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_sub_ptr_nv'>
      <parameter type-id='type-id-192' name='target'/>
      <parameter type-id='type-id-88' name='bits'/>
      <return type-id='type-id-89'/>
    </function-decl>
    <function-decl name='atomic_sub_long_nv' mangled-name='atomic_sub_long_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_sub_long_nv'>
      <parameter type-id='type-id-190' name='target'/>
      <parameter type-id='type-id-86' name='bits'/>
      <return type-id='type-id-143'/>
    </function-decl>
    <function-decl name='atomic_sub_32_nv' mangled-name='atomic_sub_32_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_sub_32_nv'>
      <parameter type-id='type-id-194' name='target'/>
      <parameter type-id='type-id-6' name='bits'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <typedef-decl name='__int16_t' type-id='type-id-164' id='type-id-202'/>
    <typedef-decl name='int16_t' type-id='type-id-202' id='type-id-203'/>
    <function-decl name='atomic_sub_16_nv' mangled-name='atomic_sub_16_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_sub_16_nv'>
      <parameter type-id='type-id-199' name='target'/>
      <parameter type-id='type-id-203' name='bits'/>
      <return type-id='type-id-197'/>
    </function-decl>
    <type-decl name='signed char' size-in-bits='8' id='type-id-204'/>
    <typedef-decl name='__int8_t' type-id='type-id-204' id='type-id-205'/>
    <typedef-decl name='int8_t' type-id='type-id-205' id='type-id-206'/>
    <function-decl name='atomic_sub_8_nv' mangled-name='atomic_sub_8_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_sub_8_nv'>
      <parameter type-id='type-id-201' name='target'/>
      <parameter type-id='type-id-206' name='bits'/>
      <return type-id='type-id-33'/>
    </function-decl>
    <function-decl name='atomic_add_ptr_nv' mangled-name='atomic_add_ptr_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_ptr_nv'>
      <parameter type-id='type-id-192' name='target'/>
      <parameter type-id='type-id-88' name='bits'/>
      <return type-id='type-id-89'/>
    </function-decl>
    <function-decl name='atomic_add_long_nv' mangled-name='atomic_add_long_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_long_nv'>
      <parameter type-id='type-id-190' name='target'/>
      <parameter type-id='type-id-86' name='bits'/>
      <return type-id='type-id-143'/>
    </function-decl>
    <function-decl name='atomic_add_32_nv' mangled-name='atomic_add_32_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_32_nv'>
      <parameter type-id='type-id-194' name='target'/>
      <parameter type-id='type-id-6' name='bits'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='atomic_add_16_nv' mangled-name='atomic_add_16_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_16_nv'>
      <parameter type-id='type-id-199' name='target'/>
      <parameter type-id='type-id-203' name='bits'/>
      <return type-id='type-id-197'/>
    </function-decl>
    <function-decl name='atomic_add_8_nv' mangled-name='atomic_add_8_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_8_nv'>
      <parameter type-id='type-id-201' name='target'/>
      <parameter type-id='type-id-206' name='bits'/>
      <return type-id='type-id-33'/>
    </function-decl>
    <function-decl name='atomic_dec_ulong_nv' mangled-name='atomic_dec_ulong_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_dec_ulong_nv'>
      <parameter type-id='type-id-190' name='target'/>
      <return type-id='type-id-143'/>
    </function-decl>
    <function-decl name='atomic_dec_32_nv' mangled-name='atomic_dec_32_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_dec_32_nv'>
      <parameter type-id='type-id-194' name='target'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='atomic_dec_16_nv' mangled-name='atomic_dec_16_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_dec_16_nv'>
      <parameter type-id='type-id-199' name='target'/>
      <return type-id='type-id-197'/>
    </function-decl>
    <function-decl name='atomic_dec_8_nv' mangled-name='atomic_dec_8_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_dec_8_nv'>
      <parameter type-id='type-id-201' name='target'/>
      <return type-id='type-id-33'/>
    </function-decl>
    <function-decl name='atomic_inc_ulong_nv' mangled-name='atomic_inc_ulong_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_inc_ulong_nv'>
      <parameter type-id='type-id-190' name='target'/>
      <return type-id='type-id-143'/>
    </function-decl>
    <function-decl name='atomic_inc_32_nv' mangled-name='atomic_inc_32_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_inc_32_nv'>
      <parameter type-id='type-id-194' name='target'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='atomic_inc_16_nv' mangled-name='atomic_inc_16_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_inc_16_nv'>
      <parameter type-id='type-id-199' name='target'/>
      <return type-id='type-id-197'/>
    </function-decl>
    <function-decl name='atomic_inc_8_nv' mangled-name='atomic_inc_8_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_inc_8_nv'>
      <parameter type-id='type-id-201' name='target'/>
      <return type-id='type-id-33'/>
    </function-decl>
    <function-decl name='atomic_and_ulong' mangled-name='atomic_and_ulong' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_and_ulong'>
      <parameter type-id='type-id-190' name='target'/>
      <parameter type-id='type-id-143' name='bits'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='atomic_and_32' mangled-name='atomic_and_32' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_and_32'>
      <parameter type-id='type-id-194' name='target'/>
      <parameter type-id='type-id-7' name='bits'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='atomic_and_16' mangled-name='atomic_and_16' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_and_16'>
      <parameter type-id='type-id-199' name='target'/>
      <parameter type-id='type-id-197' name='bits'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='atomic_and_8' mangled-name='atomic_and_8' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_and_8'>
      <parameter type-id='type-id-201' name='target'/>
      <parameter type-id='type-id-33' name='bits'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='atomic_or_ulong' mangled-name='atomic_or_ulong' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_or_ulong'>
      <parameter type-id='type-id-190' name='target'/>
      <parameter type-id='type-id-143' name='bits'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='atomic_or_32' mangled-name='atomic_or_32' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_or_32'>
      <parameter type-id='type-id-194' name='target'/>
      <parameter type-id='type-id-7' name='bits'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='atomic_or_16' mangled-name='atomic_or_16' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_or_16'>
      <parameter type-id='type-id-199' name='target'/>
      <parameter type-id='type-id-197' name='bits'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='atomic_or_8' mangled-name='atomic_or_8' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_or_8'>
      <parameter type-id='type-id-201' name='target'/>
      <parameter type-id='type-id-33' name='bits'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='atomic_sub_ptr' mangled-name='atomic_sub_ptr' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_sub_ptr'>
      <parameter type-id='type-id-192' name='target'/>
      <parameter type-id='type-id-88' name='bits'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='atomic_sub_long' mangled-name='atomic_sub_long' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_sub_long'>
      <parameter type-id='type-id-190' name='target'/>
      <parameter type-id='type-id-86' name='bits'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='atomic_sub_32' mangled-name='atomic_sub_32' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_sub_32'>
      <parameter type-id='type-id-194' name='target'/>
      <parameter type-id='type-id-6' name='bits'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='atomic_sub_16' mangled-name='atomic_sub_16' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_sub_16'>
      <parameter type-id='type-id-199' name='target'/>
      <parameter type-id='type-id-203' name='bits'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='atomic_sub_8' mangled-name='atomic_sub_8' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_sub_8'>
      <parameter type-id='type-id-201' name='target'/>
      <parameter type-id='type-id-206' name='bits'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='atomic_add_ptr' mangled-name='atomic_add_ptr' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_ptr'>
      <parameter type-id='type-id-192' name='target'/>
      <parameter type-id='type-id-88' name='bits'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='atomic_add_long' mangled-name='atomic_add_long' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_long'>
      <parameter type-id='type-id-190' name='target'/>
      <parameter type-id='type-id-86' name='bits'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='atomic_add_32' mangled-name='atomic_add_32' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_32'>
      <parameter type-id='type-id-194' name='target'/>
      <parameter type-id='type-id-6' name='bits'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='atomic_add_16' mangled-name='atomic_add_16' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_16'>
      <parameter type-id='type-id-199' name='target'/>
      <parameter type-id='type-id-203' name='bits'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='atomic_add_8' mangled-name='atomic_add_8' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_8'>
      <parameter type-id='type-id-201' name='target'/>
      <parameter type-id='type-id-206' name='bits'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='atomic_dec_ulong' mangled-name='atomic_dec_ulong' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_dec_ulong'>
      <parameter type-id='type-id-190' name='target'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='atomic_dec_32' mangled-name='atomic_dec_32' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_dec_32'>
      <parameter type-id='type-id-194' name='target'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='atomic_dec_16' mangled-name='atomic_dec_16' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_dec_16'>
      <parameter type-id='type-id-199' name='target'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='atomic_dec_8' mangled-name='atomic_dec_8' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_dec_8'>
      <parameter type-id='type-id-201' name='target'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='atomic_inc_ulong' mangled-name='atomic_inc_ulong' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_inc_ulong'>
      <parameter type-id='type-id-190' name='target'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='atomic_inc_32' mangled-name='atomic_inc_32' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_inc_32'>
      <parameter type-id='type-id-194' name='target'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='atomic_inc_16' mangled-name='atomic_inc_16' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_inc_16'>
      <parameter type-id='type-id-199' name='target'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='atomic_inc_8' mangled-name='atomic_inc_8' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_inc_8'>
      <parameter type-id='type-id-201' name='target'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='atomic_cas_8' mangled-name='atomic_cas_8' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_cas_8'>
      <parameter type-id='type-id-201' name='target'/>
      <parameter type-id='type-id-33' name='exp'/>
      <parameter type-id='type-id-33' name='des'/>
      <return type-id='type-id-33'/>
    </function-decl>
    <function-decl name='atomic_cas_16' mangled-name='atomic_cas_16' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_cas_16'>
      <parameter type-id='type-id-199' name='target'/>
      <parameter type-id='type-id-197' name='exp'/>
      <parameter type-id='type-id-197' name='des'/>
      <return type-id='type-id-197'/>
    </function-decl>
    <function-decl name='atomic_cas_32' mangled-name='atomic_cas_32' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_cas_32'>
      <parameter type-id='type-id-194' name='target'/>
      <parameter type-id='type-id-7' name='exp'/>
      <parameter type-id='type-id-7' name='des'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='atomic_cas_ulong' mangled-name='atomic_cas_ulong' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_cas_ulong'>
      <parameter type-id='type-id-190' name='target'/>
      <parameter type-id='type-id-143' name='exp'/>
      <parameter type-id='type-id-143' name='des'/>
      <return type-id='type-id-143'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='getexecname.c' comp-dir-path='/home/runner/work/zfs/zfs/lib/libspl' language='LANG_C99'>
    <function-decl name='getexecname' mangled-name='getexecname' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getexecname'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='getexecname_impl' mangled-name='getexecname_impl' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='os/linux/gethostid.c' comp-dir-path='/home/runner/work/zfs/zfs/lib/libspl' language='LANG_C99'>
    <function-decl name='get_system_hostid' mangled-name='get_system_hostid' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='get_system_hostid'>
      <return type-id='type-id-12'/>
    </function-decl>
    <function-decl name='fopen' mangled-name='fopen64' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='fscanf' mangled-name='fscanf' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='fclose' mangled-name='fclose' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='os/linux/getmntany.c' comp-dir-path='/home/runner/work/zfs/zfs/lib/libspl' language='LANG_C99'>
    <class-decl name='extmnttab' size-in-bits='320' is-struct='yes' visibility='default' id='type-id-207'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mnt_special' type-id='type-id-36' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='mnt_mountp' type-id='type-id-36' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='mnt_fstype' type-id='type-id-36' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='mnt_mntopts' type-id='type-id-36' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='mnt_major' type-id='type-id-35' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='mnt_minor' type-id='type-id-35' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-207' size-in-bits='64' id='type-id-208'/>
    <class-decl name='stat64' size-in-bits='1152' is-struct='yes' visibility='default' id='type-id-209'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='st_dev' type-id='type-id-210' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='st_ino' type-id='type-id-211' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='st_nlink' type-id='type-id-212' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='st_mode' type-id='type-id-213' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='st_uid' type-id='type-id-214' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='st_gid' type-id='type-id-215' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='__pad0' type-id='type-id-1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='st_rdev' type-id='type-id-210' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='st_size' type-id='type-id-216' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='st_blksize' type-id='type-id-217' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='st_blocks' type-id='type-id-218' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='st_atim' type-id='type-id-219' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='st_mtim' type-id='type-id-219' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='st_ctim' type-id='type-id-219' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='__glibc_reserved' type-id='type-id-220' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__dev_t' type-id='type-id-12' id='type-id-210'/>
    <typedef-decl name='__ino64_t' type-id='type-id-12' id='type-id-211'/>
    <typedef-decl name='__nlink_t' type-id='type-id-12' id='type-id-212'/>
    <typedef-decl name='__mode_t' type-id='type-id-10' id='type-id-213'/>
    <typedef-decl name='__uid_t' type-id='type-id-10' id='type-id-214'/>
    <typedef-decl name='__gid_t' type-id='type-id-10' id='type-id-215'/>
    <typedef-decl name='__off_t' type-id='type-id-86' id='type-id-216'/>
    <typedef-decl name='__blksize_t' type-id='type-id-86' id='type-id-217'/>
    <typedef-decl name='__blkcnt64_t' type-id='type-id-86' id='type-id-218'/>
    <class-decl name='timespec' size-in-bits='128' is-struct='yes' visibility='default' id='type-id-219'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tv_sec' type-id='type-id-221' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tv_nsec' type-id='type-id-222' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__time_t' type-id='type-id-86' id='type-id-221'/>
    <typedef-decl name='__syscall_slong_t' type-id='type-id-86' id='type-id-222'/>

    <array-type-def dimensions='1' type-id='type-id-222' size-in-bits='192' id='type-id-220'>
      <subrange length='3' type-id='type-id-12' id='type-id-75'/>

    </array-type-def>
    <pointer-type-def type-id='type-id-209' size-in-bits='64' id='type-id-223'/>
    <function-decl name='getextmntent' mangled-name='getextmntent' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getextmntent'>
      <parameter type-id='type-id-4' name='path'/>
      <parameter type-id='type-id-208' name='entry'/>
      <parameter type-id='type-id-223' name='statbuf'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <class-decl name='_IO_FILE' size-in-bits='1728' is-struct='yes' visibility='default' id='type-id-224'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_flags' type-id='type-id-1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_IO_read_ptr' type-id='type-id-36' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_IO_read_end' type-id='type-id-36' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_IO_read_base' type-id='type-id-36' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='_IO_write_base' type-id='type-id-36' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='_IO_write_ptr' type-id='type-id-36' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_IO_write_end' type-id='type-id-36' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='_IO_buf_base' type-id='type-id-36' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='_IO_buf_end' type-id='type-id-36' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='_IO_save_base' type-id='type-id-36' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='_IO_backup_base' type-id='type-id-36' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='_IO_save_end' type-id='type-id-36' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='_markers' type-id='type-id-225' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='_chain' type-id='type-id-226' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='_fileno' type-id='type-id-1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='_flags2' type-id='type-id-1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='_old_offset' type-id='type-id-216' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='_cur_column' type-id='type-id-195' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1040'>
        <var-decl name='_vtable_offset' type-id='type-id-204' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1048'>
        <var-decl name='_shortbuf' type-id='type-id-227' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='_offset' type-id='type-id-228' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='__pad1' type-id='type-id-89' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='__pad2' type-id='type-id-89' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='__pad3' type-id='type-id-89' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='__pad4' type-id='type-id-89' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='__pad5' type-id='type-id-85' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='_mode' type-id='type-id-1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='_unused2' type-id='type-id-229' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='_IO_marker' size-in-bits='192' is-struct='yes' visibility='default' id='type-id-230'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_next' type-id='type-id-225' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_sbuf' type-id='type-id-226' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_pos' type-id='type-id-1' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-230' size-in-bits='64' id='type-id-225'/>
    <pointer-type-def type-id='type-id-224' size-in-bits='64' id='type-id-226'/>

    <array-type-def dimensions='1' type-id='type-id-2' size-in-bits='8' id='type-id-227'>
      <subrange length='1' type-id='type-id-12' id='type-id-231'/>

    </array-type-def>
    <typedef-decl name='__off64_t' type-id='type-id-86' id='type-id-228'/>

    <array-type-def dimensions='1' type-id='type-id-2' size-in-bits='160' id='type-id-229'>
      <subrange length='20' type-id='type-id-12' id='type-id-232'/>

    </array-type-def>
    <typedef-decl name='FILE' type-id='type-id-224' id='type-id-233'/>
    <pointer-type-def type-id='type-id-233' size-in-bits='64' id='type-id-234'/>
    <class-decl name='mnttab' size-in-bits='256' is-struct='yes' visibility='default' id='type-id-235'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mnt_special' type-id='type-id-36' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='mnt_mountp' type-id='type-id-36' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='mnt_fstype' type-id='type-id-36' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='mnt_mntopts' type-id='type-id-36' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-235' size-in-bits='64' id='type-id-236'/>
    <function-decl name='getmntany' mangled-name='getmntany' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getmntany'>
      <parameter type-id='type-id-234' name='fp'/>
      <parameter type-id='type-id-236' name='mgetp'/>
      <parameter type-id='type-id-236' name='mrefp'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_sol_getmntent' mangled-name='_sol_getmntent' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_sol_getmntent'>
      <parameter type-id='type-id-234' name='fp'/>
      <parameter type-id='type-id-236' name='mgetp'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='__builtin_fwrite' mangled-name='fwrite' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='feof' mangled-name='feof' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='getmntent_r' mangled-name='getmntent_r' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='list.c' comp-dir-path='/home/runner/work/zfs/zfs/lib/libspl' language='LANG_C99'>
    <class-decl name='list' size-in-bits='256' is-struct='yes' visibility='default' id='type-id-237'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='list_size' type-id='type-id-85' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='list_offset' type-id='type-id-85' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='list_head' type-id='type-id-238' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='list_node' size-in-bits='128' is-struct='yes' visibility='default' id='type-id-238'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-239' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='prev' type-id='type-id-239' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-238' size-in-bits='64' id='type-id-239'/>
    <typedef-decl name='list_t' type-id='type-id-237' id='type-id-240'/>
    <pointer-type-def type-id='type-id-240' size-in-bits='64' id='type-id-241'/>
    <function-decl name='list_is_empty' mangled-name='list_is_empty' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_is_empty'>
      <parameter type-id='type-id-241' name='list'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <typedef-decl name='list_node_t' type-id='type-id-238' id='type-id-242'/>
    <pointer-type-def type-id='type-id-242' size-in-bits='64' id='type-id-243'/>
    <function-decl name='list_link_active' mangled-name='list_link_active' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_link_active'>
      <parameter type-id='type-id-243' name='ln'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='list_link_init' mangled-name='list_link_init' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_link_init'>
      <parameter type-id='type-id-243' name='ln'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='list_link_replace' mangled-name='list_link_replace' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_link_replace'>
      <parameter type-id='type-id-243' name='lold'/>
      <parameter type-id='type-id-243' name='lnew'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='list_move_tail' mangled-name='list_move_tail' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_move_tail'>
      <parameter type-id='type-id-241' name='dst'/>
      <parameter type-id='type-id-241' name='src'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='list_prev' mangled-name='list_prev' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_prev'>
      <parameter type-id='type-id-241' name='list'/>
      <parameter type-id='type-id-89' name='object'/>
      <return type-id='type-id-89'/>
    </function-decl>
    <function-decl name='list_next' mangled-name='list_next' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_next'>
      <parameter type-id='type-id-241' name='list'/>
      <parameter type-id='type-id-89' name='object'/>
      <return type-id='type-id-89'/>
    </function-decl>
    <function-decl name='list_tail' mangled-name='list_tail' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_tail'>
      <parameter type-id='type-id-241' name='list'/>
      <return type-id='type-id-89'/>
    </function-decl>
    <function-decl name='list_head' mangled-name='list_head' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_head'>
      <parameter type-id='type-id-241' name='list'/>
      <return type-id='type-id-89'/>
    </function-decl>
    <function-decl name='list_remove_tail' mangled-name='list_remove_tail' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_remove_tail'>
      <parameter type-id='type-id-241' name='list'/>
      <return type-id='type-id-89'/>
    </function-decl>
    <function-decl name='list_remove_head' mangled-name='list_remove_head' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_remove_head'>
      <parameter type-id='type-id-241' name='list'/>
      <return type-id='type-id-89'/>
    </function-decl>
    <function-decl name='list_remove' mangled-name='list_remove' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_remove'>
      <parameter type-id='type-id-241' name='list'/>
      <parameter type-id='type-id-89' name='object'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='list_insert_tail' mangled-name='list_insert_tail' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_insert_tail'>
      <parameter type-id='type-id-241' name='list'/>
      <parameter type-id='type-id-89' name='object'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='list_insert_head' mangled-name='list_insert_head' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_insert_head'>
      <parameter type-id='type-id-241' name='list'/>
      <parameter type-id='type-id-89' name='object'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='list_insert_before' mangled-name='list_insert_before' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_insert_before'>
      <parameter type-id='type-id-241' name='list'/>
      <parameter type-id='type-id-89' name='object'/>
      <parameter type-id='type-id-89' name='nobject'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='list_insert_after' mangled-name='list_insert_after' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_insert_after'>
      <parameter type-id='type-id-241' name='list'/>
      <parameter type-id='type-id-89' name='object'/>
      <parameter type-id='type-id-89' name='nobject'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='list_destroy' mangled-name='list_destroy' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_destroy'>
      <parameter type-id='type-id-241' name='list'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='list_create' mangled-name='list_create' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_create'>
      <parameter type-id='type-id-241' name='list'/>
      <parameter type-id='type-id-85' name='size'/>
      <parameter type-id='type-id-85' name='offset'/>
      <return type-id='type-id-84'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='mkdirp.c' comp-dir-path='/home/runner/work/zfs/zfs/lib/libspl' language='LANG_C99'>
    <typedef-decl name='mode_t' type-id='type-id-213' id='type-id-244'/>
    <function-decl name='mkdirp' mangled-name='mkdirp' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='mkdirp'>
      <parameter type-id='type-id-4' name='d'/>
      <parameter type-id='type-id-244' name='mode'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='__mbstowcs_alias' mangled-name='mbstowcs' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='__wcstombs_alias' mangled-name='wcstombs' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='mkdir' mangled-name='mkdir' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='page.c' comp-dir-path='/home/runner/work/zfs/zfs/lib/libspl' language='LANG_C99'>
    <function-decl name='spl_pagesize' mangled-name='spl_pagesize' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spl_pagesize'>
      <return type-id='type-id-85'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='strlcat.c' comp-dir-path='/home/runner/work/zfs/zfs/lib/libspl' language='LANG_C99'>
    <function-decl name='strlcat' mangled-name='strlcat' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strlcat'>
      <parameter type-id='type-id-36' name='dst'/>
      <parameter type-id='type-id-4' name='src'/>
      <parameter type-id='type-id-85' name='dstsize'/>
      <return type-id='type-id-85'/>
    </function-decl>
    <function-decl name='__builtin_memcpy' mangled-name='memcpy' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='strlcpy.c' comp-dir-path='/home/runner/work/zfs/zfs/lib/libspl' language='LANG_C99'>
    <function-decl name='strlcpy' mangled-name='strlcpy' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strlcpy'>
      <parameter type-id='type-id-36' name='dst'/>
      <parameter type-id='type-id-4' name='src'/>
      <parameter type-id='type-id-85' name='len'/>
      <return type-id='type-id-85'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='timestamp.c' comp-dir-path='/home/runner/work/zfs/zfs/lib/libspl' language='LANG_C99'>
    <function-decl name='print_timestamp' mangled-name='print_timestamp' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='print_timestamp'>
      <parameter type-id='type-id-35' name='timestamp_fmt'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='localtime' mangled-name='localtime' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='strftime' mangled-name='strftime' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='time' mangled-name='time' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='nl_langinfo' mangled-name='nl_langinfo' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='os/linux/zone.c' comp-dir-path='/home/runner/work/zfs/zfs/lib/libspl' language='LANG_C99'>
    <typedef-decl name='zoneid_t' type-id='type-id-1' id='type-id-245'/>
    <function-decl name='getzoneid' mangled-name='getzoneid' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getzoneid'>
      <return type-id='type-id-245'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='rdwr_efi.c' comp-dir-path='/home/runner/work/zfs/zfs/lib/libefi' language='LANG_C99'>
    <var-decl name='efi_debug' type-id='type-id-1' mangled-name='efi_debug' visibility='default' elf-symbol-id='efi_debug'/>
    <class-decl name='dk_gpt' size-in-bits='1920' is-struct='yes' visibility='default' id='type-id-246'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='efi_version' type-id='type-id-35' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='efi_nparts' type-id='type-id-35' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='efi_part_size' type-id='type-id-35' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='efi_lbasize' type-id='type-id-35' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='efi_last_lba' type-id='type-id-247' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='efi_first_u_lba' type-id='type-id-247' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='efi_last_u_lba' type-id='type-id-247' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='efi_disk_uguid' type-id='type-id-248' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='efi_flags' type-id='type-id-35' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='efi_reserved1' type-id='type-id-35' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='efi_altern_lba' type-id='type-id-247' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='efi_reserved' type-id='type-id-249' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='efi_parts' type-id='type-id-250' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='longlong_t' type-id='type-id-172' id='type-id-251'/>
    <typedef-decl name='diskaddr_t' type-id='type-id-251' id='type-id-247'/>
    <class-decl name='uuid' size-in-bits='128' is-struct='yes' visibility='default' id='type-id-248'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='time_low' type-id='type-id-7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='time_mid' type-id='type-id-197' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='time_hi_and_version' type-id='type-id-197' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='clock_seq_hi_and_reserved' type-id='type-id-33' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='72'>
        <var-decl name='clock_seq_low' type-id='type-id-33' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='node_addr' type-id='type-id-72' visibility='default'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-35' size-in-bits='384' id='type-id-249'>
      <subrange length='12' type-id='type-id-12' id='type-id-70'/>

    </array-type-def>
    <class-decl name='dk_part' size-in-bits='960' is-struct='yes' visibility='default' id='type-id-252'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='p_start' type-id='type-id-247' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='p_size' type-id='type-id-247' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='p_guid' type-id='type-id-248' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='p_tag' type-id='type-id-253' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='272'>
        <var-decl name='p_flag' type-id='type-id-253' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='p_name' type-id='type-id-254' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='p_uguid' type-id='type-id-248' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='p_resv' type-id='type-id-255' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='ushort_t' type-id='type-id-195' id='type-id-253'/>

    <array-type-def dimensions='1' type-id='type-id-2' size-in-bits='288' id='type-id-254'>
      <subrange length='36' type-id='type-id-12' id='type-id-256'/>

    </array-type-def>

    <array-type-def dimensions='1' type-id='type-id-35' size-in-bits='256' id='type-id-255'>
      <subrange length='8' type-id='type-id-12' id='type-id-69'/>

    </array-type-def>

    <array-type-def dimensions='1' type-id='type-id-252' size-in-bits='960' id='type-id-250'>
      <subrange length='1' type-id='type-id-12' id='type-id-231'/>

    </array-type-def>
    <pointer-type-def type-id='type-id-246' size-in-bits='64' id='type-id-257'/>
    <function-decl name='efi_err_check' mangled-name='efi_err_check' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_err_check'>
      <parameter type-id='type-id-257' name='vtoc'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='efi_type' mangled-name='efi_type' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_type'>
      <parameter type-id='type-id-1' name='fd'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='efi_free' mangled-name='efi_free' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_free'>
      <parameter type-id='type-id-257' name='ptr'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='efi_write' mangled-name='efi_write' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_write'>
      <parameter type-id='type-id-1' name='fd'/>
      <parameter type-id='type-id-257' name='vtoc'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='efi_use_whole_disk' mangled-name='efi_use_whole_disk' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_use_whole_disk'>
      <parameter type-id='type-id-1' name='fd'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='efi_rescan' mangled-name='efi_rescan' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_rescan'>
      <parameter type-id='type-id-1' name='fd'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <pointer-type-def type-id='type-id-257' size-in-bits='64' id='type-id-258'/>
    <function-decl name='efi_alloc_and_read' mangled-name='efi_alloc_and_read' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_alloc_and_read'>
      <parameter type-id='type-id-1' name='fd'/>
      <parameter type-id='type-id-258' name='vtoc'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='efi_alloc_and_init' mangled-name='efi_alloc_and_init' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_alloc_and_init'>
      <parameter type-id='type-id-1' name='fd'/>
      <parameter type-id='type-id-7' name='nparts'/>
      <parameter type-id='type-id-258' name='vtoc'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='uuid_is_null' mangled-name='uuid_is_null' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='uuid_generate' mangled-name='uuid_generate' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='bcmp' mangled-name='bcmp' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='lseek' mangled-name='lseek64' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
