<abi-corpus version='2.0' architecture='elf-amd-x86_64' soname='libzfs_core.so.3'>
  <elf-needed>
    <dependency name='libnvpair.so.3'/>
    <dependency name='libpthread.so.0'/>
    <dependency name='libc.so.6'/>
    <dependency name='ld-linux-x86-64.so.2'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='_sol_getmntent' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='atomic_add_16' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='atomic_add_16_nv' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='atomic_add_32' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='atomic_add_32_nv' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='atomic_add_64' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='atomic_add_64_nv' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='atomic_add_8' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='atomic_add_8_nv' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='lzc_send_resume_redacted' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='lzc_send_space' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='lzc_send_space_resume_redacted' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='lzc_send_wrapper' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='lzc_set_bootenv' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='lzc_set_vdev_prop' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='lzc_snaprange_space' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='lzc_snapshot' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='lzc_sync' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='lzc_trim' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='lzc_unload_key' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='lzc_wait' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='lzc_wait_fs' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='lzc_wait_tag' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='membar_consumer' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='membar_enter' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='membar_exit' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='membar_producer' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='mkdirp' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='print_timestamp' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spl_pagesize' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='strlcat' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='strlcpy' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <abi-instr address-size='64' path='assert.c' language='LANG_C99'>
    <type-decl name='variadic parameter type' id='2c1145c5'/>
    <function-decl name='libspl_set_assert_ok' mangled-name='libspl_set_assert_ok' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='libspl_set_assert_ok'>
      <parameter type-id='c19b74c3' name='val'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='libspl_assertf' mangled-name='libspl_assertf' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='libspl_assertf'>
      <parameter type-id='80f4b756' name='file'/>
      <parameter type-id='80f4b756' name='func'/>
      <parameter type-id='95e97e5e' name='line'/>
      <parameter type-id='80f4b756' name='format'/>
      <parameter is-variadic='yes'/>
      <return type-id='48b5725f'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='atomic.c' language='LANG_C99'>
    <type-decl name='long int' size-in-bits='64' id='bd54fe1a'/>
    <type-decl name='short int' size-in-bits='16' id='a2185560'/>
    <type-decl name='signed char' size-in-bits='8' id='28577a57'/>
    <type-decl name='unsigned short int' size-in-bits='16' id='8efea9e5'/>
    <typedef-decl name='ulong_t' type-id='7359adad' id='ee1f298e'/>
    <typedef-decl name='int8_t' type-id='2171a512' id='ee31ee44'/>
    <typedef-decl name='int16_t' type-id='03896e23' id='23bd8cb5'/>
    <typedef-decl name='uint16_t' type-id='253c2d2a' id='149c6638'/>
    <typedef-decl name='__int8_t' type-id='28577a57' id='2171a512'/>
    <typedef-decl name='__int16_t' type-id='a2185560' id='03896e23'/>
    <typedef-decl name='__uint16_t' type-id='8efea9e5' id='253c2d2a'/>
    <typedef-decl name='__ssize_t' type-id='bd54fe1a' id='41060289'/>
    <typedef-decl name='ssize_t' type-id='41060289' id='79a0948f'/>
    <qualified-type-def type-id='149c6638' volatile='yes' id='5120c5f7'/>
    <pointer-type-def type-id='5120c5f7' size-in-bits='64' id='93977ae7'/>
    <qualified-type-def type-id='8f92235e' volatile='yes' id='430e0681'/>
    <pointer-type-def type-id='430e0681' size-in-bits='64' id='3a147f31'/>
    <qualified-type-def type-id='b96825af' volatile='yes' id='84ff7d66'/>
    <pointer-type-def type-id='84ff7d66' size-in-bits='64' id='aa323ea4'/>
    <qualified-type-def type-id='ee1f298e' volatile='yes' id='6f7e09cb'/>
    <pointer-type-def type-id='6f7e09cb' size-in-bits='64' id='64698d33'/>
    <qualified-type-def type-id='48b5725f' volatile='yes' id='b0b3cbf9'/>
    <pointer-type-def type-id='b0b3cbf9' size-in-bits='64' id='fe09dd29'/>
    <function-decl name='atomic_inc_8' mangled-name='atomic_inc_8' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_inc_8'>
      <parameter type-id='aa323ea4' name='target'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='atomic_inc_16' mangled-name='atomic_inc_16' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_inc_16'>
      <parameter type-id='93977ae7' name='target'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='atomic_inc_32' mangled-name='atomic_inc_32' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_inc_32'>
      <parameter type-id='3a147f31' name='target'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='atomic_inc_ulong' mangled-name='atomic_inc_ulong' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_inc_ulong'>
      <parameter type-id='64698d33' name='target'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='atomic_dec_8' mangled-name='atomic_dec_8' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_dec_8'>
      <parameter type-id='aa323ea4' name='target'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='atomic_dec_16' mangled-name='atomic_dec_16' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_dec_16'>
      <parameter type-id='93977ae7' name='target'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='atomic_dec_32' mangled-name='atomic_dec_32' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_dec_32'>
      <parameter type-id='3a147f31' name='target'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='atomic_dec_ulong' mangled-name='atomic_dec_ulong' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_dec_ulong'>
      <parameter type-id='64698d33' name='target'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='atomic_add_ptr' mangled-name='atomic_add_ptr' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_ptr'>
      <parameter type-id='fe09dd29' name='target'/>
      <parameter type-id='79a0948f' name='bits'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='atomic_add_8' mangled-name='atomic_add_8' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_8'>
      <parameter type-id='aa323ea4' name='target'/>
      <parameter type-id='ee31ee44' name='bits'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='atomic_add_16' mangled-name='atomic_add_16' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_16'>
      <parameter type-id='93977ae7' name='target'/>
      <parameter type-id='23bd8cb5' name='bits'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='atomic_add_32' mangled-name='atomic_add_32' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_32'>
      <parameter type-id='3a147f31' name='target'/>
      <parameter type-id='3ff5601b' name='bits'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='atomic_add_long' mangled-name='atomic_add_long' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_long'>
      <parameter type-id='64698d33' name='target'/>
      <parameter type-id='bd54fe1a' name='bits'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='atomic_sub_ptr' mangled-name='atomic_sub_ptr' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_sub_ptr'>
      <parameter type-id='fe09dd29' name='target'/>
      <parameter type-id='79a0948f' name='bits'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='atomic_sub_8' mangled-name='atomic_sub_8' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_sub_8'>
      <parameter type-id='aa323ea4' name='target'/>
      <parameter type-id='ee31ee44' name='bits'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='atomic_sub_16' mangled-name='atomic_sub_16' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_sub_16'>
      <parameter type-id='93977ae7' name='target'/>
      <parameter type-id='23bd8cb5' name='bits'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='atomic_sub_32' mangled-name='atomic_sub_32' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_sub_32'>
      <parameter type-id='3a147f31' name='target'/>
      <parameter type-id='3ff5601b' name='bits'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='atomic_sub_long' mangled-name='atomic_sub_long' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_sub_long'>
      <parameter type-id='64698d33' name='target'/>
      <parameter type-id='bd54fe1a' name='bits'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='atomic_or_8' mangled-name='atomic_or_8' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_or_8'>
      <parameter type-id='aa323ea4' name='target'/>
      <parameter type-id='b96825af' name='bits'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='atomic_or_16' mangled-name='atomic_or_16' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_or_16'>
      <parameter type-id='93977ae7' name='target'/>
      <parameter type-id='149c6638' name='bits'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='atomic_or_32' mangled-name='atomic_or_32' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_or_32'>
      <parameter type-id='3a147f31' name='target'/>
      <parameter type-id='8f92235e' name='bits'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='atomic_or_ulong' mangled-name='atomic_or_ulong' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_or_ulong'>
      <parameter type-id='64698d33' name='target'/>
      <parameter type-id='ee1f298e' name='bits'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='atomic_and_8' mangled-name='atomic_and_8' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_and_8'>
      <parameter type-id='aa323ea4' name='target'/>
      <parameter type-id='b96825af' name='bits'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='atomic_and_16' mangled-name='atomic_and_16' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_and_16'>
      <parameter type-id='93977ae7' name='target'/>
      <parameter type-id='149c6638' name='bits'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='atomic_and_32' mangled-name='atomic_and_32' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_and_32'>
      <parameter type-id='3a147f31' name='target'/>
      <parameter type-id='8f92235e' name='bits'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='atomic_and_ulong' mangled-name='atomic_and_ulong' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_and_ulong'>
      <parameter type-id='64698d33' name='target'/>
      <parameter type-id='ee1f298e' name='bits'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='atomic_inc_8_nv' mangled-name='atomic_inc_8_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_inc_8_nv'>
      <parameter type-id='aa323ea4' name='target'/>
      <return type-id='b96825af'/>
    </function-decl>
    <function-decl name='atomic_inc_16_nv' mangled-name='atomic_inc_16_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_inc_16_nv'>
      <parameter type-id='93977ae7' name='target'/>
      <return type-id='149c6638'/>
    </function-decl>
    <function-decl name='atomic_inc_32_nv' mangled-name='atomic_inc_32_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_inc_32_nv'>
      <parameter type-id='3a147f31' name='target'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='atomic_inc_ulong_nv' mangled-name='atomic_inc_ulong_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_inc_ulong_nv'>
      <parameter type-id='64698d33' name='target'/>
      <return type-id='ee1f298e'/>
    </function-decl>
    <function-decl name='atomic_dec_8_nv' mangled-name='atomic_dec_8_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_dec_8_nv'>
      <parameter type-id='aa323ea4' name='target'/>
      <return type-id='b96825af'/>
    </function-decl>
    <function-decl name='atomic_dec_16_nv' mangled-name='atomic_dec_16_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_dec_16_nv'>
      <parameter type-id='93977ae7' name='target'/>
      <return type-id='149c6638'/>
    </function-decl>
    <function-decl name='atomic_dec_32_nv' mangled-name='atomic_dec_32_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_dec_32_nv'>
      <parameter type-id='3a147f31' name='target'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='atomic_dec_ulong_nv' mangled-name='atomic_dec_ulong_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_dec_ulong_nv'>
      <parameter type-id='64698d33' name='target'/>
      <return type-id='ee1f298e'/>
    </function-decl>
    <function-decl name='atomic_add_ptr_nv' mangled-name='atomic_add_ptr_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_ptr_nv'>
      <parameter type-id='fe09dd29' name='target'/>
      <parameter type-id='79a0948f' name='bits'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='atomic_add_8_nv' mangled-name='atomic_add_8_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_8_nv'>
      <parameter type-id='aa323ea4' name='target'/>
      <parameter type-id='ee31ee44' name='bits'/>
      <return type-id='b96825af'/>
    </function-decl>
    <function-decl name='atomic_add_16_nv' mangled-name='atomic_add_16_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_16_nv'>
      <parameter type-id='93977ae7' name='target'/>
      <parameter type-id='23bd8cb5' name='bits'/>
      <return type-id='149c6638'/>
    </function-decl>
    <function-decl name='atomic_add_32_nv' mangled-name='atomic_add_32_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_32_nv'>
      <parameter type-id='3a147f31' name='target'/>
      <parameter type-id='3ff5601b' name='bits'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='atomic_add_long_nv' mangled-name='atomic_add_long_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_long_nv'>
      <parameter type-id='64698d33' name='target'/>
      <parameter type-id='bd54fe1a' name='bits'/>
      <return type-id='ee1f298e'/>
    </function-decl>
    <function-decl name='atomic_sub_ptr_nv' mangled-name='atomic_sub_ptr_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_sub_ptr_nv'>
      <parameter type-id='fe09dd29' name='target'/>
      <parameter type-id='79a0948f' name='bits'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='atomic_sub_8_nv' mangled-name='atomic_sub_8_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_sub_8_nv'>
      <parameter type-id='aa323ea4' name='target'/>
      <parameter type-id='ee31ee44' name='bits'/>
      <return type-id='b96825af'/>
    </function-decl>
    <function-decl name='atomic_sub_16_nv' mangled-name='atomic_sub_16_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_sub_16_nv'>
      <parameter type-id='93977ae7' name='target'/>
      <parameter type-id='23bd8cb5' name='bits'/>
      <return type-id='149c6638'/>
    </function-decl>
    <function-decl name='atomic_sub_32_nv' mangled-name='atomic_sub_32_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_sub_32_nv'>
      <parameter type-id='3a147f31' name='target'/>
      <parameter type-id='3ff5601b' name='bits'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='atomic_sub_long_nv' mangled-name='atomic_sub_long_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_sub_long_nv'>
      <parameter type-id='64698d33' name='target'/>
      <parameter type-id='bd54fe1a' name='bits'/>
      <return type-id='ee1f298e'/>
    </function-decl>
    <function-decl name='atomic_or_8_nv' mangled-name='atomic_or_8_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_or_8_nv'>
      <parameter type-id='aa323ea4' name='target'/>
      <parameter type-id='b96825af' name='bits'/>
      <return type-id='b96825af'/>
    </function-decl>
    <function-decl name='atomic_or_16_nv' mangled-name='atomic_or_16_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_or_16_nv'>
      <parameter type-id='93977ae7' name='target'/>
      <parameter type-id='149c6638' name='bits'/>
      <return type-id='149c6638'/>
    </function-decl>
    <function-decl name='atomic_or_32_nv' mangled-name='atomic_or_32_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_or_32_nv'>
      <parameter type-id='3a147f31' name='target'/>
      <parameter type-id='8f92235e' name='bits'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='atomic_or_ulong_nv' mangled-name='atomic_or_ulong_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_or_ulong_nv'>
      <parameter type-id='64698d33' name='target'/>
      <parameter type-id='ee1f298e' name='bits'/>
      <return type-id='ee1f298e'/>
    </function-decl>
    <function-decl name='atomic_and_8_nv' mangled-name='atomic_and_8_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_and_8_nv'>
      <parameter type-id='aa323ea4' name='target'/>
      <parameter type-id='b96825af' name='bits'/>
      <return type-id='b96825af'/>
    </function-decl>
    <function-decl name='atomic_and_16_nv' mangled-name='atomic_and_16_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_and_16_nv'>
      <parameter type-id='93977ae7' name='target'/>
      <parameter type-id='149c6638' name='bits'/>
      <return type-id='149c6638'/>
    </function-decl>
    <function-decl name='atomic_and_32_nv' mangled-name='atomic_and_32_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_and_32_nv'>
      <parameter type-id='3a147f31' name='target'/>
      <parameter type-id='8f92235e' name='bits'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='atomic_and_ulong_nv' mangled-name='atomic_and_ulong_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_and_ulong_nv'>
      <parameter type-id='64698d33' name='target'/>
      <parameter type-id='ee1f298e' name='bits'/>
      <return type-id='ee1f298e'/>
    </function-decl>
    <function-decl name='atomic_cas_ptr' mangled-name='atomic_cas_ptr' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_cas_ptr'>
      <parameter type-id='fe09dd29' name='target'/>
      <parameter type-id='eaa32e2f' name='exp'/>
      <parameter type-id='eaa32e2f' name='des'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='atomic_cas_8' mangled-name='atomic_cas_8' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_cas_8'>
      <parameter type-id='aa323ea4' name='target'/>
      <parameter type-id='b96825af' name='exp'/>
      <parameter type-id='b96825af' name='des'/>
      <return type-id='b96825af'/>
    </function-decl>
    <function-decl name='atomic_cas_16' mangled-name='atomic_cas_16' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_cas_16'>
      <parameter type-id='93977ae7' name='target'/>
      <parameter type-id='149c6638' name='exp'/>
      <parameter type-id='149c6638' name='des'/>
      <return type-id='149c6638'/>
    </function-decl>
    <function-decl name='atomic_cas_32' mangled-name='atomic_cas_32' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_cas_32'>
      <parameter type-id='3a147f31' name='target'/>
      <parameter type-id='8f92235e' name='exp'/>
      <parameter type-id='8f92235e' name='des'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='atomic_cas_ulong' mangled-name='atomic_cas_ulong' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_cas_ulong'>
      <parameter type-id='64698d33' name='target'/>
      <parameter type-id='ee1f298e' name='exp'/>
      <parameter type-id='ee1f298e' name='des'/>
      <return type-id='ee1f298e'/>
    </function-decl>
    <function-decl name='atomic_swap_8' mangled-name='atomic_swap_8' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_swap_8'>
      <parameter type-id='aa323ea4' name='target'/>
      <parameter type-id='b96825af' name='bits'/>
      <return type-id='b96825af'/>
    </function-decl>
    <function-decl name='atomic_swap_16' mangled-name='atomic_swap_16' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_swap_16'>
      <parameter type-id='93977ae7' name='target'/>
      <parameter type-id='149c6638' name='bits'/>
      <return type-id='149c6638'/>
    </function-decl>
    <function-decl name='atomic_swap_32' mangled-name='atomic_swap_32' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_swap_32'>
      <parameter type-id='3a147f31' name='target'/>
      <parameter type-id='8f92235e' name='bits'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='atomic_swap_ulong' mangled-name='atomic_swap_ulong' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_swap_ulong'>
      <parameter type-id='64698d33' name='target'/>
      <parameter type-id='ee1f298e' name='bits'/>
      <return type-id='ee1f298e'/>
    </function-decl>
    <function-decl name='atomic_swap_ptr' mangled-name='atomic_swap_ptr' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_swap_ptr'>
      <parameter type-id='fe09dd29' name='target'/>
      <parameter type-id='eaa32e2f' name='bits'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='atomic_set_long_excl' mangled-name='atomic_set_long_excl' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_set_long_excl'>
      <parameter type-id='64698d33' name='target'/>
      <parameter type-id='3502e3ff' name='value'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='atomic_clear_long_excl' mangled-name='atomic_clear_long_excl' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_clear_long_excl'>
      <parameter type-id='64698d33' name='target'/>
      <parameter type-id='3502e3ff' name='value'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='membar_enter' mangled-name='membar_enter' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='membar_enter'>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='membar_producer' mangled-name='membar_producer' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='membar_producer'>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='membar_consumer' mangled-name='membar_consumer' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='membar_consumer'>
      <return type-id='48b5725f'/>
    </function-decl>
    <type-decl name='unsigned long int' size-in-bits='64' id='7359adad'/>
  </abi-instr>
  <abi-instr address-size='64' path='getexecname.c' language='LANG_C99'>
    <function-decl name='getexecname' mangled-name='getexecname' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getexecname'>
      <return type-id='80f4b756'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='list.c' language='LANG_C99'>
    <typedef-decl name='list_node_t' type-id='b0b5e45e' id='b21843b2'/>
    <typedef-decl name='list_t' type-id='e824dae9' id='0899125f'/>
    <class-decl name='list_node' size-in-bits='128' is-struct='yes' visibility='default' id='b0b5e45e'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='b03eadb4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='prev' type-id='b03eadb4' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='list' size-in-bits='256' is-struct='yes' visibility='default' id='e824dae9'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='list_size' type-id='b59d7dce' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='list_offset' type-id='b59d7dce' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='list_head' type-id='b0b5e45e' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='size_t' type-id='7359adad' id='b59d7dce'/>
    <pointer-type-def type-id='b0b5e45e' size-in-bits='64' id='b03eadb4'/>
    <pointer-type-def type-id='b21843b2' size-in-bits='64' id='ccc38265'/>
    <pointer-type-def type-id='0899125f' size-in-bits='64' id='352ec160'/>
    <function-decl name='list_create' mangled-name='list_create' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_create'>
      <parameter type-id='352ec160' name='list'/>
      <parameter type-id='b59d7dce' name='size'/>
      <parameter type-id='b59d7dce' name='offset'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='list_destroy' mangled-name='list_destroy' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_destroy'>
      <parameter type-id='352ec160' name='list'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='list_insert_after' mangled-name='list_insert_after' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_insert_after'>
      <parameter type-id='352ec160' name='list'/>
      <parameter type-id='eaa32e2f' name='object'/>
      <parameter type-id='eaa32e2f' name='nobject'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='list_insert_before' mangled-name='list_insert_before' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_insert_before'>
      <parameter type-id='352ec160' name='list'/>
      <parameter type-id='eaa32e2f' name='object'/>
      <parameter type-id='eaa32e2f' name='nobject'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='list_insert_head' mangled-name='list_insert_head' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_insert_head'>
      <parameter type-id='352ec160' name='list'/>
      <parameter type-id='eaa32e2f' name='object'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='list_insert_tail' mangled-name='list_insert_tail' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_insert_tail'>
      <parameter type-id='352ec160' name='list'/>
      <parameter type-id='eaa32e2f' name='object'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='list_remove' mangled-name='list_remove' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_remove'>
      <parameter type-id='352ec160' name='list'/>
      <parameter type-id='eaa32e2f' name='object'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='list_remove_head' mangled-name='list_remove_head' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_remove_head'>
      <parameter type-id='352ec160' name='list'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='list_remove_tail' mangled-name='list_remove_tail' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_remove_tail'>
      <parameter type-id='352ec160' name='list'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='list_head' mangled-name='list_head' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_head'>
      <parameter type-id='352ec160' name='list'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='list_tail' mangled-name='list_tail' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_tail'>
      <parameter type-id='352ec160' name='list'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='list_next' mangled-name='list_next' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_next'>
      <parameter type-id='352ec160' name='list'/>
      <parameter type-id='eaa32e2f' name='object'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='list_prev' mangled-name='list_prev' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_prev'>
      <parameter type-id='352ec160' name='list'/>
      <parameter type-id='eaa32e2f' name='object'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='list_move_tail' mangled-name='list_move_tail' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_move_tail'>
      <parameter type-id='352ec160' name='dst'/>
      <parameter type-id='352ec160' name='src'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='list_link_replace' mangled-name='list_link_replace' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_link_replace'>
      <parameter type-id='ccc38265' name='lold'/>
      <parameter type-id='ccc38265' name='lnew'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='list_link_init' mangled-name='list_link_init' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_link_init'>
      <parameter type-id='ccc38265' name='ln'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='list_link_active' mangled-name='list_link_active' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_link_active'>
      <parameter type-id='ccc38265' name='ln'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='list_is_empty' mangled-name='list_is_empty' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_is_empty'>
      <parameter type-id='352ec160' name='list'/>
      <return type-id='95e97e5e'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='mkdirp.c' language='LANG_C99'>
    <typedef-decl name='__mode_t' type-id='f0981eeb' id='e1c52942'/>
    <typedef-decl name='mode_t' type-id='e1c52942' id='d50d396c'/>
    <function-decl name='mkdirp' mangled-name='mkdirp' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='mkdirp'>
      <parameter type-id='80f4b756' name='d'/>
      <parameter type-id='d50d396c' name='mode'/>
      <return type-id='95e97e5e'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='os/linux/gethostid.c' language='LANG_C99'>
    <function-decl name='get_system_hostid' mangled-name='get_system_hostid' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='get_system_hostid'>
      <return type-id='7359adad'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='os/linux/getmntany.c' language='LANG_C99'>
    <array-type-def dimensions='1' type-id='03085adc' size-in-bits='192' id='083f8d58'>
      <subrange length='3' type-id='7359adad' id='56f209d2'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='8' id='89feb1ec'>
      <subrange length='1' type-id='7359adad' id='52f813b4'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='160' id='664ac0b7'>
      <subrange length='20' type-id='7359adad' id='fdca39cf'/>
    </array-type-def>
    <class-decl name='_IO_codecvt' is-struct='yes' visibility='default' is-declaration-only='yes' id='a4036571'/>
    <class-decl name='_IO_marker' is-struct='yes' visibility='default' is-declaration-only='yes' id='010ae0b9'/>
    <class-decl name='_IO_wide_data' is-struct='yes' visibility='default' is-declaration-only='yes' id='79bd3751'/>
    <class-decl name='mnttab' size-in-bits='256' is-struct='yes' visibility='default' id='1b055409'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mnt_special' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='mnt_mountp' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='mnt_fstype' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='mnt_mntopts' type-id='26a90f95' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='extmnttab' size-in-bits='320' is-struct='yes' visibility='default' id='0c544dc0'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mnt_special' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='mnt_mountp' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='mnt_fstype' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='mnt_mntopts' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='mnt_major' type-id='3502e3ff' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='mnt_minor' type-id='3502e3ff' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='stat64' size-in-bits='1152' is-struct='yes' visibility='default' id='0bbec9cd'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='st_dev' type-id='35ed8932' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='st_ino' type-id='71288a47' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='st_nlink' type-id='80f0b9df' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='st_mode' type-id='e1c52942' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='st_uid' type-id='cc5fcceb' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='st_gid' type-id='d94ec6d9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='__pad0' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='st_rdev' type-id='35ed8932' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='st_size' type-id='79989e9c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='st_blksize' type-id='d3f10a7f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='st_blocks' type-id='4e711bf1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='st_atim' type-id='a9c79a1f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='st_mtim' type-id='a9c79a1f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='st_ctim' type-id='a9c79a1f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='__glibc_reserved' type-id='083f8d58' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__dev_t' type-id='7359adad' id='35ed8932'/>
    <typedef-decl name='__uid_t' type-id='f0981eeb' id='cc5fcceb'/>
    <typedef-decl name='__gid_t' type-id='f0981eeb' id='d94ec6d9'/>
    <typedef-decl name='__ino64_t' type-id='7359adad' id='71288a47'/>
    <typedef-decl name='__nlink_t' type-id='7359adad' id='80f0b9df'/>
    <typedef-decl name='__off_t' type-id='bd54fe1a' id='79989e9c'/>
    <typedef-decl name='__off64_t' type-id='bd54fe1a' id='724e4de6'/>
    <typedef-decl name='__time_t' type-id='bd54fe1a' id='65eda9c0'/>
    <typedef-decl name='__blksize_t' type-id='bd54fe1a' id='d3f10a7f'/>
    <typedef-decl name='__blkcnt64_t' type-id='bd54fe1a' id='4e711bf1'/>
    <typedef-decl name='__syscall_slong_t' type-id='bd54fe1a' id='03085adc'/>
    <typedef-decl name='FILE' type-id='ec1ed955' id='aa12d1ba'/>
    <typedef-decl name='_IO_lock_t' type-id='48b5725f' id='bb4788fa'/>
    <class-decl name='_IO_FILE' size-in-bits='1728' is-struct='yes' visibility='default' id='ec1ed955'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_flags' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_IO_read_ptr' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_IO_read_end' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_IO_read_base' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='_IO_write_base' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='_IO_write_ptr' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_IO_write_end' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='_IO_buf_base' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='_IO_buf_end' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='_IO_save_base' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='_IO_backup_base' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='_IO_save_end' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='_markers' type-id='e4c6fa61' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='_chain' type-id='dca988a5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='_fileno' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='_flags2' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='_old_offset' type-id='79989e9c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='_cur_column' type-id='8efea9e5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1040'>
        <var-decl name='_vtable_offset' type-id='28577a57' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1048'>
        <var-decl name='_shortbuf' type-id='89feb1ec' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='_lock' type-id='cecf4ea7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='_offset' type-id='724e4de6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='_codecvt' type-id='570f8c59' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='_wide_data' type-id='c65a1f29' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='_freeres_list' type-id='dca988a5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='_freeres_buf' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='__pad5' type-id='b59d7dce' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='_mode' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='_unused2' type-id='664ac0b7' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='timespec' size-in-bits='128' is-struct='yes' visibility='default' id='a9c79a1f'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tv_sec' type-id='65eda9c0' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tv_nsec' type-id='03085adc' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='aa12d1ba' size-in-bits='64' id='822cd80b'/>
    <pointer-type-def type-id='ec1ed955' size-in-bits='64' id='dca988a5'/>
    <pointer-type-def type-id='a4036571' size-in-bits='64' id='570f8c59'/>
    <pointer-type-def type-id='bb4788fa' size-in-bits='64' id='cecf4ea7'/>
    <pointer-type-def type-id='010ae0b9' size-in-bits='64' id='e4c6fa61'/>
    <pointer-type-def type-id='79bd3751' size-in-bits='64' id='c65a1f29'/>
    <pointer-type-def type-id='0c544dc0' size-in-bits='64' id='394fc496'/>
    <pointer-type-def type-id='1b055409' size-in-bits='64' id='9d424d31'/>
    <pointer-type-def type-id='0bbec9cd' size-in-bits='64' id='62f7a03d'/>
    <class-decl name='_IO_codecvt' is-struct='yes' visibility='default' is-declaration-only='yes' id='a4036571'/>
    <class-decl name='_IO_marker' is-struct='yes' visibility='default' is-declaration-only='yes' id='010ae0b9'/>
    <class-decl name='_IO_wide_data' is-struct='yes' visibility='default' is-declaration-only='yes' id='79bd3751'/>
    <function-decl name='getmntany' mangled-name='getmntany' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getmntany'>
      <parameter type-id='822cd80b' name='fp'/>
      <parameter type-id='9d424d31' name='mgetp'/>
      <parameter type-id='9d424d31' name='mrefp'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='_sol_getmntent' mangled-name='_sol_getmntent' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_sol_getmntent'>
      <parameter type-id='822cd80b' name='fp'/>
      <parameter type-id='9d424d31' name='mgetp'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='getextmntent' mangled-name='getextmntent' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getextmntent'>
      <parameter type-id='80f4b756' name='path'/>
      <parameter type-id='394fc496' name='entry'/>
      <parameter type-id='62f7a03d' name='statbuf'/>
      <return type-id='95e97e5e'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='os/linux/zone.c' language='LANG_C99'>
    <typedef-decl name='zoneid_t' type-id='3502e3ff' id='4da03624'/>
    <function-decl name='getzoneid' mangled-name='getzoneid' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getzoneid'>
      <return type-id='4da03624'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='page.c' language='LANG_C99'>
    <function-decl name='spl_pagesize' mangled-name='spl_pagesize' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spl_pagesize'>
      <return type-id='b59d7dce'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='strlcat.c' language='LANG_C99'>
    <function-decl name='strlcat' mangled-name='strlcat' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strlcat'>
      <parameter type-id='26a90f95' name='dst'/>
      <parameter type-id='80f4b756' name='src'/>
      <parameter type-id='b59d7dce' name='dstsize'/>
      <return type-id='b59d7dce'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='strlcpy.c' language='LANG_C99'>
    <function-decl name='strlcpy' mangled-name='strlcpy' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strlcpy'>
      <parameter type-id='26a90f95' name='dst'/>
      <parameter type-id='80f4b756' name='src'/>
      <parameter type-id='b59d7dce' name='len'/>
      <return type-id='b59d7dce'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='timestamp.c' language='LANG_C99'>
    <function-decl name='print_timestamp' mangled-name='print_timestamp' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='print_timestamp'>
      <parameter type-id='3502e3ff' name='timestamp_fmt'/>
      <return type-id='48b5725f'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='libzfs_core.c' language='LANG_C99'>
    <type-decl name='char' size-in-bits='8' id='a84c031d'/>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='2048' id='d1617432'>
      <subrange length='256' type-id='7359adad' id='36e5b9fa'/>
    </array-type-def>
    <type-decl name='int' size-in-bits='32' id='95e97e5e'/>
    <array-type-def dimensions='1' type-id='9c313c2d' size-in-bits='2176' id='8c2bcad1'>
      <subrange length='34' type-id='7359adad' id='6a6a7e00'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='9c313c2d' size-in-bits='256' id='85c64d26'>
      <subrange length='4' type-id='7359adad' id='16fe7105'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='96' id='fa8ef949'>
      <subrange length='12' type-id='7359adad' id='84827bdc'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='128' id='fa9986a5'>
      <subrange length='16' type-id='7359adad' id='848d0938'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='24' id='d3490169'>
      <subrange length='3' type-id='7359adad' id='56f209d2'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='40' id='0f4ddd0b'>
      <subrange length='5' type-id='7359adad' id='53010e10'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='48' id='0f562bd0'>
      <subrange length='6' type-id='7359adad' id='52fa524b'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='64' id='13339fda'>
      <subrange length='8' type-id='7359adad' id='56e0c0b1'/>
    </array-type-def>
    <type-decl name='unnamed-enum-underlying-type-32' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='9cac1fee'/>
    <type-decl name='unsigned char' size-in-bits='8' id='002ac4a6'/>
    <type-decl name='unsigned int' size-in-bits='32' id='f0981eeb'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='7359adad'/>
    <type-decl name='void' id='48b5725f'/>
    <enum-decl name='lzc_dataset_type' id='bc9887f1'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='LZC_DATSET_TYPE_ZFS' value='2'/>
      <enumerator name='LZC_DATSET_TYPE_ZVOL' value='3'/>
    </enum-decl>
    <enum-decl name='lzc_send_flags' id='bfbd3c8e'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='LZC_SEND_FLAG_EMBED_DATA' value='1'/>
      <enumerator name='LZC_SEND_FLAG_LARGE_BLOCK' value='2'/>
      <enumerator name='LZC_SEND_FLAG_COMPRESS' value='4'/>
      <enumerator name='LZC_SEND_FLAG_RAW' value='8'/>
      <enumerator name='LZC_SEND_FLAG_SAVED' value='16'/>
    </enum-decl>
    <class-decl name='ddt_key' size-in-bits='320' is-struct='yes' visibility='default' id='e0a4a1cb'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ddk_cksum' type-id='39730d0b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='ddk_prop' type-id='9c313c2d' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='ddt_key_t' type-id='e0a4a1cb' id='67f6d2cf'/>
    <enum-decl name='dmu_object_type' id='04b3b0b9'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='DMU_OT_NONE' value='0'/>
      <enumerator name='DMU_OT_OBJECT_DIRECTORY' value='1'/>
      <enumerator name='DMU_OT_OBJECT_ARRAY' value='2'/>
      <enumerator name='DMU_OT_PACKED_NVLIST' value='3'/>
      <enumerator name='DMU_OT_PACKED_NVLIST_SIZE' value='4'/>
      <enumerator name='DMU_OT_BPOBJ' value='5'/>
      <enumerator name='DMU_OT_BPOBJ_HDR' value='6'/>
      <enumerator name='DMU_OT_SPACE_MAP_HEADER' value='7'/>
      <enumerator name='DMU_OT_SPACE_MAP' value='8'/>
      <enumerator name='DMU_OT_INTENT_LOG' value='9'/>
      <enumerator name='DMU_OT_DNODE' value='10'/>
      <enumerator name='DMU_OT_OBJSET' value='11'/>
      <enumerator name='DMU_OT_DSL_DIR' value='12'/>
      <enumerator name='DMU_OT_DSL_DIR_CHILD_MAP' value='13'/>
      <enumerator name='DMU_OT_DSL_DS_SNAP_MAP' value='14'/>
      <enumerator name='DMU_OT_DSL_PROPS' value='15'/>
      <enumerator name='DMU_OT_DSL_DATASET' value='16'/>
      <enumerator name='DMU_OT_ZNODE' value='17'/>
      <enumerator name='DMU_OT_OLDACL' value='18'/>
      <enumerator name='DMU_OT_PLAIN_FILE_CONTENTS' value='19'/>
      <enumerator name='DMU_OT_DIRECTORY_CONTENTS' value='20'/>
      <enumerator name='DMU_OT_MASTER_NODE' value='21'/>
      <enumerator name='DMU_OT_UNLINKED_SET' value='22'/>
      <enumerator name='DMU_OT_ZVOL' value='23'/>
      <enumerator name='DMU_OT_ZVOL_PROP' value='24'/>
      <enumerator name='DMU_OT_PLAIN_OTHER' value='25'/>
      <enumerator name='DMU_OT_UINT64_OTHER' value='26'/>
      <enumerator name='DMU_OT_ZAP_OTHER' value='27'/>
      <enumerator name='DMU_OT_ERROR_LOG' value='28'/>
      <enumerator name='DMU_OT_SPA_HISTORY' value='29'/>
      <enumerator name='DMU_OT_SPA_HISTORY_OFFSETS' value='30'/>
      <enumerator name='DMU_OT_POOL_PROPS' value='31'/>
      <enumerator name='DMU_OT_DSL_PERMS' value='32'/>
      <enumerator name='DMU_OT_ACL' value='33'/>
      <enumerator name='DMU_OT_SYSACL' value='34'/>
      <enumerator name='DMU_OT_FUID' value='35'/>
      <enumerator name='DMU_OT_FUID_SIZE' value='36'/>
      <enumerator name='DMU_OT_NEXT_CLONES' value='37'/>
      <enumerator name='DMU_OT_SCAN_QUEUE' value='38'/>
      <enumerator name='DMU_OT_USERGROUP_USED' value='39'/>
      <enumerator name='DMU_OT_USERGROUP_QUOTA' value='40'/>
      <enumerator name='DMU_OT_USERREFS' value='41'/>
      <enumerator name='DMU_OT_DDT_ZAP' value='42'/>
      <enumerator name='DMU_OT_DDT_STATS' value='43'/>
      <enumerator name='DMU_OT_SA' value='44'/>
      <enumerator name='DMU_OT_SA_MASTER_NODE' value='45'/>
      <enumerator name='DMU_OT_SA_ATTR_REGISTRATION' value='46'/>
      <enumerator name='DMU_OT_SA_ATTR_LAYOUTS' value='47'/>
      <enumerator name='DMU_OT_SCAN_XLATE' value='48'/>
      <enumerator name='DMU_OT_DEDUP' value='49'/>
      <enumerator name='DMU_OT_DEADLIST' value='50'/>
      <enumerator name='DMU_OT_DEADLIST_HDR' value='51'/>
      <enumerator name='DMU_OT_DSL_CLONES' value='52'/>
      <enumerator name='DMU_OT_BPOBJ_SUBOBJ' value='53'/>
      <enumerator name='DMU_OT_NUMTYPES' value='54'/>
      <enumerator name='DMU_OTN_UINT8_DATA' value='128'/>
      <enumerator name='DMU_OTN_UINT8_METADATA' value='192'/>
      <enumerator name='DMU_OTN_UINT16_DATA' value='129'/>
      <enumerator name='DMU_OTN_UINT16_METADATA' value='193'/>
      <enumerator name='DMU_OTN_UINT32_DATA' value='130'/>
      <enumerator name='DMU_OTN_UINT32_METADATA' value='194'/>
      <enumerator name='DMU_OTN_UINT64_DATA' value='131'/>
      <enumerator name='DMU_OTN_UINT64_METADATA' value='195'/>
      <enumerator name='DMU_OTN_ZAP_DATA' value='132'/>
      <enumerator name='DMU_OTN_ZAP_METADATA' value='196'/>
      <enumerator name='DMU_OTN_UINT8_ENC_DATA' value='160'/>
      <enumerator name='DMU_OTN_UINT8_ENC_METADATA' value='224'/>
      <enumerator name='DMU_OTN_UINT16_ENC_DATA' value='161'/>
      <enumerator name='DMU_OTN_UINT16_ENC_METADATA' value='225'/>
      <enumerator name='DMU_OTN_UINT32_ENC_DATA' value='162'/>
      <enumerator name='DMU_OTN_UINT32_ENC_METADATA' value='226'/>
      <enumerator name='DMU_OTN_UINT64_ENC_DATA' value='163'/>
      <enumerator name='DMU_OTN_UINT64_ENC_METADATA' value='227'/>
      <enumerator name='DMU_OTN_ZAP_ENC_DATA' value='164'/>
      <enumerator name='DMU_OTN_ZAP_ENC_METADATA' value='228'/>
    </enum-decl>
    <typedef-decl name='dmu_object_type_t' type-id='04b3b0b9' id='5c9d8906'/>
    <enum-decl name='dmu_objset_type' id='6b1b19f9'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='DMU_OST_NONE' value='0'/>
      <enumerator name='DMU_OST_META' value='1'/>
      <enumerator name='DMU_OST_ZFS' value='2'/>
      <enumerator name='DMU_OST_ZVOL' value='3'/>
      <enumerator name='DMU_OST_OTHER' value='4'/>
      <enumerator name='DMU_OST_ANY' value='5'/>
      <enumerator name='DMU_OST_NUMTYPES' value='6'/>
    </enum-decl>
    <typedef-decl name='dmu_objset_type_t' type-id='6b1b19f9' id='230f1e16'/>
    <enum-decl name='pool_initialize_func' id='5c246ad4'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='POOL_INITIALIZE_START' value='0'/>
      <enumerator name='POOL_INITIALIZE_CANCEL' value='1'/>
      <enumerator name='POOL_INITIALIZE_SUSPEND' value='2'/>
      <enumerator name='POOL_INITIALIZE_FUNCS' value='3'/>
    </enum-decl>
    <typedef-decl name='pool_initialize_func_t' type-id='5c246ad4' id='7063e1ab'/>
    <enum-decl name='pool_trim_func' id='54ed608a'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='POOL_TRIM_START' value='0'/>
      <enumerator name='POOL_TRIM_CANCEL' value='1'/>
      <enumerator name='POOL_TRIM_SUSPEND' value='2'/>
      <enumerator name='POOL_TRIM_FUNCS' value='3'/>
    </enum-decl>
    <typedef-decl name='pool_trim_func_t' type-id='54ed608a' id='b1146b8d'/>
    <enum-decl name='zpool_wait_activity_t' naming-typedef-id='73446457' id='849338e3'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='ZPOOL_WAIT_CKPT_DISCARD' value='0'/>
      <enumerator name='ZPOOL_WAIT_FREE' value='1'/>
      <enumerator name='ZPOOL_WAIT_INITIALIZE' value='2'/>
      <enumerator name='ZPOOL_WAIT_REPLACE' value='3'/>
      <enumerator name='ZPOOL_WAIT_REMOVE' value='4'/>
      <enumerator name='ZPOOL_WAIT_RESILVER' value='5'/>
      <enumerator name='ZPOOL_WAIT_SCRUB' value='6'/>
      <enumerator name='ZPOOL_WAIT_TRIM' value='7'/>
      <enumerator name='ZPOOL_WAIT_NUM_ACTIVITIES' value='8'/>
    </enum-decl>
    <typedef-decl name='zpool_wait_activity_t' type-id='849338e3' id='73446457'/>
    <enum-decl name='zfs_wait_activity_t' naming-typedef-id='3024501a' id='527d5dc6'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='ZFS_WAIT_DELETEQ' value='0'/>
      <enumerator name='ZFS_WAIT_NUM_ACTIVITIES' value='1'/>
    </enum-decl>
    <typedef-decl name='zfs_wait_activity_t' type-id='527d5dc6' id='3024501a'/>
    <class-decl name='nvlist' size-in-bits='192' is-struct='yes' visibility='default' id='ac266fd9'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nvl_version' type-id='3ff5601b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='nvl_nvflag' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='nvl_priv' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='nvl_flag' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='nvl_pad' type-id='3ff5601b' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='nvlist_t' type-id='ac266fd9' id='8e8d4be3'/>
    <class-decl name='zio_cksum' size-in-bits='256' is-struct='yes' visibility='default' id='1d53e28b'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='zc_word' type-id='85c64d26' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='zio_cksum_t' type-id='1d53e28b' id='39730d0b'/>
    <class-decl name='drr_begin' size-in-bits='2432' is-struct='yes' visibility='default' id='09fcdc01'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='drr_magic' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='drr_versioninfo' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='drr_creation_time' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='drr_type' type-id='230f1e16' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='drr_flags' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='drr_toguid' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='drr_fromguid' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='drr_toname' type-id='d1617432' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='dmu_replay_record' size-in-bits='2496' is-struct='yes' visibility='default' id='781a52d7'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='drr_type' type-id='08f5ca17' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='drr_payloadlen' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='drr_u' type-id='ac5ab595' visibility='default'/>
      </data-member>
    </class-decl>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' id='08f5ca17'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='DRR_BEGIN' value='0'/>
      <enumerator name='DRR_OBJECT' value='1'/>
      <enumerator name='DRR_FREEOBJECTS' value='2'/>
      <enumerator name='DRR_WRITE' value='3'/>
      <enumerator name='DRR_FREE' value='4'/>
      <enumerator name='DRR_END' value='5'/>
      <enumerator name='DRR_WRITE_BYREF' value='6'/>
      <enumerator name='DRR_SPILL' value='7'/>
      <enumerator name='DRR_WRITE_EMBEDDED' value='8'/>
      <enumerator name='DRR_OBJECT_RANGE' value='9'/>
      <enumerator name='DRR_REDACT' value='10'/>
      <enumerator name='DRR_NUMTYPES' value='11'/>
    </enum-decl>
    <union-decl name='__anonymous_union__' size-in-bits='2432' is-anonymous='yes' visibility='default' id='ac5ab595'>
      <data-member access='public'>
        <var-decl name='drr_begin' type-id='09fcdc01' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='drr_end' type-id='6ee25631' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='drr_object' type-id='f9ad530b' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='drr_freeobjects' type-id='a27d958e' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='drr_write' type-id='4cc69e4b' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='drr_free' type-id='c836cfd2' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='drr_write_byref' type-id='e511cdce' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='drr_spill' type-id='1e69a80a' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='drr_write_embedded' type-id='98b1345e' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='drr_object_range' type-id='aba1f9e1' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='drr_redact' type-id='50389039' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='drr_checksum' type-id='a5fe3647' visibility='default'/>
      </data-member>
    </union-decl>
    <class-decl name='drr_end' size-in-bits='320' is-struct='yes' visibility='default' id='6ee25631'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='drr_checksum' type-id='39730d0b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='drr_toguid' type-id='9c313c2d' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='drr_object' size-in-bits='448' is-struct='yes' visibility='default' id='f9ad530b'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='drr_object' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='drr_type' type-id='5c9d8906' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='drr_bonustype' type-id='5c9d8906' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='drr_blksz' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='drr_bonuslen' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='drr_checksumtype' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='200'>
        <var-decl name='drr_compress' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='208'>
        <var-decl name='drr_dn_slots' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='216'>
        <var-decl name='drr_flags' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='drr_raw_bonuslen' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='drr_toguid' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='drr_indblkshift' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='328'>
        <var-decl name='drr_nlevels' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='336'>
        <var-decl name='drr_nblkptr' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='344'>
        <var-decl name='drr_pad' type-id='0f4ddd0b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='drr_maxblkid' type-id='9c313c2d' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='drr_freeobjects' size-in-bits='192' is-struct='yes' visibility='default' id='a27d958e'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='drr_firstobj' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='drr_numobjs' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='drr_toguid' type-id='9c313c2d' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='drr_write' size-in-bits='1088' is-struct='yes' visibility='default' id='4cc69e4b'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='drr_object' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='drr_type' type-id='5c9d8906' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='drr_pad' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='drr_offset' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='drr_logical_size' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='drr_toguid' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='drr_checksumtype' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='328'>
        <var-decl name='drr_flags' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='336'>
        <var-decl name='drr_compressiontype' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='344'>
        <var-decl name='drr_pad2' type-id='0f4ddd0b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='drr_key' type-id='67f6d2cf' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='drr_compressed_size' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='drr_salt' type-id='13339fda' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='drr_iv' type-id='fa8ef949' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='drr_mac' type-id='fa9986a5' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='drr_free' size-in-bits='256' is-struct='yes' visibility='default' id='c836cfd2'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='drr_object' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='drr_offset' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='drr_length' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='drr_toguid' type-id='9c313c2d' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='drr_write_byref' size-in-bits='832' is-struct='yes' visibility='default' id='e511cdce'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='drr_object' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='drr_offset' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='drr_length' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='drr_toguid' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='drr_refguid' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='drr_refobject' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='drr_refoffset' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='drr_checksumtype' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='456'>
        <var-decl name='drr_flags' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='464'>
        <var-decl name='drr_pad2' type-id='0f562bd0' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='drr_key' type-id='67f6d2cf' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='drr_spill' size-in-bits='640' is-struct='yes' visibility='default' id='1e69a80a'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='drr_object' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='drr_length' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='drr_toguid' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='drr_flags' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='200'>
        <var-decl name='drr_compressiontype' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='208'>
        <var-decl name='drr_pad' type-id='0f562bd0' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='drr_compressed_size' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='drr_salt' type-id='13339fda' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='drr_iv' type-id='fa8ef949' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='drr_mac' type-id='fa9986a5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='608'>
        <var-decl name='drr_type' type-id='5c9d8906' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='drr_write_embedded' size-in-bits='384' is-struct='yes' visibility='default' id='98b1345e'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='drr_object' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='drr_offset' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='drr_length' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='drr_toguid' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='drr_compression' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='264'>
        <var-decl name='drr_etype' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='272'>
        <var-decl name='drr_pad' type-id='0f562bd0' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='drr_lsize' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='drr_psize' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='drr_object_range' size-in-bits='512' is-struct='yes' visibility='default' id='aba1f9e1'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='drr_firstobj' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='drr_numslots' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='drr_toguid' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='drr_salt' type-id='13339fda' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='drr_iv' type-id='fa8ef949' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='drr_mac' type-id='fa9986a5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='drr_flags' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='488'>
        <var-decl name='drr_pad' type-id='d3490169' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='drr_redact' size-in-bits='256' is-struct='yes' visibility='default' id='50389039'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='drr_object' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='drr_offset' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='drr_length' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='drr_toguid' type-id='9c313c2d' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='drr_checksum' size-in-bits='2432' is-struct='yes' visibility='default' id='a5fe3647'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='drr_pad' type-id='8c2bcad1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='drr_checksum' type-id='39730d0b' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='dmu_replay_record_t' type-id='781a52d7' id='8b8fc893'/>
    <enum-decl name='boolean_t' naming-typedef-id='c19b74c3' id='f58c8277'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='B_FALSE' value='0'/>
      <enumerator name='B_TRUE' value='1'/>
    </enum-decl>
    <typedef-decl name='boolean_t' type-id='f58c8277' id='c19b74c3'/>
    <typedef-decl name='uint_t' type-id='f0981eeb' id='3502e3ff'/>
    <typedef-decl name='int32_t' type-id='33f57a65' id='3ff5601b'/>
    <typedef-decl name='uint8_t' type-id='c51d6389' id='b96825af'/>
    <typedef-decl name='uint32_t' type-id='62f1140c' id='8f92235e'/>
    <typedef-decl name='uint64_t' type-id='8910171f' id='9c313c2d'/>
    <typedef-decl name='__uint8_t' type-id='002ac4a6' id='c51d6389'/>
    <typedef-decl name='__int32_t' type-id='95e97e5e' id='33f57a65'/>
    <typedef-decl name='__uint32_t' type-id='f0981eeb' id='62f1140c'/>
    <typedef-decl name='__uint64_t' type-id='7359adad' id='8910171f'/>
    <pointer-type-def type-id='c19b74c3' size-in-bits='64' id='37e3bd22'/>
    <pointer-type-def type-id='a84c031d' size-in-bits='64' id='26a90f95'/>
    <qualified-type-def type-id='a84c031d' const='yes' id='9b45d938'/>
    <pointer-type-def type-id='9b45d938' size-in-bits='64' id='80f4b756'/>
    <qualified-type-def type-id='8b8fc893' const='yes' id='9623bc03'/>
    <pointer-type-def type-id='9623bc03' size-in-bits='64' id='8341348b'/>
    <qualified-type-def type-id='8e8d4be3' const='yes' id='693c3853'/>
    <pointer-type-def type-id='693c3853' size-in-bits='64' id='22cce67b'/>
    <pointer-type-def type-id='c70fa2e8' size-in-bits='64' id='2e711a2a'/>
    <pointer-type-def type-id='8e8d4be3' size-in-bits='64' id='5ce45b60'/>
    <pointer-type-def type-id='5ce45b60' size-in-bits='64' id='857bb57e'/>
    <pointer-type-def type-id='9c313c2d' size-in-bits='64' id='5d6479ae'/>
    <pointer-type-def type-id='b96825af' size-in-bits='64' id='ae3e8ca6'/>
    <pointer-type-def type-id='48b5725f' size-in-bits='64' id='eaa32e2f'/>
    <function-decl name='libzfs_core_init' mangled-name='libzfs_core_init' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='libzfs_core_init'>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='libzfs_core_fini' mangled-name='libzfs_core_fini' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='libzfs_core_fini'>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='lzc_create' mangled-name='lzc_create' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_create'>
      <parameter type-id='80f4b756' name='fsname'/>
      <parameter type-id='bc9887f1' name='type'/>
      <parameter type-id='5ce45b60' name='props'/>
      <parameter type-id='ae3e8ca6' name='wkeydata'/>
      <parameter type-id='3502e3ff' name='wkeylen'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='lzc_clone' mangled-name='lzc_clone' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_clone'>
      <parameter type-id='80f4b756' name='fsname'/>
      <parameter type-id='80f4b756' name='origin'/>
      <parameter type-id='5ce45b60' name='props'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='lzc_promote' mangled-name='lzc_promote' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_promote'>
      <parameter type-id='80f4b756' name='fsname'/>
      <parameter type-id='26a90f95' name='snapnamebuf'/>
      <parameter type-id='95e97e5e' name='snapnamelen'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='lzc_rename' mangled-name='lzc_rename' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_rename'>
      <parameter type-id='80f4b756' name='source'/>
      <parameter type-id='80f4b756' name='target'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='lzc_destroy' mangled-name='lzc_destroy' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_destroy'>
      <parameter type-id='80f4b756' name='fsname'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='lzc_snapshot' mangled-name='lzc_snapshot' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_snapshot'>
      <parameter type-id='5ce45b60' name='snaps'/>
      <parameter type-id='5ce45b60' name='props'/>
      <parameter type-id='857bb57e' name='errlist'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='lzc_destroy_snaps' mangled-name='lzc_destroy_snaps' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_destroy_snaps'>
      <parameter type-id='5ce45b60' name='snaps'/>
      <parameter type-id='c19b74c3' name='defer'/>
      <parameter type-id='857bb57e' name='errlist'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='lzc_snaprange_space' mangled-name='lzc_snaprange_space' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_snaprange_space'>
      <parameter type-id='80f4b756' name='firstsnap'/>
      <parameter type-id='80f4b756' name='lastsnap'/>
      <parameter type-id='5d6479ae' name='usedp'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='lzc_exists' mangled-name='lzc_exists' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_exists'>
      <parameter type-id='80f4b756' name='dataset'/>
      <return type-id='c19b74c3'/>
    </function-decl>
    <function-decl name='lzc_sync' mangled-name='lzc_sync' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_sync'>
      <parameter type-id='80f4b756' name='pool_name'/>
      <parameter type-id='5ce45b60' name='innvl'/>
      <parameter type-id='857bb57e' name='outnvl'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='lzc_hold' mangled-name='lzc_hold' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_hold'>
      <parameter type-id='5ce45b60' name='holds'/>
      <parameter type-id='95e97e5e' name='cleanup_fd'/>
      <parameter type-id='857bb57e' name='errlist'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='lzc_release' mangled-name='lzc_release' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_release'>
      <parameter type-id='5ce45b60' name='holds'/>
      <parameter type-id='857bb57e' name='errlist'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='lzc_get_holds' mangled-name='lzc_get_holds' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_get_holds'>
      <parameter type-id='80f4b756' name='snapname'/>
      <parameter type-id='857bb57e' name='holdsp'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='lzc_send_wrapper' mangled-name='lzc_send_wrapper' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_send_wrapper'>
      <parameter type-id='2e711a2a' name='func'/>
      <parameter type-id='95e97e5e' name='orig_fd'/>
      <parameter type-id='eaa32e2f' name='data'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='lzc_send' mangled-name='lzc_send' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_send'>
      <parameter type-id='80f4b756' name='snapname'/>
      <parameter type-id='80f4b756' name='from'/>
      <parameter type-id='95e97e5e' name='fd'/>
      <parameter type-id='bfbd3c8e' name='flags'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='lzc_send_redacted' mangled-name='lzc_send_redacted' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_send_redacted'>
      <parameter type-id='80f4b756' name='snapname'/>
      <parameter type-id='80f4b756' name='from'/>
      <parameter type-id='95e97e5e' name='fd'/>
      <parameter type-id='bfbd3c8e' name='flags'/>
      <parameter type-id='80f4b756' name='redactbook'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='lzc_send_resume' mangled-name='lzc_send_resume' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_send_resume'>
      <parameter type-id='80f4b756' name='snapname'/>
      <parameter type-id='80f4b756' name='from'/>
      <parameter type-id='95e97e5e' name='fd'/>
      <parameter type-id='bfbd3c8e' name='flags'/>
      <parameter type-id='9c313c2d' name='resumeobj'/>
      <parameter type-id='9c313c2d' name='resumeoff'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='lzc_send_resume_redacted' mangled-name='lzc_send_resume_redacted' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_send_resume_redacted'>
      <parameter type-id='80f4b756' name='snapname'/>
      <parameter type-id='80f4b756' name='from'/>
      <parameter type-id='95e97e5e' name='fd'/>
      <parameter type-id='bfbd3c8e' name='flags'/>
      <parameter type-id='9c313c2d' name='resumeobj'/>
      <parameter type-id='9c313c2d' name='resumeoff'/>
      <parameter type-id='80f4b756' name='redactbook'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='lzc_send_space_resume_redacted' mangled-name='lzc_send_space_resume_redacted' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_send_space_resume_redacted'>
      <parameter type-id='80f4b756' name='snapname'/>
      <parameter type-id='80f4b756' name='from'/>
      <parameter type-id='bfbd3c8e' name='flags'/>
      <parameter type-id='9c313c2d' name='resumeobj'/>
      <parameter type-id='9c313c2d' name='resumeoff'/>
      <parameter type-id='9c313c2d' name='resume_bytes'/>
      <parameter type-id='80f4b756' name='redactbook'/>
      <parameter type-id='95e97e5e' name='fd'/>
      <parameter type-id='5d6479ae' name='spacep'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='lzc_send_space' mangled-name='lzc_send_space' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_send_space'>
      <parameter type-id='80f4b756' name='snapname'/>
      <parameter type-id='80f4b756' name='from'/>
      <parameter type-id='bfbd3c8e' name='flags'/>
      <parameter type-id='5d6479ae' name='spacep'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='lzc_receive' mangled-name='lzc_receive' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_receive'>
      <parameter type-id='80f4b756' name='snapname'/>
      <parameter type-id='5ce45b60' name='props'/>
      <parameter type-id='80f4b756' name='origin'/>
      <parameter type-id='c19b74c3' name='force'/>
      <parameter type-id='c19b74c3' name='raw'/>
      <parameter type-id='95e97e5e' name='fd'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='lzc_receive_resumable' mangled-name='lzc_receive_resumable' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_receive_resumable'>
      <parameter type-id='80f4b756' name='snapname'/>
      <parameter type-id='5ce45b60' name='props'/>
      <parameter type-id='80f4b756' name='origin'/>
      <parameter type-id='c19b74c3' name='force'/>
      <parameter type-id='c19b74c3' name='raw'/>
      <parameter type-id='95e97e5e' name='fd'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='lzc_receive_with_header' mangled-name='lzc_receive_with_header' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_receive_with_header'>
      <parameter type-id='80f4b756' name='snapname'/>
      <parameter type-id='5ce45b60' name='props'/>
      <parameter type-id='80f4b756' name='origin'/>
      <parameter type-id='c19b74c3' name='force'/>
      <parameter type-id='c19b74c3' name='resumable'/>
      <parameter type-id='c19b74c3' name='raw'/>
      <parameter type-id='95e97e5e' name='fd'/>
      <parameter type-id='8341348b' name='begin_record'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='lzc_receive_one' mangled-name='lzc_receive_one' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_receive_one'>
      <parameter type-id='80f4b756' name='snapname'/>
      <parameter type-id='5ce45b60' name='props'/>
      <parameter type-id='80f4b756' name='origin'/>
      <parameter type-id='c19b74c3' name='force'/>
      <parameter type-id='c19b74c3' name='resumable'/>
      <parameter type-id='c19b74c3' name='raw'/>
      <parameter type-id='95e97e5e' name='input_fd'/>
      <parameter type-id='8341348b' name='begin_record'/>
      <parameter type-id='95e97e5e' name='cleanup_fd'/>
      <parameter type-id='5d6479ae' name='read_bytes'/>
      <parameter type-id='5d6479ae' name='errflags'/>
      <parameter type-id='5d6479ae' name='action_handle'/>
      <parameter type-id='857bb57e' name='errors'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='lzc_receive_with_cmdprops' mangled-name='lzc_receive_with_cmdprops' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_receive_with_cmdprops'>
      <parameter type-id='80f4b756' name='snapname'/>
      <parameter type-id='5ce45b60' name='props'/>
      <parameter type-id='5ce45b60' name='cmdprops'/>
      <parameter type-id='ae3e8ca6' name='wkeydata'/>
      <parameter type-id='3502e3ff' name='wkeylen'/>
      <parameter type-id='80f4b756' name='origin'/>
      <parameter type-id='c19b74c3' name='force'/>
      <parameter type-id='c19b74c3' name='resumable'/>
      <parameter type-id='c19b74c3' name='raw'/>
      <parameter type-id='95e97e5e' name='input_fd'/>
      <parameter type-id='8341348b' name='begin_record'/>
      <parameter type-id='95e97e5e' name='cleanup_fd'/>
      <parameter type-id='5d6479ae' name='read_bytes'/>
      <parameter type-id='5d6479ae' name='errflags'/>
      <parameter type-id='5d6479ae' name='action_handle'/>
      <parameter type-id='857bb57e' name='errors'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='lzc_rollback' mangled-name='lzc_rollback' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_rollback'>
      <parameter type-id='80f4b756' name='fsname'/>
      <parameter type-id='26a90f95' name='snapnamebuf'/>
      <parameter type-id='95e97e5e' name='snapnamelen'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='lzc_rollback_to' mangled-name='lzc_rollback_to' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_rollback_to'>
      <parameter type-id='80f4b756' name='fsname'/>
      <parameter type-id='80f4b756' name='snapname'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='lzc_bookmark' mangled-name='lzc_bookmark' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_bookmark'>
      <parameter type-id='5ce45b60' name='bookmarks'/>
      <parameter type-id='857bb57e' name='errlist'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='lzc_get_bookmarks' mangled-name='lzc_get_bookmarks' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_get_bookmarks'>
      <parameter type-id='80f4b756' name='fsname'/>
      <parameter type-id='5ce45b60' name='props'/>
      <parameter type-id='857bb57e' name='bmarks'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='lzc_get_bookmark_props' mangled-name='lzc_get_bookmark_props' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_get_bookmark_props'>
      <parameter type-id='80f4b756' name='bookmark'/>
      <parameter type-id='857bb57e' name='props'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='lzc_destroy_bookmarks' mangled-name='lzc_destroy_bookmarks' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_destroy_bookmarks'>
      <parameter type-id='5ce45b60' name='bmarks'/>
      <parameter type-id='857bb57e' name='errlist'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='lzc_channel_program' mangled-name='lzc_channel_program' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_channel_program'>
      <parameter type-id='80f4b756' name='pool'/>
      <parameter type-id='80f4b756' name='program'/>
      <parameter type-id='9c313c2d' name='instrlimit'/>
      <parameter type-id='9c313c2d' name='memlimit'/>
      <parameter type-id='5ce45b60' name='argnvl'/>
      <parameter type-id='857bb57e' name='outnvl'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='lzc_pool_checkpoint' mangled-name='lzc_pool_checkpoint' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_pool_checkpoint'>
      <parameter type-id='80f4b756' name='pool'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='lzc_pool_checkpoint_discard' mangled-name='lzc_pool_checkpoint_discard' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_pool_checkpoint_discard'>
      <parameter type-id='80f4b756' name='pool'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='lzc_channel_program_nosync' mangled-name='lzc_channel_program_nosync' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_channel_program_nosync'>
      <parameter type-id='80f4b756' name='pool'/>
      <parameter type-id='80f4b756' name='program'/>
      <parameter type-id='9c313c2d' name='timeout'/>
      <parameter type-id='9c313c2d' name='memlimit'/>
      <parameter type-id='5ce45b60' name='argnvl'/>
      <parameter type-id='857bb57e' name='outnvl'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='lzc_get_vdev_prop' mangled-name='lzc_get_vdev_prop' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_get_vdev_prop'>
      <parameter type-id='80f4b756' name='poolname'/>
      <parameter type-id='5ce45b60' name='innvl'/>
      <parameter type-id='857bb57e' name='outnvl'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='lzc_set_vdev_prop' mangled-name='lzc_set_vdev_prop' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_set_vdev_prop'>
      <parameter type-id='80f4b756' name='poolname'/>
      <parameter type-id='5ce45b60' name='innvl'/>
      <parameter type-id='857bb57e' name='outnvl'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='lzc_load_key' mangled-name='lzc_load_key' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_load_key'>
      <parameter type-id='80f4b756' name='fsname'/>
      <parameter type-id='c19b74c3' name='noop'/>
      <parameter type-id='ae3e8ca6' name='wkeydata'/>
      <parameter type-id='3502e3ff' name='wkeylen'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='lzc_unload_key' mangled-name='lzc_unload_key' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_unload_key'>
      <parameter type-id='80f4b756' name='fsname'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='lzc_change_key' mangled-name='lzc_change_key' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_change_key'>
      <parameter type-id='80f4b756' name='fsname'/>
      <parameter type-id='9c313c2d' name='crypt_cmd'/>
      <parameter type-id='5ce45b60' name='props'/>
      <parameter type-id='ae3e8ca6' name='wkeydata'/>
      <parameter type-id='3502e3ff' name='wkeylen'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='lzc_reopen' mangled-name='lzc_reopen' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_reopen'>
      <parameter type-id='80f4b756' name='pool_name'/>
      <parameter type-id='c19b74c3' name='scrub_restart'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='lzc_initialize' mangled-name='lzc_initialize' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_initialize'>
      <parameter type-id='80f4b756' name='poolname'/>
      <parameter type-id='7063e1ab' name='cmd_type'/>
      <parameter type-id='5ce45b60' name='vdevs'/>
      <parameter type-id='857bb57e' name='errlist'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='lzc_trim' mangled-name='lzc_trim' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_trim'>
      <parameter type-id='80f4b756' name='poolname'/>
      <parameter type-id='b1146b8d' name='cmd_type'/>
      <parameter type-id='9c313c2d' name='rate'/>
      <parameter type-id='c19b74c3' name='secure'/>
      <parameter type-id='5ce45b60' name='vdevs'/>
      <parameter type-id='857bb57e' name='errlist'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='lzc_redact' mangled-name='lzc_redact' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_redact'>
      <parameter type-id='80f4b756' name='snapshot'/>
      <parameter type-id='80f4b756' name='bookname'/>
      <parameter type-id='5ce45b60' name='snapnv'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='lzc_wait' mangled-name='lzc_wait' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_wait'>
      <parameter type-id='80f4b756' name='pool'/>
      <parameter type-id='73446457' name='activity'/>
      <parameter type-id='37e3bd22' name='waited'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='lzc_wait_tag' mangled-name='lzc_wait_tag' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_wait_tag'>
      <parameter type-id='80f4b756' name='pool'/>
      <parameter type-id='73446457' name='activity'/>
      <parameter type-id='9c313c2d' name='tag'/>
      <parameter type-id='37e3bd22' name='waited'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='lzc_wait_fs' mangled-name='lzc_wait_fs' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_wait_fs'>
      <parameter type-id='80f4b756' name='fs'/>
      <parameter type-id='3024501a' name='activity'/>
      <parameter type-id='37e3bd22' name='waited'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='lzc_set_bootenv' mangled-name='lzc_set_bootenv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_set_bootenv'>
      <parameter type-id='80f4b756' name='pool'/>
      <parameter type-id='22cce67b' name='env'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='lzc_get_bootenv' mangled-name='lzc_get_bootenv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_get_bootenv'>
      <parameter type-id='80f4b756' name='pool'/>
      <parameter type-id='857bb57e' name='outnvl'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-type size-in-bits='64' id='c70fa2e8'>
      <parameter type-id='95e97e5e'/>
      <parameter type-id='eaa32e2f'/>
      <return type-id='95e97e5e'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='os/linux/libzfs_core_ioctl.c' language='LANG_C99'>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='32768' id='d16c6df4'>
      <subrange length='4096' type-id='7359adad' id='bc1b5ddc'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='65536' id='163f6aa5'>
      <subrange length='8192' type-id='7359adad' id='c88f397d'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='9c313c2d' size-in-bits='128' id='c1c22e6c'>
      <subrange length='2' type-id='7359adad' id='52efc4ef'/>
    </array-type-def>
    <class-decl name='dmu_objset_stats' size-in-bits='2304' is-struct='yes' visibility='default' id='098f0221'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='dds_num_clones' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='dds_creation_txg' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='dds_guid' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='dds_type' type-id='230f1e16' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='dds_is_snapshot' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='232'>
        <var-decl name='dds_inconsistent' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='240'>
        <var-decl name='dds_redacted' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='248'>
        <var-decl name='dds_origin' type-id='d1617432' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='dmu_objset_stats_t' type-id='098f0221' id='b2c14f17'/>
    <class-decl name='zinject_record' size-in-bits='2816' is-struct='yes' visibility='default' id='3216f820'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='zi_objset' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='zi_object' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='zi_start' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='zi_end' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='zi_guid' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='zi_level' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='zi_error' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='zi_type' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='zi_freq' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='zi_failfast' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='zi_func' type-id='d1617432' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2560'>
        <var-decl name='zi_iotype' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2592'>
        <var-decl name='zi_duration' type-id='3ff5601b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2624'>
        <var-decl name='zi_timer' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2688'>
        <var-decl name='zi_nlanes' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2752'>
        <var-decl name='zi_cmd' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2784'>
        <var-decl name='zi_dvas' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='zinject_record_t' type-id='3216f820' id='a4301ca6'/>
    <class-decl name='zfs_share' size-in-bits='256' is-struct='yes' visibility='default' id='feb6f2da'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='z_exportdata' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='z_sharedata' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='z_sharetype' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='z_sharemax' type-id='9c313c2d' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='zfs_share_t' type-id='feb6f2da' id='ee5cec36'/>
    <class-decl name='zfs_cmd' size-in-bits='109952' is-struct='yes' visibility='default' id='3522cd69'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='zc_name' type-id='d16c6df4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32768'>
        <var-decl name='zc_nvlist_src' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32832'>
        <var-decl name='zc_nvlist_src_size' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32896'>
        <var-decl name='zc_nvlist_dst' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32960'>
        <var-decl name='zc_nvlist_dst_size' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='33024'>
        <var-decl name='zc_nvlist_dst_filled' type-id='c19b74c3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='33056'>
        <var-decl name='zc_pad2' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='33088'>
        <var-decl name='zc_history' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='33152'>
        <var-decl name='zc_value' type-id='163f6aa5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='98688'>
        <var-decl name='zc_string' type-id='d1617432' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='100736'>
        <var-decl name='zc_guid' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='100800'>
        <var-decl name='zc_nvlist_conf' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='100864'>
        <var-decl name='zc_nvlist_conf_size' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='100928'>
        <var-decl name='zc_cookie' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='100992'>
        <var-decl name='zc_objset_type' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='101056'>
        <var-decl name='zc_perm_action' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='101120'>
        <var-decl name='zc_history_len' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='101184'>
        <var-decl name='zc_history_offset' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='101248'>
        <var-decl name='zc_obj' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='101312'>
        <var-decl name='zc_iflags' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='101376'>
        <var-decl name='zc_share' type-id='ee5cec36' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='101632'>
        <var-decl name='zc_objset_stats' type-id='b2c14f17' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='103936'>
        <var-decl name='zc_begin_record' type-id='09fcdc01' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='106368'>
        <var-decl name='zc_inject_record' type-id='a4301ca6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109184'>
        <var-decl name='zc_defer_destroy' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109216'>
        <var-decl name='zc_flags' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109248'>
        <var-decl name='zc_action_handle' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109312'>
        <var-decl name='zc_cleanup_fd' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109344'>
        <var-decl name='zc_simple' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109352'>
        <var-decl name='zc_pad' type-id='d3490169' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109376'>
        <var-decl name='zc_sendobj' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109440'>
        <var-decl name='zc_fromobj' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109504'>
        <var-decl name='zc_createtxg' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109568'>
        <var-decl name='zc_stat' type-id='0371a9c7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109888'>
        <var-decl name='zc_zoneid' type-id='9c313c2d' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='zfs_cmd_t' type-id='3522cd69' id='a5559cdd'/>
    <class-decl name='zfs_stat' size-in-bits='320' is-struct='yes' visibility='default' id='6417f0b9'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='zs_gen' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='zs_mode' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='zs_links' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='zs_ctime' type-id='c1c22e6c' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='zfs_stat_t' type-id='6417f0b9' id='0371a9c7'/>
    <pointer-type-def type-id='a5559cdd' size-in-bits='64' id='e4ec4540'/>
    <function-decl name='lzc_ioctl_fd' mangled-name='lzc_ioctl_fd' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_ioctl_fd'>
      <parameter type-id='95e97e5e' name='fd'/>
      <parameter type-id='7359adad' name='request'/>
      <parameter type-id='e4ec4540' name='zc'/>
      <return type-id='95e97e5e'/>
    </function-decl>
  </abi-instr>
</abi-corpus>
