<abi-corpus path='libzfs_core.so' architecture='elf-amd-x86_64' soname='libzfs_core.so.3'>
  <elf-needed>
    <dependency name='libatomic.so.1'/>
    <dependency name='libuuid.so.1'/>
    <dependency name='libz.so.1'/>
    <dependency name='librt.so.1'/>
    <dependency name='libm.so.6'/>
    <dependency name='libblkid.so.1'/>
    <dependency name='libudev.so.1'/>
    <dependency name='libnvpair.so.3'/>
    <dependency name='libpthread.so.0'/>
    <dependency name='libc.so.6'/>
    <dependency name='ld-linux-x86-64.so.2'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='_sol_getmntent' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='atomic_add_16' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='atomic_add_16_nv' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='atomic_add_32' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='atomic_add_32_nv' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='atomic_add_64' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='atomic_add_64_nv' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='zfs_dev_flush' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zfs_dev_is_dm' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zfs_dev_is_whole_disk' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zfs_device_get_devid' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zfs_device_get_physical' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zfs_get_enclosure_sysfs_path' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zfs_get_underlying_path' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zfs_ioctl_fd' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zfs_isnumber' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zfs_nicebytes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zfs_nicenum' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zfs_nicenum_format' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zfs_niceraw' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zfs_nicetime' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zfs_resolve_shortname' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zfs_strcmp_pathname' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zfs_strip_partition' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zfs_strip_path' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zpool_default_search_paths' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zpool_dump_ddt' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zpool_find_config' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zpool_find_import_blkid' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zpool_history_unpack' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zpool_label_disk_wait' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zpool_open_func' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zpool_read_label' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zpool_search_import' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zutil_alloc' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zutil_strdup' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <elf-variable-symbols>
    <elf-symbol name='default_vtoc_map' size='64' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_debug' size='4' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='libspl_assert_ok' size='4' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-variable-symbols>
  <abi-instr version='1.0' address-size='64' path='libzfs_core.c' comp-dir-path='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core' language='LANG_C99'>
    <type-decl name='int' size-in-bits='32' id='type-id-1'/>
    <function-decl name='libzfs_core_init' mangled-name='libzfs_core_init' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='136' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='libzfs_core_init'>
      <return type-id='type-id-1'/>
    </function-decl>
    <union-decl name='__anonymous_union__' size-in-bits='320' is-anonymous='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='67' column='1' id='type-id-2'>
      <data-member access='private'>
        <var-decl name='__data' type-id='type-id-3' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='69' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='__size' type-id='type-id-4' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='70' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='__align' type-id='type-id-5' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='71' column='1'/>
      </data-member>
    </union-decl>
    <class-decl name='__pthread_mutex_s' size-in-bits='320' is-struct='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='118' column='1' id='type-id-3'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__lock' type-id='type-id-1' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='120' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='__count' type-id='type-id-6' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='121' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__owner' type-id='type-id-1' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='122' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='__nusers' type-id='type-id-6' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='124' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='__kind' type-id='type-id-1' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='148' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='__spins' type-id='type-id-7' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='154' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='176'>
        <var-decl name='__elision' type-id='type-id-7' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='154' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='__list' type-id='type-id-8' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='155' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-6'/>
    <type-decl name='short int' size-in-bits='16' id='type-id-7'/>
    <class-decl name='__pthread_internal_list' size-in-bits='128' is-struct='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='82' column='1' id='type-id-9'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__prev' type-id='type-id-10' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__next' type-id='type-id-10' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='85' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-9' size-in-bits='64' id='type-id-10'/>
    <typedef-decl name='__pthread_list_t' type-id='type-id-9' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='86' column='1' id='type-id-8'/>
    <type-decl name='char' size-in-bits='8' id='type-id-11'/>
    <type-decl name='__ARRAY_SIZE_TYPE__' size-in-bits='64' id='type-id-12'/>

    <array-type-def dimensions='1' type-id='type-id-11' size-in-bits='320' id='type-id-4'>
      <subrange length='40' type-id='type-id-12' id='type-id-13'/>

    </array-type-def>
    <type-decl name='long int' size-in-bits='64' id='type-id-5'/>
    <pointer-type-def type-id='type-id-2' size-in-bits='64' id='type-id-14'/>
    <function-decl name='pthread_mutex_lock' filepath='/usr/include/pthread.h' line='763' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-14'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <qualified-type-def type-id='type-id-11' const='yes' id='type-id-15'/>
    <pointer-type-def type-id='type-id-15' size-in-bits='64' id='type-id-16'/>
    <function-decl name='open' mangled-name='open64' filepath='/usr/include/fcntl.h' line='171' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='pthread_mutex_unlock' filepath='/usr/include/pthread.h' line='774' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-14'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <type-decl name='void' id='type-id-17'/>
    <function-decl name='libzfs_core_fini' mangled-name='libzfs_core_fini' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='156' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='libzfs_core_fini'>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='close' filepath='/usr/include/unistd.h' line='353' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <type-decl name='unnamed-enum-underlying-type' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='type-id-18'/>
    <enum-decl name='lzc_dataset_type' filepath='../../include/libzfs_core.h' line='47' column='1' id='type-id-19'>
      <underlying-type type-id='type-id-18'/>
      <enumerator name='LZC_DATSET_TYPE_ZFS' value='2'/>
      <enumerator name='LZC_DATSET_TYPE_ZVOL' value='3'/>
    </enum-decl>
    <class-decl name='nvlist' size-in-bits='192' is-struct='yes' visibility='default' filepath='../../include/sys/nvpair.h' line='85' column='1' id='type-id-20'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nvl_version' type-id='type-id-21' visibility='default' filepath='../../include/sys/nvpair.h' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='nvl_nvflag' type-id='type-id-22' visibility='default' filepath='../../include/sys/nvpair.h' line='87' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='nvl_priv' type-id='type-id-23' visibility='default' filepath='../../include/sys/nvpair.h' line='88' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='nvl_flag' type-id='type-id-22' visibility='default' filepath='../../include/sys/nvpair.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='nvl_pad' type-id='type-id-21' visibility='default' filepath='../../include/sys/nvpair.h' line='90' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__int32_t' type-id='type-id-1' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='40' column='1' id='type-id-24'/>
    <typedef-decl name='int32_t' type-id='type-id-24' filepath='/usr/include/x86_64-linux-gnu/bits/stdint-intn.h' line='26' column='1' id='type-id-21'/>
    <typedef-decl name='__uint32_t' type-id='type-id-6' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='41' column='1' id='type-id-25'/>
    <typedef-decl name='uint32_t' type-id='type-id-25' filepath='/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h' line='26' column='1' id='type-id-22'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-26'/>
    <typedef-decl name='__uint64_t' type-id='type-id-26' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='44' column='1' id='type-id-27'/>
    <typedef-decl name='uint64_t' type-id='type-id-27' filepath='/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h' line='27' column='1' id='type-id-23'/>
    <typedef-decl name='nvlist_t' type-id='type-id-20' filepath='../../include/sys/nvpair.h' line='91' column='1' id='type-id-28'/>
    <pointer-type-def type-id='type-id-28' size-in-bits='64' id='type-id-29'/>
    <type-decl name='unsigned char' size-in-bits='8' id='type-id-30'/>
    <typedef-decl name='__uint8_t' type-id='type-id-30' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='37' column='1' id='type-id-31'/>
    <typedef-decl name='uint8_t' type-id='type-id-31' filepath='/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h' line='24' column='1' id='type-id-32'/>
    <pointer-type-def type-id='type-id-32' size-in-bits='64' id='type-id-33'/>
    <typedef-decl name='uint_t' type-id='type-id-6' filepath='../../lib/libspl/include/sys/stdtypes.h' line='33' column='1' id='type-id-34'/>
    <function-decl name='lzc_create' mangled-name='lzc_create' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='249' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_create'>
      <parameter type-id='type-id-16' name='fsname' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='249' column='1'/>
      <parameter type-id='type-id-19' name='type' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='249' column='1'/>
      <parameter type-id='type-id-29' name='props' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='249' column='1'/>
      <parameter type-id='type-id-33' name='wkeydata' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='250' column='1'/>
      <parameter type-id='type-id-34' name='wkeylen' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='250' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <pointer-type-def type-id='type-id-20' size-in-bits='64' id='type-id-35'/>
    <function-decl name='fnvlist_alloc' filepath='../../include/sys/nvpair.h' line='276' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-35'/>
    </function-decl>
    <function-decl name='fnvlist_add_int32' filepath='../../include/sys/nvpair.h' line='293' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-35'/>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='fnvlist_add_nvlist' filepath='../../include/sys/nvpair.h' line='298' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-35'/>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-35'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <pointer-type-def type-id='type-id-30' size-in-bits='64' id='type-id-36'/>
    <function-decl name='fnvlist_add_uint8_array' filepath='../../include/sys/nvpair.h' line='303' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-35'/>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-36'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='nvlist_free' filepath='../../include/sys/nvpair.h' line='152' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-35'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <pointer-type-def type-id='type-id-11' size-in-bits='64' id='type-id-37'/>
    <function-decl name='strlcpy' filepath='../../lib/libspl/include/string.h' line='37' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-37'/>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-26'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <pointer-type-def type-id='type-id-26' size-in-bits='64' id='type-id-38'/>
    <function-decl name='fnvlist_pack' filepath='../../include/sys/nvpair.h' line='279' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-35'/>
      <parameter type-id='type-id-38'/>
      <return type-id='type-id-37'/>
    </function-decl>
    <function-decl name='libspl_assertf' filepath='../../lib/libspl/include/assert.h' line='40' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-16'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_uint64' filepath='../../include/sys/nvpair.h' line='327' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-35'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <class-decl name='zfs_cmd' size-in-bits='109952' is-struct='yes' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='477' column='1' id='type-id-39'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='zc_name' type-id='type-id-40' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='478' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32768'>
        <var-decl name='zc_nvlist_src' type-id='type-id-23' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='479' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32832'>
        <var-decl name='zc_nvlist_src_size' type-id='type-id-23' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='480' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32896'>
        <var-decl name='zc_nvlist_dst' type-id='type-id-23' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='481' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32960'>
        <var-decl name='zc_nvlist_dst_size' type-id='type-id-23' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='482' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='33024'>
        <var-decl name='zc_nvlist_dst_filled' type-id='type-id-41' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='483' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='33056'>
        <var-decl name='zc_pad2' type-id='type-id-1' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='484' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='33088'>
        <var-decl name='zc_history' type-id='type-id-23' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='490' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='33152'>
        <var-decl name='zc_value' type-id='type-id-42' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='491' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='98688'>
        <var-decl name='zc_string' type-id='type-id-43' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='492' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='100736'>
        <var-decl name='zc_guid' type-id='type-id-23' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='493' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='100800'>
        <var-decl name='zc_nvlist_conf' type-id='type-id-23' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='494' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='100864'>
        <var-decl name='zc_nvlist_conf_size' type-id='type-id-23' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='495' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='100928'>
        <var-decl name='zc_cookie' type-id='type-id-23' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='496' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='100992'>
        <var-decl name='zc_objset_type' type-id='type-id-23' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='497' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='101056'>
        <var-decl name='zc_perm_action' type-id='type-id-23' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='498' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='101120'>
        <var-decl name='zc_history_len' type-id='type-id-23' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='499' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='101184'>
        <var-decl name='zc_history_offset' type-id='type-id-23' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='500' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='101248'>
        <var-decl name='zc_obj' type-id='type-id-23' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='501' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='101312'>
        <var-decl name='zc_iflags' type-id='type-id-23' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='502' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='101376'>
        <var-decl name='zc_share' type-id='type-id-44' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='503' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='101632'>
        <var-decl name='zc_objset_stats' type-id='type-id-45' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='504' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='103936'>
        <var-decl name='zc_begin_record' type-id='type-id-46' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='505' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='106368'>
        <var-decl name='zc_inject_record' type-id='type-id-47' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='506' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109184'>
        <var-decl name='zc_defer_destroy' type-id='type-id-22' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='507' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109216'>
        <var-decl name='zc_flags' type-id='type-id-22' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='508' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109248'>
        <var-decl name='zc_action_handle' type-id='type-id-23' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='509' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109312'>
        <var-decl name='zc_cleanup_fd' type-id='type-id-1' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='510' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109344'>
        <var-decl name='zc_simple' type-id='type-id-32' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='511' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109352'>
        <var-decl name='zc_pad' type-id='type-id-48' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='512' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109376'>
        <var-decl name='zc_sendobj' type-id='type-id-23' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='513' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109440'>
        <var-decl name='zc_fromobj' type-id='type-id-23' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='514' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109504'>
        <var-decl name='zc_createtxg' type-id='type-id-23' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='515' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109568'>
        <var-decl name='zc_stat' type-id='type-id-49' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='516' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109888'>
        <var-decl name='zc_zoneid' type-id='type-id-23' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='517' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-11' size-in-bits='32768' id='type-id-40'>
      <subrange length='4096' type-id='type-id-12' id='type-id-50'/>

    </array-type-def>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' filepath='../../lib/libspl/include/sys/stdtypes.h' line='26' column='1' id='type-id-51'>
      <underlying-type type-id='type-id-18'/>
      <enumerator name='B_FALSE' value='0'/>
      <enumerator name='B_TRUE' value='1'/>
    </enum-decl>
    <typedef-decl name='boolean_t' type-id='type-id-51' filepath='../../lib/libspl/include/sys/stdtypes.h' line='29' column='1' id='type-id-41'/>

    <array-type-def dimensions='1' type-id='type-id-11' size-in-bits='65536' id='type-id-42'>
      <subrange length='8192' type-id='type-id-12' id='type-id-52'/>

    </array-type-def>

    <array-type-def dimensions='1' type-id='type-id-11' size-in-bits='2048' id='type-id-43'>
      <subrange length='256' type-id='type-id-12' id='type-id-53'/>

    </array-type-def>
    <class-decl name='zfs_share' size-in-bits='256' is-struct='yes' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='452' column='1' id='type-id-54'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='z_exportdata' type-id='type-id-23' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='453' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='z_sharedata' type-id='type-id-23' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='454' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='z_sharetype' type-id='type-id-23' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='455' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='z_sharemax' type-id='type-id-23' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='456' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='zfs_share_t' type-id='type-id-54' filepath='../../include/sys/zfs_ioctl.h' line='457' column='1' id='type-id-44'/>
    <class-decl name='dmu_objset_stats' size-in-bits='2304' is-struct='yes' visibility='default' filepath='../../include/sys/dmu.h' line='931' column='1' id='type-id-55'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='dds_num_clones' type-id='type-id-23' visibility='default' filepath='../../include/sys/dmu.h' line='932' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='dds_creation_txg' type-id='type-id-23' visibility='default' filepath='../../include/sys/dmu.h' line='933' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='dds_guid' type-id='type-id-23' visibility='default' filepath='../../include/sys/dmu.h' line='934' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='dds_type' type-id='type-id-56' visibility='default' filepath='../../include/sys/dmu.h' line='935' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='dds_is_snapshot' type-id='type-id-32' visibility='default' filepath='../../include/sys/dmu.h' line='936' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='232'>
        <var-decl name='dds_inconsistent' type-id='type-id-32' visibility='default' filepath='../../include/sys/dmu.h' line='937' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='240'>
        <var-decl name='dds_redacted' type-id='type-id-32' visibility='default' filepath='../../include/sys/dmu.h' line='938' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='248'>
        <var-decl name='dds_origin' type-id='type-id-43' visibility='default' filepath='../../include/sys/dmu.h' line='939' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='dmu_objset_type' filepath='../../include/sys/fs/zfs.h' line='64' column='1' id='type-id-57'>
      <underlying-type type-id='type-id-18'/>
      <enumerator name='DMU_OST_NONE' value='0'/>
      <enumerator name='DMU_OST_META' value='1'/>
      <enumerator name='DMU_OST_ZFS' value='2'/>
      <enumerator name='DMU_OST_ZVOL' value='3'/>
      <enumerator name='DMU_OST_OTHER' value='4'/>
      <enumerator name='DMU_OST_ANY' value='5'/>
      <enumerator name='DMU_OST_NUMTYPES' value='6'/>
    </enum-decl>
    <typedef-decl name='dmu_objset_type_t' type-id='type-id-57' filepath='../../include/sys/fs/zfs.h' line='72' column='1' id='type-id-56'/>
    <typedef-decl name='dmu_objset_stats_t' type-id='type-id-55' filepath='../../include/sys/dmu.h' line='940' column='1' id='type-id-45'/>
    <class-decl name='drr_begin' size-in-bits='2432' is-struct='yes' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='231' column='1' id='type-id-46'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='drr_magic' type-id='type-id-23' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='232' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='drr_versioninfo' type-id='type-id-23' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='233' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='drr_creation_time' type-id='type-id-23' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='234' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='drr_type' type-id='type-id-56' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='235' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='drr_flags' type-id='type-id-22' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='236' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='drr_toguid' type-id='type-id-23' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='237' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='drr_fromguid' type-id='type-id-23' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='238' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='drr_toname' type-id='type-id-43' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='239' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='zinject_record' size-in-bits='2816' is-struct='yes' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='403' column='1' id='type-id-58'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='zi_objset' type-id='type-id-23' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='404' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='zi_object' type-id='type-id-23' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='405' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='zi_start' type-id='type-id-23' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='406' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='zi_end' type-id='type-id-23' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='407' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='zi_guid' type-id='type-id-23' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='408' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='zi_level' type-id='type-id-22' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='409' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='zi_error' type-id='type-id-22' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='410' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='zi_type' type-id='type-id-23' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='411' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='zi_freq' type-id='type-id-22' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='412' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='zi_failfast' type-id='type-id-22' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='413' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='zi_func' type-id='type-id-43' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='414' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2560'>
        <var-decl name='zi_iotype' type-id='type-id-22' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='415' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2592'>
        <var-decl name='zi_duration' type-id='type-id-21' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='416' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2624'>
        <var-decl name='zi_timer' type-id='type-id-23' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='417' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2688'>
        <var-decl name='zi_nlanes' type-id='type-id-23' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='418' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2752'>
        <var-decl name='zi_cmd' type-id='type-id-22' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='419' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2784'>
        <var-decl name='zi_dvas' type-id='type-id-22' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='420' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='zinject_record_t' type-id='type-id-58' filepath='../../include/sys/zfs_ioctl.h' line='421' column='1' id='type-id-47'/>

    <array-type-def dimensions='1' type-id='type-id-32' size-in-bits='24' id='type-id-48'>
      <subrange length='3' type-id='type-id-12' id='type-id-59'/>

    </array-type-def>
    <class-decl name='zfs_stat' size-in-bits='320' is-struct='yes' visibility='default' filepath='../../include/sys/zfs_stat.h' line='42' column='1' id='type-id-60'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='zs_gen' type-id='type-id-23' visibility='default' filepath='../../include/sys/zfs_stat.h' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='zs_mode' type-id='type-id-23' visibility='default' filepath='../../include/sys/zfs_stat.h' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='zs_links' type-id='type-id-23' visibility='default' filepath='../../include/sys/zfs_stat.h' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='zs_ctime' type-id='type-id-61' visibility='default' filepath='../../include/sys/zfs_stat.h' line='46' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-23' size-in-bits='128' id='type-id-61'>
      <subrange length='2' type-id='type-id-12' id='type-id-62'/>

    </array-type-def>
    <typedef-decl name='zfs_stat_t' type-id='type-id-60' filepath='../../include/sys/zfs_stat.h' line='47' column='1' id='type-id-49'/>
    <pointer-type-def type-id='type-id-39' size-in-bits='64' id='type-id-63'/>
    <function-decl name='zfs_ioctl_fd' filepath='../../include/libzutil.h' line='148' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-63'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='fnvlist_unpack' filepath='../../include/sys/nvpair.h' line='281' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-37'/>
      <parameter type-id='type-id-26'/>
      <return type-id='type-id-35'/>
    </function-decl>
    <function-decl name='fnvlist_pack_free' filepath='../../include/sys/nvpair.h' line='280' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-37'/>
      <parameter type-id='type-id-26'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='lzc_clone' mangled-name='lzc_clone' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='274' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_clone'>
      <parameter type-id='type-id-16' name='fsname' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='274' column='1'/>
      <parameter type-id='type-id-16' name='origin' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='274' column='1'/>
      <parameter type-id='type-id-29' name='props' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='274' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='fnvlist_add_string' filepath='../../include/sys/nvpair.h' line='297' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-35'/>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='lzc_promote' mangled-name='lzc_promote' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='290' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_promote'>
      <parameter type-id='type-id-16' name='fsname' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='290' column='1'/>
      <parameter type-id='type-id-37' name='snapnamebuf' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='290' column='1'/>
      <parameter type-id='type-id-1' name='snapnamelen' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='290' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='lzc_rename' mangled-name='lzc_rename' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='312' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_rename'>
      <parameter type-id='type-id-16' name='source' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='312' column='1'/>
      <parameter type-id='type-id-16' name='target' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='312' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='lzc_destroy' mangled-name='lzc_destroy' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='327' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_destroy'>
      <parameter type-id='type-id-16' name='fsname' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='327' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <pointer-type-def type-id='type-id-29' size-in-bits='64' id='type-id-64'/>
    <function-decl name='lzc_snapshot' mangled-name='lzc_snapshot' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='352' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_snapshot'>
      <parameter type-id='type-id-29' name='snaps' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='352' column='1'/>
      <parameter type-id='type-id-29' name='props' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='352' column='1'/>
      <parameter type-id='type-id-64' name='errlist' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='352' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <class-decl name='nvpair' size-in-bits='128' is-struct='yes' visibility='default' filepath='../../include/sys/nvpair.h' line='73' column='1' id='type-id-65'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nvp_size' type-id='type-id-21' visibility='default' filepath='../../include/sys/nvpair.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='nvp_name_sz' type-id='type-id-66' visibility='default' filepath='../../include/sys/nvpair.h' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='nvp_reserve' type-id='type-id-66' visibility='default' filepath='../../include/sys/nvpair.h' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='nvp_value_elem' type-id='type-id-21' visibility='default' filepath='../../include/sys/nvpair.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='nvp_type' type-id='type-id-67' visibility='default' filepath='../../include/sys/nvpair.h' line='78' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__int16_t' type-id='type-id-7' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='38' column='1' id='type-id-68'/>
    <typedef-decl name='int16_t' type-id='type-id-68' filepath='/usr/include/x86_64-linux-gnu/bits/stdint-intn.h' line='25' column='1' id='type-id-66'/>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' filepath='../../include/sys/nvpair.h' line='37' column='1' id='type-id-69'>
      <underlying-type type-id='type-id-18'/>
      <enumerator name='DATA_TYPE_DONTCARE' value='-1'/>
      <enumerator name='DATA_TYPE_UNKNOWN' value='0'/>
      <enumerator name='DATA_TYPE_BOOLEAN' value='1'/>
      <enumerator name='DATA_TYPE_BYTE' value='2'/>
      <enumerator name='DATA_TYPE_INT16' value='3'/>
      <enumerator name='DATA_TYPE_UINT16' value='4'/>
      <enumerator name='DATA_TYPE_INT32' value='5'/>
      <enumerator name='DATA_TYPE_UINT32' value='6'/>
      <enumerator name='DATA_TYPE_INT64' value='7'/>
      <enumerator name='DATA_TYPE_UINT64' value='8'/>
      <enumerator name='DATA_TYPE_STRING' value='9'/>
      <enumerator name='DATA_TYPE_BYTE_ARRAY' value='10'/>
      <enumerator name='DATA_TYPE_INT16_ARRAY' value='11'/>
      <enumerator name='DATA_TYPE_UINT16_ARRAY' value='12'/>
      <enumerator name='DATA_TYPE_INT32_ARRAY' value='13'/>
      <enumerator name='DATA_TYPE_UINT32_ARRAY' value='14'/>
      <enumerator name='DATA_TYPE_INT64_ARRAY' value='15'/>
      <enumerator name='DATA_TYPE_UINT64_ARRAY' value='16'/>
      <enumerator name='DATA_TYPE_STRING_ARRAY' value='17'/>
      <enumerator name='DATA_TYPE_HRTIME' value='18'/>
      <enumerator name='DATA_TYPE_NVLIST' value='19'/>
      <enumerator name='DATA_TYPE_NVLIST_ARRAY' value='20'/>
      <enumerator name='DATA_TYPE_BOOLEAN_VALUE' value='21'/>
      <enumerator name='DATA_TYPE_INT8' value='22'/>
      <enumerator name='DATA_TYPE_UINT8' value='23'/>
      <enumerator name='DATA_TYPE_BOOLEAN_ARRAY' value='24'/>
      <enumerator name='DATA_TYPE_INT8_ARRAY' value='25'/>
      <enumerator name='DATA_TYPE_UINT8_ARRAY' value='26'/>
      <enumerator name='DATA_TYPE_DOUBLE' value='27'/>
    </enum-decl>
    <typedef-decl name='data_type_t' type-id='type-id-69' filepath='../../include/sys/nvpair.h' line='71' column='1' id='type-id-67'/>
    <pointer-type-def type-id='type-id-65' size-in-bits='64' id='type-id-70'/>
    <function-decl name='nvlist_next_nvpair' filepath='../../include/sys/nvpair.h' line='242' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-35'/>
      <parameter type-id='type-id-70'/>
      <return type-id='type-id-70'/>
    </function-decl>
    <function-decl name='nvpair_name' filepath='../../include/sys/nvpair.h' line='244' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-70'/>
      <return type-id='type-id-37'/>
    </function-decl>
    <function-decl name='lzc_destroy_snaps' mangled-name='lzc_destroy_snaps' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='404' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_destroy_snaps'>
      <parameter type-id='type-id-29' name='snaps' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='404' column='1'/>
      <parameter type-id='type-id-41' name='defer' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='404' column='1'/>
      <parameter type-id='type-id-64' name='errlist' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='404' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='fnvlist_add_boolean' filepath='../../include/sys/nvpair.h' line='286' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-35'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <pointer-type-def type-id='type-id-23' size-in-bits='64' id='type-id-71'/>
    <function-decl name='lzc_snaprange_space' mangled-name='lzc_snaprange_space' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='430' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_snaprange_space'>
      <parameter type-id='type-id-16' name='firstsnap' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='430' column='1'/>
      <parameter type-id='type-id-16' name='lastsnap' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='430' column='1'/>
      <parameter type-id='type-id-71' name='usedp' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='431' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='fnvlist_free' filepath='../../include/sys/nvpair.h' line='277' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-35'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='lzc_exists' mangled-name='lzc_exists' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='459' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_exists'>
      <parameter type-id='type-id-16' name='dataset' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='459' column='1'/>
      <return type-id='type-id-41'/>
    </function-decl>
    <function-decl name='lzc_sync' mangled-name='lzc_sync' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='481' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_sync'>
      <parameter type-id='type-id-16' name='pool_name' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='481' column='1'/>
      <parameter type-id='type-id-29' name='innvl' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='481' column='1'/>
      <parameter type-id='type-id-64' name='outnvl' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='481' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='lzc_hold' mangled-name='lzc_hold' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='514' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_hold'>
      <parameter type-id='type-id-29' name='holds' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='514' column='1'/>
      <parameter type-id='type-id-1' name='cleanup_fd' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='514' column='1'/>
      <parameter type-id='type-id-64' name='errlist' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='514' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='lzc_release' mangled-name='lzc_release' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='561' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_release'>
      <parameter type-id='type-id-29' name='holds' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='561' column='1'/>
      <parameter type-id='type-id-64' name='errlist' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='561' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='lzc_get_holds' mangled-name='lzc_get_holds' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='584' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_get_holds'>
      <parameter type-id='type-id-16' name='snapname' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='584' column='1'/>
      <parameter type-id='type-id-64' name='holdsp' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='584' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <enum-decl name='lzc_send_flags' filepath='../../include/libzfs_core.h' line='77' column='1' id='type-id-72'>
      <underlying-type type-id='type-id-18'/>
      <enumerator name='LZC_SEND_FLAG_EMBED_DATA' value='1'/>
      <enumerator name='LZC_SEND_FLAG_LARGE_BLOCK' value='2'/>
      <enumerator name='LZC_SEND_FLAG_COMPRESS' value='4'/>
      <enumerator name='LZC_SEND_FLAG_RAW' value='8'/>
      <enumerator name='LZC_SEND_FLAG_SAVED' value='16'/>
    </enum-decl>
    <function-decl name='lzc_send' mangled-name='lzc_send' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='625' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_send'>
      <parameter type-id='type-id-16' name='snapname' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='625' column='1'/>
      <parameter type-id='type-id-16' name='from' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='625' column='1'/>
      <parameter type-id='type-id-1' name='fd' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='625' column='1'/>
      <parameter type-id='type-id-72' name='flags' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='626' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='lzc_send_resume_redacted' mangled-name='lzc_send_resume_redacted' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='661' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_send_resume_redacted'>
      <parameter type-id='type-id-16' name='snapname' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='661' column='1'/>
      <parameter type-id='type-id-16' name='from' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='661' column='1'/>
      <parameter type-id='type-id-1' name='fd' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='661' column='1'/>
      <parameter type-id='type-id-72' name='flags' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='662' column='1'/>
      <parameter type-id='type-id-23' name='resumeobj' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='662' column='1'/>
      <parameter type-id='type-id-23' name='resumeoff' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='662' column='1'/>
      <parameter type-id='type-id-16' name='redactbook' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='663' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='fnvlist_add_uint64' filepath='../../include/sys/nvpair.h' line='296' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-35'/>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-26'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='lzc_send_redacted' mangled-name='lzc_send_redacted' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='633' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_send_redacted'>
      <parameter type-id='type-id-16' name='snapname' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='633' column='1'/>
      <parameter type-id='type-id-16' name='from' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='633' column='1'/>
      <parameter type-id='type-id-1' name='fd' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='633' column='1'/>
      <parameter type-id='type-id-72' name='flags' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='634' column='1'/>
      <parameter type-id='type-id-16' name='redactbook' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='634' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='lzc_send_resume' mangled-name='lzc_send_resume' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='641' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_send_resume'>
      <parameter type-id='type-id-16' name='snapname' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='641' column='1'/>
      <parameter type-id='type-id-16' name='from' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='641' column='1'/>
      <parameter type-id='type-id-1' name='fd' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='641' column='1'/>
      <parameter type-id='type-id-72' name='flags' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='642' column='1'/>
      <parameter type-id='type-id-23' name='resumeobj' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='642' column='1'/>
      <parameter type-id='type-id-23' name='resumeoff' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='642' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='lzc_send_space_resume_redacted' mangled-name='lzc_send_space_resume_redacted' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='711' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_send_space_resume_redacted'>
      <parameter type-id='type-id-16' name='snapname' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='711' column='1'/>
      <parameter type-id='type-id-16' name='from' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='711' column='1'/>
      <parameter type-id='type-id-72' name='flags' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='712' column='1'/>
      <parameter type-id='type-id-23' name='resumeobj' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='712' column='1'/>
      <parameter type-id='type-id-23' name='resumeoff' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='712' column='1'/>
      <parameter type-id='type-id-23' name='resume_bytes' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='713' column='1'/>
      <parameter type-id='type-id-16' name='redactbook' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='713' column='1'/>
      <parameter type-id='type-id-1' name='fd' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='713' column='1'/>
      <parameter type-id='type-id-71' name='spacep' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='713' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='lzc_send_space' mangled-name='lzc_send_space' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='749' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_send_space'>
      <parameter type-id='type-id-16' name='snapname' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='749' column='1'/>
      <parameter type-id='type-id-16' name='from' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='749' column='1'/>
      <parameter type-id='type-id-72' name='flags' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='750' column='1'/>
      <parameter type-id='type-id-71' name='spacep' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='750' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='lzc_receive' mangled-name='lzc_receive' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='966' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_receive'>
      <parameter type-id='type-id-16' name='snapname' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='966' column='1'/>
      <parameter type-id='type-id-29' name='props' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='966' column='1'/>
      <parameter type-id='type-id-16' name='origin' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='966' column='1'/>
      <parameter type-id='type-id-41' name='force' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='967' column='1'/>
      <parameter type-id='type-id-41' name='raw' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='967' column='1'/>
      <parameter type-id='type-id-1' name='fd' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='967' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <pointer-type-def type-id='type-id-17' size-in-bits='64' id='type-id-73'/>
    <function-decl name='read' filepath='/usr/include/unistd.h' line='360' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-73'/>
      <parameter type-id='type-id-26'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='fnvlist_add_byte_array' filepath='../../include/sys/nvpair.h' line='301' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-35'/>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-36'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='nvlist_lookup_uint64' filepath='../../include/sys/nvpair.h' line='212' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-35'/>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-38'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <pointer-type-def type-id='type-id-35' size-in-bits='64' id='type-id-74'/>
    <function-decl name='nvlist_lookup_nvlist' filepath='../../include/sys/nvpair.h' line='214' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-35'/>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-74'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='fnvlist_dup' filepath='../../include/sys/nvpair.h' line='282' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-35'/>
      <return type-id='type-id-35'/>
    </function-decl>
    <function-decl name='nvlist_unpack' filepath='../../include/sys/nvpair.h' line='155' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-37'/>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-74'/>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='lzc_receive_resumable' mangled-name='lzc_receive_resumable' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='980' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_receive_resumable'>
      <parameter type-id='type-id-16' name='snapname' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='966' column='1'/>
      <parameter type-id='type-id-29' name='props' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='966' column='1'/>
      <parameter type-id='type-id-16' name='origin' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='966' column='1'/>
      <parameter type-id='type-id-41' name='force' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='967' column='1'/>
      <parameter type-id='type-id-41' name='raw' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='967' column='1'/>
      <parameter type-id='type-id-1' name='fd' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='967' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <class-decl name='dmu_replay_record' size-in-bits='2496' is-struct='yes' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='242' column='1' id='type-id-75'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='drr_type' type-id='type-id-76' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='248' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='drr_payloadlen' type-id='type-id-22' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='249' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='drr_u' type-id='type-id-77' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='384' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' filepath='../../include/sys/zfs_ioctl.h' line='243' column='1' id='type-id-76'>
      <underlying-type type-id='type-id-18'/>
      <enumerator name='DRR_BEGIN' value='0'/>
      <enumerator name='DRR_OBJECT' value='1'/>
      <enumerator name='DRR_FREEOBJECTS' value='2'/>
      <enumerator name='DRR_WRITE' value='3'/>
      <enumerator name='DRR_FREE' value='4'/>
      <enumerator name='DRR_END' value='5'/>
      <enumerator name='DRR_WRITE_BYREF' value='6'/>
      <enumerator name='DRR_SPILL' value='7'/>
      <enumerator name='DRR_WRITE_EMBEDDED' value='8'/>
      <enumerator name='DRR_OBJECT_RANGE' value='9'/>
      <enumerator name='DRR_REDACT' value='10'/>
      <enumerator name='DRR_NUMTYPES' value='11'/>
    </enum-decl>
    <union-decl name='__anonymous_union__' size-in-bits='2432' is-anonymous='yes' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='250' column='1' id='type-id-77'>
      <data-member access='private'>
        <var-decl name='drr_begin' type-id='type-id-46' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='251' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='drr_end' type-id='type-id-78' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='255' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='drr_object' type-id='type-id-79' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='275' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='drr_freeobjects' type-id='type-id-80' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='280' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='drr_write' type-id='type-id-81' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='301' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='drr_free' type-id='type-id-82' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='307' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='drr_write_byref' type-id='type-id-83' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='323' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='drr_spill' type-id='type-id-84' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='338' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='drr_write_embedded' type-id='type-id-85' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='351' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='drr_object_range' type-id='type-id-86' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='361' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='drr_redact' type-id='type-id-87' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='367' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='drr_checksum' type-id='type-id-88' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='383' column='1'/>
      </data-member>
    </union-decl>
    <class-decl name='drr_end' size-in-bits='320' is-struct='yes' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='252' column='1' id='type-id-78'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='drr_checksum' type-id='type-id-89' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='253' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='drr_toguid' type-id='type-id-23' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='254' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='zio_cksum' size-in-bits='256' is-struct='yes' visibility='default' filepath='../../include/sys/spa_checksum.h' line='38' column='1' id='type-id-90'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='zc_word' type-id='type-id-91' visibility='default' filepath='../../include/sys/spa_checksum.h' line='39' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-23' size-in-bits='256' id='type-id-91'>
      <subrange length='4' type-id='type-id-12' id='type-id-92'/>

    </array-type-def>
    <typedef-decl name='zio_cksum_t' type-id='type-id-90' filepath='../../include/sys/spa_checksum.h' line='40' column='1' id='type-id-89'/>
    <class-decl name='drr_object' size-in-bits='448' is-struct='yes' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='256' column='1' id='type-id-79'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='drr_object' type-id='type-id-23' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='257' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='drr_type' type-id='type-id-93' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='258' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='drr_bonustype' type-id='type-id-93' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='259' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='drr_blksz' type-id='type-id-22' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='260' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='drr_bonuslen' type-id='type-id-22' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='261' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='drr_checksumtype' type-id='type-id-32' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='262' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='200'>
        <var-decl name='drr_compress' type-id='type-id-32' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='263' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='208'>
        <var-decl name='drr_dn_slots' type-id='type-id-32' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='264' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='216'>
        <var-decl name='drr_flags' type-id='type-id-32' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='265' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='drr_raw_bonuslen' type-id='type-id-22' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='266' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='drr_toguid' type-id='type-id-23' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='267' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='drr_indblkshift' type-id='type-id-32' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='269' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='328'>
        <var-decl name='drr_nlevels' type-id='type-id-32' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='270' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='336'>
        <var-decl name='drr_nblkptr' type-id='type-id-32' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='271' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='344'>
        <var-decl name='drr_pad' type-id='type-id-94' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='272' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='drr_maxblkid' type-id='type-id-23' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='273' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='dmu_object_type' filepath='../../include/sys/dmu.h' line='165' column='1' id='type-id-95'>
      <underlying-type type-id='type-id-18'/>
      <enumerator name='DMU_OT_NONE' value='0'/>
      <enumerator name='DMU_OT_OBJECT_DIRECTORY' value='1'/>
      <enumerator name='DMU_OT_OBJECT_ARRAY' value='2'/>
      <enumerator name='DMU_OT_PACKED_NVLIST' value='3'/>
      <enumerator name='DMU_OT_PACKED_NVLIST_SIZE' value='4'/>
      <enumerator name='DMU_OT_BPOBJ' value='5'/>
      <enumerator name='DMU_OT_BPOBJ_HDR' value='6'/>
      <enumerator name='DMU_OT_SPACE_MAP_HEADER' value='7'/>
      <enumerator name='DMU_OT_SPACE_MAP' value='8'/>
      <enumerator name='DMU_OT_INTENT_LOG' value='9'/>
      <enumerator name='DMU_OT_DNODE' value='10'/>
      <enumerator name='DMU_OT_OBJSET' value='11'/>
      <enumerator name='DMU_OT_DSL_DIR' value='12'/>
      <enumerator name='DMU_OT_DSL_DIR_CHILD_MAP' value='13'/>
      <enumerator name='DMU_OT_DSL_DS_SNAP_MAP' value='14'/>
      <enumerator name='DMU_OT_DSL_PROPS' value='15'/>
      <enumerator name='DMU_OT_DSL_DATASET' value='16'/>
      <enumerator name='DMU_OT_ZNODE' value='17'/>
      <enumerator name='DMU_OT_OLDACL' value='18'/>
      <enumerator name='DMU_OT_PLAIN_FILE_CONTENTS' value='19'/>
      <enumerator name='DMU_OT_DIRECTORY_CONTENTS' value='20'/>
      <enumerator name='DMU_OT_MASTER_NODE' value='21'/>
      <enumerator name='DMU_OT_UNLINKED_SET' value='22'/>
      <enumerator name='DMU_OT_ZVOL' value='23'/>
      <enumerator name='DMU_OT_ZVOL_PROP' value='24'/>
      <enumerator name='DMU_OT_PLAIN_OTHER' value='25'/>
      <enumerator name='DMU_OT_UINT64_OTHER' value='26'/>
      <enumerator name='DMU_OT_ZAP_OTHER' value='27'/>
      <enumerator name='DMU_OT_ERROR_LOG' value='28'/>
      <enumerator name='DMU_OT_SPA_HISTORY' value='29'/>
      <enumerator name='DMU_OT_SPA_HISTORY_OFFSETS' value='30'/>
      <enumerator name='DMU_OT_POOL_PROPS' value='31'/>
      <enumerator name='DMU_OT_DSL_PERMS' value='32'/>
      <enumerator name='DMU_OT_ACL' value='33'/>
      <enumerator name='DMU_OT_SYSACL' value='34'/>
      <enumerator name='DMU_OT_FUID' value='35'/>
      <enumerator name='DMU_OT_FUID_SIZE' value='36'/>
      <enumerator name='DMU_OT_NEXT_CLONES' value='37'/>
      <enumerator name='DMU_OT_SCAN_QUEUE' value='38'/>
      <enumerator name='DMU_OT_USERGROUP_USED' value='39'/>
      <enumerator name='DMU_OT_USERGROUP_QUOTA' value='40'/>
      <enumerator name='DMU_OT_USERREFS' value='41'/>
      <enumerator name='DMU_OT_DDT_ZAP' value='42'/>
      <enumerator name='DMU_OT_DDT_STATS' value='43'/>
      <enumerator name='DMU_OT_SA' value='44'/>
      <enumerator name='DMU_OT_SA_MASTER_NODE' value='45'/>
      <enumerator name='DMU_OT_SA_ATTR_REGISTRATION' value='46'/>
      <enumerator name='DMU_OT_SA_ATTR_LAYOUTS' value='47'/>
      <enumerator name='DMU_OT_SCAN_XLATE' value='48'/>
      <enumerator name='DMU_OT_DEDUP' value='49'/>
      <enumerator name='DMU_OT_DEADLIST' value='50'/>
      <enumerator name='DMU_OT_DEADLIST_HDR' value='51'/>
      <enumerator name='DMU_OT_DSL_CLONES' value='52'/>
      <enumerator name='DMU_OT_BPOBJ_SUBOBJ' value='53'/>
      <enumerator name='DMU_OT_NUMTYPES' value='54'/>
      <enumerator name='DMU_OTN_UINT8_DATA' value='128'/>
      <enumerator name='DMU_OTN_UINT8_METADATA' value='192'/>
      <enumerator name='DMU_OTN_UINT16_DATA' value='129'/>
      <enumerator name='DMU_OTN_UINT16_METADATA' value='193'/>
      <enumerator name='DMU_OTN_UINT32_DATA' value='130'/>
      <enumerator name='DMU_OTN_UINT32_METADATA' value='194'/>
      <enumerator name='DMU_OTN_UINT64_DATA' value='131'/>
      <enumerator name='DMU_OTN_UINT64_METADATA' value='195'/>
      <enumerator name='DMU_OTN_ZAP_DATA' value='132'/>
      <enumerator name='DMU_OTN_ZAP_METADATA' value='196'/>
      <enumerator name='DMU_OTN_UINT8_ENC_DATA' value='160'/>
      <enumerator name='DMU_OTN_UINT8_ENC_METADATA' value='224'/>
      <enumerator name='DMU_OTN_UINT16_ENC_DATA' value='161'/>
      <enumerator name='DMU_OTN_UINT16_ENC_METADATA' value='225'/>
      <enumerator name='DMU_OTN_UINT32_ENC_DATA' value='162'/>
      <enumerator name='DMU_OTN_UINT32_ENC_METADATA' value='226'/>
      <enumerator name='DMU_OTN_UINT64_ENC_DATA' value='163'/>
      <enumerator name='DMU_OTN_UINT64_ENC_METADATA' value='227'/>
      <enumerator name='DMU_OTN_ZAP_ENC_DATA' value='164'/>
      <enumerator name='DMU_OTN_ZAP_ENC_METADATA' value='228'/>
    </enum-decl>
    <typedef-decl name='dmu_object_type_t' type-id='type-id-95' filepath='../../include/sys/dmu.h' line='269' column='1' id='type-id-93'/>

    <array-type-def dimensions='1' type-id='type-id-32' size-in-bits='40' id='type-id-94'>
      <subrange length='5' type-id='type-id-12' id='type-id-96'/>

    </array-type-def>
    <class-decl name='drr_freeobjects' size-in-bits='192' is-struct='yes' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='276' column='1' id='type-id-80'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='drr_firstobj' type-id='type-id-23' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='277' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='drr_numobjs' type-id='type-id-23' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='278' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='drr_toguid' type-id='type-id-23' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='279' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='drr_write' size-in-bits='1088' is-struct='yes' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='281' column='1' id='type-id-81'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='drr_object' type-id='type-id-23' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='282' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='drr_type' type-id='type-id-93' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='283' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='drr_pad' type-id='type-id-22' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='284' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='drr_offset' type-id='type-id-23' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='285' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='drr_logical_size' type-id='type-id-23' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='286' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='drr_toguid' type-id='type-id-23' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='287' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='drr_checksumtype' type-id='type-id-32' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='288' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='328'>
        <var-decl name='drr_flags' type-id='type-id-32' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='289' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='336'>
        <var-decl name='drr_compressiontype' type-id='type-id-32' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='290' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='344'>
        <var-decl name='drr_pad2' type-id='type-id-94' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='291' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='drr_key' type-id='type-id-97' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='293' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='drr_compressed_size' type-id='type-id-23' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='295' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='drr_salt' type-id='type-id-98' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='297' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='drr_iv' type-id='type-id-99' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='298' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='drr_mac' type-id='type-id-100' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='299' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ddt_key' size-in-bits='320' is-struct='yes' visibility='default' filepath='../../include/sys/ddt.h' line='67' column='1' id='type-id-101'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ddk_cksum' type-id='type-id-89' visibility='default' filepath='../../include/sys/ddt.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='ddk_prop' type-id='type-id-23' visibility='default' filepath='../../include/sys/ddt.h' line='76' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='ddt_key_t' type-id='type-id-101' filepath='../../include/sys/ddt.h' line='77' column='1' id='type-id-97'/>

    <array-type-def dimensions='1' type-id='type-id-32' size-in-bits='64' id='type-id-98'>
      <subrange length='8' type-id='type-id-12' id='type-id-102'/>

    </array-type-def>

    <array-type-def dimensions='1' type-id='type-id-32' size-in-bits='96' id='type-id-99'>
      <subrange length='12' type-id='type-id-12' id='type-id-103'/>

    </array-type-def>

    <array-type-def dimensions='1' type-id='type-id-32' size-in-bits='128' id='type-id-100'>
      <subrange length='16' type-id='type-id-12' id='type-id-104'/>

    </array-type-def>
    <class-decl name='drr_free' size-in-bits='256' is-struct='yes' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='302' column='1' id='type-id-82'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='drr_object' type-id='type-id-23' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='303' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='drr_offset' type-id='type-id-23' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='304' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='drr_length' type-id='type-id-23' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='305' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='drr_toguid' type-id='type-id-23' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='306' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='drr_write_byref' size-in-bits='832' is-struct='yes' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='308' column='1' id='type-id-83'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='drr_object' type-id='type-id-23' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='310' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='drr_offset' type-id='type-id-23' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='311' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='drr_length' type-id='type-id-23' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='312' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='drr_toguid' type-id='type-id-23' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='313' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='drr_refguid' type-id='type-id-23' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='315' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='drr_refobject' type-id='type-id-23' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='316' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='drr_refoffset' type-id='type-id-23' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='317' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='drr_checksumtype' type-id='type-id-32' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='319' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='456'>
        <var-decl name='drr_flags' type-id='type-id-32' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='320' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='464'>
        <var-decl name='drr_pad2' type-id='type-id-105' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='321' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='drr_key' type-id='type-id-97' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='322' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-32' size-in-bits='48' id='type-id-105'>
      <subrange length='6' type-id='type-id-12' id='type-id-106'/>

    </array-type-def>
    <class-decl name='drr_spill' size-in-bits='640' is-struct='yes' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='324' column='1' id='type-id-84'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='drr_object' type-id='type-id-23' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='325' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='drr_length' type-id='type-id-23' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='326' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='drr_toguid' type-id='type-id-23' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='327' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='drr_flags' type-id='type-id-32' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='328' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='200'>
        <var-decl name='drr_compressiontype' type-id='type-id-32' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='329' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='208'>
        <var-decl name='drr_pad' type-id='type-id-105' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='330' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='drr_compressed_size' type-id='type-id-23' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='332' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='drr_salt' type-id='type-id-98' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='333' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='drr_iv' type-id='type-id-99' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='334' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='drr_mac' type-id='type-id-100' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='335' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='608'>
        <var-decl name='drr_type' type-id='type-id-93' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='336' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='drr_write_embedded' size-in-bits='384' is-struct='yes' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='339' column='1' id='type-id-85'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='drr_object' type-id='type-id-23' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='340' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='drr_offset' type-id='type-id-23' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='341' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='drr_length' type-id='type-id-23' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='343' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='drr_toguid' type-id='type-id-23' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='344' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='drr_compression' type-id='type-id-32' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='345' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='264'>
        <var-decl name='drr_etype' type-id='type-id-32' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='346' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='272'>
        <var-decl name='drr_pad' type-id='type-id-105' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='347' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='drr_lsize' type-id='type-id-22' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='348' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='drr_psize' type-id='type-id-22' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='349' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='drr_object_range' size-in-bits='512' is-struct='yes' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='352' column='1' id='type-id-86'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='drr_firstobj' type-id='type-id-23' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='353' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='drr_numslots' type-id='type-id-23' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='354' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='drr_toguid' type-id='type-id-23' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='355' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='drr_salt' type-id='type-id-98' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='356' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='drr_iv' type-id='type-id-99' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='357' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='drr_mac' type-id='type-id-100' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='358' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='drr_flags' type-id='type-id-32' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='359' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='488'>
        <var-decl name='drr_pad' type-id='type-id-48' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='360' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='drr_redact' size-in-bits='256' is-struct='yes' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='362' column='1' id='type-id-87'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='drr_object' type-id='type-id-23' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='363' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='drr_offset' type-id='type-id-23' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='364' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='drr_length' type-id='type-id-23' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='365' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='drr_toguid' type-id='type-id-23' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='366' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='drr_checksum' size-in-bits='2432' is-struct='yes' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='376' column='1' id='type-id-88'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='drr_pad' type-id='type-id-107' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='377' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='drr_checksum' type-id='type-id-89' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='382' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-23' size-in-bits='2176' id='type-id-107'>
      <subrange length='34' type-id='type-id-12' id='type-id-108'/>

    </array-type-def>
    <typedef-decl name='dmu_replay_record_t' type-id='type-id-75' filepath='../../include/sys/zfs_ioctl.h' line='385' column='1' id='type-id-109'/>
    <qualified-type-def type-id='type-id-109' const='yes' id='type-id-110'/>
    <pointer-type-def type-id='type-id-110' size-in-bits='64' id='type-id-111'/>
    <function-decl name='lzc_receive_with_header' mangled-name='lzc_receive_with_header' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='999' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_receive_with_header'>
      <parameter type-id='type-id-16' name='snapname' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='999' column='1'/>
      <parameter type-id='type-id-29' name='props' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='999' column='1'/>
      <parameter type-id='type-id-16' name='origin' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='1000' column='1'/>
      <parameter type-id='type-id-41' name='force' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='1000' column='1'/>
      <parameter type-id='type-id-41' name='resumable' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='1000' column='1'/>
      <parameter type-id='type-id-41' name='raw' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='1000' column='1'/>
      <parameter type-id='type-id-1' name='fd' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='1001' column='1'/>
      <parameter type-id='type-id-111' name='begin_record' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='1001' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='lzc_receive_one' mangled-name='lzc_receive_one' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='1028' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_receive_one'>
      <parameter type-id='type-id-16' name='snapname' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='1028' column='1'/>
      <parameter type-id='type-id-29' name='props' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='1028' column='1'/>
      <parameter type-id='type-id-16' name='origin' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='1029' column='1'/>
      <parameter type-id='type-id-41' name='force' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='1029' column='1'/>
      <parameter type-id='type-id-41' name='resumable' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='1029' column='1'/>
      <parameter type-id='type-id-41' name='raw' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='1029' column='1'/>
      <parameter type-id='type-id-1' name='input_fd' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='1030' column='1'/>
      <parameter type-id='type-id-111' name='begin_record' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='1030' column='1'/>
      <parameter type-id='type-id-1' name='cleanup_fd' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='1030' column='1'/>
      <parameter type-id='type-id-71' name='read_bytes' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='1031' column='1'/>
      <parameter type-id='type-id-71' name='errflags' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='1031' column='1'/>
      <parameter type-id='type-id-71' name='action_handle' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='1031' column='1'/>
      <parameter type-id='type-id-64' name='errors' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='1032' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='lzc_receive_with_cmdprops' mangled-name='lzc_receive_with_cmdprops' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='1047' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_receive_with_cmdprops'>
      <parameter type-id='type-id-16' name='snapname' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='1047' column='1'/>
      <parameter type-id='type-id-29' name='props' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='1047' column='1'/>
      <parameter type-id='type-id-29' name='cmdprops' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='1048' column='1'/>
      <parameter type-id='type-id-33' name='wkeydata' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='1048' column='1'/>
      <parameter type-id='type-id-34' name='wkeylen' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='1048' column='1'/>
      <parameter type-id='type-id-16' name='origin' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='1048' column='1'/>
      <parameter type-id='type-id-41' name='force' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='1049' column='1'/>
      <parameter type-id='type-id-41' name='resumable' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='1049' column='1'/>
      <parameter type-id='type-id-41' name='raw' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='1049' column='1'/>
      <parameter type-id='type-id-1' name='input_fd' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='1049' column='1'/>
      <parameter type-id='type-id-111' name='begin_record' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='1050' column='1'/>
      <parameter type-id='type-id-1' name='cleanup_fd' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='1050' column='1'/>
      <parameter type-id='type-id-71' name='read_bytes' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='1051' column='1'/>
      <parameter type-id='type-id-71' name='errflags' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='1051' column='1'/>
      <parameter type-id='type-id-71' name='action_handle' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='1051' column='1'/>
      <parameter type-id='type-id-64' name='errors' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='1052' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='lzc_rollback' mangled-name='lzc_rollback' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='1070' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_rollback'>
      <parameter type-id='type-id-16' name='fsname' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='1070' column='1'/>
      <parameter type-id='type-id-37' name='snapnamebuf' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='1070' column='1'/>
      <parameter type-id='type-id-1' name='snapnamelen' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='1070' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_string' filepath='../../include/sys/nvpair.h' line='328' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-35'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-37'/>
    </function-decl>
    <function-decl name='lzc_rollback_to' mangled-name='lzc_rollback_to' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='1095' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_rollback_to'>
      <parameter type-id='type-id-16' name='fsname' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='1095' column='1'/>
      <parameter type-id='type-id-16' name='snapname' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='1095' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='lzc_bookmark' mangled-name='lzc_bookmark' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='1125' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_bookmark'>
      <parameter type-id='type-id-29' name='bookmarks' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='1125' column='1'/>
      <parameter type-id='type-id-64' name='errlist' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='1125' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='lzc_get_bookmarks' mangled-name='lzc_get_bookmarks' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='1180' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_get_bookmarks'>
      <parameter type-id='type-id-16' name='pool_name' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='481' column='1'/>
      <parameter type-id='type-id-29' name='innvl' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='481' column='1'/>
      <parameter type-id='type-id-64' name='outnvl' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='481' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='lzc_get_bookmark_props' mangled-name='lzc_get_bookmark_props' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='1201' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_get_bookmark_props'>
      <parameter type-id='type-id-16' name='bookmark' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='1201' column='1'/>
      <parameter type-id='type-id-64' name='props' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='1201' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='lzc_destroy_bookmarks' mangled-name='lzc_destroy_bookmarks' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='1229' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_destroy_bookmarks'>
      <parameter type-id='type-id-29' name='bookmarks' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='1125' column='1'/>
      <parameter type-id='type-id-64' name='errlist' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='1125' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='lzc_channel_program' mangled-name='lzc_channel_program' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='1300' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_channel_program'>
      <parameter type-id='type-id-16' name='pool' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='1300' column='1'/>
      <parameter type-id='type-id-16' name='program' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='1300' column='1'/>
      <parameter type-id='type-id-23' name='instrlimit' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='1300' column='1'/>
      <parameter type-id='type-id-23' name='memlimit' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='1301' column='1'/>
      <parameter type-id='type-id-29' name='argnvl' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='1301' column='1'/>
      <parameter type-id='type-id-64' name='outnvl' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='1301' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='fnvlist_add_boolean_value' filepath='../../include/sys/nvpair.h' line='287' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-35'/>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-51'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='lzc_pool_checkpoint' mangled-name='lzc_pool_checkpoint' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='1331' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_pool_checkpoint'>
      <parameter type-id='type-id-16' name='pool' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='1331' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='lzc_pool_checkpoint_discard' mangled-name='lzc_pool_checkpoint_discard' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='1360' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_pool_checkpoint_discard'>
      <parameter type-id='type-id-16' name='pool' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='1331' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='lzc_channel_program_nosync' mangled-name='lzc_channel_program_nosync' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='1388' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_channel_program_nosync'>
      <parameter type-id='type-id-16' name='pool' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='1300' column='1'/>
      <parameter type-id='type-id-16' name='program' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='1300' column='1'/>
      <parameter type-id='type-id-23' name='instrlimit' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='1300' column='1'/>
      <parameter type-id='type-id-23' name='memlimit' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='1301' column='1'/>
      <parameter type-id='type-id-29' name='argnvl' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='1301' column='1'/>
      <parameter type-id='type-id-64' name='outnvl' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='1301' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='lzc_load_key' mangled-name='lzc_load_key' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='1403' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_load_key'>
      <parameter type-id='type-id-16' name='fsname' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='1403' column='1'/>
      <parameter type-id='type-id-41' name='noop' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='1403' column='1'/>
      <parameter type-id='type-id-33' name='wkeydata' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='1403' column='1'/>
      <parameter type-id='type-id-34' name='wkeylen' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='1404' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='lzc_unload_key' mangled-name='lzc_unload_key' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='1427' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_unload_key'>
      <parameter type-id='type-id-16' name='fsname' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='1427' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='lzc_change_key' mangled-name='lzc_change_key' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='1433' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_change_key'>
      <parameter type-id='type-id-16' name='fsname' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='1433' column='1'/>
      <parameter type-id='type-id-23' name='crypt_cmd' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='1433' column='1'/>
      <parameter type-id='type-id-29' name='props' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='1433' column='1'/>
      <parameter type-id='type-id-33' name='wkeydata' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='1434' column='1'/>
      <parameter type-id='type-id-34' name='wkeylen' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='1434' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='lzc_reopen' mangled-name='lzc_reopen' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='1460' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_reopen'>
      <parameter type-id='type-id-16' name='pool_name' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='1460' column='1'/>
      <parameter type-id='type-id-41' name='scrub_restart' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='1460' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <enum-decl name='pool_initialize_func' filepath='../../include/sys/fs/zfs.h' line='1167' column='1' id='type-id-112'>
      <underlying-type type-id='type-id-18'/>
      <enumerator name='POOL_INITIALIZE_START' value='0'/>
      <enumerator name='POOL_INITIALIZE_CANCEL' value='1'/>
      <enumerator name='POOL_INITIALIZE_SUSPEND' value='2'/>
      <enumerator name='POOL_INITIALIZE_FUNCS' value='3'/>
    </enum-decl>
    <typedef-decl name='pool_initialize_func_t' type-id='type-id-112' filepath='../../include/sys/fs/zfs.h' line='1172' column='1' id='type-id-113'/>
    <function-decl name='lzc_initialize' mangled-name='lzc_initialize' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='1495' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_initialize'>
      <parameter type-id='type-id-16' name='poolname' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='1495' column='1'/>
      <parameter type-id='type-id-113' name='cmd_type' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='1495' column='1'/>
      <parameter type-id='type-id-29' name='vdevs' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='1496' column='1'/>
      <parameter type-id='type-id-64' name='errlist' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='1496' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <enum-decl name='pool_trim_func' filepath='../../include/sys/fs/zfs.h' line='1177' column='1' id='type-id-114'>
      <underlying-type type-id='type-id-18'/>
      <enumerator name='POOL_TRIM_START' value='0'/>
      <enumerator name='POOL_TRIM_CANCEL' value='1'/>
      <enumerator name='POOL_TRIM_SUSPEND' value='2'/>
      <enumerator name='POOL_TRIM_FUNCS' value='3'/>
    </enum-decl>
    <typedef-decl name='pool_trim_func_t' type-id='type-id-114' filepath='../../include/sys/fs/zfs.h' line='1182' column='1' id='type-id-115'/>
    <function-decl name='lzc_trim' mangled-name='lzc_trim' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='1535' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_trim'>
      <parameter type-id='type-id-16' name='poolname' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='1535' column='1'/>
      <parameter type-id='type-id-115' name='cmd_type' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='1535' column='1'/>
      <parameter type-id='type-id-23' name='rate' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='1535' column='1'/>
      <parameter type-id='type-id-41' name='secure' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='1536' column='1'/>
      <parameter type-id='type-id-29' name='vdevs' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='1536' column='1'/>
      <parameter type-id='type-id-64' name='errlist' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='1536' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='lzc_redact' mangled-name='lzc_redact' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='1558' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_redact'>
      <parameter type-id='type-id-16' name='snapshot' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='1558' column='1'/>
      <parameter type-id='type-id-16' name='bookname' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='1558' column='1'/>
      <parameter type-id='type-id-29' name='snapnv' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='1558' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' filepath='../../include/sys/fs/zfs.h' line='1427' column='1' id='type-id-116'>
      <underlying-type type-id='type-id-18'/>
      <enumerator name='ZPOOL_WAIT_CKPT_DISCARD' value='0'/>
      <enumerator name='ZPOOL_WAIT_FREE' value='1'/>
      <enumerator name='ZPOOL_WAIT_INITIALIZE' value='2'/>
      <enumerator name='ZPOOL_WAIT_REPLACE' value='3'/>
      <enumerator name='ZPOOL_WAIT_REMOVE' value='4'/>
      <enumerator name='ZPOOL_WAIT_RESILVER' value='5'/>
      <enumerator name='ZPOOL_WAIT_SCRUB' value='6'/>
      <enumerator name='ZPOOL_WAIT_TRIM' value='7'/>
      <enumerator name='ZPOOL_WAIT_NUM_ACTIVITIES' value='8'/>
    </enum-decl>
    <typedef-decl name='zpool_wait_activity_t' type-id='type-id-116' filepath='../../include/sys/fs/zfs.h' line='1437' column='1' id='type-id-117'/>
    <pointer-type-def type-id='type-id-41' size-in-bits='64' id='type-id-118'/>
    <function-decl name='lzc_wait' mangled-name='lzc_wait' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='1592' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_wait'>
      <parameter type-id='type-id-16' name='pool' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='1592' column='1'/>
      <parameter type-id='type-id-117' name='activity' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='1592' column='1'/>
      <parameter type-id='type-id-118' name='waited' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='1592' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_boolean_value' filepath='../../include/sys/nvpair.h' line='318' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-35'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='lzc_wait_tag' mangled-name='lzc_wait_tag' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='1598' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_wait_tag'>
      <parameter type-id='type-id-16' name='pool' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='1598' column='1'/>
      <parameter type-id='type-id-117' name='activity' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='1598' column='1'/>
      <parameter type-id='type-id-23' name='tag' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='1598' column='1'/>
      <parameter type-id='type-id-118' name='waited' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='1599' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' filepath='../../include/sys/fs/zfs.h' line='1439' column='1' id='type-id-119'>
      <underlying-type type-id='type-id-18'/>
      <enumerator name='ZFS_WAIT_DELETEQ' value='0'/>
      <enumerator name='ZFS_WAIT_NUM_ACTIVITIES' value='1'/>
    </enum-decl>
    <typedef-decl name='zfs_wait_activity_t' type-id='type-id-119' filepath='../../include/sys/fs/zfs.h' line='1442' column='1' id='type-id-120'/>
    <function-decl name='lzc_wait_fs' mangled-name='lzc_wait_fs' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='1605' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_wait_fs'>
      <parameter type-id='type-id-16' name='fs' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='1605' column='1'/>
      <parameter type-id='type-id-120' name='activity' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='1605' column='1'/>
      <parameter type-id='type-id-118' name='waited' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='1605' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <qualified-type-def type-id='type-id-28' const='yes' id='type-id-121'/>
    <pointer-type-def type-id='type-id-121' size-in-bits='64' id='type-id-122'/>
    <function-decl name='lzc_set_bootenv' mangled-name='lzc_set_bootenv' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='1628' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_set_bootenv'>
      <parameter type-id='type-id-16' name='pool' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='1628' column='1'/>
      <parameter type-id='type-id-122' name='env' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='1628' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='lzc_get_bootenv' mangled-name='lzc_get_bootenv' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='1637' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_get_bootenv'>
      <parameter type-id='type-id-16' name='snapname' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='584' column='1'/>
      <parameter type-id='type-id-64' name='holdsp' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzfs_core/libzfs_core.c' line='584' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='zutil_device_path.c' comp-dir-path='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzutil' language='LANG_C99'>
    <typedef-decl name='size_t' type-id='type-id-26' filepath='/usr/lib/llvm-13/lib/clang/13.0.0/include/stddef.h' line='46' column='1' id='type-id-123'/>
    <function-decl name='zfs_resolve_shortname' mangled-name='zfs_resolve_shortname' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzutil/zutil_device_path.c' line='41' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_resolve_shortname'>
      <parameter type-id='type-id-16' name='name' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzutil/zutil_device_path.c' line='41' column='1'/>
      <parameter type-id='type-id-37' name='path' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzutil/zutil_device_path.c' line='41' column='1'/>
      <parameter type-id='type-id-123' name='len' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzutil/zutil_device_path.c' line='41' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='getenv' filepath='/usr/include/stdlib.h' line='631' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-37'/>
    </function-decl>
    <function-decl name='access' filepath='/usr/include/unistd.h' line='287' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <qualified-type-def type-id='type-id-16' const='yes' id='type-id-124'/>
    <pointer-type-def type-id='type-id-124' size-in-bits='64' id='type-id-125'/>
    <function-decl name='zpool_default_search_paths' filepath='../../include/libzutil.h' line='78' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-38'/>
      <return type-id='type-id-125'/>
    </function-decl>
    <function-decl name='zfs_strcmp_pathname' mangled-name='zfs_strcmp_pathname' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzutil/zutil_device_path.c' line='139' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_strcmp_pathname'>
      <parameter type-id='type-id-16' name='name' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzutil/zutil_device_path.c' line='139' column='1'/>
      <parameter type-id='type-id-16' name='cmp' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzutil/zutil_device_path.c' line='139' column='1'/>
      <parameter type-id='type-id-1' name='wholedisk' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzutil/zutil_device_path.c' line='139' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='strlcat' filepath='../../lib/libspl/include/string.h' line='33' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-37'/>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-26'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='zfs_append_partition' filepath='../../include/libzutil.h' line='96' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-37'/>
      <parameter type-id='type-id-26'/>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='zutil_import.c' comp-dir-path='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzutil' language='LANG_C99'>
    <class-decl name='libpc_handle' size-in-bits='8448' is-struct='yes' visibility='default' filepath='./zutil_import.h' line='41' column='1' id='type-id-126'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='lpc_printerr' type-id='type-id-41' visibility='default' filepath='./zutil_import.h' line='42' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='lpc_open_access_error' type-id='type-id-41' visibility='default' filepath='./zutil_import.h' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='lpc_desc_active' type-id='type-id-41' visibility='default' filepath='./zutil_import.h' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='lpc_desc' type-id='type-id-127' visibility='default' filepath='./zutil_import.h' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8320'>
        <var-decl name='lpc_ops' type-id='type-id-128' visibility='default' filepath='./zutil_import.h' line='46' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8384'>
        <var-decl name='lpc_lib_handle' type-id='type-id-73' visibility='default' filepath='./zutil_import.h' line='47' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-11' size-in-bits='8192' id='type-id-127'>
      <subrange length='1024' type-id='type-id-12' id='type-id-129'/>

    </array-type-def>
    <class-decl name='pool_config_ops' size-in-bits='128' is-struct='yes' visibility='default' filepath='../../include/libzutil.h' line='51' column='1' id='type-id-130'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='pco_refresh_config' type-id='type-id-131' visibility='default' filepath='../../include/libzutil.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='pco_pool_active' type-id='type-id-132' visibility='default' filepath='../../include/libzutil.h' line='53' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='refresh_config_func_t' type-id='type-id-133' filepath='../../include/libzutil.h' line='47' column='1' id='type-id-134'/>
    <pointer-type-def type-id='type-id-134' size-in-bits='64' id='type-id-131'/>
    <typedef-decl name='pool_active_func_t' type-id='type-id-135' filepath='../../include/libzutil.h' line='49' column='1' id='type-id-136'/>
    <pointer-type-def type-id='type-id-136' size-in-bits='64' id='type-id-132'/>
    <qualified-type-def type-id='type-id-130' const='yes' id='type-id-137'/>
    <typedef-decl name='pool_config_ops_t' type-id='type-id-137' filepath='../../include/libzutil.h' line='54' column='1' id='type-id-138'/>
    <pointer-type-def type-id='type-id-138' size-in-bits='64' id='type-id-128'/>
    <typedef-decl name='libpc_handle_t' type-id='type-id-126' filepath='./zutil_import.h' line='48' column='1' id='type-id-140'/>
    <pointer-type-def type-id='type-id-140' size-in-bits='64' id='type-id-141'/>
    <function-decl name='zutil_alloc' mangled-name='zutil_alloc' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzutil/zutil_import.c' line='136' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zutil_alloc'>
      <parameter type-id='type-id-141' name='hdl' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzutil/zutil_import.c' line='136' column='1'/>
      <parameter type-id='type-id-123' name='size' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzutil/zutil_import.c' line='136' column='1'/>
      <return type-id='type-id-73'/>
    </function-decl>
    <function-decl name='zutil_strdup' mangled-name='zutil_strdup' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzutil/zutil_import.c' line='147' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zutil_strdup'>
      <parameter type-id='type-id-141' name='hdl' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzutil/zutil_import.c' line='147' column='1'/>
      <parameter type-id='type-id-16' name='str' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzutil/zutil_import.c' line='147' column='1'/>
      <return type-id='type-id-37'/>
    </function-decl>
    <pointer-type-def type-id='type-id-1' size-in-bits='64' id='type-id-142'/>
    <function-decl name='zpool_read_label' mangled-name='zpool_read_label' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzutil/zutil_import.c' line='897' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_read_label'>
      <parameter type-id='type-id-1' name='fd' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzutil/zutil_import.c' line='897' column='1'/>
      <parameter type-id='type-id-64' name='config' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzutil/zutil_import.c' line='897' column='1'/>
      <parameter type-id='type-id-142' name='num_labels' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzutil/zutil_import.c' line='897' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='ioctl' filepath='/usr/include/x86_64-linux-gnu/sys/ioctl.h' line='41' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-26'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='spl_pagesize' filepath='../../lib/libspl/include/os/linux/sys/param.h' line='64' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-26'/>
    </function-decl>
    <pointer-type-def type-id='type-id-73' size-in-bits='64' id='type-id-143'/>
    <function-decl name='posix_memalign' filepath='/usr/include/stdlib.h' line='577' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-143'/>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-26'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <class-decl name='aiocb' size-in-bits='1344' is-struct='yes' visibility='default' filepath='/usr/include/aio.h' line='34' column='1' id='type-id-144'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='aio_fildes' type-id='type-id-1' visibility='default' filepath='/usr/include/aio.h' line='36' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='aio_lio_opcode' type-id='type-id-1' visibility='default' filepath='/usr/include/aio.h' line='37' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='aio_reqprio' type-id='type-id-1' visibility='default' filepath='/usr/include/aio.h' line='38' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='aio_buf' type-id='type-id-145' visibility='default' filepath='/usr/include/aio.h' line='39' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='aio_nbytes' type-id='type-id-123' visibility='default' filepath='/usr/include/aio.h' line='40' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='aio_sigevent' type-id='type-id-146' visibility='default' filepath='/usr/include/aio.h' line='41' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='__next_prio' type-id='type-id-147' visibility='default' filepath='/usr/include/aio.h' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='__abs_prio' type-id='type-id-1' visibility='default' filepath='/usr/include/aio.h' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='864'>
        <var-decl name='__policy' type-id='type-id-1' visibility='default' filepath='/usr/include/aio.h' line='46' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='__error_code' type-id='type-id-1' visibility='default' filepath='/usr/include/aio.h' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='__return_value' type-id='type-id-148' visibility='default' filepath='/usr/include/aio.h' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='aio_offset' type-id='type-id-149' visibility='default' filepath='/usr/include/aio.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='__glibc_reserved' type-id='type-id-150' visibility='default' filepath='/usr/include/aio.h' line='56' column='1'/>
      </data-member>
    </class-decl>
    <qualified-type-def type-id='type-id-17' volatile='yes' id='type-id-151'/>
    <pointer-type-def type-id='type-id-151' size-in-bits='64' id='type-id-145'/>
    <class-decl name='sigevent' size-in-bits='512' is-struct='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/sigevent_t.h' line='22' column='1' id='type-id-146'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sigev_value' type-id='type-id-152' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/sigevent_t.h' line='24' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='sigev_signo' type-id='type-id-1' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/sigevent_t.h' line='25' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='sigev_notify' type-id='type-id-1' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/sigevent_t.h' line='26' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_sigev_un' type-id='type-id-153' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/sigevent_t.h' line='41' column='1'/>
      </data-member>
    </class-decl>
    <union-decl name='sigval' size-in-bits='64' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/__sigval_t.h' line='24' column='1' id='type-id-154'>
      <data-member access='private'>
        <var-decl name='sival_int' type-id='type-id-1' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/__sigval_t.h' line='26' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='sival_ptr' type-id='type-id-73' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/__sigval_t.h' line='27' column='1'/>
      </data-member>
    </union-decl>
    <typedef-decl name='__sigval_t' type-id='type-id-154' filepath='/usr/include/x86_64-linux-gnu/bits/types/__sigval_t.h' line='30' column='1' id='type-id-152'/>
    <union-decl name='__anonymous_union__' size-in-bits='384' is-anonymous='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/sigevent_t.h' line='28' column='1' id='type-id-153'>
      <data-member access='private'>
        <var-decl name='_pad' type-id='type-id-155' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/sigevent_t.h' line='30' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='_tid' type-id='type-id-156' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/sigevent_t.h' line='34' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='_sigev_thread' type-id='type-id-157' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/sigevent_t.h' line='40' column='1'/>
      </data-member>
    </union-decl>

    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='384' id='type-id-155'>
      <subrange length='12' type-id='type-id-12' id='type-id-103'/>

    </array-type-def>
    <typedef-decl name='__pid_t' type-id='type-id-1' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='152' column='1' id='type-id-156'/>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/sigevent_t.h' line='36' column='1' id='type-id-157'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_function' type-id='type-id-158' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/sigevent_t.h' line='38' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_attribute' type-id='type-id-159' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/sigevent_t.h' line='39' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-160' size-in-bits='64' id='type-id-158'/>
    <union-decl name='pthread_attr_t' size-in-bits='448' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='56' column='1' id='type-id-161'>
      <data-member access='private'>
        <var-decl name='__size' type-id='type-id-162' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='58' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='__align' type-id='type-id-5' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='59' column='1'/>
      </data-member>
    </union-decl>

    <array-type-def dimensions='1' type-id='type-id-11' size-in-bits='448' id='type-id-162'>
      <subrange length='56' type-id='type-id-12' id='type-id-163'/>

    </array-type-def>
    <typedef-decl name='pthread_attr_t' type-id='type-id-161' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='62' column='1' id='type-id-164'/>
    <pointer-type-def type-id='type-id-164' size-in-bits='64' id='type-id-159'/>
    <pointer-type-def type-id='type-id-144' size-in-bits='64' id='type-id-147'/>
    <typedef-decl name='__ssize_t' type-id='type-id-5' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='191' column='1' id='type-id-148'/>
    <typedef-decl name='__off64_t' type-id='type-id-5' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='151' column='1' id='type-id-149'/>

    <array-type-def dimensions='1' type-id='type-id-11' size-in-bits='256' id='type-id-150'>
      <subrange length='32' type-id='type-id-12' id='type-id-165'/>

    </array-type-def>
    <qualified-type-def type-id='type-id-147' const='yes' id='type-id-166'/>
    <pointer-type-def type-id='type-id-166' size-in-bits='64' id='type-id-167'/>
    <pointer-type-def type-id='type-id-146' size-in-bits='64' id='type-id-168'/>
    <function-decl name='lio_listio' mangled-name='lio_listio64' filepath='/usr/include/aio.h' line='183' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-167'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-168'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <qualified-type-def type-id='type-id-144' const='yes' id='type-id-169'/>
    <pointer-type-def type-id='type-id-169' size-in-bits='64' id='type-id-170'/>
    <function-decl name='aio_error' mangled-name='aio_error64' filepath='/usr/include/aio.h' line='189' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-170'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='aio_return' mangled-name='aio_return64' filepath='/usr/include/aio.h' line='191' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-147'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='slice_cache_compare' mangled-name='slice_cache_compare' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzutil/zutil_import.c' line='1010' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='slice_cache_compare'>
      <parameter type-id='type-id-73' name='arg1' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzutil/zutil_import.c' line='1010' column='1'/>
      <parameter type-id='type-id-73' name='arg2' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzutil/zutil_import.c' line='1010' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <pointer-type-def type-id='type-id-37' size-in-bits='64' id='type-id-171'/>
    <function-decl name='label_paths' mangled-name='label_paths' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzutil/zutil_import.c' line='1070' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='label_paths'>
      <parameter type-id='type-id-141' name='hdl' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzutil/zutil_import.c' line='1070' column='1'/>
      <parameter type-id='type-id-29' name='label' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzutil/zutil_import.c' line='1070' column='1'/>
      <parameter type-id='type-id-171' name='path' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzutil/zutil_import.c' line='1070' column='1'/>
      <parameter type-id='type-id-171' name='devid' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzutil/zutil_import.c' line='1070' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <pointer-type-def type-id='type-id-74' size-in-bits='64' id='type-id-172'/>
    <pointer-type-def type-id='type-id-6' size-in-bits='64' id='type-id-173'/>
    <function-decl name='nvlist_lookup_nvlist_array' filepath='../../include/sys/nvpair.h' line='227' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-35'/>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-172'/>
      <parameter type-id='type-id-173'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='nvlist_lookup_string' filepath='../../include/sys/nvpair.h' line='213' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-35'/>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-171'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <class-decl name='importargs' size-in-bits='448' is-struct='yes' visibility='default' filepath='../../include/libzutil.h' line='62' column='1' id='type-id-174'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='path' type-id='type-id-171' visibility='default' filepath='../../include/libzutil.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='paths' type-id='type-id-1' visibility='default' filepath='../../include/libzutil.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='poolname' type-id='type-id-16' visibility='default' filepath='../../include/libzutil.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='guid' type-id='type-id-23' visibility='default' filepath='../../include/libzutil.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='cachefile' type-id='type-id-16' visibility='default' filepath='../../include/libzutil.h' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='can_be_active' type-id='type-id-41' visibility='default' filepath='../../include/libzutil.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='scan' type-id='type-id-41' visibility='default' filepath='../../include/libzutil.h' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='policy' type-id='type-id-29' visibility='default' filepath='../../include/libzutil.h' line='70' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='importargs_t' type-id='type-id-174' filepath='../../include/libzutil.h' line='71' column='1' id='type-id-175'/>
    <pointer-type-def type-id='type-id-175' size-in-bits='64' id='type-id-176'/>
    <function-decl name='zpool_search_import' mangled-name='zpool_search_import' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzutil/zutil_import.c' line='1642' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_search_import'>
      <parameter type-id='type-id-73' name='hdl' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzutil/zutil_import.c' line='1642' column='1'/>
      <parameter type-id='type-id-176' name='import' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzutil/zutil_import.c' line='1642' column='1'/>
      <parameter type-id='type-id-128' name='pco' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzutil/zutil_import.c' line='1643' column='1'/>
      <return type-id='type-id-29'/>
    </function-decl>
    <function-decl name='dcgettext' filepath='/usr/include/libintl.h' line='51' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-37'/>
    </function-decl>
    <union-decl name='__anonymous_union__' size-in-bits='32' is-anonymous='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='32' column='1' id='type-id-177'>
      <data-member access='private'>
        <var-decl name='__size' type-id='type-id-178' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='34' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='__align' type-id='type-id-1' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='35' column='1'/>
      </data-member>
    </union-decl>

    <array-type-def dimensions='1' type-id='type-id-11' size-in-bits='32' id='type-id-178'>
      <subrange length='4' type-id='type-id-12' id='type-id-92'/>

    </array-type-def>
    <qualified-type-def type-id='type-id-177' const='yes' id='type-id-179'/>
    <pointer-type-def type-id='type-id-179' size-in-bits='64' id='type-id-180'/>
    <function-decl name='pthread_mutex_init' filepath='/usr/include/pthread.h' line='750' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-180'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <class-decl name='avl_tree' size-in-bits='320' is-struct='yes' visibility='default' filepath='../../include/sys/avl_impl.h' line='146' column='1' id='type-id-181'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='avl_root' type-id='type-id-182' visibility='default' filepath='../../include/sys/avl_impl.h' line='147' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='avl_compar' type-id='type-id-183' visibility='default' filepath='../../include/sys/avl_impl.h' line='148' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='avl_offset' type-id='type-id-123' visibility='default' filepath='../../include/sys/avl_impl.h' line='149' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='avl_numnodes' type-id='type-id-184' visibility='default' filepath='../../include/sys/avl_impl.h' line='150' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='avl_size' type-id='type-id-123' visibility='default' filepath='../../include/sys/avl_impl.h' line='151' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='avl_node' size-in-bits='192' is-struct='yes' visibility='default' filepath='../../include/sys/avl_impl.h' line='90' column='1' id='type-id-185'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='avl_child' type-id='type-id-186' visibility='default' filepath='../../include/sys/avl_impl.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='avl_pcb' type-id='type-id-187' visibility='default' filepath='../../include/sys/avl_impl.h' line='92' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-185' size-in-bits='64' id='type-id-182'/>

    <array-type-def dimensions='1' type-id='type-id-182' size-in-bits='128' id='type-id-186'>
      <subrange length='2' type-id='type-id-12' id='type-id-62'/>

    </array-type-def>
    <typedef-decl name='uintptr_t' type-id='type-id-26' filepath='/usr/include/stdint.h' line='90' column='1' id='type-id-187'/>
    <pointer-type-def type-id='type-id-188' size-in-bits='64' id='type-id-183'/>
    <typedef-decl name='ulong_t' type-id='type-id-26' filepath='../../lib/libspl/include/sys/stdtypes.h' line='34' column='1' id='type-id-184'/>
    <pointer-type-def type-id='type-id-181' size-in-bits='64' id='type-id-189'/>
    <function-decl name='avl_create' filepath='../../include/sys/avl.h' line='163' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-189'/>
      <parameter type-id='type-id-183'/>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-26'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='dirname' filepath='/usr/include/libgen.h' line='26' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-37'/>
      <return type-id='type-id-37'/>
    </function-decl>
    <function-decl name='realpath' filepath='/usr/include/stdlib.h' line='797' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-37'/>
      <return type-id='type-id-37'/>
    </function-decl>
    <function-decl name='avl_destroy_nodes' filepath='../../include/sys/avl.h' line='309' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-189'/>
      <parameter type-id='type-id-143'/>
      <return type-id='type-id-73'/>
    </function-decl>
    <function-decl name='pthread_mutex_destroy' filepath='/usr/include/pthread.h' line='755' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-14'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <pointer-type-def type-id='type-id-126' size-in-bits='64' id='type-id-190'/>
    <pointer-type-def type-id='type-id-189' size-in-bits='64' id='type-id-191'/>
    <function-decl name='zpool_find_import_blkid' filepath='./zutil_import.h' line='53' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-190'/>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-191'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='nvlist_empty' filepath='../../include/sys/nvpair.h' line='239' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-35'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='geteuid' filepath='/usr/include/unistd.h' line='678' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='nvlist_alloc' filepath='../../include/sys/nvpair.h' line='151' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-74'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='fnvpair_value_nvlist' filepath='../../include/sys/nvpair.h' line='352' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-70'/>
      <return type-id='type-id-35'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_nvlist' filepath='../../include/sys/nvpair.h' line='329' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-35'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-35'/>
    </function-decl>
    <function-decl name='nvlist_add_string' filepath='../../include/sys/nvpair.h' line='179' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-35'/>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='nvlist_add_nvlist' filepath='../../include/sys/nvpair.h' line='180' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-35'/>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-35'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='zpool_find_config' mangled-name='zpool_find_config' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzutil/zutil_import.c' line='1685' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_find_config'>
      <parameter type-id='type-id-73' name='hdl' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzutil/zutil_import.c' line='1685' column='1'/>
      <parameter type-id='type-id-16' name='target' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzutil/zutil_import.c' line='1685' column='1'/>
      <parameter type-id='type-id-64' name='configp' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzutil/zutil_import.c' line='1685' column='1'/>
      <parameter type-id='type-id-176' name='args' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzutil/zutil_import.c' line='1686' column='1'/>
      <parameter type-id='type-id-128' name='pco' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzutil/zutil_import.c' line='1686' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='nvpair_value_nvlist' filepath='../../include/sys/nvpair.h' line='258' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-70'/>
      <parameter type-id='type-id-74'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='sysconf' filepath='/usr/include/unistd.h' line='619' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <class-decl name='tpool' size-in-bits='2496' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-192'/>
    <pointer-type-def type-id='type-id-192' size-in-bits='64' id='type-id-193'/>
    <function-decl name='tpool_create' filepath='../../include/thread_pool.h' line='42' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-159'/>
      <return type-id='type-id-193'/>
    </function-decl>
    <function-decl name='avl_first' filepath='../../include/sys/avl.h' line='205' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-189'/>
      <return type-id='type-id-73'/>
    </function-decl>
    <pointer-type-def type-id='type-id-194' size-in-bits='64' id='type-id-195'/>
    <function-decl name='tpool_dispatch' filepath='../../include/thread_pool.h' line='44' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-193'/>
      <parameter type-id='type-id-195'/>
      <parameter type-id='type-id-73'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='avl_walk' filepath='../../include/sys/avl_impl.h' line='158' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-189'/>
      <parameter type-id='type-id-73'/>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-73'/>
    </function-decl>
    <function-decl name='tpool_wait' filepath='../../include/thread_pool.h' line='48' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-193'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='tpool_destroy' filepath='../../include/thread_pool.h' line='46' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-193'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='avl_destroy' filepath='../../include/sys/avl.h' line='317' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-189'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='nvlist_remove' filepath='../../include/sys/nvpair.h' line='198' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-35'/>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-69'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='nvlist_add_uint64' filepath='../../include/sys/nvpair.h' line='178' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-35'/>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-26'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <pointer-type-def type-id='type-id-38' size-in-bits='64' id='type-id-196'/>
    <function-decl name='nvlist_lookup_uint64_array' filepath='../../include/sys/nvpair.h' line='225' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-35'/>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-196'/>
      <parameter type-id='type-id-173'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='nvlist_add_uint64_array' filepath='../../include/sys/nvpair.h' line='190' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-35'/>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-38'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='nvlist_dup' filepath='../../include/sys/nvpair.h' line='156' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-35'/>
      <parameter type-id='type-id-74'/>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='nvlist_add_nvlist_array' filepath='../../include/sys/nvpair.h' line='192' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-35'/>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-74'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-197'/>
    <pointer-type-def type-id='type-id-197' size-in-bits='64' id='type-id-198'/>
    <function-decl name='opendir' filepath='/usr/include/dirent.h' line='134' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-198'/>
    </function-decl>
    <class-decl name='dirent64' size-in-bits='2240' is-struct='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/dirent.h' line='37' column='1' id='type-id-199'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='d_ino' type-id='type-id-200' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/dirent.h' line='39' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='d_off' type-id='type-id-149' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/dirent.h' line='40' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='d_reclen' type-id='type-id-201' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/dirent.h' line='41' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='144'>
        <var-decl name='d_type' type-id='type-id-30' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/dirent.h' line='42' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='152'>
        <var-decl name='d_name' type-id='type-id-43' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/dirent.h' line='43' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__ino64_t' type-id='type-id-26' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='147' column='1' id='type-id-200'/>
    <type-decl name='unsigned short int' size-in-bits='16' id='type-id-201'/>
    <pointer-type-def type-id='type-id-199' size-in-bits='64' id='type-id-202'/>
    <function-decl name='readdir64' filepath='/usr/include/dirent.h' line='173' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-198'/>
      <return type-id='type-id-202'/>
    </function-decl>
    <function-decl name='closedir' filepath='/usr/include/dirent.h' line='149' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-198'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='asprintf' filepath='/usr/include/stdio.h' line='372' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-171'/>
      <parameter type-id='type-id-16'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='avl_find' filepath='../../include/sys/avl.h' line='175' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-189'/>
      <parameter type-id='type-id-73'/>
      <parameter type-id='type-id-38'/>
      <return type-id='type-id-73'/>
    </function-decl>
    <function-decl name='avl_insert' filepath='../../include/sys/avl.h' line='183' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-189'/>
      <parameter type-id='type-id-73'/>
      <parameter type-id='type-id-26'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='update_vdev_config_dev_strs' filepath='../../include/libzutil.h' line='87' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-35'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-135'>
      <parameter type-id='type-id-73'/>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-118'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-188'>
      <parameter type-id='type-id-73'/>
      <parameter type-id='type-id-73'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-133'>
      <parameter type-id='type-id-73'/>
      <parameter type-id='type-id-29'/>
      <return type-id='type-id-29'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-160'>
      <parameter type-id='type-id-152'/>
      <return type-id='type-id-17'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-194'>
      <parameter type-id='type-id-73'/>
      <return type-id='type-id-17'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='zutil_nicenum.c' comp-dir-path='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzutil' language='LANG_C99'>
    <function-decl name='zfs_isnumber' mangled-name='zfs_isnumber' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzutil/zutil_nicenum.c' line='36' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_isnumber'>
      <parameter type-id='type-id-16' name='str' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzutil/zutil_nicenum.c' line='36' column='1'/>
      <return type-id='type-id-41'/>
    </function-decl>
    <enum-decl name='zfs_nicenum_format' filepath='../../include/libzutil.h' line='123' column='1' id='type-id-203'>
      <underlying-type type-id='type-id-18'/>
      <enumerator name='ZFS_NICENUM_1024' value='0'/>
      <enumerator name='ZFS_NICENUM_BYTES' value='1'/>
      <enumerator name='ZFS_NICENUM_TIME' value='2'/>
      <enumerator name='ZFS_NICENUM_RAW' value='3'/>
      <enumerator name='ZFS_NICENUM_RAWTIME' value='4'/>
    </enum-decl>
    <function-decl name='zfs_nicenum_format' mangled-name='zfs_nicenum_format' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzutil/zutil_nicenum.c' line='52' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_nicenum_format'>
      <parameter type-id='type-id-23' name='num' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzutil/zutil_nicenum.c' line='52' column='1'/>
      <parameter type-id='type-id-37' name='buf' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzutil/zutil_nicenum.c' line='52' column='1'/>
      <parameter type-id='type-id-123' name='buflen' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzutil/zutil_nicenum.c' line='52' column='1'/>
      <parameter type-id='type-id-203' name='format' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzutil/zutil_nicenum.c' line='53' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='zfs_nicenum' mangled-name='zfs_nicenum' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzutil/zutil_nicenum.c' line='144' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_nicenum'>
      <parameter type-id='type-id-23' name='num' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzutil/zutil_nicenum.c' line='144' column='1'/>
      <parameter type-id='type-id-37' name='buf' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzutil/zutil_nicenum.c' line='144' column='1'/>
      <parameter type-id='type-id-123' name='buflen' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzutil/zutil_nicenum.c' line='144' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='zfs_nicetime' mangled-name='zfs_nicetime' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzutil/zutil_nicenum.c' line='154' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_nicetime'>
      <parameter type-id='type-id-23' name='num' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzutil/zutil_nicenum.c' line='144' column='1'/>
      <parameter type-id='type-id-37' name='buf' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzutil/zutil_nicenum.c' line='144' column='1'/>
      <parameter type-id='type-id-123' name='buflen' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzutil/zutil_nicenum.c' line='144' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='zfs_niceraw' mangled-name='zfs_niceraw' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzutil/zutil_nicenum.c' line='163' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_niceraw'>
      <parameter type-id='type-id-23' name='num' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzutil/zutil_nicenum.c' line='163' column='1'/>
      <parameter type-id='type-id-37' name='buf' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzutil/zutil_nicenum.c' line='163' column='1'/>
      <parameter type-id='type-id-123' name='buflen' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzutil/zutil_nicenum.c' line='163' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='zfs_nicebytes' mangled-name='zfs_nicebytes' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzutil/zutil_nicenum.c' line='172' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_nicebytes'>
      <parameter type-id='type-id-23' name='num' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzutil/zutil_nicenum.c' line='144' column='1'/>
      <parameter type-id='type-id-37' name='buf' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzutil/zutil_nicenum.c' line='144' column='1'/>
      <parameter type-id='type-id-123' name='buflen' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzutil/zutil_nicenum.c' line='144' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='zutil_pool.c' comp-dir-path='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzutil' language='LANG_C99'>
    <class-decl name='ddt_stat' size-in-bits='512' is-struct='yes' visibility='default' filepath='../../include/sys/fs/zfs.h' line='1194' column='1' id='type-id-204'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='dds_blocks' type-id='type-id-23' visibility='default' filepath='../../include/sys/fs/zfs.h' line='1195' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='dds_lsize' type-id='type-id-23' visibility='default' filepath='../../include/sys/fs/zfs.h' line='1196' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='dds_psize' type-id='type-id-23' visibility='default' filepath='../../include/sys/fs/zfs.h' line='1197' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='dds_dsize' type-id='type-id-23' visibility='default' filepath='../../include/sys/fs/zfs.h' line='1198' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='dds_ref_blocks' type-id='type-id-23' visibility='default' filepath='../../include/sys/fs/zfs.h' line='1199' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='dds_ref_lsize' type-id='type-id-23' visibility='default' filepath='../../include/sys/fs/zfs.h' line='1200' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='dds_ref_psize' type-id='type-id-23' visibility='default' filepath='../../include/sys/fs/zfs.h' line='1201' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='dds_ref_dsize' type-id='type-id-23' visibility='default' filepath='../../include/sys/fs/zfs.h' line='1202' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='ddt_stat_t' type-id='type-id-204' filepath='../../include/sys/fs/zfs.h' line='1203' column='1' id='type-id-205'/>
    <qualified-type-def type-id='type-id-205' const='yes' id='type-id-206'/>
    <pointer-type-def type-id='type-id-206' size-in-bits='64' id='type-id-207'/>
    <class-decl name='ddt_histogram' size-in-bits='32768' is-struct='yes' visibility='default' filepath='../../include/sys/fs/zfs.h' line='1205' column='1' id='type-id-208'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ddh_stat' type-id='type-id-209' visibility='default' filepath='../../include/sys/fs/zfs.h' line='1206' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-205' size-in-bits='32768' id='type-id-209'>
      <subrange length='64' type-id='type-id-12' id='type-id-210'/>

    </array-type-def>
    <typedef-decl name='ddt_histogram_t' type-id='type-id-208' filepath='../../include/sys/fs/zfs.h' line='1207' column='1' id='type-id-211'/>
    <qualified-type-def type-id='type-id-211' const='yes' id='type-id-212'/>
    <pointer-type-def type-id='type-id-212' size-in-bits='64' id='type-id-213'/>
    <function-decl name='zpool_dump_ddt' mangled-name='zpool_dump_ddt' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzutil/zutil_pool.c' line='68' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_dump_ddt'>
      <parameter type-id='type-id-207' name='dds_total' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzutil/zutil_pool.c' line='68' column='1'/>
      <parameter type-id='type-id-213' name='ddh' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzutil/zutil_pool.c' line='68' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='zfs_nicenum' filepath='../../include/libzutil.h' line='135' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-37'/>
      <parameter type-id='type-id-26'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='zfs_nicebytes' filepath='../../include/libzutil.h' line='134' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-37'/>
      <parameter type-id='type-id-26'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <pointer-type-def type-id='type-id-64' size-in-bits='64' id='type-id-214'/>
    <pointer-type-def type-id='type-id-34' size-in-bits='64' id='type-id-215'/>
    <function-decl name='zpool_history_unpack' mangled-name='zpool_history_unpack' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzutil/zutil_pool.c' line='105' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_history_unpack'>
      <parameter type-id='type-id-37' name='buf' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzutil/zutil_pool.c' line='105' column='1'/>
      <parameter type-id='type-id-23' name='bytes_read' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzutil/zutil_pool.c' line='105' column='1'/>
      <parameter type-id='type-id-71' name='leftover' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzutil/zutil_pool.c' line='105' column='1'/>
      <parameter type-id='type-id-214' name='records' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzutil/zutil_pool.c' line='106' column='1'/>
      <parameter type-id='type-id-215' name='numrecords' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzutil/zutil_pool.c' line='106' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='os/linux/zutil_device_path_os.c' comp-dir-path='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzutil' language='LANG_C99'>
    <function-decl name='zfs_append_partition' mangled-name='zfs_append_partition' filepath='os/linux/zutil_device_path_os.c' line='47' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_append_partition'>
      <parameter type-id='type-id-37' name='path' filepath='os/linux/zutil_device_path_os.c' line='47' column='1'/>
      <parameter type-id='type-id-123' name='max_len' filepath='os/linux/zutil_device_path_os.c' line='47' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='zfs_strip_partition' mangled-name='zfs_strip_partition' filepath='os/linux/zutil_device_path_os.c' line='84' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_strip_partition'>
      <parameter type-id='type-id-37' name='path' filepath='os/linux/zutil_device_path_os.c' line='84' column='1'/>
      <return type-id='type-id-37'/>
    </function-decl>
    <function-decl name='zfs_strip_path' mangled-name='zfs_strip_path' filepath='os/linux/zutil_device_path_os.c' line='152' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_strip_path'>
      <parameter type-id='type-id-37'/>
      <return type-id='type-id-37'/>
    </function-decl>
    <function-decl name='zfs_get_enclosure_sysfs_path' mangled-name='zfs_get_enclosure_sysfs_path' filepath='os/linux/zutil_device_path_os.c' line='171' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_get_enclosure_sysfs_path'>
      <parameter type-id='type-id-16' name='dev_name' filepath='os/linux/zutil_device_path_os.c' line='171' column='1'/>
      <return type-id='type-id-37'/>
    </function-decl>
    <class-decl name='dirent' size-in-bits='2240' is-struct='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/dirent.h' line='22' column='1' id='type-id-216'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='d_ino' type-id='type-id-200' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/dirent.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='d_off' type-id='type-id-149' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/dirent.h' line='29' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='d_reclen' type-id='type-id-201' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/dirent.h' line='31' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='144'>
        <var-decl name='d_type' type-id='type-id-30' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/dirent.h' line='32' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='152'>
        <var-decl name='d_name' type-id='type-id-43' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/dirent.h' line='33' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-216' size-in-bits='64' id='type-id-217'/>
    <function-decl name='readdir' mangled-name='readdir64' filepath='/usr/include/dirent.h' line='165' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-198'/>
      <return type-id='type-id-217'/>
    </function-decl>
    <function-decl name='readlink' filepath='/usr/include/unistd.h' line='808' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-37'/>
      <parameter type-id='type-id-26'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='zfs_dev_is_dm' mangled-name='zfs_dev_is_dm' filepath='os/linux/zutil_device_path_os.c' line='367' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_dev_is_dm'>
      <parameter type-id='type-id-16' name='dev_name' filepath='os/linux/zutil_device_path_os.c' line='367' column='1'/>
      <return type-id='type-id-41'/>
    </function-decl>
    <function-decl name='zfs_dev_is_whole_disk' mangled-name='zfs_dev_is_whole_disk' filepath='os/linux/zutil_device_path_os.c' line='388' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_dev_is_whole_disk'>
      <parameter type-id='type-id-16' name='dev_name' filepath='os/linux/zutil_device_path_os.c' line='388' column='1'/>
      <return type-id='type-id-41'/>
    </function-decl>
    <class-decl name='dk_gpt' size-in-bits='1920' is-struct='yes' visibility='default' filepath='../../include/sys/efi_partition.h' line='316' column='1' id='type-id-218'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='efi_version' type-id='type-id-34' visibility='default' filepath='../../include/sys/efi_partition.h' line='317' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='efi_nparts' type-id='type-id-34' visibility='default' filepath='../../include/sys/efi_partition.h' line='318' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='efi_part_size' type-id='type-id-34' visibility='default' filepath='../../include/sys/efi_partition.h' line='319' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='efi_lbasize' type-id='type-id-34' visibility='default' filepath='../../include/sys/efi_partition.h' line='321' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='efi_last_lba' type-id='type-id-219' visibility='default' filepath='../../include/sys/efi_partition.h' line='322' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='efi_first_u_lba' type-id='type-id-219' visibility='default' filepath='../../include/sys/efi_partition.h' line='323' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='efi_last_u_lba' type-id='type-id-219' visibility='default' filepath='../../include/sys/efi_partition.h' line='324' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='efi_disk_uguid' type-id='type-id-220' visibility='default' filepath='../../include/sys/efi_partition.h' line='325' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='efi_flags' type-id='type-id-34' visibility='default' filepath='../../include/sys/efi_partition.h' line='326' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='efi_reserved1' type-id='type-id-34' visibility='default' filepath='../../include/sys/efi_partition.h' line='327' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='efi_altern_lba' type-id='type-id-219' visibility='default' filepath='../../include/sys/efi_partition.h' line='328' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='efi_reserved' type-id='type-id-221' visibility='default' filepath='../../include/sys/efi_partition.h' line='329' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='efi_parts' type-id='type-id-222' visibility='default' filepath='../../include/sys/efi_partition.h' line='330' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='long long int' size-in-bits='64' id='type-id-223'/>
    <typedef-decl name='longlong_t' type-id='type-id-223' filepath='../../lib/libspl/include/sys/stdtypes.h' line='36' column='1' id='type-id-224'/>
    <typedef-decl name='diskaddr_t' type-id='type-id-224' filepath='../../lib/libspl/include/sys/stdtypes.h' line='41' column='1' id='type-id-219'/>
    <class-decl name='uuid' size-in-bits='128' is-struct='yes' visibility='default' filepath='../../include/sys/uuid.h' line='68' column='1' id='type-id-220'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='time_low' type-id='type-id-22' visibility='default' filepath='../../include/sys/uuid.h' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='time_mid' type-id='type-id-225' visibility='default' filepath='../../include/sys/uuid.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='time_hi_and_version' type-id='type-id-225' visibility='default' filepath='../../include/sys/uuid.h' line='71' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='clock_seq_hi_and_reserved' type-id='type-id-32' visibility='default' filepath='../../include/sys/uuid.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='72'>
        <var-decl name='clock_seq_low' type-id='type-id-32' visibility='default' filepath='../../include/sys/uuid.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='node_addr' type-id='type-id-105' visibility='default' filepath='../../include/sys/uuid.h' line='74' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__uint16_t' type-id='type-id-201' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='39' column='1' id='type-id-226'/>
    <typedef-decl name='uint16_t' type-id='type-id-226' filepath='/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h' line='25' column='1' id='type-id-225'/>

    <array-type-def dimensions='1' type-id='type-id-34' size-in-bits='384' id='type-id-221'>
      <subrange length='12' type-id='type-id-12' id='type-id-103'/>

    </array-type-def>
    <class-decl name='dk_part' size-in-bits='960' is-struct='yes' visibility='default' filepath='../../include/sys/efi_partition.h' line='301' column='1' id='type-id-227'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='p_start' type-id='type-id-219' visibility='default' filepath='../../include/sys/efi_partition.h' line='302' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='p_size' type-id='type-id-219' visibility='default' filepath='../../include/sys/efi_partition.h' line='303' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='p_guid' type-id='type-id-220' visibility='default' filepath='../../include/sys/efi_partition.h' line='304' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='p_tag' type-id='type-id-228' visibility='default' filepath='../../include/sys/efi_partition.h' line='305' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='272'>
        <var-decl name='p_flag' type-id='type-id-228' visibility='default' filepath='../../include/sys/efi_partition.h' line='306' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='p_name' type-id='type-id-229' visibility='default' filepath='../../include/sys/efi_partition.h' line='307' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='p_uguid' type-id='type-id-220' visibility='default' filepath='../../include/sys/efi_partition.h' line='308' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='p_resv' type-id='type-id-230' visibility='default' filepath='../../include/sys/efi_partition.h' line='309' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='ushort_t' type-id='type-id-201' filepath='../../lib/libspl/include/sys/stdtypes.h' line='32' column='1' id='type-id-228'/>

    <array-type-def dimensions='1' type-id='type-id-11' size-in-bits='288' id='type-id-229'>
      <subrange length='36' type-id='type-id-12' id='type-id-231'/>

    </array-type-def>

    <array-type-def dimensions='1' type-id='type-id-34' size-in-bits='256' id='type-id-230'>
      <subrange length='8' type-id='type-id-12' id='type-id-102'/>

    </array-type-def>

    <array-type-def dimensions='1' type-id='type-id-227' size-in-bits='960' id='type-id-222'>
      <subrange length='1' type-id='type-id-12' id='type-id-232'/>

    </array-type-def>
    <pointer-type-def type-id='type-id-218' size-in-bits='64' id='type-id-233'/>
    <pointer-type-def type-id='type-id-233' size-in-bits='64' id='type-id-234'/>
    <function-decl name='efi_alloc_and_init' filepath='../../include/sys/efi_partition.h' line='366' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-234'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='efi_free' mangled-name='efi_free' filepath='../../include/sys/efi_partition.h' line='370' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_free'>
      <parameter type-id='type-id-233'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='zfs_get_underlying_path' mangled-name='zfs_get_underlying_path' filepath='os/linux/zutil_device_path_os.c' line='448' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_get_underlying_path'>
      <parameter type-id='type-id-16' name='dev_name' filepath='os/linux/zutil_device_path_os.c' line='448' column='1'/>
      <return type-id='type-id-37'/>
    </function-decl>
    <function-decl name='is_mpath_whole_disk' mangled-name='is_mpath_whole_disk' filepath='os/linux/zutil_device_path_os.c' line='502' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='is_mpath_whole_disk'>
      <parameter type-id='type-id-16' name='path' filepath='os/linux/zutil_device_path_os.c' line='502' column='1'/>
      <return type-id='type-id-41'/>
    </function-decl>
    <class-decl name='udev' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-235'/>
    <pointer-type-def type-id='type-id-235' size-in-bits='64' id='type-id-236'/>
    <function-decl name='udev_new' filepath='/usr/include/libudev.h' line='23' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-236'/>
    </function-decl>
    <class-decl name='udev_device' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-237'/>
    <pointer-type-def type-id='type-id-237' size-in-bits='64' id='type-id-238'/>
    <function-decl name='udev_device_new_from_subsystem_sysname' filepath='/usr/include/libudev.h' line='66' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-236'/>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-238'/>
    </function-decl>
    <function-decl name='udev_device_get_property_value' filepath='/usr/include/libudev.h' line='86' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-238'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='udev_device_unref' filepath='/usr/include/libudev.h' line='62' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-238'/>
      <return type-id='type-id-238'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='os/linux/zutil_import_os.c' comp-dir-path='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzutil' language='LANG_C99'>
    <function-decl name='zfs_dev_flush' mangled-name='zfs_dev_flush' filepath='os/linux/zutil_import_os.c' line='95' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_dev_flush'>
      <parameter type-id='type-id-1' name='fd' filepath='os/linux/zutil_import_os.c' line='95' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='zpool_open_func' mangled-name='zpool_open_func' filepath='os/linux/zutil_import_os.c' line='101' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_open_func'>
      <parameter type-id='type-id-73' name='arg' filepath='os/linux/zutil_import_os.c' line='101' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='zutil_strdup' filepath='./zutil_import.h' line='57' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-190'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-37'/>
    </function-decl>
    <function-decl name='zpool_read_label' filepath='../../include/libzutil.h' line='79' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-74'/>
      <parameter type-id='type-id-142'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='label_paths' filepath='./zutil_import.h' line='51' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-190'/>
      <parameter type-id='type-id-35'/>
      <parameter type-id='type-id-171'/>
      <parameter type-id='type-id-171'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='zpool_label_disk_wait' mangled-name='zpool_label_disk_wait' filepath='os/linux/zutil_import_os.c' line='606' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_label_disk_wait'>
      <parameter type-id='type-id-16' name='path' filepath='os/linux/zutil_import_os.c' line='606' column='1'/>
      <parameter type-id='type-id-1' name='timeout_ms' filepath='os/linux/zutil_import_os.c' line='606' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='zutil_alloc' filepath='./zutil_import.h' line='56' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-190'/>
      <parameter type-id='type-id-26'/>
      <return type-id='type-id-73'/>
    </function-decl>
    <class-decl name='timespec' size-in-bits='128' is-struct='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h' line='9' column='1' id='type-id-239'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tv_sec' type-id='type-id-240' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h' line='11' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tv_nsec' type-id='type-id-241' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h' line='12' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__time_t' type-id='type-id-5' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='158' column='1' id='type-id-240'/>
    <typedef-decl name='__syscall_slong_t' type-id='type-id-5' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='194' column='1' id='type-id-241'/>
    <pointer-type-def type-id='type-id-239' size-in-bits='64' id='type-id-242'/>
    <function-decl name='clock_gettime' filepath='/usr/include/time.h' line='219' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-242'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='usleep' filepath='/usr/include/unistd.h' line='460' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <class-decl name='udev_list_entry' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-243'/>
    <pointer-type-def type-id='type-id-243' size-in-bits='64' id='type-id-244'/>
    <function-decl name='udev_device_get_devlinks_list_entry' filepath='/usr/include/libudev.h' line='82' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-238'/>
      <return type-id='type-id-244'/>
    </function-decl>
    <function-decl name='udev_list_entry_get_next' filepath='/usr/include/libudev.h' line='39' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-244'/>
      <return type-id='type-id-244'/>
    </function-decl>
    <function-decl name='udev_list_entry_get_name' filepath='/usr/include/libudev.h' line='41' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-244'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='udev_unref' filepath='/usr/include/libudev.h' line='22' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-236'/>
      <return type-id='type-id-236'/>
    </function-decl>
    <pointer-type-def type-id='type-id-123' size-in-bits='64' id='type-id-245'/>
    <function-decl name='zpool_default_search_paths' mangled-name='zpool_default_search_paths' filepath='os/linux/zutil_import_os.c' line='272' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_default_search_paths'>
      <parameter type-id='type-id-245' name='count' filepath='os/linux/zutil_import_os.c' line='272' column='1'/>
      <return type-id='type-id-125'/>
    </function-decl>
    <typedef-decl name='pthread_mutex_t' type-id='type-id-2' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='72' column='1' id='type-id-246'/>
    <pointer-type-def type-id='type-id-246' size-in-bits='64' id='type-id-247'/>
    <typedef-decl name='avl_tree_t' type-id='type-id-181' filepath='../../include/sys/avl.h' line='119' column='1' id='type-id-248'/>
    <pointer-type-def type-id='type-id-248' size-in-bits='64' id='type-id-249'/>
    <pointer-type-def type-id='type-id-249' size-in-bits='64' id='type-id-250'/>
    <function-decl name='zpool_find_import_blkid' mangled-name='zpool_find_import_blkid' filepath='os/linux/zutil_import_os.c' line='321' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_find_import_blkid'>
      <parameter type-id='type-id-141' name='hdl' filepath='os/linux/zutil_import_os.c' line='321' column='1'/>
      <parameter type-id='type-id-247' name='lock' filepath='os/linux/zutil_import_os.c' line='321' column='1'/>
      <parameter type-id='type-id-250' name='slice_cache' filepath='os/linux/zutil_import_os.c' line='322' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <class-decl name='blkid_struct_cache' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-251'/>
    <pointer-type-def type-id='type-id-251' size-in-bits='64' id='type-id-252'/>
    <pointer-type-def type-id='type-id-252' size-in-bits='64' id='type-id-253'/>
    <function-decl name='blkid_get_cache' filepath='/usr/include/blkid/blkid.h' line='143' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-253'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='blkid_probe_all_new' filepath='/usr/include/blkid/blkid.h' line='165' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-252'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <class-decl name='blkid_struct_dev_iterate' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-254'/>
    <pointer-type-def type-id='type-id-254' size-in-bits='64' id='type-id-255'/>
    <function-decl name='blkid_dev_iterate_begin' filepath='/usr/include/blkid/blkid.h' line='150' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-252'/>
      <return type-id='type-id-255'/>
    </function-decl>
    <function-decl name='blkid_dev_set_search' filepath='/usr/include/blkid/blkid.h' line='151' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-255'/>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='blkid_dev_iterate_end' filepath='/usr/include/blkid/blkid.h' line='154' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-255'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <class-decl name='blkid_struct_dev' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-256'/>
    <pointer-type-def type-id='type-id-256' size-in-bits='64' id='type-id-257'/>
    <pointer-type-def type-id='type-id-257' size-in-bits='64' id='type-id-258'/>
    <function-decl name='blkid_dev_next' filepath='/usr/include/blkid/blkid.h' line='153' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-255'/>
      <parameter type-id='type-id-258'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='blkid_put_cache' filepath='/usr/include/blkid/blkid.h' line='142' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-252'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='blkid_dev_devname' filepath='/usr/include/blkid/blkid.h' line='147' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-257'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='zfs_device_get_devid' mangled-name='zfs_device_get_devid' filepath='os/linux/zutil_import_os.c' line='410' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_device_get_devid'>
      <parameter type-id='type-id-238' name='dev' filepath='os/linux/zutil_import_os.c' line='410' column='1'/>
      <parameter type-id='type-id-37' name='bufptr' filepath='os/linux/zutil_import_os.c' line='410' column='1'/>
      <parameter type-id='type-id-123' name='buflen' filepath='os/linux/zutil_import_os.c' line='410' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='udev_device_get_parent_with_subsystem_devtype' filepath='/usr/include/libudev.h' line='71' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-238'/>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-238'/>
    </function-decl>
    <function-decl name='zfs_device_get_physical' mangled-name='zfs_device_get_physical' filepath='os/linux/zutil_import_os.c' line='487' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_device_get_physical'>
      <parameter type-id='type-id-238' name='dev' filepath='os/linux/zutil_import_os.c' line='487' column='1'/>
      <parameter type-id='type-id-37' name='bufptr' filepath='os/linux/zutil_import_os.c' line='487' column='1'/>
      <parameter type-id='type-id-123' name='buflen' filepath='os/linux/zutil_import_os.c' line='487' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='update_vdev_config_dev_strs' mangled-name='update_vdev_config_dev_strs' filepath='os/linux/zutil_import_os.c' line='800' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='update_vdev_config_dev_strs'>
      <parameter type-id='type-id-29' name='nv' filepath='os/linux/zutil_import_os.c' line='800' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='nvlist_remove_all' filepath='../../include/sys/nvpair.h' line='199' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-35'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='sched_yield' filepath='/usr/include/sched.h' line='68' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='os/linux/zutil_compat.c' comp-dir-path='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libzutil' language='LANG_C99'>
    <typedef-decl name='zfs_cmd_t' type-id='type-id-39' filepath='../../include/sys/zfs_ioctl.h' line='518' column='1' id='type-id-259'/>
    <pointer-type-def type-id='type-id-259' size-in-bits='64' id='type-id-260'/>
    <function-decl name='zfs_ioctl_fd' mangled-name='zfs_ioctl_fd' filepath='os/linux/zutil_compat.c' line='27' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_ioctl_fd'>
      <parameter type-id='type-id-1' name='fd' filepath='os/linux/zutil_compat.c' line='27' column='1'/>
      <parameter type-id='type-id-26' name='request' filepath='os/linux/zutil_compat.c' line='27' column='1'/>
      <parameter type-id='type-id-260' name='zc' filepath='os/linux/zutil_compat.c' line='27' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../../module/avl/avl.c' comp-dir-path='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libavl' language='LANG_C99'>
    <function-decl name='avl_walk' mangled-name='avl_walk' filepath='../../module/avl/avl.c' line='140' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_walk'>
      <parameter type-id='type-id-249' name='tree' filepath='../../module/avl/avl.c' line='140' column='1'/>
      <parameter type-id='type-id-73' name='oldnode' filepath='../../module/avl/avl.c' line='140' column='1'/>
      <parameter type-id='type-id-1' name='left' filepath='../../module/avl/avl.c' line='140' column='1'/>
      <return type-id='type-id-73'/>
    </function-decl>
    <function-decl name='avl_first' mangled-name='avl_first' filepath='../../module/avl/avl.c' line='187' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_first'>
      <parameter type-id='type-id-249' name='tree' filepath='../../module/avl/avl.c' line='187' column='1'/>
      <return type-id='type-id-73'/>
    </function-decl>
    <function-decl name='avl_last' mangled-name='avl_last' filepath='../../module/avl/avl.c' line='206' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_last'>
      <parameter type-id='type-id-249' name='tree' filepath='../../module/avl/avl.c' line='187' column='1'/>
      <return type-id='type-id-73'/>
    </function-decl>
    <typedef-decl name='avl_index_t' type-id='type-id-187' filepath='../../include/sys/avl.h' line='130' column='1' id='type-id-261'/>
    <function-decl name='avl_nearest' mangled-name='avl_nearest' filepath='../../module/avl/avl.c' line='230' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_nearest'>
      <parameter type-id='type-id-249' name='tree' filepath='../../module/avl/avl.c' line='230' column='1'/>
      <parameter type-id='type-id-261' name='where' filepath='../../module/avl/avl.c' line='230' column='1'/>
      <parameter type-id='type-id-1' name='direction' filepath='../../module/avl/avl.c' line='230' column='1'/>
      <return type-id='type-id-73'/>
    </function-decl>
    <pointer-type-def type-id='type-id-261' size-in-bits='64' id='type-id-262'/>
    <function-decl name='avl_find' mangled-name='avl_find' filepath='../../module/avl/avl.c' line='259' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_find'>
      <parameter type-id='type-id-249' name='tree' filepath='../../module/avl/avl.c' line='259' column='1'/>
      <parameter type-id='type-id-73' name='value' filepath='../../module/avl/avl.c' line='259' column='1'/>
      <parameter type-id='type-id-262' name='where' filepath='../../module/avl/avl.c' line='259' column='1'/>
      <return type-id='type-id-73'/>
    </function-decl>
    <function-decl name='avl_insert' mangled-name='avl_insert' filepath='../../module/avl/avl.c' line='486' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_insert'>
      <parameter type-id='type-id-249' name='tree' filepath='../../module/avl/avl.c' line='486' column='1'/>
      <parameter type-id='type-id-73' name='new_data' filepath='../../module/avl/avl.c' line='486' column='1'/>
      <parameter type-id='type-id-261' name='where' filepath='../../module/avl/avl.c' line='486' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='avl_insert_here' mangled-name='avl_insert_here' filepath='../../module/avl/avl.c' line='575' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_insert_here'>
      <parameter type-id='type-id-249' name='tree' filepath='../../module/avl/avl.c' line='576' column='1'/>
      <parameter type-id='type-id-73' name='new_data' filepath='../../module/avl/avl.c' line='577' column='1'/>
      <parameter type-id='type-id-73' name='here' filepath='../../module/avl/avl.c' line='578' column='1'/>
      <parameter type-id='type-id-1' name='direction' filepath='../../module/avl/avl.c' line='579' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='avl_add' mangled-name='avl_add' filepath='../../module/avl/avl.c' line='636' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_add'>
      <parameter type-id='type-id-249' name='tree' filepath='../../module/avl/avl.c' line='636' column='1'/>
      <parameter type-id='type-id-73' name='new_node' filepath='../../module/avl/avl.c' line='636' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='avl_remove' mangled-name='avl_remove' filepath='../../module/avl/avl.c' line='669' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_remove'>
      <parameter type-id='type-id-249' name='tree' filepath='../../module/avl/avl.c' line='669' column='1'/>
      <parameter type-id='type-id-73' name='data' filepath='../../module/avl/avl.c' line='669' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='avl_update_lt' mangled-name='avl_update_lt' filepath='../../module/avl/avl.c' line='817' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_update_lt'>
      <parameter type-id='type-id-249' name='t' filepath='../../module/avl/avl.c' line='817' column='1'/>
      <parameter type-id='type-id-73' name='obj' filepath='../../module/avl/avl.c' line='817' column='1'/>
      <return type-id='type-id-41'/>
    </function-decl>
    <function-decl name='avl_update_gt' mangled-name='avl_update_gt' filepath='../../module/avl/avl.c' line='834' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_update_gt'>
      <parameter type-id='type-id-249' name='t' filepath='../../module/avl/avl.c' line='817' column='1'/>
      <parameter type-id='type-id-73' name='obj' filepath='../../module/avl/avl.c' line='817' column='1'/>
      <return type-id='type-id-41'/>
    </function-decl>
    <function-decl name='avl_update' mangled-name='avl_update' filepath='../../module/avl/avl.c' line='851' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_update'>
      <parameter type-id='type-id-249' name='t' filepath='../../module/avl/avl.c' line='851' column='1'/>
      <parameter type-id='type-id-73' name='obj' filepath='../../module/avl/avl.c' line='851' column='1'/>
      <return type-id='type-id-41'/>
    </function-decl>
    <function-decl name='avl_swap' mangled-name='avl_swap' filepath='../../module/avl/avl.c' line='871' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_swap'>
      <parameter type-id='type-id-249' name='tree1' filepath='../../module/avl/avl.c' line='871' column='1'/>
      <parameter type-id='type-id-249' name='tree2' filepath='../../module/avl/avl.c' line='871' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='avl_create' mangled-name='avl_create' filepath='../../module/avl/avl.c' line='892' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_create'>
      <parameter type-id='type-id-249' name='tree' filepath='../../module/avl/avl.c' line='892' column='1'/>
      <parameter type-id='type-id-183' name='compar' filepath='../../module/avl/avl.c' line='892' column='1'/>
      <parameter type-id='type-id-123' name='size' filepath='../../module/avl/avl.c' line='893' column='1'/>
      <parameter type-id='type-id-123' name='offset' filepath='../../module/avl/avl.c' line='893' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='avl_destroy' mangled-name='avl_destroy' filepath='../../module/avl/avl.c' line='915' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_destroy'>
      <parameter type-id='type-id-249' name='tree' filepath='../../module/avl/avl.c' line='915' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='avl_numnodes' mangled-name='avl_numnodes' filepath='../../module/avl/avl.c' line='927' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_numnodes'>
      <parameter type-id='type-id-249' name='tree' filepath='../../module/avl/avl.c' line='927' column='1'/>
      <return type-id='type-id-184'/>
    </function-decl>
    <function-decl name='avl_is_empty' mangled-name='avl_is_empty' filepath='../../module/avl/avl.c' line='934' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_is_empty'>
      <parameter type-id='type-id-249' name='tree' filepath='../../module/avl/avl.c' line='934' column='1'/>
      <return type-id='type-id-41'/>
    </function-decl>
    <function-decl name='avl_destroy_nodes' mangled-name='avl_destroy_nodes' filepath='../../module/avl/avl.c' line='962' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_destroy_nodes'>
      <parameter type-id='type-id-249' name='tree' filepath='../../module/avl/avl.c' line='962' column='1'/>
      <parameter type-id='type-id-143' name='cookie' filepath='../../module/avl/avl.c' line='962' column='1'/>
      <return type-id='type-id-73'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='thread_pool.c' comp-dir-path='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libtpool' language='LANG_C99'>
    <class-decl name='tpool' size-in-bits='2496' is-struct='yes' visibility='default' filepath='./thread_pool_impl.h' line='63' column='1' id='type-id-192'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tp_forw' type-id='type-id-263' visibility='default' filepath='./thread_pool_impl.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tp_back' type-id='type-id-263' visibility='default' filepath='./thread_pool_impl.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='tp_mutex' type-id='type-id-246' visibility='default' filepath='./thread_pool_impl.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='tp_busycv' type-id='type-id-264' visibility='default' filepath='./thread_pool_impl.h' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='tp_workcv' type-id='type-id-264' visibility='default' filepath='./thread_pool_impl.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='tp_waitcv' type-id='type-id-264' visibility='default' filepath='./thread_pool_impl.h' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='tp_active' type-id='type-id-265' visibility='default' filepath='./thread_pool_impl.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='tp_head' type-id='type-id-266' visibility='default' filepath='./thread_pool_impl.h' line='71' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='tp_tail' type-id='type-id-266' visibility='default' filepath='./thread_pool_impl.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='tp_attr' type-id='type-id-164' visibility='default' filepath='./thread_pool_impl.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <var-decl name='tp_flags' type-id='type-id-1' visibility='default' filepath='./thread_pool_impl.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2272'>
        <var-decl name='tp_linger' type-id='type-id-34' visibility='default' filepath='./thread_pool_impl.h' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2304'>
        <var-decl name='tp_njobs' type-id='type-id-1' visibility='default' filepath='./thread_pool_impl.h' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2336'>
        <var-decl name='tp_minimum' type-id='type-id-1' visibility='default' filepath='./thread_pool_impl.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2368'>
        <var-decl name='tp_maximum' type-id='type-id-1' visibility='default' filepath='./thread_pool_impl.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2400'>
        <var-decl name='tp_current' type-id='type-id-1' visibility='default' filepath='./thread_pool_impl.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2432'>
        <var-decl name='tp_idle' type-id='type-id-1' visibility='default' filepath='./thread_pool_impl.h' line='80' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='tpool_t' type-id='type-id-192' filepath='../../include/thread_pool.h' line='38' column='1' id='type-id-267'/>
    <pointer-type-def type-id='type-id-267' size-in-bits='64' id='type-id-263'/>
    <union-decl name='__anonymous_union__' size-in-bits='384' is-anonymous='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='75' column='1' id='type-id-268'>
      <data-member access='private'>
        <var-decl name='__data' type-id='type-id-269' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='77' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='__size' type-id='type-id-270' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='78' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='__align' type-id='type-id-223' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='79' column='1'/>
      </data-member>
    </union-decl>
    <class-decl name='__pthread_cond_s' size-in-bits='384' is-struct='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='171' column='1' id='type-id-269'>
      <member-type access='public'>
        <union-decl name='__anonymous_union__' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='182' column='1' id='type-id-271'>
          <data-member access='private'>
            <var-decl name='__g1_start' type-id='type-id-272' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='184' column='1'/>
          </data-member>
          <data-member access='private'>
            <var-decl name='__g1_start32' type-id='type-id-273' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='189' column='1'/>
          </data-member>
        </union-decl>
      </member-type>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='' type-id='type-id-274' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='173' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='__g_refs' type-id='type-id-275' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='191' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='__g_size' type-id='type-id-275' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='192' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='__g1_orig_size' type-id='type-id-6' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='193' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='__wrefs' type-id='type-id-6' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='194' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='__g_signals' type-id='type-id-275' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='195' column='1'/>
      </data-member>
    </class-decl>
    <union-decl name='__anonymous_union__' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='173' column='1' id='type-id-274'>
      <data-member access='private'>
        <var-decl name='__wseq' type-id='type-id-272' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='175' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='__wseq32' type-id='type-id-273' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='180' column='1'/>
      </data-member>
    </union-decl>
    <type-decl name='long long unsigned int' size-in-bits='64' id='type-id-272'/>
    <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='176' column='1' id='type-id-273'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__low' type-id='type-id-6' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='178' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='__high' type-id='type-id-6' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='179' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-6' size-in-bits='64' id='type-id-275'>
      <subrange length='2' type-id='type-id-12' id='type-id-62'/>

    </array-type-def>

    <array-type-def dimensions='1' type-id='type-id-11' size-in-bits='384' id='type-id-270'>
      <subrange length='48' type-id='type-id-12' id='type-id-276'/>

    </array-type-def>
    <typedef-decl name='pthread_cond_t' type-id='type-id-268' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='80' column='1' id='type-id-264'/>
    <class-decl name='tpool_active' size-in-bits='128' is-struct='yes' visibility='default' filepath='./thread_pool_impl.h' line='55' column='1' id='type-id-277'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tpa_next' type-id='type-id-265' visibility='default' filepath='./thread_pool_impl.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tpa_tid' type-id='type-id-278' visibility='default' filepath='./thread_pool_impl.h' line='57' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='tpool_active_t' type-id='type-id-277' filepath='./thread_pool_impl.h' line='54' column='1' id='type-id-279'/>
    <pointer-type-def type-id='type-id-279' size-in-bits='64' id='type-id-265'/>
    <typedef-decl name='pthread_t' type-id='type-id-26' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='27' column='1' id='type-id-278'/>
    <class-decl name='tpool_job' size-in-bits='192' is-struct='yes' visibility='default' filepath='./thread_pool_impl.h' line='45' column='1' id='type-id-280'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tpj_next' type-id='type-id-266' visibility='default' filepath='./thread_pool_impl.h' line='46' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tpj_func' type-id='type-id-195' visibility='default' filepath='./thread_pool_impl.h' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='tpj_arg' type-id='type-id-73' visibility='default' filepath='./thread_pool_impl.h' line='48' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='tpool_job_t' type-id='type-id-280' filepath='./thread_pool_impl.h' line='44' column='1' id='type-id-281'/>
    <pointer-type-def type-id='type-id-281' size-in-bits='64' id='type-id-266'/>
    <function-decl name='tpool_create' mangled-name='tpool_create' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libtpool/thread_pool.c' line='322' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='tpool_create'>
      <parameter type-id='type-id-34' name='min_threads' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libtpool/thread_pool.c' line='322' column='1'/>
      <parameter type-id='type-id-34' name='max_threads' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libtpool/thread_pool.c' line='322' column='1'/>
      <parameter type-id='type-id-34' name='linger' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libtpool/thread_pool.c' line='322' column='1'/>
      <parameter type-id='type-id-159' name='attr' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libtpool/thread_pool.c' line='323' column='1'/>
      <return type-id='type-id-263'/>
    </function-decl>
    <qualified-type-def type-id='type-id-161' const='yes' id='type-id-282'/>
    <pointer-type-def type-id='type-id-282' size-in-bits='64' id='type-id-283'/>
    <function-decl name='pthread_attr_getstack' filepath='/usr/include/pthread.h' line='382' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-283'/>
      <parameter type-id='type-id-143'/>
      <parameter type-id='type-id-38'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <pointer-type-def type-id='type-id-268' size-in-bits='64' id='type-id-284'/>
    <function-decl name='pthread_cond_init' filepath='/usr/include/pthread.h' line='969' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-284'/>
      <parameter type-id='type-id-180'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <pointer-type-def type-id='type-id-161' size-in-bits='64' id='type-id-285'/>
    <function-decl name='pthread_attr_init' filepath='/usr/include/pthread.h' line='288' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-285'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='1024' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/cpu-set.h' line='39' column='1' id='type-id-286'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__bits' type-id='type-id-287' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/cpu-set.h' line='41' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__cpu_mask' type-id='type-id-26' filepath='/usr/include/x86_64-linux-gnu/bits/cpu-set.h' line='32' column='1' id='type-id-288'/>

    <array-type-def dimensions='1' type-id='type-id-288' size-in-bits='1024' id='type-id-287'>
      <subrange length='16' type-id='type-id-12' id='type-id-104'/>

    </array-type-def>
    <pointer-type-def type-id='type-id-286' size-in-bits='64' id='type-id-289'/>
    <function-decl name='pthread_attr_getaffinity_np' filepath='/usr/include/pthread.h' line='404' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-283'/>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-289'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <qualified-type-def type-id='type-id-286' const='yes' id='type-id-290'/>
    <pointer-type-def type-id='type-id-290' size-in-bits='64' id='type-id-291'/>
    <function-decl name='pthread_attr_setaffinity_np' filepath='/usr/include/pthread.h' line='397' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-285'/>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-291'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='pthread_attr_getdetachstate' filepath='/usr/include/pthread.h' line='295' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-283'/>
      <parameter type-id='type-id-142'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='pthread_attr_setdetachstate' filepath='/usr/include/pthread.h' line='300' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-285'/>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='pthread_attr_getguardsize' filepath='/usr/include/pthread.h' line='306' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-283'/>
      <parameter type-id='type-id-38'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='pthread_attr_setguardsize' filepath='/usr/include/pthread.h' line='311' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-285'/>
      <parameter type-id='type-id-26'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='pthread_attr_getinheritsched' filepath='/usr/include/pthread.h' line='336' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-283'/>
      <parameter type-id='type-id-142'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='pthread_attr_setinheritsched' filepath='/usr/include/pthread.h' line='341' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-285'/>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <class-decl name='sched_param' size-in-bits='32' is-struct='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_sched_param.h' line='23' column='1' id='type-id-292'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sched_priority' type-id='type-id-1' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_sched_param.h' line='25' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-292' size-in-bits='64' id='type-id-293'/>
    <function-decl name='pthread_attr_getschedparam' filepath='/usr/include/pthread.h' line='317' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-283'/>
      <parameter type-id='type-id-293'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <qualified-type-def type-id='type-id-292' const='yes' id='type-id-294'/>
    <pointer-type-def type-id='type-id-294' size-in-bits='64' id='type-id-295'/>
    <function-decl name='pthread_attr_setschedparam' filepath='/usr/include/pthread.h' line='322' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-285'/>
      <parameter type-id='type-id-295'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='pthread_attr_getschedpolicy' filepath='/usr/include/pthread.h' line='327' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-283'/>
      <parameter type-id='type-id-142'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='pthread_attr_setschedpolicy' filepath='/usr/include/pthread.h' line='332' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-285'/>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='pthread_attr_getscope' filepath='/usr/include/pthread.h' line='347' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-283'/>
      <parameter type-id='type-id-142'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='pthread_attr_setscope' filepath='/usr/include/pthread.h' line='352' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-285'/>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='pthread_attr_setstack' filepath='/usr/include/pthread.h' line='390' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-285'/>
      <parameter type-id='type-id-73'/>
      <parameter type-id='type-id-26'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='pthread_attr_destroy' filepath='/usr/include/pthread.h' line='291' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-285'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='tpool_dispatch' mangled-name='tpool_dispatch' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libtpool/thread_pool.c' line='412' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='tpool_dispatch'>
      <parameter type-id='type-id-263' name='tpool' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libtpool/thread_pool.c' line='412' column='1'/>
      <parameter type-id='type-id-195' name='func' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libtpool/thread_pool.c' line='412' column='1'/>
      <parameter type-id='type-id-73' name='arg' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libtpool/thread_pool.c' line='412' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='pthread_cond_signal' filepath='/usr/include/pthread.h' line='978' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-284'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='1024' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/__sigset_t.h' line='5' column='1' id='type-id-296'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__val' type-id='type-id-297' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/__sigset_t.h' line='7' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-26' size-in-bits='1024' id='type-id-297'>
      <subrange length='16' type-id='type-id-12' id='type-id-104'/>

    </array-type-def>
    <qualified-type-def type-id='type-id-296' const='yes' id='type-id-298'/>
    <pointer-type-def type-id='type-id-296' size-in-bits='64' id='type-id-299'/>
    <function-decl name='pthread_sigmask' filepath='/usr/include/x86_64-linux-gnu/bits/sigthread.h' line='31' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-291'/>
      <parameter type-id='type-id-299'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <pointer-type-def type-id='type-id-300' size-in-bits='64' id='type-id-301'/>
    <function-decl name='pthread_create' filepath='/usr/include/pthread.h' line='234' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-38'/>
      <parameter type-id='type-id-283'/>
      <parameter type-id='type-id-301'/>
      <parameter type-id='type-id-73'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='tpool_destroy' mangled-name='tpool_destroy' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libtpool/thread_pool.c' line='459' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='tpool_destroy'>
      <parameter type-id='type-id-263' name='tpool' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libtpool/thread_pool.c' line='459' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='pthread_cond_broadcast' filepath='/usr/include/pthread.h' line='982' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-284'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='pthread_cancel' filepath='/usr/include/pthread.h' line='514' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-26'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='pthread_cond_wait' filepath='/usr/include/pthread.h' line='990' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-284'/>
      <parameter type-id='type-id-14'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='tpool_abandon' mangled-name='tpool_abandon' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libtpool/thread_pool.c' line='497' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='tpool_abandon'>
      <parameter type-id='type-id-263' name='tpool' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libtpool/thread_pool.c' line='497' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='tpool_wait' mangled-name='tpool_wait' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libtpool/thread_pool.c' line='520' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='tpool_wait'>
      <parameter type-id='type-id-263' name='tpool' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libtpool/thread_pool.c' line='520' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='tpool_suspend' mangled-name='tpool_suspend' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libtpool/thread_pool.c' line='536' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='tpool_suspend'>
      <parameter type-id='type-id-263' name='tpool' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libtpool/thread_pool.c' line='536' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='tpool_suspended' mangled-name='tpool_suspended' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libtpool/thread_pool.c' line='546' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='tpool_suspended'>
      <parameter type-id='type-id-263' name='tpool' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libtpool/thread_pool.c' line='546' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='tpool_resume' mangled-name='tpool_resume' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libtpool/thread_pool.c' line='560' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='tpool_resume'>
      <parameter type-id='type-id-263' name='tpool' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libtpool/thread_pool.c' line='560' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='tpool_member' mangled-name='tpool_member' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libtpool/thread_pool.c' line='583' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='tpool_member'>
      <parameter type-id='type-id-263' name='tpool' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libtpool/thread_pool.c' line='583' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='pthread_self' filepath='/usr/include/pthread.h' line='276' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-26'/>
    </function-decl>
    <qualified-type-def type-id='type-id-239' const='yes' id='type-id-302'/>
    <pointer-type-def type-id='type-id-302' size-in-bits='64' id='type-id-303'/>
    <function-decl name='pthread_cond_timedwait' filepath='/usr/include/pthread.h' line='1001' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-284'/>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-303'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='pthread_setcanceltype' filepath='/usr/include/pthread.h' line='511' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-142'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='pthread_setcancelstate' filepath='/usr/include/pthread.h' line='507' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-142'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-300'>
      <parameter type-id='type-id-73'/>
      <return type-id='type-id-73'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='assert.c' comp-dir-path='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl' language='LANG_C99'>
    <var-decl name='libspl_assert_ok' type-id='type-id-1' mangled-name='libspl_assert_ok' visibility='default' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/assert.c' line='28' column='1' elf-symbol-id='libspl_assert_ok'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='atomic.c' comp-dir-path='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl' language='LANG_C99'>
    <qualified-type-def type-id='type-id-32' volatile='yes' id='type-id-304'/>
    <pointer-type-def type-id='type-id-304' size-in-bits='64' id='type-id-305'/>
    <function-decl name='atomic_inc_8' mangled-name='atomic_inc_8' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='39' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_inc_8'>
      <parameter type-id='type-id-305' name='target' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='39' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <typedef-decl name='uchar_t' type-id='type-id-30' filepath='../../lib/libspl/include/sys/stdtypes.h' line='31' column='1' id='type-id-306'/>
    <qualified-type-def type-id='type-id-306' volatile='yes' id='type-id-307'/>
    <pointer-type-def type-id='type-id-307' size-in-bits='64' id='type-id-308'/>
    <function-decl name='atomic_inc_uchar' mangled-name='atomic_inc_uchar' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='40' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_inc_uchar'>
      <parameter type-id='type-id-308' name='target' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='40' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <qualified-type-def type-id='type-id-225' volatile='yes' id='type-id-309'/>
    <pointer-type-def type-id='type-id-309' size-in-bits='64' id='type-id-310'/>
    <function-decl name='atomic_inc_16' mangled-name='atomic_inc_16' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='41' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_inc_16'>
      <parameter type-id='type-id-310' name='target' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='41' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <qualified-type-def type-id='type-id-228' volatile='yes' id='type-id-311'/>
    <pointer-type-def type-id='type-id-311' size-in-bits='64' id='type-id-312'/>
    <function-decl name='atomic_inc_ushort' mangled-name='atomic_inc_ushort' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='42' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_inc_ushort'>
      <parameter type-id='type-id-312' name='target' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='42' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <qualified-type-def type-id='type-id-22' volatile='yes' id='type-id-313'/>
    <pointer-type-def type-id='type-id-313' size-in-bits='64' id='type-id-314'/>
    <function-decl name='atomic_inc_32' mangled-name='atomic_inc_32' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='43' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_inc_32'>
      <parameter type-id='type-id-314' name='target' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='43' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <qualified-type-def type-id='type-id-34' volatile='yes' id='type-id-315'/>
    <pointer-type-def type-id='type-id-315' size-in-bits='64' id='type-id-316'/>
    <function-decl name='atomic_inc_uint' mangled-name='atomic_inc_uint' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='44' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_inc_uint'>
      <parameter type-id='type-id-316' name='target' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='44' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <qualified-type-def type-id='type-id-184' volatile='yes' id='type-id-317'/>
    <pointer-type-def type-id='type-id-317' size-in-bits='64' id='type-id-318'/>
    <function-decl name='atomic_inc_ulong' mangled-name='atomic_inc_ulong' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='45' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_inc_ulong'>
      <parameter type-id='type-id-318' name='target' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='45' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <qualified-type-def type-id='type-id-23' volatile='yes' id='type-id-319'/>
    <pointer-type-def type-id='type-id-319' size-in-bits='64' id='type-id-320'/>
    <function-decl name='atomic_inc_64' mangled-name='atomic_inc_64' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='46' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_inc_64'>
      <parameter type-id='type-id-320' name='target' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='46' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='atomic_dec_8' mangled-name='atomic_dec_8' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='55' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_dec_8'>
      <parameter type-id='type-id-305' name='target' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='39' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='atomic_dec_uchar' mangled-name='atomic_dec_uchar' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='56' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_dec_uchar'>
      <parameter type-id='type-id-308' name='target' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='40' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='atomic_dec_16' mangled-name='atomic_dec_16' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='57' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_dec_16'>
      <parameter type-id='type-id-310' name='target' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='41' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='atomic_dec_ushort' mangled-name='atomic_dec_ushort' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='58' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_dec_ushort'>
      <parameter type-id='type-id-312' name='target' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='42' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='atomic_dec_32' mangled-name='atomic_dec_32' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='59' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_dec_32'>
      <parameter type-id='type-id-314' name='target' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='43' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='atomic_dec_uint' mangled-name='atomic_dec_uint' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='60' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_dec_uint'>
      <parameter type-id='type-id-316' name='target' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='44' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='atomic_dec_ulong' mangled-name='atomic_dec_ulong' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='61' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_dec_ulong'>
      <parameter type-id='type-id-318' name='target' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='45' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='atomic_dec_64' mangled-name='atomic_dec_64' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='62' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_dec_64'>
      <parameter type-id='type-id-320' name='target' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='46' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <type-decl name='signed char' size-in-bits='8' id='type-id-321'/>
    <typedef-decl name='__int8_t' type-id='type-id-321' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='36' column='1' id='type-id-322'/>
    <typedef-decl name='int8_t' type-id='type-id-322' filepath='/usr/include/x86_64-linux-gnu/bits/stdint-intn.h' line='24' column='1' id='type-id-323'/>
    <function-decl name='atomic_add_8' mangled-name='atomic_add_8' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='71' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_8'>
      <parameter type-id='type-id-305' name='target' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='71' column='1'/>
      <parameter type-id='type-id-323' name='bits' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='71' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='atomic_add_char' mangled-name='atomic_add_char' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='72' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_char'>
      <parameter type-id='type-id-308' name='target' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='72' column='1'/>
      <parameter type-id='type-id-321' name='bits' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='72' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='atomic_add_16' mangled-name='atomic_add_16' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='73' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_16'>
      <parameter type-id='type-id-310' name='target' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='73' column='1'/>
      <parameter type-id='type-id-66' name='bits' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='73' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='atomic_add_short' mangled-name='atomic_add_short' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='74' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_short'>
      <parameter type-id='type-id-312' name='target' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='74' column='1'/>
      <parameter type-id='type-id-7' name='bits' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='74' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='atomic_add_32' mangled-name='atomic_add_32' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='75' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_32'>
      <parameter type-id='type-id-314' name='target' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='75' column='1'/>
      <parameter type-id='type-id-21' name='bits' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='75' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='atomic_add_int' mangled-name='atomic_add_int' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='76' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_int'>
      <parameter type-id='type-id-316' name='target' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='76' column='1'/>
      <parameter type-id='type-id-1' name='bits' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='76' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='atomic_add_long' mangled-name='atomic_add_long' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='77' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_long'>
      <parameter type-id='type-id-318' name='target' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='77' column='1'/>
      <parameter type-id='type-id-5' name='bits' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='77' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <typedef-decl name='__int64_t' type-id='type-id-5' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='43' column='1' id='type-id-324'/>
    <typedef-decl name='int64_t' type-id='type-id-324' filepath='/usr/include/x86_64-linux-gnu/bits/stdint-intn.h' line='27' column='1' id='type-id-325'/>
    <function-decl name='atomic_add_64' mangled-name='atomic_add_64' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='78' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_64'>
      <parameter type-id='type-id-320' name='target' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='78' column='1'/>
      <parameter type-id='type-id-325' name='bits' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='78' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <typedef-decl name='ssize_t' type-id='type-id-148' filepath='/usr/include/x86_64-linux-gnu/sys/types.h' line='108' column='1' id='type-id-326'/>
    <function-decl name='atomic_add_ptr' mangled-name='atomic_add_ptr' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='81' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_ptr'>
      <parameter type-id='type-id-145' name='target' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='81' column='1'/>
      <parameter type-id='type-id-326' name='bits' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='81' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='atomic_sub_8' mangled-name='atomic_sub_8' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='93' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_sub_8'>
      <parameter type-id='type-id-305' name='target' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='71' column='1'/>
      <parameter type-id='type-id-323' name='bits' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='71' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='atomic_sub_char' mangled-name='atomic_sub_char' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='94' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_sub_char'>
      <parameter type-id='type-id-308' name='target' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='72' column='1'/>
      <parameter type-id='type-id-321' name='bits' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='72' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='atomic_sub_16' mangled-name='atomic_sub_16' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='95' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_sub_16'>
      <parameter type-id='type-id-310' name='target' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='73' column='1'/>
      <parameter type-id='type-id-66' name='bits' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='73' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='atomic_sub_short' mangled-name='atomic_sub_short' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='96' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_sub_short'>
      <parameter type-id='type-id-312' name='target' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='74' column='1'/>
      <parameter type-id='type-id-7' name='bits' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='74' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='atomic_sub_32' mangled-name='atomic_sub_32' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='97' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_sub_32'>
      <parameter type-id='type-id-314' name='target' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='75' column='1'/>
      <parameter type-id='type-id-21' name='bits' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='75' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='atomic_sub_int' mangled-name='atomic_sub_int' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='98' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_sub_int'>
      <parameter type-id='type-id-316' name='target' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='76' column='1'/>
      <parameter type-id='type-id-1' name='bits' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='76' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='atomic_sub_long' mangled-name='atomic_sub_long' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='99' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_sub_long'>
      <parameter type-id='type-id-318' name='target' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='77' column='1'/>
      <parameter type-id='type-id-5' name='bits' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='77' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='atomic_sub_64' mangled-name='atomic_sub_64' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='100' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_sub_64'>
      <parameter type-id='type-id-320' name='target' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='78' column='1'/>
      <parameter type-id='type-id-325' name='bits' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='78' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='atomic_sub_ptr' mangled-name='atomic_sub_ptr' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='103' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_sub_ptr'>
      <parameter type-id='type-id-145' name='target' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='81' column='1'/>
      <parameter type-id='type-id-326' name='bits' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='81' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='atomic_or_8' mangled-name='atomic_or_8' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='115' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_or_8'>
      <parameter type-id='type-id-305' name='target' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='115' column='1'/>
      <parameter type-id='type-id-32' name='bits' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='115' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='atomic_or_uchar' mangled-name='atomic_or_uchar' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='116' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_or_uchar'>
      <parameter type-id='type-id-308' name='target' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='116' column='1'/>
      <parameter type-id='type-id-306' name='bits' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='116' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='atomic_or_16' mangled-name='atomic_or_16' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='117' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_or_16'>
      <parameter type-id='type-id-310' name='target' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='117' column='1'/>
      <parameter type-id='type-id-225' name='bits' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='117' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='atomic_or_ushort' mangled-name='atomic_or_ushort' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='118' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_or_ushort'>
      <parameter type-id='type-id-312' name='target' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='118' column='1'/>
      <parameter type-id='type-id-228' name='bits' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='118' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='atomic_or_32' mangled-name='atomic_or_32' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='119' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_or_32'>
      <parameter type-id='type-id-314' name='target' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='119' column='1'/>
      <parameter type-id='type-id-22' name='bits' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='119' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='atomic_or_uint' mangled-name='atomic_or_uint' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='120' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_or_uint'>
      <parameter type-id='type-id-316' name='target' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='120' column='1'/>
      <parameter type-id='type-id-34' name='bits' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='120' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='atomic_or_ulong' mangled-name='atomic_or_ulong' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='121' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_or_ulong'>
      <parameter type-id='type-id-318' name='target' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='121' column='1'/>
      <parameter type-id='type-id-184' name='bits' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='121' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='atomic_or_64' mangled-name='atomic_or_64' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='122' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_or_64'>
      <parameter type-id='type-id-320' name='target' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='122' column='1'/>
      <parameter type-id='type-id-23' name='bits' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='122' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='atomic_and_8' mangled-name='atomic_and_8' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='131' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_and_8'>
      <parameter type-id='type-id-305' name='target' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='115' column='1'/>
      <parameter type-id='type-id-32' name='bits' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='115' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='atomic_and_uchar' mangled-name='atomic_and_uchar' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='132' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_and_uchar'>
      <parameter type-id='type-id-308' name='target' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='116' column='1'/>
      <parameter type-id='type-id-306' name='bits' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='116' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='atomic_and_16' mangled-name='atomic_and_16' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='133' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_and_16'>
      <parameter type-id='type-id-310' name='target' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='117' column='1'/>
      <parameter type-id='type-id-225' name='bits' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='117' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='atomic_and_ushort' mangled-name='atomic_and_ushort' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='134' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_and_ushort'>
      <parameter type-id='type-id-312' name='target' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='118' column='1'/>
      <parameter type-id='type-id-228' name='bits' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='118' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='atomic_and_32' mangled-name='atomic_and_32' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='135' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_and_32'>
      <parameter type-id='type-id-314' name='target' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='119' column='1'/>
      <parameter type-id='type-id-22' name='bits' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='119' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='atomic_and_uint' mangled-name='atomic_and_uint' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='136' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_and_uint'>
      <parameter type-id='type-id-316' name='target' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='120' column='1'/>
      <parameter type-id='type-id-34' name='bits' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='120' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='atomic_and_ulong' mangled-name='atomic_and_ulong' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='137' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_and_ulong'>
      <parameter type-id='type-id-318' name='target' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='121' column='1'/>
      <parameter type-id='type-id-184' name='bits' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='121' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='atomic_and_64' mangled-name='atomic_and_64' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='138' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_and_64'>
      <parameter type-id='type-id-320' name='target' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='122' column='1'/>
      <parameter type-id='type-id-23' name='bits' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='122' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='atomic_inc_8_nv' mangled-name='atomic_inc_8_nv' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='151' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_inc_8_nv'>
      <parameter type-id='type-id-305' name='target' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='151' column='1'/>
      <return type-id='type-id-32'/>
    </function-decl>
    <function-decl name='atomic_inc_uchar_nv' mangled-name='atomic_inc_uchar_nv' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='152' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_inc_uchar_nv'>
      <parameter type-id='type-id-308' name='target' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='152' column='1'/>
      <return type-id='type-id-306'/>
    </function-decl>
    <function-decl name='atomic_inc_16_nv' mangled-name='atomic_inc_16_nv' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='153' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_inc_16_nv'>
      <parameter type-id='type-id-310' name='target' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='153' column='1'/>
      <return type-id='type-id-225'/>
    </function-decl>
    <function-decl name='atomic_inc_ushort_nv' mangled-name='atomic_inc_ushort_nv' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='154' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_inc_ushort_nv'>
      <parameter type-id='type-id-312' name='target' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='154' column='1'/>
      <return type-id='type-id-228'/>
    </function-decl>
    <function-decl name='atomic_inc_32_nv' mangled-name='atomic_inc_32_nv' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='155' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_inc_32_nv'>
      <parameter type-id='type-id-314' name='target' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='155' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='atomic_inc_uint_nv' mangled-name='atomic_inc_uint_nv' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='156' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_inc_uint_nv'>
      <parameter type-id='type-id-316' name='target' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='156' column='1'/>
      <return type-id='type-id-34'/>
    </function-decl>
    <function-decl name='atomic_inc_ulong_nv' mangled-name='atomic_inc_ulong_nv' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='157' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_inc_ulong_nv'>
      <parameter type-id='type-id-318' name='target' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='157' column='1'/>
      <return type-id='type-id-184'/>
    </function-decl>
    <function-decl name='atomic_inc_64_nv' mangled-name='atomic_inc_64_nv' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='158' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_inc_64_nv'>
      <parameter type-id='type-id-320' name='target' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='158' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='atomic_dec_8_nv' mangled-name='atomic_dec_8_nv' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='167' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_dec_8_nv'>
      <parameter type-id='type-id-305' name='target' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='151' column='1'/>
      <return type-id='type-id-32'/>
    </function-decl>
    <function-decl name='atomic_dec_uchar_nv' mangled-name='atomic_dec_uchar_nv' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='168' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_dec_uchar_nv'>
      <parameter type-id='type-id-308' name='target' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='152' column='1'/>
      <return type-id='type-id-306'/>
    </function-decl>
    <function-decl name='atomic_dec_16_nv' mangled-name='atomic_dec_16_nv' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='169' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_dec_16_nv'>
      <parameter type-id='type-id-310' name='target' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='153' column='1'/>
      <return type-id='type-id-225'/>
    </function-decl>
    <function-decl name='atomic_dec_ushort_nv' mangled-name='atomic_dec_ushort_nv' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='170' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_dec_ushort_nv'>
      <parameter type-id='type-id-312' name='target' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='154' column='1'/>
      <return type-id='type-id-228'/>
    </function-decl>
    <function-decl name='atomic_dec_32_nv' mangled-name='atomic_dec_32_nv' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='171' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_dec_32_nv'>
      <parameter type-id='type-id-314' name='target' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='155' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='atomic_dec_uint_nv' mangled-name='atomic_dec_uint_nv' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='172' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_dec_uint_nv'>
      <parameter type-id='type-id-316' name='target' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='156' column='1'/>
      <return type-id='type-id-34'/>
    </function-decl>
    <function-decl name='atomic_dec_ulong_nv' mangled-name='atomic_dec_ulong_nv' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='173' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_dec_ulong_nv'>
      <parameter type-id='type-id-318' name='target' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='157' column='1'/>
      <return type-id='type-id-184'/>
    </function-decl>
    <function-decl name='atomic_dec_64_nv' mangled-name='atomic_dec_64_nv' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='174' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_dec_64_nv'>
      <parameter type-id='type-id-320' name='target' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='158' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='atomic_add_8_nv' mangled-name='atomic_add_8_nv' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='183' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_8_nv'>
      <parameter type-id='type-id-305' name='target' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='183' column='1'/>
      <parameter type-id='type-id-323' name='bits' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='183' column='1'/>
      <return type-id='type-id-32'/>
    </function-decl>
    <function-decl name='atomic_add_char_nv' mangled-name='atomic_add_char_nv' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='184' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_char_nv'>
      <parameter type-id='type-id-308' name='target' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='184' column='1'/>
      <parameter type-id='type-id-321' name='bits' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='184' column='1'/>
      <return type-id='type-id-306'/>
    </function-decl>
    <function-decl name='atomic_add_16_nv' mangled-name='atomic_add_16_nv' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='185' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_16_nv'>
      <parameter type-id='type-id-310' name='target' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='185' column='1'/>
      <parameter type-id='type-id-66' name='bits' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='185' column='1'/>
      <return type-id='type-id-225'/>
    </function-decl>
    <function-decl name='atomic_add_short_nv' mangled-name='atomic_add_short_nv' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='186' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_short_nv'>
      <parameter type-id='type-id-312' name='target' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='186' column='1'/>
      <parameter type-id='type-id-7' name='bits' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='186' column='1'/>
      <return type-id='type-id-228'/>
    </function-decl>
    <function-decl name='atomic_add_32_nv' mangled-name='atomic_add_32_nv' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='187' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_32_nv'>
      <parameter type-id='type-id-314' name='target' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='187' column='1'/>
      <parameter type-id='type-id-21' name='bits' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='187' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='atomic_add_int_nv' mangled-name='atomic_add_int_nv' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='188' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_int_nv'>
      <parameter type-id='type-id-316' name='target' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='188' column='1'/>
      <parameter type-id='type-id-1' name='bits' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='188' column='1'/>
      <return type-id='type-id-34'/>
    </function-decl>
    <function-decl name='atomic_add_long_nv' mangled-name='atomic_add_long_nv' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='189' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_long_nv'>
      <parameter type-id='type-id-318' name='target' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='189' column='1'/>
      <parameter type-id='type-id-5' name='bits' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='189' column='1'/>
      <return type-id='type-id-184'/>
    </function-decl>
    <function-decl name='atomic_add_64_nv' mangled-name='atomic_add_64_nv' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='190' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_64_nv'>
      <parameter type-id='type-id-320' name='target' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='190' column='1'/>
      <parameter type-id='type-id-325' name='bits' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libspl/atomic.c' line='190' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
