<abi-corpus version='2.0' architecture='elf-amd-x86_64' soname='libzfs_core.so.3'>
  <elf-needed>
    <dependency name='libuuid.so.1'/>
    <dependency name='libz.so.1'/>
    <dependency name='libm.so.6'/>
    <dependency name='libblkid.so.1'/>
    <dependency name='libudev.so.1'/>
    <dependency name='libnvpair.so.3'/>
    <dependency name='libc.so.6'/>
    <dependency name='ld-linux-x86-64.so.2'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='_sol_getmntent' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='atomic_add_16' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='atomic_add_16_nv' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='atomic_add_32' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='atomic_add_32_nv' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='atomic_add_64' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='atomic_add_64_nv' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='atomic_add_8' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='zfs_setproctitle_init' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zfs_strcmp_pathname' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zfs_strip_partition' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zfs_strip_path' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zpool_default_search_paths' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zpool_disk_wait' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zpool_dump_ddt' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zpool_find_config' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zpool_find_import_blkid' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zpool_getenv_int' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zpool_history_unpack' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zpool_label_disk_wait' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zpool_open_func' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zpool_read_label' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zpool_search_import' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zutil_alloc' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zutil_strdup' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <elf-variable-symbols>
    <elf-symbol name='aok' size='4' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='buf' size='4110' type='tls-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='default_vtoc_map' size='64' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_debug' size='4' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='pagesize' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-variable-symbols>
  <abi-instr address-size='64' path='../../module/avl/avl.c' language='LANG_C99'>
    <function-decl name='avl_last' mangled-name='avl_last' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_last'>
      <parameter type-id='a3681dea' name='tree'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='avl_nearest' mangled-name='avl_nearest' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_nearest'>
      <parameter type-id='a3681dea' name='tree'/>
      <parameter type-id='fba6cb51' name='where'/>
      <parameter type-id='95e97e5e' name='direction'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='avl_insert_here' mangled-name='avl_insert_here' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_insert_here'>
      <parameter type-id='a3681dea' name='tree'/>
      <parameter type-id='eaa32e2f' name='new_data'/>
      <parameter type-id='eaa32e2f' name='here'/>
      <parameter type-id='95e97e5e' name='direction'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='avl_add' mangled-name='avl_add' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_add'>
      <parameter type-id='a3681dea' name='tree'/>
      <parameter type-id='eaa32e2f' name='new_node'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='avl_remove' mangled-name='avl_remove' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_remove'>
      <parameter type-id='a3681dea' name='tree'/>
      <parameter type-id='eaa32e2f' name='data'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='avl_update_lt' mangled-name='avl_update_lt' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_update_lt'>
      <parameter type-id='a3681dea' name='t'/>
      <parameter type-id='eaa32e2f' name='obj'/>
      <return type-id='c19b74c3'/>
    </function-decl>
    <function-decl name='avl_update_gt' mangled-name='avl_update_gt' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_update_gt'>
      <parameter type-id='a3681dea' name='t'/>
      <parameter type-id='eaa32e2f' name='obj'/>
      <return type-id='c19b74c3'/>
    </function-decl>
    <function-decl name='avl_update' mangled-name='avl_update' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_update'>
      <parameter type-id='a3681dea' name='t'/>
      <parameter type-id='eaa32e2f' name='obj'/>
      <return type-id='c19b74c3'/>
    </function-decl>
    <function-decl name='avl_swap' mangled-name='avl_swap' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_swap'>
      <parameter type-id='a3681dea' name='tree1'/>
      <parameter type-id='a3681dea' name='tree2'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='avl_numnodes' mangled-name='avl_numnodes' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_numnodes'>
      <parameter type-id='a3681dea' name='tree'/>
      <return type-id='ee1f298e'/>
    </function-decl>
    <function-decl name='avl_is_empty' mangled-name='avl_is_empty' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_is_empty'>
      <parameter type-id='a3681dea' name='tree'/>
      <return type-id='c19b74c3'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='rdwr_efi.c' language='LANG_C99'>
    <array-type-def dimensions='1' type-id='72d5edd1' size-in-bits='512' id='c1dc88bc'>
      <subrange length='16' type-id='7359adad' id='848d0938'/>
    </array-type-def>
    <class-decl name='dk_map2' size-in-bits='32' is-struct='yes' visibility='default' id='72d5edd1'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='p_tag' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='p_flag' type-id='149c6638' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='Byte' type-id='002ac4a6' id='efb9ba06'/>
    <typedef-decl name='uInt' type-id='f0981eeb' id='09110a74'/>
    <typedef-decl name='uLong' type-id='7359adad' id='5bbcce85'/>
    <typedef-decl name='Bytef' type-id='efb9ba06' id='c1606520'/>
    <qualified-type-def type-id='c1606520' const='yes' id='a6124a50'/>
    <pointer-type-def type-id='a6124a50' size-in-bits='64' id='e8cb3e0e'/>
    <qualified-type-def type-id='002ac4a6' const='yes' id='ea86de29'/>
    <pointer-type-def type-id='ea86de29' size-in-bits='64' id='354f7eb9'/>
    <pointer-type-def type-id='002ac4a6' size-in-bits='64' id='cf536864'/>
    <var-decl name='default_vtoc_map' type-id='c1dc88bc' mangled-name='default_vtoc_map' visibility='default' elf-symbol-id='default_vtoc_map'/>
    <var-decl name='efi_debug' type-id='95e97e5e' mangled-name='efi_debug' visibility='default' elf-symbol-id='efi_debug'/>
    <function-decl name='efi_alloc_and_read' mangled-name='efi_alloc_and_read' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_alloc_and_read'>
      <parameter type-id='95e97e5e' name='fd'/>
      <parameter type-id='c43b27a6' name='vtoc'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='efi_rescan' mangled-name='efi_rescan' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_rescan'>
      <parameter type-id='95e97e5e' name='fd'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='efi_use_whole_disk' mangled-name='efi_use_whole_disk' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_use_whole_disk'>
      <parameter type-id='95e97e5e' name='fd'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='efi_write' mangled-name='efi_write' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_write'>
      <parameter type-id='95e97e5e' name='fd'/>
      <parameter type-id='0d8119a8' name='vtoc'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='efi_type' mangled-name='efi_type' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_type'>
      <parameter type-id='95e97e5e' name='fd'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='efi_err_check' mangled-name='efi_err_check' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_err_check'>
      <parameter type-id='0d8119a8' name='vtoc'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='efi_auto_sense' mangled-name='efi_auto_sense' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_auto_sense'>
      <parameter type-id='95e97e5e' name='fd'/>
      <parameter type-id='c43b27a6' name='vtoc'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='write' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='95e97e5e'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='b59d7dce'/>
      <return type-id='79a0948f'/>
    </function-decl>
    <function-decl name='fsync' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='95e97e5e'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='uuid_generate' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='cf536864'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='uuid_is_null' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='354f7eb9'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='crc32' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='5bbcce85'/>
      <parameter type-id='e8cb3e0e'/>
      <parameter type-id='09110a74'/>
      <return type-id='5bbcce85'/>
    </function-decl>
    <type-decl name='unsigned long int' size-in-bits='64' id='7359adad'/>
  </abi-instr>
  <abi-instr address-size='64' path='assert.c' language='LANG_C99'>
    <class-decl name='__va_list_tag' size-in-bits='192' is-struct='yes' visibility='default' id='d5027220'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='gp_offset' type-id='f0981eeb' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='fp_offset' type-id='f0981eeb' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='overflow_arg_area' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='reg_save_area' type-id='eaa32e2f' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='d5027220' size-in-bits='64' id='b7f2d5e6'/>
    <var-decl name='aok' type-id='95e97e5e' mangled-name='aok' visibility='default' elf-symbol-id='aok'/>
    <function-decl name='abort' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='__vfprintf_chk' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='e75a27e9'/>
      <parameter type-id='95e97e5e'/>
      <parameter type-id='9d26089a'/>
      <parameter type-id='b7f2d5e6'/>
      <return type-id='95e97e5e'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='atomic.c' language='LANG_C99'>
    <typedef-decl name='int8_t' type-id='2171a512' id='ee31ee44'/>
    <typedef-decl name='__int8_t' type-id='28577a57' id='2171a512'/>
    <qualified-type-def type-id='149c6638' volatile='yes' id='5120c5f7'/>
    <pointer-type-def type-id='5120c5f7' size-in-bits='64' id='93977ae7'/>
    <qualified-type-def type-id='8f92235e' volatile='yes' id='430e0681'/>
    <pointer-type-def type-id='430e0681' size-in-bits='64' id='3a147f31'/>
    <qualified-type-def type-id='b96825af' volatile='yes' id='84ff7d66'/>
    <pointer-type-def type-id='84ff7d66' size-in-bits='64' id='aa323ea4'/>
    <qualified-type-def type-id='ee1f298e' volatile='yes' id='6f7e09cb'/>
    <pointer-type-def type-id='6f7e09cb' size-in-bits='64' id='64698d33'/>
    <function-decl name='atomic_inc_8' mangled-name='atomic_inc_8' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_inc_8'>
      <parameter type-id='aa323ea4' name='target'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='atomic_inc_16' mangled-name='atomic_inc_16' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_inc_16'>
      <parameter type-id='93977ae7' name='target'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='atomic_inc_32' mangled-name='atomic_inc_32' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_inc_32'>
      <parameter type-id='3a147f31' name='target'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='atomic_inc_ulong' mangled-name='atomic_inc_ulong' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_inc_ulong'>
      <parameter type-id='64698d33' name='target'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='atomic_dec_8' mangled-name='atomic_dec_8' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_dec_8'>
      <parameter type-id='aa323ea4' name='target'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='atomic_dec_16' mangled-name='atomic_dec_16' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_dec_16'>
      <parameter type-id='93977ae7' name='target'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='atomic_dec_32' mangled-name='atomic_dec_32' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_dec_32'>
      <parameter type-id='3a147f31' name='target'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='atomic_dec_ulong' mangled-name='atomic_dec_ulong' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_dec_ulong'>
      <parameter type-id='64698d33' name='target'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='atomic_add_8' mangled-name='atomic_add_8' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_8'>
      <parameter type-id='aa323ea4' name='target'/>
      <parameter type-id='ee31ee44' name='bits'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='atomic_add_16' mangled-name='atomic_add_16' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_16'>
      <parameter type-id='93977ae7' name='target'/>
      <parameter type-id='23bd8cb5' name='bits'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='atomic_add_32' mangled-name='atomic_add_32' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_32'>
      <parameter type-id='3a147f31' name='target'/>
      <parameter type-id='3ff5601b' name='bits'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='atomic_add_ptr' mangled-name='atomic_add_ptr' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_ptr'>
      <parameter type-id='fe09dd29' name='target'/>
      <parameter type-id='79a0948f' name='bits'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='atomic_sub_8' mangled-name='atomic_sub_8' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_sub_8'>
      <parameter type-id='aa323ea4' name='target'/>
      <parameter type-id='ee31ee44' name='bits'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='atomic_sub_16' mangled-name='atomic_sub_16' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_sub_16'>
      <parameter type-id='93977ae7' name='target'/>
      <parameter type-id='23bd8cb5' name='bits'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='atomic_sub_32' mangled-name='atomic_sub_32' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_sub_32'>
      <parameter type-id='3a147f31' name='target'/>
      <parameter type-id='3ff5601b' name='bits'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='atomic_sub_ptr' mangled-name='atomic_sub_ptr' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_sub_ptr'>
      <parameter type-id='fe09dd29' name='target'/>
      <parameter type-id='79a0948f' name='bits'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='atomic_or_8' mangled-name='atomic_or_8' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_or_8'>
      <parameter type-id='aa323ea4' name='target'/>
      <parameter type-id='b96825af' name='bits'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='atomic_or_16' mangled-name='atomic_or_16' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_or_16'>
      <parameter type-id='93977ae7' name='target'/>
      <parameter type-id='149c6638' name='bits'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='atomic_or_32' mangled-name='atomic_or_32' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_or_32'>
      <parameter type-id='3a147f31' name='target'/>
      <parameter type-id='8f92235e' name='bits'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='atomic_or_ulong' mangled-name='atomic_or_ulong' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_or_ulong'>
      <parameter type-id='64698d33' name='target'/>
      <parameter type-id='ee1f298e' name='bits'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='atomic_and_8' mangled-name='atomic_and_8' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_and_8'>
      <parameter type-id='aa323ea4' name='target'/>
      <parameter type-id='b96825af' name='bits'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='atomic_and_16' mangled-name='atomic_and_16' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_and_16'>
      <parameter type-id='93977ae7' name='target'/>
      <parameter type-id='149c6638' name='bits'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='atomic_and_32' mangled-name='atomic_and_32' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_and_32'>
      <parameter type-id='3a147f31' name='target'/>
      <parameter type-id='8f92235e' name='bits'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='atomic_and_ulong' mangled-name='atomic_and_ulong' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_and_ulong'>
      <parameter type-id='64698d33' name='target'/>
      <parameter type-id='ee1f298e' name='bits'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='atomic_inc_8_nv' mangled-name='atomic_inc_8_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_inc_8_nv'>
      <parameter type-id='aa323ea4' name='target'/>
      <return type-id='b96825af'/>
    </function-decl>
    <function-decl name='atomic_inc_16_nv' mangled-name='atomic_inc_16_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_inc_16_nv'>
      <parameter type-id='93977ae7' name='target'/>
      <return type-id='149c6638'/>
    </function-decl>
    <function-decl name='atomic_inc_32_nv' mangled-name='atomic_inc_32_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_inc_32_nv'>
      <parameter type-id='3a147f31' name='target'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='atomic_inc_ulong_nv' mangled-name='atomic_inc_ulong_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_inc_ulong_nv'>
      <parameter type-id='64698d33' name='target'/>
      <return type-id='ee1f298e'/>
    </function-decl>
    <function-decl name='atomic_dec_8_nv' mangled-name='atomic_dec_8_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_dec_8_nv'>
      <parameter type-id='aa323ea4' name='target'/>
      <return type-id='b96825af'/>
    </function-decl>
    <function-decl name='atomic_dec_16_nv' mangled-name='atomic_dec_16_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_dec_16_nv'>
      <parameter type-id='93977ae7' name='target'/>
      <return type-id='149c6638'/>
    </function-decl>
    <function-decl name='atomic_dec_32_nv' mangled-name='atomic_dec_32_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_dec_32_nv'>
      <parameter type-id='3a147f31' name='target'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='atomic_dec_ulong_nv' mangled-name='atomic_dec_ulong_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_dec_ulong_nv'>
      <parameter type-id='64698d33' name='target'/>
      <return type-id='ee1f298e'/>
    </function-decl>
    <function-decl name='atomic_add_8_nv' mangled-name='atomic_add_8_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_8_nv'>
      <parameter type-id='aa323ea4' name='target'/>
      <parameter type-id='ee31ee44' name='bits'/>
      <return type-id='b96825af'/>
    </function-decl>
    <function-decl name='atomic_add_16_nv' mangled-name='atomic_add_16_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_16_nv'>
      <parameter type-id='93977ae7' name='target'/>
      <parameter type-id='23bd8cb5' name='bits'/>
      <return type-id='149c6638'/>
    </function-decl>
    <function-decl name='atomic_add_32_nv' mangled-name='atomic_add_32_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_32_nv'>
      <parameter type-id='3a147f31' name='target'/>
      <parameter type-id='3ff5601b' name='bits'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='atomic_add_long_nv' mangled-name='atomic_add_long_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_long_nv'>
      <parameter type-id='64698d33' name='target'/>
      <parameter type-id='bd54fe1a' name='bits'/>
      <return type-id='ee1f298e'/>
    </function-decl>
    <function-decl name='atomic_add_ptr_nv' mangled-name='atomic_add_ptr_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_ptr_nv'>
      <parameter type-id='fe09dd29' name='target'/>
      <parameter type-id='79a0948f' name='bits'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='atomic_sub_8_nv' mangled-name='atomic_sub_8_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_sub_8_nv'>
      <parameter type-id='aa323ea4' name='target'/>
      <parameter type-id='ee31ee44' name='bits'/>
      <return type-id='b96825af'/>
    </function-decl>
    <function-decl name='atomic_sub_16_nv' mangled-name='atomic_sub_16_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_sub_16_nv'>
      <parameter type-id='93977ae7' name='target'/>
      <parameter type-id='23bd8cb5' name='bits'/>
      <return type-id='149c6638'/>
    </function-decl>
    <function-decl name='atomic_sub_32_nv' mangled-name='atomic_sub_32_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_sub_32_nv'>
      <parameter type-id='3a147f31' name='target'/>
      <parameter type-id='3ff5601b' name='bits'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='atomic_sub_long_nv' mangled-name='atomic_sub_long_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_sub_long_nv'>
      <parameter type-id='64698d33' name='target'/>
      <parameter type-id='bd54fe1a' name='bits'/>
      <return type-id='ee1f298e'/>
    </function-decl>
    <function-decl name='atomic_sub_ptr_nv' mangled-name='atomic_sub_ptr_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_sub_ptr_nv'>
      <parameter type-id='fe09dd29' name='target'/>
      <parameter type-id='79a0948f' name='bits'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='atomic_or_8_nv' mangled-name='atomic_or_8_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_or_8_nv'>
      <parameter type-id='aa323ea4' name='target'/>
      <parameter type-id='b96825af' name='bits'/>
      <return type-id='b96825af'/>
    </function-decl>
    <function-decl name='atomic_or_16_nv' mangled-name='atomic_or_16_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_or_16_nv'>
      <parameter type-id='93977ae7' name='target'/>
      <parameter type-id='149c6638' name='bits'/>
      <return type-id='149c6638'/>
    </function-decl>
    <function-decl name='atomic_or_32_nv' mangled-name='atomic_or_32_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_or_32_nv'>
      <parameter type-id='3a147f31' name='target'/>
      <parameter type-id='8f92235e' name='bits'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='atomic_or_ulong_nv' mangled-name='atomic_or_ulong_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_or_ulong_nv'>
      <parameter type-id='64698d33' name='target'/>
      <parameter type-id='ee1f298e' name='bits'/>
      <return type-id='ee1f298e'/>
    </function-decl>
    <function-decl name='atomic_and_8_nv' mangled-name='atomic_and_8_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_and_8_nv'>
      <parameter type-id='aa323ea4' name='target'/>
      <parameter type-id='b96825af' name='bits'/>
      <return type-id='b96825af'/>
    </function-decl>
    <function-decl name='atomic_and_16_nv' mangled-name='atomic_and_16_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_and_16_nv'>
      <parameter type-id='93977ae7' name='target'/>
      <parameter type-id='149c6638' name='bits'/>
      <return type-id='149c6638'/>
    </function-decl>
    <function-decl name='atomic_and_32_nv' mangled-name='atomic_and_32_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_and_32_nv'>
      <parameter type-id='3a147f31' name='target'/>
      <parameter type-id='8f92235e' name='bits'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='atomic_and_ulong_nv' mangled-name='atomic_and_ulong_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_and_ulong_nv'>
      <parameter type-id='64698d33' name='target'/>
      <parameter type-id='ee1f298e' name='bits'/>
      <return type-id='ee1f298e'/>
    </function-decl>
    <function-decl name='atomic_cas_8' mangled-name='atomic_cas_8' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_cas_8'>
      <parameter type-id='aa323ea4' name='target'/>
      <parameter type-id='b96825af' name='exp'/>
      <parameter type-id='b96825af' name='des'/>
      <return type-id='b96825af'/>
    </function-decl>
    <function-decl name='atomic_cas_16' mangled-name='atomic_cas_16' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_cas_16'>
      <parameter type-id='93977ae7' name='target'/>
      <parameter type-id='149c6638' name='exp'/>
      <parameter type-id='149c6638' name='des'/>
      <return type-id='149c6638'/>
    </function-decl>
    <function-decl name='atomic_cas_32' mangled-name='atomic_cas_32' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_cas_32'>
      <parameter type-id='3a147f31' name='target'/>
      <parameter type-id='8f92235e' name='exp'/>
      <parameter type-id='8f92235e' name='des'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='atomic_cas_ulong' mangled-name='atomic_cas_ulong' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_cas_ulong'>
      <parameter type-id='64698d33' name='target'/>
      <parameter type-id='ee1f298e' name='exp'/>
      <parameter type-id='ee1f298e' name='des'/>
      <return type-id='ee1f298e'/>
    </function-decl>
    <function-decl name='atomic_cas_ptr' mangled-name='atomic_cas_ptr' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_cas_ptr'>
      <parameter type-id='fe09dd29' name='target'/>
      <parameter type-id='eaa32e2f' name='exp'/>
      <parameter type-id='eaa32e2f' name='des'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='atomic_swap_8' mangled-name='atomic_swap_8' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_swap_8'>
      <parameter type-id='aa323ea4' name='target'/>
      <parameter type-id='b96825af' name='bits'/>
      <return type-id='b96825af'/>
    </function-decl>
    <function-decl name='atomic_swap_16' mangled-name='atomic_swap_16' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_swap_16'>
      <parameter type-id='93977ae7' name='target'/>
      <parameter type-id='149c6638' name='bits'/>
      <return type-id='149c6638'/>
    </function-decl>
    <function-decl name='atomic_swap_32' mangled-name='atomic_swap_32' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_swap_32'>
      <parameter type-id='3a147f31' name='target'/>
      <parameter type-id='8f92235e' name='bits'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='atomic_swap_ulong' mangled-name='atomic_swap_ulong' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_swap_ulong'>
      <parameter type-id='64698d33' name='target'/>
      <parameter type-id='ee1f298e' name='bits'/>
      <return type-id='ee1f298e'/>
    </function-decl>
    <function-decl name='atomic_swap_ptr' mangled-name='atomic_swap_ptr' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_swap_ptr'>
      <parameter type-id='fe09dd29' name='target'/>
      <parameter type-id='eaa32e2f' name='bits'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='atomic_set_long_excl' mangled-name='atomic_set_long_excl' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_set_long_excl'>
      <parameter type-id='64698d33' name='target'/>
      <parameter type-id='3502e3ff' name='value'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='atomic_clear_long_excl' mangled-name='atomic_clear_long_excl' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_clear_long_excl'>
      <parameter type-id='64698d33' name='target'/>
      <parameter type-id='3502e3ff' name='value'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='membar_enter' mangled-name='membar_enter' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='membar_enter'>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='membar_producer' mangled-name='membar_producer' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='membar_producer'>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='membar_consumer' mangled-name='membar_consumer' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='membar_consumer'>
      <return type-id='48b5725f'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='list.c' language='LANG_C99'>
    <typedef-decl name='list_node_t' type-id='b0b5e45e' id='b21843b2'/>
    <typedef-decl name='list_t' type-id='e824dae9' id='0899125f'/>
    <class-decl name='list_node' size-in-bits='128' is-struct='yes' visibility='default' id='b0b5e45e'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='b03eadb4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='prev' type-id='b03eadb4' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='list' size-in-bits='256' is-struct='yes' visibility='default' id='e824dae9'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='list_size' type-id='b59d7dce' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='list_offset' type-id='b59d7dce' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='list_head' type-id='b0b5e45e' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='b0b5e45e' size-in-bits='64' id='b03eadb4'/>
    <pointer-type-def type-id='b21843b2' size-in-bits='64' id='ccc38265'/>
    <pointer-type-def type-id='0899125f' size-in-bits='64' id='352ec160'/>
    <function-decl name='list_create' mangled-name='list_create' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_create'>
      <parameter type-id='352ec160' name='list'/>
      <parameter type-id='b59d7dce' name='size'/>
      <parameter type-id='b59d7dce' name='offset'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='list_destroy' mangled-name='list_destroy' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_destroy'>
      <parameter type-id='352ec160' name='list'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='list_insert_after' mangled-name='list_insert_after' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_insert_after'>
      <parameter type-id='352ec160' name='list'/>
      <parameter type-id='eaa32e2f' name='object'/>
      <parameter type-id='eaa32e2f' name='nobject'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='list_insert_before' mangled-name='list_insert_before' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_insert_before'>
      <parameter type-id='352ec160' name='list'/>
      <parameter type-id='eaa32e2f' name='object'/>
      <parameter type-id='eaa32e2f' name='nobject'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='list_insert_head' mangled-name='list_insert_head' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_insert_head'>
      <parameter type-id='352ec160' name='list'/>
      <parameter type-id='eaa32e2f' name='object'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='list_insert_tail' mangled-name='list_insert_tail' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_insert_tail'>
      <parameter type-id='352ec160' name='list'/>
      <parameter type-id='eaa32e2f' name='object'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='list_remove' mangled-name='list_remove' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_remove'>
      <parameter type-id='352ec160' name='list'/>
      <parameter type-id='eaa32e2f' name='object'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='list_remove_head' mangled-name='list_remove_head' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_remove_head'>
      <parameter type-id='352ec160' name='list'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='list_remove_tail' mangled-name='list_remove_tail' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_remove_tail'>
      <parameter type-id='352ec160' name='list'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='list_head' mangled-name='list_head' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_head'>
      <parameter type-id='352ec160' name='list'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='list_tail' mangled-name='list_tail' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_tail'>
      <parameter type-id='352ec160' name='list'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='list_next' mangled-name='list_next' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_next'>
      <parameter type-id='352ec160' name='list'/>
      <parameter type-id='eaa32e2f' name='object'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='list_prev' mangled-name='list_prev' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_prev'>
      <parameter type-id='352ec160' name='list'/>
      <parameter type-id='eaa32e2f' name='object'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='list_move_tail' mangled-name='list_move_tail' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_move_tail'>
      <parameter type-id='352ec160' name='dst'/>
      <parameter type-id='352ec160' name='src'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='list_link_replace' mangled-name='list_link_replace' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_link_replace'>
      <parameter type-id='ccc38265' name='lold'/>
      <parameter type-id='ccc38265' name='lnew'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='list_link_init' mangled-name='list_link_init' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_link_init'>
      <parameter type-id='ccc38265' name='ln'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='list_link_active' mangled-name='list_link_active' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_link_active'>
      <parameter type-id='ccc38265' name='ln'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='list_is_empty' mangled-name='list_is_empty' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_is_empty'>
      <parameter type-id='352ec160' name='list'/>
      <return type-id='95e97e5e'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='mkdirp.c' language='LANG_C99'>
    <typedef-decl name='mode_t' type-id='e1c52942' id='d50d396c'/>
    <typedef-decl name='wchar_t' type-id='95e97e5e' id='928221d2'/>
    <qualified-type-def type-id='928221d2' const='yes' id='effb3702'/>
    <pointer-type-def type-id='effb3702' size-in-bits='64' id='f077d3f8'/>
    <qualified-type-def type-id='f077d3f8' restrict='yes' id='598aab80'/>
    <pointer-type-def type-id='928221d2' size-in-bits='64' id='323d93c1'/>
    <qualified-type-def type-id='323d93c1' restrict='yes' id='f1358bc3'/>
    <function-decl name='mkdirp' mangled-name='mkdirp' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='mkdirp'>
      <parameter type-id='80f4b756' name='d'/>
      <parameter type-id='d50d396c' name='mode'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='__mbstowcs_chk' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='f1358bc3'/>
      <parameter type-id='9d26089a'/>
      <parameter type-id='b59d7dce'/>
      <parameter type-id='b59d7dce'/>
      <return type-id='b59d7dce'/>
    </function-decl>
    <function-decl name='__wcstombs_chk' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='266fe297'/>
      <parameter type-id='598aab80'/>
      <parameter type-id='b59d7dce'/>
      <parameter type-id='b59d7dce'/>
      <return type-id='b59d7dce'/>
    </function-decl>
    <function-decl name='mkdir' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='80f4b756'/>
      <parameter type-id='e1c52942'/>
      <return type-id='95e97e5e'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='os/linux/getexecname.c' language='LANG_C99'>
    <function-decl name='getexecname' mangled-name='getexecname' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getexecname'>
      <return type-id='80f4b756'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='os/linux/gethostid.c' language='LANG_C99'>
    <function-decl name='get_system_hostid' mangled-name='get_system_hostid' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='get_system_hostid'>
      <return type-id='7359adad'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='os/linux/getmntany.c' language='LANG_C99'>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='32880' id='ad756b7f'>
      <subrange length='4110' type-id='7359adad' id='8aa676f7'/>
    </array-type-def>
    <class-decl name='mnttab' size-in-bits='256' is-struct='yes' visibility='default' id='1b055409'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mnt_special' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='mnt_mountp' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='mnt_fstype' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='mnt_mntopts' type-id='26a90f95' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='extmnttab' size-in-bits='320' is-struct='yes' visibility='default' id='0c544dc0'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mnt_special' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='mnt_mountp' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='mnt_fstype' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='mnt_mntopts' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='mnt_major' type-id='3502e3ff' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='mnt_minor' type-id='3502e3ff' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='mntent' size-in-bits='320' is-struct='yes' visibility='default' id='56fe4a37'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mnt_fsname' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='mnt_dir' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='mnt_type' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='mnt_opts' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='mnt_freq' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='mnt_passno' type-id='95e97e5e' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='0c544dc0' size-in-bits='64' id='394fc496'/>
    <pointer-type-def type-id='56fe4a37' size-in-bits='64' id='b6b61d2f'/>
    <qualified-type-def type-id='b6b61d2f' restrict='yes' id='3cad23cd'/>
    <pointer-type-def type-id='1b055409' size-in-bits='64' id='9d424d31'/>
    <function-decl name='getmntent_r' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='e75a27e9'/>
      <parameter type-id='3cad23cd'/>
      <parameter type-id='266fe297'/>
      <parameter type-id='95e97e5e'/>
      <return type-id='b6b61d2f'/>
    </function-decl>
    <function-decl name='feof' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='822cd80b'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <var-decl name='buf' type-id='ad756b7f' mangled-name='buf' visibility='default' elf-symbol-id='buf'/>
    <function-decl name='getmntany' mangled-name='getmntany' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getmntany'>
      <parameter type-id='822cd80b' name='fp'/>
      <parameter type-id='9d424d31' name='mgetp'/>
      <parameter type-id='9d424d31' name='mrefp'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='_sol_getmntent' mangled-name='_sol_getmntent' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_sol_getmntent'>
      <parameter type-id='822cd80b' name='fp'/>
      <parameter type-id='9d424d31' name='mgetp'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='getextmntent' mangled-name='getextmntent' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getextmntent'>
      <parameter type-id='80f4b756' name='path'/>
      <parameter type-id='394fc496' name='entry'/>
      <parameter type-id='62f7a03d' name='statbuf'/>
      <return type-id='95e97e5e'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='os/linux/zone.c' language='LANG_C99'>
    <typedef-decl name='zoneid_t' type-id='95e97e5e' id='4da03624'/>
    <function-decl name='getzoneid' mangled-name='getzoneid' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getzoneid'>
      <return type-id='4da03624'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='page.c' language='LANG_C99'>
    <var-decl name='pagesize' type-id='b59d7dce' mangled-name='pagesize' visibility='default' elf-symbol-id='pagesize'/>
  </abi-instr>
  <abi-instr address-size='64' path='timestamp.c' language='LANG_C99'>
    <typedef-decl name='nl_item' type-id='95e97e5e' id='03b79a94'/>
    <class-decl name='tm' size-in-bits='448' is-struct='yes' visibility='default' id='dddf6ca2'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tm_sec' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='tm_min' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tm_hour' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='tm_mday' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='tm_mon' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='tm_year' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='tm_wday' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='tm_yday' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='tm_isdst' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='tm_gmtoff' type-id='bd54fe1a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='tm_zone' type-id='80f4b756' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='time_t' type-id='65eda9c0' id='c9d12d66'/>
    <qualified-type-def type-id='c9d12d66' const='yes' id='588b3216'/>
    <pointer-type-def type-id='588b3216' size-in-bits='64' id='9f201474'/>
    <qualified-type-def type-id='dddf6ca2' const='yes' id='e824a34f'/>
    <pointer-type-def type-id='e824a34f' size-in-bits='64' id='d6ad37ff'/>
    <qualified-type-def type-id='d6ad37ff' restrict='yes' id='f8c6051d'/>
    <pointer-type-def type-id='c9d12d66' size-in-bits='64' id='b2eb2c3f'/>
    <pointer-type-def type-id='dddf6ca2' size-in-bits='64' id='d915a820'/>
    <function-decl name='print_timestamp' mangled-name='print_timestamp' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='print_timestamp'>
      <parameter type-id='3502e3ff' name='timestamp_fmt'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='nl_langinfo' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='03b79a94'/>
      <return type-id='26a90f95'/>
    </function-decl>
    <function-decl name='time' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='b2eb2c3f'/>
      <return type-id='c9d12d66'/>
    </function-decl>
    <function-decl name='strftime' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='266fe297'/>
      <parameter type-id='b59d7dce'/>
      <parameter type-id='9d26089a'/>
      <parameter type-id='f8c6051d'/>
      <return type-id='b59d7dce'/>
    </function-decl>
    <function-decl name='localtime' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='9f201474'/>
      <return type-id='d915a820'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='thread_pool.c' language='LANG_C99'>
    <array-type-def dimensions='1' type-id='8901473c' size-in-bits='576' id='f5da478b'>
      <subrange length='1' type-id='7359adad' id='52f813b4'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='49ef3ffd' size-in-bits='1024' id='a14403f5'>
      <subrange length='16' type-id='7359adad' id='848d0938'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='384' id='36d7f119'>
      <subrange length='48' type-id='7359adad' id='8f6d2a81'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='bd54fe1a' size-in-bits='512' id='5d4efd44'>
      <subrange length='8' type-id='7359adad' id='56e0c0b1'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='f0981eeb' size-in-bits='64' id='0d532ec1'>
      <subrange length='2' type-id='7359adad' id='52efc4ef'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='7359adad' size-in-bits='1024' id='d2baa450'>
      <subrange length='16' type-id='7359adad' id='848d0938'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='eaa32e2f' size-in-bits='256' id='209ef23f'>
      <subrange length='4' type-id='7359adad' id='16fe7105'/>
    </array-type-def>
    <typedef-decl name='tpool_job_t' type-id='3b8579e5' id='66a0afc9'/>
    <class-decl name='tpool_job' size-in-bits='192' is-struct='yes' visibility='default' id='3b8579e5'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tpj_next' type-id='f32b30e4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tpj_func' type-id='b7f9d8e6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='tpj_arg' type-id='eaa32e2f' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='tpool_active_t' type-id='c8d086f4' id='6fcda10e'/>
    <class-decl name='tpool_active' size-in-bits='128' is-struct='yes' visibility='default' id='c8d086f4'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tpa_next' type-id='ad33e5e7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tpa_tid' type-id='4051f5e7' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__cancel_jmp_buf_tag' size-in-bits='576' is-struct='yes' visibility='default' id='8901473c'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__cancel_jmp_buf' type-id='379a1ab7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='__mask_was_saved' type-id='95e97e5e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__pthread_unwind_buf_t' size-in-bits='832' is-struct='yes' naming-typedef-id='4423cf7f' visibility='default' id='a0abc656'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__cancel_jmp_buf' type-id='f5da478b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='__pad' type-id='209ef23f' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__pthread_unwind_buf_t' type-id='a0abc656' id='4423cf7f'/>
    <union-decl name='__atomic_wide_counter' size-in-bits='64' naming-typedef-id='f3b40860' visibility='default' id='613ce450'>
      <data-member access='public'>
        <var-decl name='__value64' type-id='3a47d82b' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__value32' type-id='e7f43f72' visibility='default'/>
      </data-member>
    </union-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f72'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__low' type-id='f0981eeb' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='__high' type-id='f0981eeb' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__atomic_wide_counter' type-id='613ce450' id='f3b40860'/>
    <typedef-decl name='__cpu_mask' type-id='7359adad' id='49ef3ffd'/>
    <class-decl name='cpu_set_t' size-in-bits='1024' is-struct='yes' naming-typedef-id='8037c762' visibility='default' id='1f20d231'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__bits' type-id='a14403f5' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='cpu_set_t' type-id='1f20d231' id='8037c762'/>
    <typedef-decl name='pthread_t' type-id='7359adad' id='4051f5e7'/>
    <union-decl name='pthread_condattr_t' size-in-bits='32' naming-typedef-id='836265dd' visibility='default' id='33dd3aad'>
      <data-member access='public'>
        <var-decl name='__size' type-id='8e0573fd' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__align' type-id='95e97e5e' visibility='default'/>
      </data-member>
    </union-decl>
    <typedef-decl name='pthread_condattr_t' type-id='33dd3aad' id='836265dd'/>
    <union-decl name='pthread_cond_t' size-in-bits='384' naming-typedef-id='62fab762' visibility='default' id='cbb12c12'>
      <data-member access='public'>
        <var-decl name='__data' type-id='c987b47c' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__size' type-id='36d7f119' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__align' type-id='1eb56b1e' visibility='default'/>
      </data-member>
    </union-decl>
    <typedef-decl name='pthread_cond_t' type-id='cbb12c12' id='62fab762'/>
    <typedef-decl name='__jmp_buf' type-id='5d4efd44' id='379a1ab7'/>
    <class-decl name='__pthread_cond_s' size-in-bits='384' is-struct='yes' visibility='default' id='c987b47c'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__wseq' type-id='f3b40860' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__g1_start' type-id='f3b40860' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='__g_refs' type-id='0d532ec1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='__g_size' type-id='0d532ec1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='__g1_orig_size' type-id='f0981eeb' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='__wrefs' type-id='f0981eeb' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='__g_signals' type-id='0d532ec1' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__sigset_t' size-in-bits='1024' is-struct='yes' naming-typedef-id='b9c97942' visibility='default' id='2616147f'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__val' type-id='d2baa450' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__sigset_t' type-id='2616147f' id='b9c97942'/>
    <class-decl name='sched_param' size-in-bits='32' is-struct='yes' visibility='default' id='0897719a'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sched_priority' type-id='95e97e5e' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='8901473c' size-in-bits='64' id='eb91b7ea'/>
    <pointer-type-def type-id='4423cf7f' size-in-bits='64' id='ba7c727c'/>
    <pointer-type-def type-id='b9c97942' size-in-bits='64' id='bbf06c47'/>
    <qualified-type-def type-id='bbf06c47' restrict='yes' id='65e6ec45'/>
    <qualified-type-def type-id='b9c97942' const='yes' id='191f6b72'/>
    <pointer-type-def type-id='191f6b72' size-in-bits='64' id='e475fb88'/>
    <qualified-type-def type-id='e475fb88' restrict='yes' id='5a8729d0'/>
    <qualified-type-def type-id='8037c762' const='yes' id='f50ea9b2'/>
    <pointer-type-def type-id='f50ea9b2' size-in-bits='64' id='5e14fa48'/>
    <qualified-type-def type-id='7d8569fd' const='yes' id='e06dee2d'/>
    <pointer-type-def type-id='e06dee2d' size-in-bits='64' id='540db505'/>
    <qualified-type-def type-id='540db505' restrict='yes' id='e1815e87'/>
    <qualified-type-def type-id='836265dd' const='yes' id='7d24c58d'/>
    <pointer-type-def type-id='7d24c58d' size-in-bits='64' id='a7e325e5'/>
    <qualified-type-def type-id='a7e325e5' restrict='yes' id='4c428e67'/>
    <qualified-type-def type-id='0897719a' const='yes' id='c4a7b189'/>
    <pointer-type-def type-id='c4a7b189' size-in-bits='64' id='36fca399'/>
    <qualified-type-def type-id='36fca399' restrict='yes' id='37e4897b'/>
    <qualified-type-def type-id='e05e8614' restrict='yes' id='0be2e71c'/>
    <pointer-type-def type-id='8037c762' size-in-bits='64' id='d74a6869'/>
    <qualified-type-def type-id='7292109c' restrict='yes' id='6942f6a4'/>
    <qualified-type-def type-id='7347a39e' restrict='yes' id='578ba182'/>
    <pointer-type-def type-id='62fab762' size-in-bits='64' id='db285b03'/>
    <qualified-type-def type-id='db285b03' restrict='yes' id='2a468b41'/>
    <qualified-type-def type-id='18c91f9e' restrict='yes' id='6e745582'/>
    <pointer-type-def type-id='4051f5e7' size-in-bits='64' id='e01b5462'/>
    <qualified-type-def type-id='e01b5462' restrict='yes' id='cc338b26'/>
    <pointer-type-def type-id='0897719a' size-in-bits='64' id='23cbcb08'/>
    <qualified-type-def type-id='23cbcb08' restrict='yes' id='b09b2050'/>
    <qualified-type-def type-id='78c01427' restrict='yes' id='d19b2c25'/>
    <pointer-type-def type-id='6fcda10e' size-in-bits='64' id='ad33e5e7'/>
    <pointer-type-def type-id='66a0afc9' size-in-bits='64' id='f32b30e4'/>
    <pointer-type-def type-id='cd5d79f4' size-in-bits='64' id='5ad9edb6'/>
    <qualified-type-def type-id='eaa32e2f' restrict='yes' id='1b7446cd'/>
    <qualified-type-def type-id='63e171df' restrict='yes' id='9e7a3a7d'/>
    <function-decl name='tpool_abandon' mangled-name='tpool_abandon' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='tpool_abandon'>
      <parameter type-id='9cf59a50' name='tpool'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='tpool_suspend' mangled-name='tpool_suspend' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='tpool_suspend'>
      <parameter type-id='9cf59a50' name='tpool'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='tpool_suspended' mangled-name='tpool_suspended' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='tpool_suspended'>
      <parameter type-id='9cf59a50' name='tpool'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='tpool_resume' mangled-name='tpool_resume' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='tpool_resume'>
      <parameter type-id='9cf59a50' name='tpool'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='tpool_member' mangled-name='tpool_member' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='tpool_member'>
      <parameter type-id='9cf59a50' name='tpool'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='pthread_create' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='cc338b26'/>
      <parameter type-id='e1815e87'/>
      <parameter type-id='5ad9edb6'/>
      <parameter type-id='1b7446cd'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='pthread_self' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='4051f5e7'/>
    </function-decl>
    <function-decl name='pthread_attr_init' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='7347a39e'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='pthread_attr_destroy' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='7347a39e'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='pthread_attr_getdetachstate' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='540db505'/>
      <parameter type-id='7292109c'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='pthread_attr_setdetachstate' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='7347a39e'/>
      <parameter type-id='95e97e5e'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='pthread_attr_getguardsize' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='540db505'/>
      <parameter type-id='78c01427'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='pthread_attr_setguardsize' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='7347a39e'/>
      <parameter type-id='b59d7dce'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='pthread_attr_getschedparam' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='e1815e87'/>
      <parameter type-id='b09b2050'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='pthread_attr_setschedparam' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='578ba182'/>
      <parameter type-id='37e4897b'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='pthread_attr_getschedpolicy' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='e1815e87'/>
      <parameter type-id='6942f6a4'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='pthread_attr_setschedpolicy' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='7347a39e'/>
      <parameter type-id='95e97e5e'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='pthread_attr_getinheritsched' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='e1815e87'/>
      <parameter type-id='6942f6a4'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='pthread_attr_setinheritsched' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='7347a39e'/>
      <parameter type-id='95e97e5e'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='pthread_attr_getscope' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='e1815e87'/>
      <parameter type-id='6942f6a4'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='pthread_attr_setscope' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='7347a39e'/>
      <parameter type-id='95e97e5e'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='pthread_attr_getstack' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='e1815e87'/>
      <parameter type-id='9e7a3a7d'/>
      <parameter type-id='d19b2c25'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='pthread_attr_setstack' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='7347a39e'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='b59d7dce'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='pthread_attr_setaffinity_np' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='7347a39e'/>
      <parameter type-id='b59d7dce'/>
      <parameter type-id='5e14fa48'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='pthread_attr_getaffinity_np' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='540db505'/>
      <parameter type-id='b59d7dce'/>
      <parameter type-id='d74a6869'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='pthread_setcancelstate' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='95e97e5e'/>
      <parameter type-id='7292109c'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='pthread_setcanceltype' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='95e97e5e'/>
      <parameter type-id='7292109c'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='pthread_cancel' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='4051f5e7'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='__pthread_register_cancel' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='ba7c727c'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='__pthread_unregister_cancel' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='ba7c727c'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='__pthread_unwind_next' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='ba7c727c'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='pthread_cond_init' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='2a468b41'/>
      <parameter type-id='4c428e67'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='pthread_cond_signal' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='db285b03'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='pthread_cond_broadcast' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='db285b03'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='pthread_cond_wait' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='2a468b41'/>
      <parameter type-id='6e745582'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='pthread_cond_timedwait' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='2a468b41'/>
      <parameter type-id='6e745582'/>
      <parameter type-id='0be2e71c'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='__sysconf' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='95e97e5e'/>
      <return type-id='bd54fe1a'/>
    </function-decl>
    <function-decl name='pthread_sigmask' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='95e97e5e'/>
      <parameter type-id='5a8729d0'/>
      <parameter type-id='65e6ec45'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-type size-in-bits='64' id='cd5d79f4'>
      <parameter type-id='eaa32e2f'/>
      <return type-id='eaa32e2f'/>
    </function-type>
    <pointer-type-def type-id='b1bbf10d' size-in-bits='64' id='9cf59a50'/>
    <typedef-decl name='tpool_t' type-id='88d1b7f9' id='b1bbf10d'/>
    <class-decl name='tpool' size-in-bits='2496' is-struct='yes' visibility='default' id='88d1b7f9'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tp_forw' type-id='9cf59a50' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tp_back' type-id='9cf59a50' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='tp_mutex' type-id='7a6844eb' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='tp_busycv' type-id='62fab762' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='tp_workcv' type-id='62fab762' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='tp_waitcv' type-id='62fab762' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='tp_active' type-id='ad33e5e7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='tp_head' type-id='f32b30e4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='tp_tail' type-id='f32b30e4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='tp_attr' type-id='7d8569fd' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <var-decl name='tp_flags' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2272'>
        <var-decl name='tp_linger' type-id='3502e3ff' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2304'>
        <var-decl name='tp_njobs' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2336'>
        <var-decl name='tp_minimum' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2368'>
        <var-decl name='tp_maximum' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2400'>
        <var-decl name='tp_current' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2432'>
        <var-decl name='tp_idle' type-id='95e97e5e' visibility='default'/>
      </data-member>
    </class-decl>
    <function-type size-in-bits='64' id='c5c76c9c'>
      <parameter type-id='eaa32e2f'/>
      <return type-id='48b5725f'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='libzfs_core.c' language='LANG_C99'>
    <type-decl name='char' size-in-bits='8' id='a84c031d'/>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='2048' id='d1617432'>
      <subrange length='256' type-id='7359adad' id='36e5b9fa'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='32768' id='d16c6df4'>
      <subrange length='4096' type-id='7359adad' id='bc1b5ddc'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='320' id='36c46961'>
      <subrange length='40' type-id='7359adad' id='8f80b239'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='65536' id='163f6aa5'>
      <subrange length='8192' type-id='7359adad' id='c88f397d'/>
    </array-type-def>
    <type-decl name='int' size-in-bits='32' id='95e97e5e'/>
    <type-decl name='long int' size-in-bits='64' id='bd54fe1a'/>
    <type-decl name='short int' size-in-bits='16' id='a2185560'/>
    <array-type-def dimensions='1' type-id='9c313c2d' size-in-bits='128' id='c1c22e6c'>
      <subrange length='2' type-id='7359adad' id='52efc4ef'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='9c313c2d' size-in-bits='2176' id='8c2bcad1'>
      <subrange length='34' type-id='7359adad' id='6a6a7e00'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='9c313c2d' size-in-bits='256' id='85c64d26'>
      <subrange length='4' type-id='7359adad' id='16fe7105'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='96' id='fa8ef949'>
      <subrange length='12' type-id='7359adad' id='84827bdc'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='128' id='fa9986a5'>
      <subrange length='16' type-id='7359adad' id='848d0938'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='24' id='d3490169'>
      <subrange length='3' type-id='7359adad' id='56f209d2'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='40' id='0f4ddd0b'>
      <subrange length='5' type-id='7359adad' id='53010e10'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='48' id='0f562bd0'>
      <subrange length='6' type-id='7359adad' id='52fa524b'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='64' id='13339fda'>
      <subrange length='8' type-id='7359adad' id='56e0c0b1'/>
    </array-type-def>
    <type-decl name='unnamed-enum-underlying-type-32' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='9cac1fee'/>
    <type-decl name='unsigned char' size-in-bits='8' id='002ac4a6'/>
    <type-decl name='unsigned int' size-in-bits='32' id='f0981eeb'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='7359adad'/>
    <type-decl name='variadic parameter type' id='2c1145c5'/>
    <type-decl name='void' id='48b5725f'/>
    <enum-decl name='lzc_dataset_type' id='bc9887f1'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='LZC_DATSET_TYPE_ZFS' value='2'/>
      <enumerator name='LZC_DATSET_TYPE_ZVOL' value='3'/>
    </enum-decl>
    <enum-decl name='lzc_send_flags' id='bfbd3c8e'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='LZC_SEND_FLAG_EMBED_DATA' value='1'/>
      <enumerator name='LZC_SEND_FLAG_LARGE_BLOCK' value='2'/>
      <enumerator name='LZC_SEND_FLAG_COMPRESS' value='4'/>
      <enumerator name='LZC_SEND_FLAG_RAW' value='8'/>
      <enumerator name='LZC_SEND_FLAG_SAVED' value='16'/>
    </enum-decl>
    <class-decl name='ddt_key' size-in-bits='320' is-struct='yes' visibility='default' id='e0a4a1cb'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ddk_cksum' type-id='39730d0b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='ddk_prop' type-id='9c313c2d' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='ddt_key_t' type-id='e0a4a1cb' id='67f6d2cf'/>
    <enum-decl name='dmu_object_type' id='04b3b0b9'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='DMU_OT_NONE' value='0'/>
      <enumerator name='DMU_OT_OBJECT_DIRECTORY' value='1'/>
      <enumerator name='DMU_OT_OBJECT_ARRAY' value='2'/>
      <enumerator name='DMU_OT_PACKED_NVLIST' value='3'/>
      <enumerator name='DMU_OT_PACKED_NVLIST_SIZE' value='4'/>
      <enumerator name='DMU_OT_BPOBJ' value='5'/>
      <enumerator name='DMU_OT_BPOBJ_HDR' value='6'/>
      <enumerator name='DMU_OT_SPACE_MAP_HEADER' value='7'/>
      <enumerator name='DMU_OT_SPACE_MAP' value='8'/>
      <enumerator name='DMU_OT_INTENT_LOG' value='9'/>
      <enumerator name='DMU_OT_DNODE' value='10'/>
      <enumerator name='DMU_OT_OBJSET' value='11'/>
      <enumerator name='DMU_OT_DSL_DIR' value='12'/>
      <enumerator name='DMU_OT_DSL_DIR_CHILD_MAP' value='13'/>
      <enumerator name='DMU_OT_DSL_DS_SNAP_MAP' value='14'/>
      <enumerator name='DMU_OT_DSL_PROPS' value='15'/>
      <enumerator name='DMU_OT_DSL_DATASET' value='16'/>
      <enumerator name='DMU_OT_ZNODE' value='17'/>
      <enumerator name='DMU_OT_OLDACL' value='18'/>
      <enumerator name='DMU_OT_PLAIN_FILE_CONTENTS' value='19'/>
      <enumerator name='DMU_OT_DIRECTORY_CONTENTS' value='20'/>
      <enumerator name='DMU_OT_MASTER_NODE' value='21'/>
      <enumerator name='DMU_OT_UNLINKED_SET' value='22'/>
      <enumerator name='DMU_OT_ZVOL' value='23'/>
      <enumerator name='DMU_OT_ZVOL_PROP' value='24'/>
      <enumerator name='DMU_OT_PLAIN_OTHER' value='25'/>
      <enumerator name='DMU_OT_UINT64_OTHER' value='26'/>
      <enumerator name='DMU_OT_ZAP_OTHER' value='27'/>
      <enumerator name='DMU_OT_ERROR_LOG' value='28'/>
      <enumerator name='DMU_OT_SPA_HISTORY' value='29'/>
      <enumerator name='DMU_OT_SPA_HISTORY_OFFSETS' value='30'/>
      <enumerator name='DMU_OT_POOL_PROPS' value='31'/>
      <enumerator name='DMU_OT_DSL_PERMS' value='32'/>
      <enumerator name='DMU_OT_ACL' value='33'/>
      <enumerator name='DMU_OT_SYSACL' value='34'/>
      <enumerator name='DMU_OT_FUID' value='35'/>
      <enumerator name='DMU_OT_FUID_SIZE' value='36'/>
      <enumerator name='DMU_OT_NEXT_CLONES' value='37'/>
      <enumerator name='DMU_OT_SCAN_QUEUE' value='38'/>
      <enumerator name='DMU_OT_USERGROUP_USED' value='39'/>
      <enumerator name='DMU_OT_USERGROUP_QUOTA' value='40'/>
      <enumerator name='DMU_OT_USERREFS' value='41'/>
      <enumerator name='DMU_OT_DDT_ZAP' value='42'/>
      <enumerator name='DMU_OT_DDT_STATS' value='43'/>
      <enumerator name='DMU_OT_SA' value='44'/>
      <enumerator name='DMU_OT_SA_MASTER_NODE' value='45'/>
      <enumerator name='DMU_OT_SA_ATTR_REGISTRATION' value='46'/>
      <enumerator name='DMU_OT_SA_ATTR_LAYOUTS' value='47'/>
      <enumerator name='DMU_OT_SCAN_XLATE' value='48'/>
      <enumerator name='DMU_OT_DEDUP' value='49'/>
      <enumerator name='DMU_OT_DEADLIST' value='50'/>
      <enumerator name='DMU_OT_DEADLIST_HDR' value='51'/>
      <enumerator name='DMU_OT_DSL_CLONES' value='52'/>
      <enumerator name='DMU_OT_BPOBJ_SUBOBJ' value='53'/>
      <enumerator name='DMU_OT_NUMTYPES' value='54'/>
      <enumerator name='DMU_OTN_UINT8_DATA' value='128'/>
      <enumerator name='DMU_OTN_UINT8_METADATA' value='192'/>
      <enumerator name='DMU_OTN_UINT16_DATA' value='129'/>
      <enumerator name='DMU_OTN_UINT16_METADATA' value='193'/>
      <enumerator name='DMU_OTN_UINT32_DATA' value='130'/>
      <enumerator name='DMU_OTN_UINT32_METADATA' value='194'/>
      <enumerator name='DMU_OTN_UINT64_DATA' value='131'/>
      <enumerator name='DMU_OTN_UINT64_METADATA' value='195'/>
      <enumerator name='DMU_OTN_ZAP_DATA' value='132'/>
      <enumerator name='DMU_OTN_ZAP_METADATA' value='196'/>
      <enumerator name='DMU_OTN_UINT8_ENC_DATA' value='160'/>
      <enumerator name='DMU_OTN_UINT8_ENC_METADATA' value='224'/>
      <enumerator name='DMU_OTN_UINT16_ENC_DATA' value='161'/>
      <enumerator name='DMU_OTN_UINT16_ENC_METADATA' value='225'/>
      <enumerator name='DMU_OTN_UINT32_ENC_DATA' value='162'/>
      <enumerator name='DMU_OTN_UINT32_ENC_METADATA' value='226'/>
      <enumerator name='DMU_OTN_UINT64_ENC_DATA' value='163'/>
      <enumerator name='DMU_OTN_UINT64_ENC_METADATA' value='227'/>
      <enumerator name='DMU_OTN_ZAP_ENC_DATA' value='164'/>
      <enumerator name='DMU_OTN_ZAP_ENC_METADATA' value='228'/>
    </enum-decl>
    <typedef-decl name='dmu_object_type_t' type-id='04b3b0b9' id='5c9d8906'/>
    <class-decl name='dmu_objset_stats' size-in-bits='2304' is-struct='yes' visibility='default' id='098f0221'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='dds_num_clones' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='dds_creation_txg' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='dds_guid' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='dds_type' type-id='230f1e16' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='dds_is_snapshot' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='232'>
        <var-decl name='dds_inconsistent' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='240'>
        <var-decl name='dds_redacted' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='248'>
        <var-decl name='dds_origin' type-id='d1617432' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='dmu_objset_stats_t' type-id='098f0221' id='b2c14f17'/>
    <enum-decl name='dmu_objset_type' id='6b1b19f9'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='DMU_OST_NONE' value='0'/>
      <enumerator name='DMU_OST_META' value='1'/>
      <enumerator name='DMU_OST_ZFS' value='2'/>
      <enumerator name='DMU_OST_ZVOL' value='3'/>
      <enumerator name='DMU_OST_OTHER' value='4'/>
      <enumerator name='DMU_OST_ANY' value='5'/>
      <enumerator name='DMU_OST_NUMTYPES' value='6'/>
    </enum-decl>
    <typedef-decl name='dmu_objset_type_t' type-id='6b1b19f9' id='230f1e16'/>
    <enum-decl name='pool_initialize_func' id='5c246ad4'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='POOL_INITIALIZE_START' value='0'/>
      <enumerator name='POOL_INITIALIZE_CANCEL' value='1'/>
      <enumerator name='POOL_INITIALIZE_SUSPEND' value='2'/>
      <enumerator name='POOL_INITIALIZE_UNINIT' value='3'/>
      <enumerator name='POOL_INITIALIZE_FUNCS' value='4'/>
    </enum-decl>
    <typedef-decl name='pool_initialize_func_t' type-id='5c246ad4' id='7063e1ab'/>
    <enum-decl name='pool_trim_func' id='54ed608a'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='POOL_TRIM_START' value='0'/>
      <enumerator name='POOL_TRIM_CANCEL' value='1'/>
      <enumerator name='POOL_TRIM_SUSPEND' value='2'/>
      <enumerator name='POOL_TRIM_FUNCS' value='3'/>
    </enum-decl>
    <typedef-decl name='pool_trim_func_t' type-id='54ed608a' id='b1146b8d'/>
    <enum-decl name='zpool_wait_activity_t' naming-typedef-id='73446457' id='849338e3'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='ZPOOL_WAIT_CKPT_DISCARD' value='0'/>
      <enumerator name='ZPOOL_WAIT_FREE' value='1'/>
      <enumerator name='ZPOOL_WAIT_INITIALIZE' value='2'/>
      <enumerator name='ZPOOL_WAIT_REPLACE' value='3'/>
      <enumerator name='ZPOOL_WAIT_REMOVE' value='4'/>
      <enumerator name='ZPOOL_WAIT_RESILVER' value='5'/>
      <enumerator name='ZPOOL_WAIT_SCRUB' value='6'/>
      <enumerator name='ZPOOL_WAIT_TRIM' value='7'/>
      <enumerator name='ZPOOL_WAIT_NUM_ACTIVITIES' value='8'/>
    </enum-decl>
    <typedef-decl name='zpool_wait_activity_t' type-id='849338e3' id='73446457'/>
    <enum-decl name='zfs_wait_activity_t' naming-typedef-id='3024501a' id='527d5dc6'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='ZFS_WAIT_DELETEQ' value='0'/>
      <enumerator name='ZFS_WAIT_NUM_ACTIVITIES' value='1'/>
    </enum-decl>
    <typedef-decl name='zfs_wait_activity_t' type-id='527d5dc6' id='3024501a'/>
    <enum-decl name='data_type_t' naming-typedef-id='8d0687d2' id='aeeae136'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='DATA_TYPE_DONTCARE' value='-1'/>
      <enumerator name='DATA_TYPE_UNKNOWN' value='0'/>
      <enumerator name='DATA_TYPE_BOOLEAN' value='1'/>
      <enumerator name='DATA_TYPE_BYTE' value='2'/>
      <enumerator name='DATA_TYPE_INT16' value='3'/>
      <enumerator name='DATA_TYPE_UINT16' value='4'/>
      <enumerator name='DATA_TYPE_INT32' value='5'/>
      <enumerator name='DATA_TYPE_UINT32' value='6'/>
      <enumerator name='DATA_TYPE_INT64' value='7'/>
      <enumerator name='DATA_TYPE_UINT64' value='8'/>
      <enumerator name='DATA_TYPE_STRING' value='9'/>
      <enumerator name='DATA_TYPE_BYTE_ARRAY' value='10'/>
      <enumerator name='DATA_TYPE_INT16_ARRAY' value='11'/>
      <enumerator name='DATA_TYPE_UINT16_ARRAY' value='12'/>
      <enumerator name='DATA_TYPE_INT32_ARRAY' value='13'/>
      <enumerator name='DATA_TYPE_UINT32_ARRAY' value='14'/>
      <enumerator name='DATA_TYPE_INT64_ARRAY' value='15'/>
      <enumerator name='DATA_TYPE_UINT64_ARRAY' value='16'/>
      <enumerator name='DATA_TYPE_STRING_ARRAY' value='17'/>
      <enumerator name='DATA_TYPE_HRTIME' value='18'/>
      <enumerator name='DATA_TYPE_NVLIST' value='19'/>
      <enumerator name='DATA_TYPE_NVLIST_ARRAY' value='20'/>
      <enumerator name='DATA_TYPE_BOOLEAN_VALUE' value='21'/>
      <enumerator name='DATA_TYPE_INT8' value='22'/>
      <enumerator name='DATA_TYPE_UINT8' value='23'/>
      <enumerator name='DATA_TYPE_BOOLEAN_ARRAY' value='24'/>
      <enumerator name='DATA_TYPE_INT8_ARRAY' value='25'/>
      <enumerator name='DATA_TYPE_UINT8_ARRAY' value='26'/>
      <enumerator name='DATA_TYPE_DOUBLE' value='27'/>
    </enum-decl>
    <typedef-decl name='data_type_t' type-id='aeeae136' id='8d0687d2'/>
    <class-decl name='nvpair' size-in-bits='128' is-struct='yes' visibility='default' id='1c34e459'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nvp_size' type-id='3ff5601b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='nvp_name_sz' type-id='23bd8cb5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='nvp_reserve' type-id='23bd8cb5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='nvp_value_elem' type-id='3ff5601b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='nvp_type' type-id='8d0687d2' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='nvpair_t' type-id='1c34e459' id='57928edf'/>
    <class-decl name='nvlist' size-in-bits='192' is-struct='yes' visibility='default' id='ac266fd9'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nvl_version' type-id='3ff5601b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='nvl_nvflag' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='nvl_priv' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='nvl_flag' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='nvl_pad' type-id='3ff5601b' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='nvlist_t' type-id='ac266fd9' id='8e8d4be3'/>
    <class-decl name='zio_cksum' size-in-bits='256' is-struct='yes' visibility='default' id='1d53e28b'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='zc_word' type-id='85c64d26' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='zio_cksum_t' type-id='1d53e28b' id='39730d0b'/>
    <class-decl name='drr_begin' size-in-bits='2432' is-struct='yes' visibility='default' id='09fcdc01'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='drr_magic' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='drr_versioninfo' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='drr_creation_time' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='drr_type' type-id='230f1e16' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='drr_flags' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='drr_toguid' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='drr_fromguid' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='drr_toname' type-id='d1617432' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='dmu_replay_record' size-in-bits='2496' is-struct='yes' visibility='default' id='781a52d7'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='drr_type' type-id='08f5ca17' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='drr_payloadlen' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='drr_u' type-id='ac5ab595' visibility='default'/>
      </data-member>
    </class-decl>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' id='08f5ca17'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='DRR_BEGIN' value='0'/>
      <enumerator name='DRR_OBJECT' value='1'/>
      <enumerator name='DRR_FREEOBJECTS' value='2'/>
      <enumerator name='DRR_WRITE' value='3'/>
      <enumerator name='DRR_FREE' value='4'/>
      <enumerator name='DRR_END' value='5'/>
      <enumerator name='DRR_WRITE_BYREF' value='6'/>
      <enumerator name='DRR_SPILL' value='7'/>
      <enumerator name='DRR_WRITE_EMBEDDED' value='8'/>
      <enumerator name='DRR_OBJECT_RANGE' value='9'/>
      <enumerator name='DRR_REDACT' value='10'/>
      <enumerator name='DRR_NUMTYPES' value='11'/>
    </enum-decl>
    <union-decl name='__anonymous_union__' size-in-bits='2432' is-anonymous='yes' visibility='default' id='ac5ab595'>
      <data-member access='public'>
        <var-decl name='drr_begin' type-id='09fcdc01' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='drr_end' type-id='6ee25631' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='drr_object' type-id='f9ad530b' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='drr_freeobjects' type-id='a27d958e' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='drr_write' type-id='4cc69e4b' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='drr_free' type-id='c836cfd2' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='drr_write_byref' type-id='e511cdce' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='drr_spill' type-id='1e69a80a' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='drr_write_embedded' type-id='98b1345e' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='drr_object_range' type-id='aba1f9e1' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='drr_redact' type-id='50389039' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='drr_checksum' type-id='a5fe3647' visibility='default'/>
      </data-member>
    </union-decl>
    <class-decl name='drr_end' size-in-bits='320' is-struct='yes' visibility='default' id='6ee25631'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='drr_checksum' type-id='39730d0b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='drr_toguid' type-id='9c313c2d' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='drr_object' size-in-bits='448' is-struct='yes' visibility='default' id='f9ad530b'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='drr_object' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='drr_type' type-id='5c9d8906' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='drr_bonustype' type-id='5c9d8906' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='drr_blksz' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='drr_bonuslen' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='drr_checksumtype' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='200'>
        <var-decl name='drr_compress' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='208'>
        <var-decl name='drr_dn_slots' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='216'>
        <var-decl name='drr_flags' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='drr_raw_bonuslen' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='drr_toguid' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='drr_indblkshift' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='328'>
        <var-decl name='drr_nlevels' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='336'>
        <var-decl name='drr_nblkptr' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='344'>
        <var-decl name='drr_pad' type-id='0f4ddd0b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='drr_maxblkid' type-id='9c313c2d' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='drr_freeobjects' size-in-bits='192' is-struct='yes' visibility='default' id='a27d958e'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='drr_firstobj' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='drr_numobjs' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='drr_toguid' type-id='9c313c2d' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='drr_write' size-in-bits='1088' is-struct='yes' visibility='default' id='4cc69e4b'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='drr_object' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='drr_type' type-id='5c9d8906' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='drr_pad' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='drr_offset' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='drr_logical_size' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='drr_toguid' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='drr_checksumtype' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='328'>
        <var-decl name='drr_flags' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='336'>
        <var-decl name='drr_compressiontype' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='344'>
        <var-decl name='drr_pad2' type-id='0f4ddd0b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='drr_key' type-id='67f6d2cf' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='drr_compressed_size' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='drr_salt' type-id='13339fda' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='drr_iv' type-id='fa8ef949' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='drr_mac' type-id='fa9986a5' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='drr_free' size-in-bits='256' is-struct='yes' visibility='default' id='c836cfd2'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='drr_object' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='drr_offset' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='drr_length' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='drr_toguid' type-id='9c313c2d' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='drr_write_byref' size-in-bits='832' is-struct='yes' visibility='default' id='e511cdce'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='drr_object' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='drr_offset' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='drr_length' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='drr_toguid' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='drr_refguid' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='drr_refobject' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='drr_refoffset' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='drr_checksumtype' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='456'>
        <var-decl name='drr_flags' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='464'>
        <var-decl name='drr_pad2' type-id='0f562bd0' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='drr_key' type-id='67f6d2cf' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='drr_spill' size-in-bits='640' is-struct='yes' visibility='default' id='1e69a80a'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='drr_object' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='drr_length' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='drr_toguid' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='drr_flags' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='200'>
        <var-decl name='drr_compressiontype' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='208'>
        <var-decl name='drr_pad' type-id='0f562bd0' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='drr_compressed_size' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='drr_salt' type-id='13339fda' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='drr_iv' type-id='fa8ef949' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='drr_mac' type-id='fa9986a5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='608'>
        <var-decl name='drr_type' type-id='5c9d8906' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='drr_write_embedded' size-in-bits='384' is-struct='yes' visibility='default' id='98b1345e'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='drr_object' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='drr_offset' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='drr_length' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='drr_toguid' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='drr_compression' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='264'>
        <var-decl name='drr_etype' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='272'>
        <var-decl name='drr_pad' type-id='0f562bd0' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='drr_lsize' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='drr_psize' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='drr_object_range' size-in-bits='512' is-struct='yes' visibility='default' id='aba1f9e1'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='drr_firstobj' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='drr_numslots' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='drr_toguid' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='drr_salt' type-id='13339fda' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='drr_iv' type-id='fa8ef949' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='drr_mac' type-id='fa9986a5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='drr_flags' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='488'>
        <var-decl name='drr_pad' type-id='d3490169' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='drr_redact' size-in-bits='256' is-struct='yes' visibility='default' id='50389039'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='drr_object' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='drr_offset' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='drr_length' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='drr_toguid' type-id='9c313c2d' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='drr_checksum' size-in-bits='2432' is-struct='yes' visibility='default' id='a5fe3647'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='drr_pad' type-id='8c2bcad1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='drr_checksum' type-id='39730d0b' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='dmu_replay_record_t' type-id='781a52d7' id='8b8fc893'/>
    <class-decl name='zinject_record' size-in-bits='2816' is-struct='yes' visibility='default' id='3216f820'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='zi_objset' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='zi_object' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='zi_start' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='zi_end' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='zi_guid' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='zi_level' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='zi_error' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='zi_type' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='zi_freq' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='zi_failfast' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='zi_func' type-id='d1617432' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2560'>
        <var-decl name='zi_iotype' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2592'>
        <var-decl name='zi_duration' type-id='3ff5601b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2624'>
        <var-decl name='zi_timer' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2688'>
        <var-decl name='zi_nlanes' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2752'>
        <var-decl name='zi_cmd' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2784'>
        <var-decl name='zi_dvas' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='zinject_record_t' type-id='3216f820' id='a4301ca6'/>
    <class-decl name='zfs_share' size-in-bits='256' is-struct='yes' visibility='default' id='feb6f2da'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='z_exportdata' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='z_sharedata' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='z_sharetype' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='z_sharemax' type-id='9c313c2d' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='zfs_share_t' type-id='feb6f2da' id='ee5cec36'/>
    <class-decl name='zfs_cmd' size-in-bits='109952' is-struct='yes' visibility='default' id='3522cd69'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='zc_name' type-id='d16c6df4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32768'>
        <var-decl name='zc_nvlist_src' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32832'>
        <var-decl name='zc_nvlist_src_size' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32896'>
        <var-decl name='zc_nvlist_dst' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32960'>
        <var-decl name='zc_nvlist_dst_size' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='33024'>
        <var-decl name='zc_nvlist_dst_filled' type-id='c19b74c3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='33056'>
        <var-decl name='zc_pad2' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='33088'>
        <var-decl name='zc_history' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='33152'>
        <var-decl name='zc_value' type-id='163f6aa5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='98688'>
        <var-decl name='zc_string' type-id='d1617432' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='100736'>
        <var-decl name='zc_guid' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='100800'>
        <var-decl name='zc_nvlist_conf' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='100864'>
        <var-decl name='zc_nvlist_conf_size' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='100928'>
        <var-decl name='zc_cookie' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='100992'>
        <var-decl name='zc_objset_type' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='101056'>
        <var-decl name='zc_perm_action' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='101120'>
        <var-decl name='zc_history_len' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='101184'>
        <var-decl name='zc_history_offset' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='101248'>
        <var-decl name='zc_obj' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='101312'>
        <var-decl name='zc_iflags' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='101376'>
        <var-decl name='zc_share' type-id='ee5cec36' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='101632'>
        <var-decl name='zc_objset_stats' type-id='b2c14f17' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='103936'>
        <var-decl name='zc_begin_record' type-id='09fcdc01' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='106368'>
        <var-decl name='zc_inject_record' type-id='a4301ca6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109184'>
        <var-decl name='zc_defer_destroy' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109216'>
        <var-decl name='zc_flags' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109248'>
        <var-decl name='zc_action_handle' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109312'>
        <var-decl name='zc_cleanup_fd' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109344'>
        <var-decl name='zc_simple' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109352'>
        <var-decl name='zc_pad' type-id='d3490169' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109376'>
        <var-decl name='zc_sendobj' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109440'>
        <var-decl name='zc_fromobj' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109504'>
        <var-decl name='zc_createtxg' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109568'>
        <var-decl name='zc_stat' type-id='0371a9c7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109888'>
        <var-decl name='zc_zoneid' type-id='9c313c2d' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='zfs_stat' size-in-bits='320' is-struct='yes' visibility='default' id='6417f0b9'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='zs_gen' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='zs_mode' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='zs_links' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='zs_ctime' type-id='c1c22e6c' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='zfs_stat_t' type-id='6417f0b9' id='0371a9c7'/>
    <enum-decl name='boolean_t' naming-typedef-id='c19b74c3' id='f58c8277'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='B_FALSE' value='0'/>
      <enumerator name='B_TRUE' value='1'/>
    </enum-decl>
    <typedef-decl name='boolean_t' type-id='f58c8277' id='c19b74c3'/>
    <typedef-decl name='uchar_t' type-id='002ac4a6' id='d8bf0010'/>
    <typedef-decl name='uint_t' type-id='f0981eeb' id='3502e3ff'/>
    <union-decl name='pthread_mutex_t' size-in-bits='320' naming-typedef-id='7a6844eb' visibility='default' id='70681f9b'>
      <data-member access='public'>
        <var-decl name='__data' type-id='4c734837' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__size' type-id='36c46961' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__align' type-id='bd54fe1a' visibility='default'/>
      </data-member>
    </union-decl>
    <typedef-decl name='pthread_mutex_t' type-id='70681f9b' id='7a6844eb'/>
    <typedef-decl name='int16_t' type-id='03896e23' id='23bd8cb5'/>
    <typedef-decl name='int32_t' type-id='33f57a65' id='3ff5601b'/>
    <typedef-decl name='uint8_t' type-id='c51d6389' id='b96825af'/>
    <typedef-decl name='uint32_t' type-id='62f1140c' id='8f92235e'/>
    <typedef-decl name='uint64_t' type-id='8910171f' id='9c313c2d'/>
    <class-decl name='__pthread_mutex_s' size-in-bits='320' is-struct='yes' visibility='default' id='4c734837'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__lock' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='__count' type-id='f0981eeb' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__owner' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='__nusers' type-id='f0981eeb' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='__kind' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='__spins' type-id='a2185560' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='176'>
        <var-decl name='__elision' type-id='a2185560' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='__list' type-id='518fb49c' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__pthread_internal_list' size-in-bits='128' is-struct='yes' visibility='default' id='0e01899c'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__prev' type-id='4d98cd5a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__next' type-id='4d98cd5a' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__pthread_list_t' type-id='0e01899c' id='518fb49c'/>
    <typedef-decl name='__uint8_t' type-id='002ac4a6' id='c51d6389'/>
    <typedef-decl name='__int16_t' type-id='a2185560' id='03896e23'/>
    <typedef-decl name='__int32_t' type-id='95e97e5e' id='33f57a65'/>
    <typedef-decl name='__uint32_t' type-id='f0981eeb' id='62f1140c'/>
    <typedef-decl name='__uint64_t' type-id='7359adad' id='8910171f'/>
    <typedef-decl name='__ssize_t' type-id='bd54fe1a' id='41060289'/>
    <typedef-decl name='ssize_t' type-id='41060289' id='79a0948f'/>
    <typedef-decl name='size_t' type-id='7359adad' id='b59d7dce'/>
    <pointer-type-def type-id='0e01899c' size-in-bits='64' id='4d98cd5a'/>
    <pointer-type-def type-id='c19b74c3' size-in-bits='64' id='37e3bd22'/>
    <pointer-type-def type-id='a84c031d' size-in-bits='64' id='26a90f95'/>
    <qualified-type-def type-id='a84c031d' const='yes' id='9b45d938'/>
    <pointer-type-def type-id='9b45d938' size-in-bits='64' id='80f4b756'/>
    <qualified-type-def type-id='8b8fc893' const='yes' id='9623bc03'/>
    <pointer-type-def type-id='9623bc03' size-in-bits='64' id='8341348b'/>
    <qualified-type-def type-id='8e8d4be3' const='yes' id='693c3853'/>
    <pointer-type-def type-id='693c3853' size-in-bits='64' id='22cce67b'/>
    <pointer-type-def type-id='95e97e5e' size-in-bits='64' id='7292109c'/>
    <pointer-type-def type-id='8e8d4be3' size-in-bits='64' id='5ce45b60'/>
    <pointer-type-def type-id='5ce45b60' size-in-bits='64' id='857bb57e'/>
    <pointer-type-def type-id='57928edf' size-in-bits='64' id='3fa542f0'/>
    <pointer-type-def type-id='7a6844eb' size-in-bits='64' id='18c91f9e'/>
    <pointer-type-def type-id='b59d7dce' size-in-bits='64' id='78c01427'/>
    <pointer-type-def type-id='d8bf0010' size-in-bits='64' id='45b65157'/>
    <pointer-type-def type-id='9c313c2d' size-in-bits='64' id='5d6479ae'/>
    <pointer-type-def type-id='b96825af' size-in-bits='64' id='ae3e8ca6'/>
    <pointer-type-def type-id='48b5725f' size-in-bits='64' id='eaa32e2f'/>
    <pointer-type-def type-id='3522cd69' size-in-bits='64' id='b65f7fd1'/>
    <function-decl name='zfs_ioctl_fd' mangled-name='zfs_ioctl_fd' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_ioctl_fd'>
      <parameter type-id='95e97e5e'/>
      <parameter type-id='7359adad'/>
      <parameter type-id='b65f7fd1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='nvlist_free' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='5ce45b60'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='nvlist_unpack' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='26a90f95'/>
      <parameter type-id='b59d7dce'/>
      <parameter type-id='857bb57e'/>
      <parameter type-id='95e97e5e'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='nvlist_lookup_uint64' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='5ce45b60'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='5d6479ae'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='nvlist_lookup_nvlist' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='5ce45b60'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='857bb57e'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='nvlist_next_nvpair' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='5ce45b60'/>
      <parameter type-id='3fa542f0'/>
      <return type-id='3fa542f0'/>
    </function-decl>
    <function-decl name='nvpair_name' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='3fa542f0'/>
      <return type-id='26a90f95'/>
    </function-decl>
    <function-decl name='fnvlist_alloc' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='5ce45b60'/>
    </function-decl>
    <function-decl name='fnvlist_free' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='5ce45b60'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='fnvlist_pack' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='5ce45b60'/>
      <parameter type-id='78c01427'/>
      <return type-id='26a90f95'/>
    </function-decl>
    <function-decl name='fnvlist_pack_free' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='26a90f95'/>
      <parameter type-id='b59d7dce'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='fnvlist_unpack' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='26a90f95'/>
      <parameter type-id='b59d7dce'/>
      <return type-id='5ce45b60'/>
    </function-decl>
    <function-decl name='fnvlist_dup' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='5ce45b60'/>
      <return type-id='5ce45b60'/>
    </function-decl>
    <function-decl name='fnvlist_add_boolean' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='5ce45b60'/>
      <parameter type-id='80f4b756'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='fnvlist_add_boolean_value' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='5ce45b60'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='c19b74c3'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='fnvlist_add_int32' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='5ce45b60'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='3ff5601b'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='fnvlist_add_uint64' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='5ce45b60'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='9c313c2d'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='fnvlist_add_string' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='5ce45b60'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='80f4b756'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='fnvlist_add_nvlist' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='5ce45b60'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='5ce45b60'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='fnvlist_add_byte_array' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='5ce45b60'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='45b65157'/>
      <parameter type-id='3502e3ff'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='fnvlist_add_uint8_array' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='5ce45b60'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='ae3e8ca6'/>
      <parameter type-id='3502e3ff'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_boolean_value' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='5ce45b60'/>
      <parameter type-id='80f4b756'/>
      <return type-id='c19b74c3'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_uint64' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='5ce45b60'/>
      <parameter type-id='80f4b756'/>
      <return type-id='9c313c2d'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_string' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='5ce45b60'/>
      <parameter type-id='80f4b756'/>
      <return type-id='26a90f95'/>
    </function-decl>
    <function-decl name='libspl_assertf' mangled-name='libspl_assertf' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='libspl_assertf'>
      <parameter type-id='80f4b756'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='95e97e5e'/>
      <parameter type-id='80f4b756'/>
      <parameter is-variadic='yes'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='strlcpy' mangled-name='strlcpy' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strlcpy'>
      <parameter type-id='26a90f95'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='b59d7dce'/>
      <return type-id='b59d7dce'/>
    </function-decl>
    <function-decl name='libzfs_core_init' mangled-name='libzfs_core_init' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='libzfs_core_init'>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='libzfs_core_fini' mangled-name='libzfs_core_fini' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='libzfs_core_fini'>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='lzc_create' mangled-name='lzc_create' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_create'>
      <parameter type-id='80f4b756' name='fsname'/>
      <parameter type-id='bc9887f1' name='type'/>
      <parameter type-id='5ce45b60' name='props'/>
      <parameter type-id='ae3e8ca6' name='wkeydata'/>
      <parameter type-id='3502e3ff' name='wkeylen'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='lzc_clone' mangled-name='lzc_clone' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_clone'>
      <parameter type-id='80f4b756' name='fsname'/>
      <parameter type-id='80f4b756' name='origin'/>
      <parameter type-id='5ce45b60' name='props'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='lzc_promote' mangled-name='lzc_promote' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_promote'>
      <parameter type-id='80f4b756' name='fsname'/>
      <parameter type-id='26a90f95' name='snapnamebuf'/>
      <parameter type-id='95e97e5e' name='snapnamelen'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='lzc_rename' mangled-name='lzc_rename' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_rename'>
      <parameter type-id='80f4b756' name='source'/>
      <parameter type-id='80f4b756' name='target'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='lzc_destroy' mangled-name='lzc_destroy' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_destroy'>
      <parameter type-id='80f4b756' name='fsname'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='lzc_snapshot' mangled-name='lzc_snapshot' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_snapshot'>
      <parameter type-id='5ce45b60' name='snaps'/>
      <parameter type-id='5ce45b60' name='props'/>
      <parameter type-id='857bb57e' name='errlist'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='lzc_destroy_snaps' mangled-name='lzc_destroy_snaps' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_destroy_snaps'>
      <parameter type-id='5ce45b60' name='snaps'/>
      <parameter type-id='c19b74c3' name='defer'/>
      <parameter type-id='857bb57e' name='errlist'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='lzc_snaprange_space' mangled-name='lzc_snaprange_space' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_snaprange_space'>
      <parameter type-id='80f4b756' name='firstsnap'/>
      <parameter type-id='80f4b756' name='lastsnap'/>
      <parameter type-id='5d6479ae' name='usedp'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='lzc_exists' mangled-name='lzc_exists' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_exists'>
      <parameter type-id='80f4b756' name='dataset'/>
      <return type-id='c19b74c3'/>
    </function-decl>
    <function-decl name='lzc_sync' mangled-name='lzc_sync' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_sync'>
      <parameter type-id='80f4b756' name='pool_name'/>
      <parameter type-id='5ce45b60' name='innvl'/>
      <parameter type-id='857bb57e' name='outnvl'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='lzc_hold' mangled-name='lzc_hold' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_hold'>
      <parameter type-id='5ce45b60' name='holds'/>
      <parameter type-id='95e97e5e' name='cleanup_fd'/>
      <parameter type-id='857bb57e' name='errlist'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='lzc_release' mangled-name='lzc_release' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_release'>
      <parameter type-id='5ce45b60' name='holds'/>
      <parameter type-id='857bb57e' name='errlist'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='lzc_get_holds' mangled-name='lzc_get_holds' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_get_holds'>
      <parameter type-id='80f4b756' name='snapname'/>
      <parameter type-id='857bb57e' name='holdsp'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='lzc_send' mangled-name='lzc_send' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_send'>
      <parameter type-id='80f4b756' name='snapname'/>
      <parameter type-id='80f4b756' name='from'/>
      <parameter type-id='95e97e5e' name='fd'/>
      <parameter type-id='bfbd3c8e' name='flags'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='lzc_send_redacted' mangled-name='lzc_send_redacted' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_send_redacted'>
      <parameter type-id='80f4b756' name='snapname'/>
      <parameter type-id='80f4b756' name='from'/>
      <parameter type-id='95e97e5e' name='fd'/>
      <parameter type-id='bfbd3c8e' name='flags'/>
      <parameter type-id='80f4b756' name='redactbook'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='lzc_send_resume' mangled-name='lzc_send_resume' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_send_resume'>
      <parameter type-id='80f4b756' name='snapname'/>
      <parameter type-id='80f4b756' name='from'/>
      <parameter type-id='95e97e5e' name='fd'/>
      <parameter type-id='bfbd3c8e' name='flags'/>
      <parameter type-id='9c313c2d' name='resumeobj'/>
      <parameter type-id='9c313c2d' name='resumeoff'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='lzc_send_resume_redacted' mangled-name='lzc_send_resume_redacted' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_send_resume_redacted'>
      <parameter type-id='80f4b756' name='snapname'/>
      <parameter type-id='80f4b756' name='from'/>
      <parameter type-id='95e97e5e' name='fd'/>
      <parameter type-id='bfbd3c8e' name='flags'/>
      <parameter type-id='9c313c2d' name='resumeobj'/>
      <parameter type-id='9c313c2d' name='resumeoff'/>
      <parameter type-id='80f4b756' name='redactbook'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='lzc_send_space_resume_redacted' mangled-name='lzc_send_space_resume_redacted' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_send_space_resume_redacted'>
      <parameter type-id='80f4b756' name='snapname'/>
      <parameter type-id='80f4b756' name='from'/>
      <parameter type-id='bfbd3c8e' name='flags'/>
      <parameter type-id='9c313c2d' name='resumeobj'/>
      <parameter type-id='9c313c2d' name='resumeoff'/>
      <parameter type-id='9c313c2d' name='resume_bytes'/>
      <parameter type-id='80f4b756' name='redactbook'/>
      <parameter type-id='95e97e5e' name='fd'/>
      <parameter type-id='5d6479ae' name='spacep'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='lzc_send_space' mangled-name='lzc_send_space' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_send_space'>
      <parameter type-id='80f4b756' name='snapname'/>
      <parameter type-id='80f4b756' name='from'/>
      <parameter type-id='bfbd3c8e' name='flags'/>
      <parameter type-id='5d6479ae' name='spacep'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='lzc_receive' mangled-name='lzc_receive' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_receive'>
      <parameter type-id='80f4b756' name='snapname'/>
      <parameter type-id='5ce45b60' name='props'/>
      <parameter type-id='80f4b756' name='origin'/>
      <parameter type-id='c19b74c3' name='force'/>
      <parameter type-id='c19b74c3' name='raw'/>
      <parameter type-id='95e97e5e' name='fd'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='lzc_receive_resumable' mangled-name='lzc_receive_resumable' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_receive_resumable'>
      <parameter type-id='80f4b756' name='snapname'/>
      <parameter type-id='5ce45b60' name='props'/>
      <parameter type-id='80f4b756' name='origin'/>
      <parameter type-id='c19b74c3' name='force'/>
      <parameter type-id='c19b74c3' name='raw'/>
      <parameter type-id='95e97e5e' name='fd'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='lzc_receive_with_header' mangled-name='lzc_receive_with_header' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_receive_with_header'>
      <parameter type-id='80f4b756' name='snapname'/>
      <parameter type-id='5ce45b60' name='props'/>
      <parameter type-id='80f4b756' name='origin'/>
      <parameter type-id='c19b74c3' name='force'/>
      <parameter type-id='c19b74c3' name='resumable'/>
      <parameter type-id='c19b74c3' name='raw'/>
      <parameter type-id='95e97e5e' name='fd'/>
      <parameter type-id='8341348b' name='begin_record'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='lzc_receive_one' mangled-name='lzc_receive_one' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_receive_one'>
      <parameter type-id='80f4b756' name='snapname'/>
      <parameter type-id='5ce45b60' name='props'/>
      <parameter type-id='80f4b756' name='origin'/>
      <parameter type-id='c19b74c3' name='force'/>
      <parameter type-id='c19b74c3' name='resumable'/>
      <parameter type-id='c19b74c3' name='raw'/>
      <parameter type-id='95e97e5e' name='input_fd'/>
      <parameter type-id='8341348b' name='begin_record'/>
      <parameter type-id='95e97e5e' name='cleanup_fd'/>
      <parameter type-id='5d6479ae' name='read_bytes'/>
      <parameter type-id='5d6479ae' name='errflags'/>
      <parameter type-id='5d6479ae' name='action_handle'/>
      <parameter type-id='857bb57e' name='errors'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='lzc_receive_with_cmdprops' mangled-name='lzc_receive_with_cmdprops' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_receive_with_cmdprops'>
      <parameter type-id='80f4b756' name='snapname'/>
      <parameter type-id='5ce45b60' name='props'/>
      <parameter type-id='5ce45b60' name='cmdprops'/>
      <parameter type-id='ae3e8ca6' name='wkeydata'/>
      <parameter type-id='3502e3ff' name='wkeylen'/>
      <parameter type-id='80f4b756' name='origin'/>
      <parameter type-id='c19b74c3' name='force'/>
      <parameter type-id='c19b74c3' name='resumable'/>
      <parameter type-id='c19b74c3' name='raw'/>
      <parameter type-id='95e97e5e' name='input_fd'/>
      <parameter type-id='8341348b' name='begin_record'/>
      <parameter type-id='95e97e5e' name='cleanup_fd'/>
      <parameter type-id='5d6479ae' name='read_bytes'/>
      <parameter type-id='5d6479ae' name='errflags'/>
      <parameter type-id='5d6479ae' name='action_handle'/>
      <parameter type-id='857bb57e' name='errors'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='lzc_rollback' mangled-name='lzc_rollback' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_rollback'>
      <parameter type-id='80f4b756' name='fsname'/>
      <parameter type-id='26a90f95' name='snapnamebuf'/>
      <parameter type-id='95e97e5e' name='snapnamelen'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='lzc_rollback_to' mangled-name='lzc_rollback_to' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_rollback_to'>
      <parameter type-id='80f4b756' name='fsname'/>
      <parameter type-id='80f4b756' name='snapname'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='lzc_bookmark' mangled-name='lzc_bookmark' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_bookmark'>
      <parameter type-id='5ce45b60' name='bookmarks'/>
      <parameter type-id='857bb57e' name='errlist'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='lzc_get_bookmarks' mangled-name='lzc_get_bookmarks' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_get_bookmarks'>
      <parameter type-id='80f4b756' name='fsname'/>
      <parameter type-id='5ce45b60' name='props'/>
      <parameter type-id='857bb57e' name='bmarks'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='lzc_get_bookmark_props' mangled-name='lzc_get_bookmark_props' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_get_bookmark_props'>
      <parameter type-id='80f4b756' name='bookmark'/>
      <parameter type-id='857bb57e' name='props'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='lzc_destroy_bookmarks' mangled-name='lzc_destroy_bookmarks' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_destroy_bookmarks'>
      <parameter type-id='5ce45b60' name='bmarks'/>
      <parameter type-id='857bb57e' name='errlist'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='lzc_channel_program' mangled-name='lzc_channel_program' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_channel_program'>
      <parameter type-id='80f4b756' name='pool'/>
      <parameter type-id='80f4b756' name='program'/>
      <parameter type-id='9c313c2d' name='instrlimit'/>
      <parameter type-id='9c313c2d' name='memlimit'/>
      <parameter type-id='5ce45b60' name='argnvl'/>
      <parameter type-id='857bb57e' name='outnvl'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='lzc_pool_checkpoint' mangled-name='lzc_pool_checkpoint' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_pool_checkpoint'>
      <parameter type-id='80f4b756' name='pool'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='lzc_pool_checkpoint_discard' mangled-name='lzc_pool_checkpoint_discard' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_pool_checkpoint_discard'>
      <parameter type-id='80f4b756' name='pool'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='lzc_channel_program_nosync' mangled-name='lzc_channel_program_nosync' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_channel_program_nosync'>
      <parameter type-id='80f4b756' name='pool'/>
      <parameter type-id='80f4b756' name='program'/>
      <parameter type-id='9c313c2d' name='timeout'/>
      <parameter type-id='9c313c2d' name='memlimit'/>
      <parameter type-id='5ce45b60' name='argnvl'/>
      <parameter type-id='857bb57e' name='outnvl'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='lzc_load_key' mangled-name='lzc_load_key' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_load_key'>
      <parameter type-id='80f4b756' name='fsname'/>
      <parameter type-id='c19b74c3' name='noop'/>
      <parameter type-id='ae3e8ca6' name='wkeydata'/>
      <parameter type-id='3502e3ff' name='wkeylen'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='lzc_unload_key' mangled-name='lzc_unload_key' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_unload_key'>
      <parameter type-id='80f4b756' name='fsname'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='lzc_change_key' mangled-name='lzc_change_key' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_change_key'>
      <parameter type-id='80f4b756' name='fsname'/>
      <parameter type-id='9c313c2d' name='crypt_cmd'/>
      <parameter type-id='5ce45b60' name='props'/>
      <parameter type-id='ae3e8ca6' name='wkeydata'/>
      <parameter type-id='3502e3ff' name='wkeylen'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='lzc_reopen' mangled-name='lzc_reopen' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_reopen'>
      <parameter type-id='80f4b756' name='pool_name'/>
      <parameter type-id='c19b74c3' name='scrub_restart'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='lzc_initialize' mangled-name='lzc_initialize' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_initialize'>
      <parameter type-id='80f4b756' name='poolname'/>
      <parameter type-id='7063e1ab' name='cmd_type'/>
      <parameter type-id='5ce45b60' name='vdevs'/>
      <parameter type-id='857bb57e' name='errlist'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='lzc_trim' mangled-name='lzc_trim' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_trim'>
      <parameter type-id='80f4b756' name='poolname'/>
      <parameter type-id='b1146b8d' name='cmd_type'/>
      <parameter type-id='9c313c2d' name='rate'/>
      <parameter type-id='c19b74c3' name='secure'/>
      <parameter type-id='5ce45b60' name='vdevs'/>
      <parameter type-id='857bb57e' name='errlist'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='lzc_redact' mangled-name='lzc_redact' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_redact'>
      <parameter type-id='80f4b756' name='snapshot'/>
      <parameter type-id='80f4b756' name='bookname'/>
      <parameter type-id='5ce45b60' name='snapnv'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='lzc_wait' mangled-name='lzc_wait' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_wait'>
      <parameter type-id='80f4b756' name='pool'/>
      <parameter type-id='73446457' name='activity'/>
      <parameter type-id='37e3bd22' name='waited'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='lzc_wait_tag' mangled-name='lzc_wait_tag' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_wait_tag'>
      <parameter type-id='80f4b756' name='pool'/>
      <parameter type-id='73446457' name='activity'/>
      <parameter type-id='9c313c2d' name='tag'/>
      <parameter type-id='37e3bd22' name='waited'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='lzc_wait_fs' mangled-name='lzc_wait_fs' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_wait_fs'>
      <parameter type-id='80f4b756' name='fs'/>
      <parameter type-id='3024501a' name='activity'/>
      <parameter type-id='37e3bd22' name='waited'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='lzc_set_bootenv' mangled-name='lzc_set_bootenv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_set_bootenv'>
      <parameter type-id='80f4b756' name='pool'/>
      <parameter type-id='22cce67b' name='env'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='lzc_get_bootenv' mangled-name='lzc_get_bootenv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_get_bootenv'>
      <parameter type-id='80f4b756' name='pool'/>
      <parameter type-id='857bb57e' name='outnvl'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='__errno_location' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='7292109c'/>
    </function-decl>
    <function-decl name='pthread_mutex_lock' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='18c91f9e'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='pthread_mutex_unlock' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='18c91f9e'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='malloc' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='b59d7dce'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='free' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='eaa32e2f'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='strchr' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='80f4b756'/>
      <parameter type-id='95e97e5e'/>
      <return type-id='26a90f95'/>
    </function-decl>
    <function-decl name='strrchr' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='80f4b756'/>
      <parameter type-id='95e97e5e'/>
      <return type-id='26a90f95'/>
    </function-decl>
    <function-decl name='strcspn' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='80f4b756'/>
      <parameter type-id='80f4b756'/>
      <return type-id='b59d7dce'/>
    </function-decl>
    <function-decl name='close' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='95e97e5e'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='__open_too_many_args' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='__open_missing_mode' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='__read_chk' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='95e97e5e'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='b59d7dce'/>
      <parameter type-id='b59d7dce'/>
      <return type-id='79a0948f'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='os/linux/zutil_device_path_os.c' language='LANG_C99'>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='288' id='16e6f2c6'>
      <subrange length='36' type-id='7359adad' id='ae666bde'/>
    </array-type-def>
    <class-decl name='udev' is-struct='yes' visibility='default' is-declaration-only='yes' id='e4a7fb7f'/>
    <class-decl name='udev_device' is-struct='yes' visibility='default' is-declaration-only='yes' id='640b33ca'/>
    <array-type-def dimensions='1' type-id='a65ae39c' size-in-bits='960' id='fa198beb'>
      <subrange length='1' type-id='7359adad' id='52f813b4'/>
    </array-type-def>
    <type-decl name='long long int' size-in-bits='64' id='1eb56b1e'/>
    <array-type-def dimensions='1' type-id='3502e3ff' size-in-bits='384' id='dba89ba3'>
      <subrange length='12' type-id='7359adad' id='84827bdc'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='3502e3ff' size-in-bits='256' id='01d84ed4'>
      <subrange length='8' type-id='7359adad' id='56e0c0b1'/>
    </array-type-def>
    <class-decl name='dk_part' size-in-bits='960' is-struct='yes' visibility='default' id='a65ae39c'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='p_start' type-id='804dc465' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='p_size' type-id='804dc465' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='p_guid' type-id='214f32ea' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='p_tag' type-id='d908a348' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='272'>
        <var-decl name='p_flag' type-id='d908a348' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='p_name' type-id='16e6f2c6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='p_uguid' type-id='214f32ea' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='p_resv' type-id='01d84ed4' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='dk_gpt' size-in-bits='1920' is-struct='yes' visibility='default' id='dd4a2e5a'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='efi_version' type-id='3502e3ff' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='efi_nparts' type-id='3502e3ff' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='efi_part_size' type-id='3502e3ff' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='efi_lbasize' type-id='3502e3ff' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='efi_last_lba' type-id='804dc465' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='efi_first_u_lba' type-id='804dc465' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='efi_last_u_lba' type-id='804dc465' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='efi_disk_uguid' type-id='214f32ea' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='efi_flags' type-id='3502e3ff' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='efi_reserved1' type-id='3502e3ff' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='efi_altern_lba' type-id='804dc465' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='efi_reserved' type-id='dba89ba3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='efi_parts' type-id='fa198beb' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='uuid' size-in-bits='128' is-struct='yes' visibility='default' id='214f32ea'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='time_low' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='time_mid' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='time_hi_and_version' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='clock_seq_hi_and_reserved' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='72'>
        <var-decl name='clock_seq_low' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='node_addr' type-id='0f562bd0' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='ushort_t' type-id='8efea9e5' id='d908a348'/>
    <typedef-decl name='longlong_t' type-id='1eb56b1e' id='9b3ff54f'/>
    <typedef-decl name='diskaddr_t' type-id='9b3ff54f' id='804dc465'/>
    <class-decl name='dirent' size-in-bits='2240' is-struct='yes' visibility='default' id='611586a1'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='d_ino' type-id='71288a47' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='d_off' type-id='724e4de6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='d_reclen' type-id='8efea9e5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='144'>
        <var-decl name='d_type' type-id='002ac4a6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='152'>
        <var-decl name='d_name' type-id='d1617432' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='uint16_t' type-id='253c2d2a' id='149c6638'/>
    <typedef-decl name='__uint16_t' type-id='8efea9e5' id='253c2d2a'/>
    <pointer-type-def type-id='611586a1' size-in-bits='64' id='2e243169'/>
    <pointer-type-def type-id='dd4a2e5a' size-in-bits='64' id='0d8119a8'/>
    <pointer-type-def type-id='0d8119a8' size-in-bits='64' id='c43b27a6'/>
    <pointer-type-def type-id='e4a7fb7f' size-in-bits='64' id='025eefe7'/>
    <pointer-type-def type-id='640b33ca' size-in-bits='64' id='b32bae08'/>
    <class-decl name='udev' is-struct='yes' visibility='default' is-declaration-only='yes' id='e4a7fb7f'/>
    <class-decl name='udev_device' is-struct='yes' visibility='default' is-declaration-only='yes' id='640b33ca'/>
    <function-decl name='efi_alloc_and_init' mangled-name='efi_alloc_and_init' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_alloc_and_init'>
      <parameter type-id='95e97e5e'/>
      <parameter type-id='8f92235e'/>
      <parameter type-id='c43b27a6'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='efi_free' mangled-name='efi_free' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_free'>
      <parameter type-id='0d8119a8'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='udev_new' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='025eefe7'/>
    </function-decl>
    <function-decl name='udev_device_unref' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='b32bae08'/>
      <return type-id='b32bae08'/>
    </function-decl>
    <function-decl name='udev_device_new_from_subsystem_sysname' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='025eefe7'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='80f4b756'/>
      <return type-id='b32bae08'/>
    </function-decl>
    <function-decl name='udev_device_get_property_value' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='b32bae08'/>
      <parameter type-id='80f4b756'/>
      <return type-id='80f4b756'/>
    </function-decl>
    <function-decl name='fclose' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='822cd80b'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='strstr' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='80f4b756'/>
      <parameter type-id='80f4b756'/>
      <return type-id='26a90f95'/>
    </function-decl>
    <function-decl name='__fgets_chk' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='266fe297'/>
      <parameter type-id='b59d7dce'/>
      <parameter type-id='95e97e5e'/>
      <parameter type-id='e75a27e9'/>
      <return type-id='26a90f95'/>
    </function-decl>
    <function-decl name='__readlink_chk' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='9d26089a'/>
      <parameter type-id='266fe297'/>
      <parameter type-id='b59d7dce'/>
      <parameter type-id='b59d7dce'/>
      <return type-id='79a0948f'/>
    </function-decl>
    <function-decl name='zfs_strip_partition' mangled-name='zfs_strip_partition' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_strip_partition'>
      <parameter type-id='26a90f95' name='path'/>
      <return type-id='26a90f95'/>
    </function-decl>
    <function-decl name='zfs_strip_path' mangled-name='zfs_strip_path' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_strip_path'>
      <parameter type-id='26a90f95' name='path'/>
      <return type-id='26a90f95'/>
    </function-decl>
    <function-decl name='zfs_get_enclosure_sysfs_path' mangled-name='zfs_get_enclosure_sysfs_path' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_get_enclosure_sysfs_path'>
      <parameter type-id='80f4b756' name='dev_name'/>
      <return type-id='26a90f95'/>
    </function-decl>
    <function-decl name='zfs_dev_is_dm' mangled-name='zfs_dev_is_dm' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_dev_is_dm'>
      <parameter type-id='80f4b756' name='dev_name'/>
      <return type-id='c19b74c3'/>
    </function-decl>
    <function-decl name='zfs_dev_is_whole_disk' mangled-name='zfs_dev_is_whole_disk' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_dev_is_whole_disk'>
      <parameter type-id='80f4b756' name='dev_name'/>
      <return type-id='c19b74c3'/>
    </function-decl>
    <function-decl name='zfs_get_underlying_path' mangled-name='zfs_get_underlying_path' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_get_underlying_path'>
      <parameter type-id='80f4b756' name='dev_name'/>
      <return type-id='26a90f95'/>
    </function-decl>
    <function-decl name='is_mpath_whole_disk' mangled-name='is_mpath_whole_disk' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='is_mpath_whole_disk'>
      <parameter type-id='80f4b756' name='path'/>
      <return type-id='c19b74c3'/>
    </function-decl>
    <type-decl name='unsigned short int' size-in-bits='16' id='8efea9e5'/>
  </abi-instr>
  <abi-instr address-size='64' path='os/linux/zutil_import_os.c' language='LANG_C99'>
    <class-decl name='blkid_struct_cache' is-struct='yes' visibility='default' is-declaration-only='yes' id='09286066'/>
    <class-decl name='blkid_struct_dev' is-struct='yes' visibility='default' is-declaration-only='yes' id='86223623'/>
    <class-decl name='blkid_struct_dev_iterate' is-struct='yes' visibility='default' is-declaration-only='yes' id='d88420d6'/>
    <class-decl name='udev_list_entry' is-struct='yes' visibility='default' is-declaration-only='yes' id='e7dbdca3'/>
    <typedef-decl name='blkid_dev' type-id='8433f053' id='f47b023a'/>
    <typedef-decl name='blkid_cache' type-id='940e3afc' id='0882dfdf'/>
    <typedef-decl name='blkid_dev_iterate' type-id='b8fa2efc' id='f4760fa7'/>
    <typedef-decl name='__useconds_t' type-id='f0981eeb' id='4e80d4b1'/>
    <typedef-decl name='__clockid_t' type-id='95e97e5e' id='08f9a87a'/>
    <typedef-decl name='clockid_t' type-id='08f9a87a' id='a1c3b834'/>
    <pointer-type-def type-id='0882dfdf' size-in-bits='64' id='2e3e7caa'/>
    <pointer-type-def type-id='f47b023a' size-in-bits='64' id='d87f9b75'/>
    <pointer-type-def type-id='09286066' size-in-bits='64' id='940e3afc'/>
    <pointer-type-def type-id='86223623' size-in-bits='64' id='8433f053'/>
    <pointer-type-def type-id='d88420d6' size-in-bits='64' id='b8fa2efc'/>
    <qualified-type-def type-id='62f7a03d' restrict='yes' id='f1cadedf'/>
    <pointer-type-def type-id='e7dbdca3' size-in-bits='64' id='deabd0d3'/>
    <class-decl name='blkid_struct_cache' is-struct='yes' visibility='default' is-declaration-only='yes' id='09286066'/>
    <class-decl name='blkid_struct_dev' is-struct='yes' visibility='default' is-declaration-only='yes' id='86223623'/>
    <class-decl name='blkid_struct_dev_iterate' is-struct='yes' visibility='default' is-declaration-only='yes' id='d88420d6'/>
    <class-decl name='udev_list_entry' is-struct='yes' visibility='default' is-declaration-only='yes' id='e7dbdca3'/>
    <function-decl name='nvlist_remove_all' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='5ce45b60'/>
      <parameter type-id='80f4b756'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='blkid_put_cache' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='0882dfdf'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='blkid_get_cache' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='2e3e7caa'/>
      <parameter type-id='80f4b756'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='blkid_dev_devname' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='f47b023a'/>
      <return type-id='80f4b756'/>
    </function-decl>
    <function-decl name='blkid_dev_iterate_begin' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='0882dfdf'/>
      <return type-id='f4760fa7'/>
    </function-decl>
    <function-decl name='blkid_dev_set_search' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='f4760fa7'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='80f4b756'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='blkid_dev_next' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='f4760fa7'/>
      <parameter type-id='d87f9b75'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='blkid_dev_iterate_end' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='f4760fa7'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='blkid_probe_all_new' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='0882dfdf'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='udev_unref' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='025eefe7'/>
      <return type-id='025eefe7'/>
    </function-decl>
    <function-decl name='udev_list_entry_get_next' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='deabd0d3'/>
      <return type-id='deabd0d3'/>
    </function-decl>
    <function-decl name='udev_list_entry_get_name' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='deabd0d3'/>
      <return type-id='80f4b756'/>
    </function-decl>
    <function-decl name='udev_device_get_parent_with_subsystem_devtype' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='b32bae08'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='80f4b756'/>
      <return type-id='b32bae08'/>
    </function-decl>
    <function-decl name='udev_device_get_devlinks_list_entry' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='b32bae08'/>
      <return type-id='deabd0d3'/>
    </function-decl>
    <function-decl name='sched_yield' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='strtoul' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='9d26089a'/>
      <parameter type-id='8c85230f'/>
      <parameter type-id='95e97e5e'/>
      <return type-id='7359adad'/>
    </function-decl>
    <function-decl name='strncasecmp' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='80f4b756'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='b59d7dce'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='clock_gettime' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='a1c3b834'/>
      <parameter type-id='3d83ba87'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='usleep' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='4e80d4b1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='stat64' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='9d26089a'/>
      <parameter type-id='f1cadedf'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='zfs_dev_flush' mangled-name='zfs_dev_flush' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_dev_flush'>
      <parameter type-id='95e97e5e' name='fd'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='zfs_device_get_devid' mangled-name='zfs_device_get_devid' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_device_get_devid'>
      <parameter type-id='b32bae08' name='dev'/>
      <parameter type-id='26a90f95' name='bufptr'/>
      <parameter type-id='b59d7dce' name='buflen'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='zfs_device_get_physical' mangled-name='zfs_device_get_physical' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_device_get_physical'>
      <parameter type-id='b32bae08' name='dev'/>
      <parameter type-id='26a90f95' name='bufptr'/>
      <parameter type-id='b59d7dce' name='buflen'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='zpool_label_disk_wait' mangled-name='zpool_label_disk_wait' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_label_disk_wait'>
      <parameter type-id='80f4b756' name='path'/>
      <parameter type-id='95e97e5e' name='timeout_ms'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='zpool_disk_wait' mangled-name='zpool_disk_wait' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_disk_wait'>
      <parameter type-id='80f4b756' name='path'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='update_vdev_config_dev_sysfs_path' mangled-name='update_vdev_config_dev_sysfs_path' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='update_vdev_config_dev_sysfs_path'>
      <parameter type-id='5ce45b60' name='nv'/>
      <parameter type-id='80f4b756' name='path'/>
      <parameter type-id='80f4b756' name='key'/>
      <return type-id='48b5725f'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='os/linux/zutil_setproctitle.c' language='LANG_C99'>
    <function-decl name='warnx' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='80f4b756'/>
      <parameter is-variadic='yes'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='setenv' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='80f4b756'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='95e97e5e'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='zfs_setproctitle_init' mangled-name='zfs_setproctitle_init' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_setproctitle_init'>
      <parameter type-id='95e97e5e' name='argc'/>
      <parameter type-id='9b23c9ad' name='argv'/>
      <parameter type-id='9b23c9ad' name='envp'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='zfs_setproctitle' mangled-name='zfs_setproctitle' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_setproctitle'>
      <parameter type-id='80f4b756' name='fmt'/>
      <parameter is-variadic='yes'/>
      <return type-id='48b5725f'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='zutil_device_path.c' language='LANG_C99'>
    <qualified-type-def type-id='26a90f95' restrict='yes' id='266fe297'/>
    <qualified-type-def type-id='80f4b756' const='yes' id='b99c00c9'/>
    <pointer-type-def type-id='b99c00c9' size-in-bits='64' id='13956559'/>
    <qualified-type-def type-id='80f4b756' restrict='yes' id='9d26089a'/>
    <function-decl name='zpool_default_search_paths' mangled-name='zpool_default_search_paths' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_default_search_paths'>
      <parameter type-id='78c01427'/>
      <return type-id='13956559'/>
    </function-decl>
    <function-decl name='zfs_append_partition' mangled-name='zfs_append_partition' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_append_partition'>
      <parameter type-id='26a90f95'/>
      <parameter type-id='b59d7dce'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='strlcat' mangled-name='strlcat' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strlcat'>
      <parameter type-id='26a90f95'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='b59d7dce'/>
      <return type-id='b59d7dce'/>
    </function-decl>
    <function-decl name='zfs_resolve_shortname' mangled-name='zfs_resolve_shortname' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_resolve_shortname'>
      <parameter type-id='80f4b756' name='name'/>
      <parameter type-id='26a90f95' name='path'/>
      <parameter type-id='b59d7dce' name='len'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='zfs_strcmp_pathname' mangled-name='zfs_strcmp_pathname' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_strcmp_pathname'>
      <parameter type-id='80f4b756' name='name'/>
      <parameter type-id='80f4b756' name='cmp'/>
      <parameter type-id='95e97e5e' name='wholedisk'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='getenv' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='80f4b756'/>
      <return type-id='26a90f95'/>
    </function-decl>
    <function-decl name='strcmp' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='80f4b756'/>
      <parameter type-id='80f4b756'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='strdup' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='80f4b756'/>
      <return type-id='26a90f95'/>
    </function-decl>
    <function-decl name='strtok' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='266fe297'/>
      <parameter type-id='9d26089a'/>
      <return type-id='26a90f95'/>
    </function-decl>
    <function-decl name='strlen' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='80f4b756'/>
      <return type-id='b59d7dce'/>
    </function-decl>
    <function-decl name='access' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='80f4b756'/>
      <parameter type-id='95e97e5e'/>
      <return type-id='95e97e5e'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='zutil_import.c' language='LANG_C99'>
    <array-type-def dimensions='1' type-id='03085adc' size-in-bits='192' id='083f8d58'>
      <subrange length='3' type-id='7359adad' id='56f209d2'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='bf311473' size-in-bits='128' id='f0f65199'>
      <subrange length='2' type-id='7359adad' id='52efc4ef'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='8192' id='b54ce520'>
      <subrange length='1024' type-id='7359adad' id='c60446f8'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='8' id='89feb1ec'>
      <subrange length='1' type-id='7359adad' id='52f813b4'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='160' id='664ac0b7'>
      <subrange length='20' type-id='7359adad' id='fdca39cf'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='256' id='16dc656a'>
      <subrange length='32' type-id='7359adad' id='ae5bde82'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='32' id='8e0573fd'>
      <subrange length='4' type-id='7359adad' id='16fe7105'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='448' id='6093ff7c'>
      <subrange length='56' type-id='7359adad' id='f8137894'/>
    </array-type-def>
    <class-decl name='_IO_codecvt' is-struct='yes' visibility='default' is-declaration-only='yes' id='a4036571'/>
    <class-decl name='_IO_marker' is-struct='yes' visibility='default' is-declaration-only='yes' id='010ae0b9'/>
    <class-decl name='_IO_wide_data' is-struct='yes' visibility='default' is-declaration-only='yes' id='79bd3751'/>
    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='20cd73f2'/>
    <class-decl name='tpool' size-in-bits='2496' is-struct='yes' visibility='default' id='88d1b7f9'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tp_forw' type-id='9cf59a50' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tp_back' type-id='9cf59a50' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='tp_mutex' type-id='7a6844eb' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='tp_busycv' type-id='62fab762' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='tp_workcv' type-id='62fab762' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='tp_waitcv' type-id='62fab762' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='tp_active' type-id='ad33e5e7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='tp_head' type-id='f32b30e4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='tp_tail' type-id='f32b30e4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='tp_attr' type-id='7d8569fd' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <var-decl name='tp_flags' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2272'>
        <var-decl name='tp_linger' type-id='3502e3ff' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2304'>
        <var-decl name='tp_njobs' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2336'>
        <var-decl name='tp_minimum' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2368'>
        <var-decl name='tp_maximum' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2400'>
        <var-decl name='tp_current' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2432'>
        <var-decl name='tp_idle' type-id='95e97e5e' visibility='default'/>
      </data-member>
    </class-decl>
    <array-type-def dimensions='1' type-id='95e97e5e' size-in-bits='384' id='73b82f0f'>
      <subrange length='12' type-id='7359adad' id='84827bdc'/>
    </array-type-def>
    <type-decl name='long long unsigned int' size-in-bits='64' id='3a47d82b'/>
    <type-decl name='signed char' size-in-bits='8' id='28577a57'/>
    <type-decl name='unsigned short int' size-in-bits='16' id='8efea9e5'/>
    <typedef-decl name='refresh_config_func_t' type-id='29f040d2' id='b7c58eaa'/>
    <typedef-decl name='pool_active_func_t' type-id='baa42fef' id='de5d1d8f'/>
    <class-decl name='pool_config_ops' size-in-bits='128' is-struct='yes' visibility='default' id='8b092c69'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='pco_refresh_config' type-id='e7c00489' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='pco_pool_active' type-id='9eadf5e0' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='pool_config_ops_t' type-id='1a21babe' id='b1e62775'/>
    <class-decl name='importargs' size-in-bits='448' is-struct='yes' visibility='default' id='7ac83801'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='path' type-id='9b23c9ad' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='paths' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='poolname' type-id='80f4b756' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='guid' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='cachefile' type-id='80f4b756' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='can_be_active' type-id='c19b74c3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='scan' type-id='c19b74c3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='policy' type-id='5ce45b60' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='importargs_t' type-id='7ac83801' id='7a842a6b'/>
    <typedef-decl name='pool_vdev_iter_f' type-id='6c16a6c8' id='dff793e0'/>
    <typedef-decl name='avl_tree_t' type-id='b351119f' id='f20fbd51'/>
    <typedef-decl name='avl_index_t' type-id='e475ab95' id='fba6cb51'/>
    <class-decl name='avl_node' size-in-bits='192' is-struct='yes' visibility='default' id='428b67b3'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='avl_child' type-id='f0f65199' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='avl_pcb' type-id='e475ab95' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='avl_tree' size-in-bits='320' is-struct='yes' visibility='default' id='b351119f'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='avl_root' type-id='bf311473' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='avl_compar' type-id='585e1de9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='avl_offset' type-id='b59d7dce' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='avl_numnodes' type-id='ee1f298e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='avl_size' type-id='b59d7dce' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='tpool_t' type-id='88d1b7f9' id='b1bbf10d'/>
    <typedef-decl name='ulong_t' type-id='7359adad' id='ee1f298e'/>
    <class-decl name='libpc_handle' size-in-bits='8448' is-struct='yes' visibility='default' id='7c8737f0'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='lpc_printerr' type-id='c19b74c3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='lpc_open_access_error' type-id='c19b74c3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='lpc_desc_active' type-id='c19b74c3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='lpc_desc' type-id='b54ce520' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8320'>
        <var-decl name='lpc_ops' type-id='f095e320' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8384'>
        <var-decl name='lpc_lib_handle' type-id='eaa32e2f' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='libpc_handle_t' type-id='7c8737f0' id='8a70a786'/>
    <class-decl name='aiocb' size-in-bits='1344' is-struct='yes' visibility='default' id='e4957c49'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='aio_fildes' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='aio_lio_opcode' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='aio_reqprio' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='aio_buf' type-id='fe09dd29' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='aio_nbytes' type-id='b59d7dce' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='aio_sigevent' type-id='519bc206' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='__next_prio' type-id='924bbc81' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='__abs_prio' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='864'>
        <var-decl name='__policy' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='__error_code' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='__return_value' type-id='41060289' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='aio_offset' type-id='724e4de6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='__glibc_reserved' type-id='16dc656a' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='DIR' type-id='20cd73f2' id='54a5d683'/>
    <typedef-decl name='uintptr_t' type-id='7359adad' id='e475ab95'/>
    <class-decl name='dirent64' size-in-bits='2240' is-struct='yes' visibility='default' id='5725d813'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='d_ino' type-id='71288a47' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='d_off' type-id='724e4de6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='d_reclen' type-id='8efea9e5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='144'>
        <var-decl name='d_type' type-id='002ac4a6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='152'>
        <var-decl name='d_name' type-id='d1617432' visibility='default'/>
      </data-member>
    </class-decl>
    <union-decl name='pthread_mutexattr_t' size-in-bits='32' naming-typedef-id='8afd6070' visibility='default' id='7300eb00'>
      <data-member access='public'>
        <var-decl name='__size' type-id='8e0573fd' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__align' type-id='95e97e5e' visibility='default'/>
      </data-member>
    </union-decl>
    <typedef-decl name='pthread_mutexattr_t' type-id='7300eb00' id='8afd6070'/>
    <union-decl name='pthread_attr_t' size-in-bits='448' visibility='default' id='b63afacd'>
      <data-member access='public'>
        <var-decl name='__size' type-id='6093ff7c' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__align' type-id='bd54fe1a' visibility='default'/>
      </data-member>
    </union-decl>
    <typedef-decl name='pthread_attr_t' type-id='b63afacd' id='7d8569fd'/>
    <class-decl name='stat' size-in-bits='1152' is-struct='yes' visibility='default' id='aafc373f'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='st_dev' type-id='35ed8932' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='st_ino' type-id='e43e523d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='st_nlink' type-id='80f0b9df' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='st_mode' type-id='e1c52942' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='st_uid' type-id='cc5fcceb' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='st_gid' type-id='d94ec6d9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='__pad0' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='st_rdev' type-id='35ed8932' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='st_size' type-id='79989e9c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='st_blksize' type-id='d3f10a7f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='st_blocks' type-id='dbc43803' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='st_atim' type-id='a9c79a1f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='st_mtim' type-id='a9c79a1f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='st_ctim' type-id='a9c79a1f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='__glibc_reserved' type-id='083f8d58' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='stat64' size-in-bits='1152' is-struct='yes' visibility='default' id='0bbec9cd'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='st_dev' type-id='35ed8932' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='st_ino' type-id='71288a47' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='st_nlink' type-id='80f0b9df' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='st_mode' type-id='e1c52942' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='st_uid' type-id='cc5fcceb' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='st_gid' type-id='d94ec6d9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='__pad0' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='st_rdev' type-id='35ed8932' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='st_size' type-id='79989e9c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='st_blksize' type-id='d3f10a7f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='st_blocks' type-id='4e711bf1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='st_atim' type-id='a9c79a1f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='st_mtim' type-id='a9c79a1f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='st_ctim' type-id='a9c79a1f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='__glibc_reserved' type-id='083f8d58' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__dev_t' type-id='7359adad' id='35ed8932'/>
    <typedef-decl name='__uid_t' type-id='f0981eeb' id='cc5fcceb'/>
    <typedef-decl name='__gid_t' type-id='f0981eeb' id='d94ec6d9'/>
    <typedef-decl name='__ino_t' type-id='7359adad' id='e43e523d'/>
    <typedef-decl name='__ino64_t' type-id='7359adad' id='71288a47'/>
    <typedef-decl name='__mode_t' type-id='f0981eeb' id='e1c52942'/>
    <typedef-decl name='__nlink_t' type-id='7359adad' id='80f0b9df'/>
    <typedef-decl name='__off_t' type-id='bd54fe1a' id='79989e9c'/>
    <typedef-decl name='__off64_t' type-id='bd54fe1a' id='724e4de6'/>
    <typedef-decl name='__pid_t' type-id='95e97e5e' id='3629bad8'/>
    <typedef-decl name='__time_t' type-id='bd54fe1a' id='65eda9c0'/>
    <typedef-decl name='__blksize_t' type-id='bd54fe1a' id='d3f10a7f'/>
    <typedef-decl name='__blkcnt_t' type-id='bd54fe1a' id='dbc43803'/>
    <typedef-decl name='__blkcnt64_t' type-id='bd54fe1a' id='4e711bf1'/>
    <typedef-decl name='__syscall_slong_t' type-id='bd54fe1a' id='03085adc'/>
    <typedef-decl name='FILE' type-id='ec1ed955' id='aa12d1ba'/>
    <union-decl name='sigval' size-in-bits='64' visibility='default' id='a094b870'>
      <data-member access='public'>
        <var-decl name='sival_int' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='sival_ptr' type-id='eaa32e2f' visibility='default'/>
      </data-member>
    </union-decl>
    <typedef-decl name='__sigval_t' type-id='a094b870' id='eabacd01'/>
    <class-decl name='sigevent' size-in-bits='512' is-struct='yes' visibility='default' id='519bc206'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sigev_value' type-id='eabacd01' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='sigev_signo' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='sigev_notify' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_sigev_un' type-id='ac5ab596' visibility='default'/>
      </data-member>
    </class-decl>
    <union-decl name='__anonymous_union__' size-in-bits='384' is-anonymous='yes' visibility='default' id='ac5ab596'>
      <data-member access='public'>
        <var-decl name='_pad' type-id='73b82f0f' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='_tid' type-id='3629bad8' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='_sigev_thread' type-id='e7f43f73' visibility='default'/>
      </data-member>
    </union-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f73'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_function' type-id='5f147c28' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_attribute' type-id='7347a39e' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='_IO_lock_t' type-id='48b5725f' id='bb4788fa'/>
    <class-decl name='_IO_FILE' size-in-bits='1728' is-struct='yes' visibility='default' id='ec1ed955'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_flags' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_IO_read_ptr' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_IO_read_end' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_IO_read_base' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='_IO_write_base' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='_IO_write_ptr' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_IO_write_end' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='_IO_buf_base' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='_IO_buf_end' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='_IO_save_base' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='_IO_backup_base' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='_IO_save_end' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='_markers' type-id='e4c6fa61' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='_chain' type-id='dca988a5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='_fileno' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='_flags2' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='_old_offset' type-id='79989e9c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='_cur_column' type-id='8efea9e5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1040'>
        <var-decl name='_vtable_offset' type-id='28577a57' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1048'>
        <var-decl name='_shortbuf' type-id='89feb1ec' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='_lock' type-id='cecf4ea7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='_offset' type-id='724e4de6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='_codecvt' type-id='570f8c59' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='_wide_data' type-id='c65a1f29' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='_freeres_list' type-id='dca988a5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='_freeres_buf' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='__pad5' type-id='b59d7dce' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='_mode' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='_unused2' type-id='664ac0b7' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='timespec' size-in-bits='128' is-struct='yes' visibility='default' id='a9c79a1f'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tv_sec' type-id='65eda9c0' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tv_nsec' type-id='03085adc' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='54a5d683' size-in-bits='64' id='f09217ba'/>
    <pointer-type-def type-id='aa12d1ba' size-in-bits='64' id='822cd80b'/>
    <qualified-type-def type-id='822cd80b' restrict='yes' id='e75a27e9'/>
    <pointer-type-def type-id='ec1ed955' size-in-bits='64' id='dca988a5'/>
    <pointer-type-def type-id='a4036571' size-in-bits='64' id='570f8c59'/>
    <pointer-type-def type-id='bb4788fa' size-in-bits='64' id='cecf4ea7'/>
    <pointer-type-def type-id='010ae0b9' size-in-bits='64' id='e4c6fa61'/>
    <pointer-type-def type-id='79bd3751' size-in-bits='64' id='c65a1f29'/>
    <pointer-type-def type-id='e4957c49' size-in-bits='64' id='924bbc81'/>
    <qualified-type-def type-id='924bbc81' const='yes' id='5499dcde'/>
    <pointer-type-def type-id='5499dcde' size-in-bits='64' id='2236d41c'/>
    <qualified-type-def type-id='2236d41c' restrict='yes' id='31488924'/>
    <pointer-type-def type-id='fba6cb51' size-in-bits='64' id='32adbf30'/>
    <pointer-type-def type-id='428b67b3' size-in-bits='64' id='bf311473'/>
    <pointer-type-def type-id='b351119f' size-in-bits='64' id='716943c7'/>
    <pointer-type-def type-id='f20fbd51' size-in-bits='64' id='a3681dea'/>
    <pointer-type-def type-id='a3681dea' size-in-bits='64' id='fce6d540'/>
    <pointer-type-def type-id='26a90f95' size-in-bits='64' id='9b23c9ad'/>
    <qualified-type-def type-id='9b23c9ad' restrict='yes' id='8c85230f'/>
    <qualified-type-def type-id='e4957c49' const='yes' id='fced9da2'/>
    <pointer-type-def type-id='fced9da2' size-in-bits='64' id='b20efd18'/>
    <qualified-type-def type-id='8b092c69' const='yes' id='1a21babe'/>
    <qualified-type-def type-id='8afd6070' const='yes' id='1d853360'/>
    <pointer-type-def type-id='1d853360' size-in-bits='64' id='c2afbd7e'/>
    <pointer-type-def type-id='5725d813' size-in-bits='64' id='07b96073'/>
    <pointer-type-def type-id='7a842a6b' size-in-bits='64' id='07ee4a58'/>
    <pointer-type-def type-id='2ec2411e' size-in-bits='64' id='6c16a6c8'/>
    <pointer-type-def type-id='96ee24a5' size-in-bits='64' id='585e1de9'/>
    <pointer-type-def type-id='8a70a786' size-in-bits='64' id='5507783b'/>
    <pointer-type-def type-id='857bb57e' size-in-bits='64' id='75be733c'/>
    <pointer-type-def type-id='de5d1d8f' size-in-bits='64' id='9eadf5e0'/>
    <pointer-type-def type-id='b1e62775' size-in-bits='64' id='f095e320'/>
    <pointer-type-def type-id='7d8569fd' size-in-bits='64' id='7347a39e'/>
    <pointer-type-def type-id='b7c58eaa' size-in-bits='64' id='e7c00489'/>
    <pointer-type-def type-id='519bc206' size-in-bits='64' id='ef2f159c'/>
    <qualified-type-def type-id='ef2f159c' restrict='yes' id='de0eb5a4'/>
    <pointer-type-def type-id='aafc373f' size-in-bits='64' id='4330df87'/>
    <qualified-type-def type-id='4330df87' restrict='yes' id='73665405'/>
    <pointer-type-def type-id='0bbec9cd' size-in-bits='64' id='62f7a03d'/>
    <pointer-type-def type-id='b1bbf10d' size-in-bits='64' id='9cf59a50'/>
    <pointer-type-def type-id='5d6479ae' size-in-bits='64' id='892b4acc'/>
    <pointer-type-def type-id='3502e3ff' size-in-bits='64' id='4dd26a40'/>
    <pointer-type-def type-id='f1abb096' size-in-bits='64' id='5f147c28'/>
    <pointer-type-def type-id='c5c76c9c' size-in-bits='64' id='b7f9d8e6'/>
    <pointer-type-def type-id='eaa32e2f' size-in-bits='64' id='63e171df'/>
    <qualified-type-def type-id='48b5725f' volatile='yes' id='b0b3cbf9'/>
    <pointer-type-def type-id='b0b3cbf9' size-in-bits='64' id='fe09dd29'/>
    <class-decl name='_IO_codecvt' is-struct='yes' visibility='default' is-declaration-only='yes' id='a4036571'/>
    <class-decl name='_IO_marker' is-struct='yes' visibility='default' is-declaration-only='yes' id='010ae0b9'/>
    <class-decl name='_IO_wide_data' is-struct='yes' visibility='default' is-declaration-only='yes' id='79bd3751'/>
    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='20cd73f2'/>
    <function-decl name='update_vdev_config_dev_strs' mangled-name='update_vdev_config_dev_strs' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='update_vdev_config_dev_strs'>
      <parameter type-id='5ce45b60'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='update_vdevs_config_dev_sysfs_path' mangled-name='update_vdevs_config_dev_sysfs_path' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='update_vdevs_config_dev_sysfs_path'>
      <parameter type-id='5ce45b60'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='avl_create' mangled-name='avl_create' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_create'>
      <parameter type-id='a3681dea'/>
      <parameter type-id='585e1de9'/>
      <parameter type-id='b59d7dce'/>
      <parameter type-id='b59d7dce'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='avl_find' mangled-name='avl_find' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_find'>
      <parameter type-id='a3681dea'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='32adbf30'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='avl_insert' mangled-name='avl_insert' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_insert'>
      <parameter type-id='a3681dea'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='fba6cb51'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='avl_first' mangled-name='avl_first' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_first'>
      <parameter type-id='a3681dea'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='avl_destroy_nodes' mangled-name='avl_destroy_nodes' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_destroy_nodes'>
      <parameter type-id='a3681dea'/>
      <parameter type-id='63e171df'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='avl_destroy' mangled-name='avl_destroy' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_destroy'>
      <parameter type-id='a3681dea'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='avl_walk' mangled-name='avl_walk' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_walk'>
      <parameter type-id='716943c7'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='95e97e5e'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='nvlist_alloc' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='857bb57e'/>
      <parameter type-id='3502e3ff'/>
      <parameter type-id='95e97e5e'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='nvlist_dup' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='5ce45b60'/>
      <parameter type-id='857bb57e'/>
      <parameter type-id='95e97e5e'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='nvlist_add_uint64' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='5ce45b60'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='9c313c2d'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='nvlist_add_string' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='5ce45b60'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='80f4b756'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='nvlist_add_nvlist' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='5ce45b60'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='5ce45b60'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='nvlist_add_uint64_array' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='5ce45b60'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='5d6479ae'/>
      <parameter type-id='3502e3ff'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='nvlist_add_nvlist_array' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='5ce45b60'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='857bb57e'/>
      <parameter type-id='3502e3ff'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='nvlist_remove' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='5ce45b60'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='8d0687d2'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='nvlist_lookup_string' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='5ce45b60'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='9b23c9ad'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='nvlist_lookup_uint64_array' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='5ce45b60'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='892b4acc'/>
      <parameter type-id='4dd26a40'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='nvlist_lookup_nvlist_array' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='5ce45b60'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='75be733c'/>
      <parameter type-id='4dd26a40'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='nvlist_empty' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='5ce45b60'/>
      <return type-id='c19b74c3'/>
    </function-decl>
    <function-decl name='nvpair_value_nvlist' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='3fa542f0'/>
      <parameter type-id='857bb57e'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_nvlist' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='5ce45b60'/>
      <parameter type-id='80f4b756'/>
      <return type-id='5ce45b60'/>
    </function-decl>
    <function-decl name='fnvpair_value_nvlist' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='3fa542f0'/>
      <return type-id='5ce45b60'/>
    </function-decl>
    <function-decl name='tpool_create' mangled-name='tpool_create' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='tpool_create'>
      <parameter type-id='3502e3ff'/>
      <parameter type-id='3502e3ff'/>
      <parameter type-id='3502e3ff'/>
      <parameter type-id='7347a39e'/>
      <return type-id='9cf59a50'/>
    </function-decl>
    <function-decl name='tpool_dispatch' mangled-name='tpool_dispatch' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='tpool_dispatch'>
      <parameter type-id='9cf59a50'/>
      <parameter type-id='b7f9d8e6'/>
      <parameter type-id='eaa32e2f'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='tpool_destroy' mangled-name='tpool_destroy' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='tpool_destroy'>
      <parameter type-id='9cf59a50'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='tpool_wait' mangled-name='tpool_wait' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='tpool_wait'>
      <parameter type-id='9cf59a50'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spl_pagesize' mangled-name='spl_pagesize' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spl_pagesize'>
      <return type-id='b59d7dce'/>
    </function-decl>
    <function-decl name='zutil_alloc' mangled-name='zutil_alloc' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zutil_alloc'>
      <parameter type-id='5507783b' name='hdl'/>
      <parameter type-id='b59d7dce' name='size'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='zutil_strdup' mangled-name='zutil_strdup' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zutil_strdup'>
      <parameter type-id='5507783b' name='hdl'/>
      <parameter type-id='80f4b756' name='str'/>
      <return type-id='26a90f95'/>
    </function-decl>
    <function-decl name='zpool_read_label' mangled-name='zpool_read_label' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_read_label'>
      <parameter type-id='95e97e5e' name='fd'/>
      <parameter type-id='857bb57e' name='config'/>
      <parameter type-id='7292109c' name='num_labels'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='slice_cache_compare' mangled-name='slice_cache_compare' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='slice_cache_compare'>
      <parameter type-id='eaa32e2f' name='arg1'/>
      <parameter type-id='eaa32e2f' name='arg2'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='label_paths' mangled-name='label_paths' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='label_paths'>
      <parameter type-id='5507783b' name='hdl'/>
      <parameter type-id='5ce45b60' name='label'/>
      <parameter type-id='9b23c9ad' name='path'/>
      <parameter type-id='9b23c9ad' name='devid'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='zpool_search_import' mangled-name='zpool_search_import' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_search_import'>
      <parameter type-id='eaa32e2f' name='hdl'/>
      <parameter type-id='07ee4a58' name='import'/>
      <parameter type-id='f095e320' name='pco'/>
      <return type-id='5ce45b60'/>
    </function-decl>
    <function-decl name='zpool_find_config' mangled-name='zpool_find_config' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_find_config'>
      <parameter type-id='eaa32e2f' name='hdl'/>
      <parameter type-id='80f4b756' name='target'/>
      <parameter type-id='857bb57e' name='configp'/>
      <parameter type-id='07ee4a58' name='args'/>
      <parameter type-id='f095e320' name='pco'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='for_each_vdev_macro_helper_func' mangled-name='for_each_vdev_macro_helper_func' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='for_each_vdev_macro_helper_func'>
      <parameter type-id='eaa32e2f' name='state'/>
      <parameter type-id='5ce45b60' name='nv'/>
      <parameter type-id='eaa32e2f' name='last_nv'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='for_each_real_leaf_vdev_macro_helper_func' mangled-name='for_each_real_leaf_vdev_macro_helper_func' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='for_each_real_leaf_vdev_macro_helper_func'>
      <parameter type-id='eaa32e2f' name='state'/>
      <parameter type-id='5ce45b60' name='nv'/>
      <parameter type-id='eaa32e2f' name='last_nv'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='for_each_vdev_cb' mangled-name='for_each_vdev_cb' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='for_each_vdev_cb'>
      <parameter type-id='eaa32e2f' name='zhp'/>
      <parameter type-id='5ce45b60' name='nv'/>
      <parameter type-id='dff793e0' name='func'/>
      <parameter type-id='eaa32e2f' name='data'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='for_each_vdev_in_nvlist' mangled-name='for_each_vdev_in_nvlist' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='for_each_vdev_in_nvlist'>
      <parameter type-id='5ce45b60' name='nvroot'/>
      <parameter type-id='dff793e0' name='func'/>
      <parameter type-id='eaa32e2f' name='data'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='zpool_find_import_blkid' mangled-name='zpool_find_import_blkid' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_find_import_blkid'>
      <parameter type-id='5507783b'/>
      <parameter type-id='18c91f9e'/>
      <parameter type-id='fce6d540'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='zpool_open_func' mangled-name='zpool_open_func' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_open_func'>
      <parameter type-id='eaa32e2f'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='opendir' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='80f4b756'/>
      <return type-id='f09217ba'/>
    </function-decl>
    <function-decl name='closedir' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='f09217ba'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='readdir64' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='f09217ba'/>
      <return type-id='07b96073'/>
    </function-decl>
    <function-decl name='dirname' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='26a90f95'/>
      <return type-id='26a90f95'/>
    </function-decl>
    <function-decl name='__xpg_basename' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='26a90f95'/>
      <return type-id='26a90f95'/>
    </function-decl>
    <function-decl name='dcgettext' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='80f4b756'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='95e97e5e'/>
      <return type-id='26a90f95'/>
    </function-decl>
    <function-decl name='pthread_mutex_init' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='18c91f9e'/>
      <parameter type-id='c2afbd7e'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='pthread_mutex_destroy' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='18c91f9e'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='strtoull' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='9d26089a'/>
      <parameter type-id='8c85230f'/>
      <parameter type-id='95e97e5e'/>
      <return type-id='3a47d82b'/>
    </function-decl>
    <function-decl name='calloc' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='b59d7dce'/>
      <parameter type-id='b59d7dce'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='posix_memalign' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='63e171df'/>
      <parameter type-id='b59d7dce'/>
      <parameter type-id='b59d7dce'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='exit' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='95e97e5e'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='strncmp' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='80f4b756'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='b59d7dce'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='strpbrk' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='80f4b756'/>
      <parameter type-id='80f4b756'/>
      <return type-id='26a90f95'/>
    </function-decl>
    <function-decl name='strerror' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='95e97e5e'/>
      <return type-id='26a90f95'/>
    </function-decl>
    <function-decl name='sysconf' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='95e97e5e'/>
      <return type-id='bd54fe1a'/>
    </function-decl>
    <function-decl name='geteuid' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='cc5fcceb'/>
    </function-decl>
    <function-decl name='__fprintf_chk' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='e75a27e9'/>
      <parameter type-id='95e97e5e'/>
      <parameter type-id='9d26089a'/>
      <parameter is-variadic='yes'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='__asprintf_chk' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='8c85230f'/>
      <parameter type-id='95e97e5e'/>
      <parameter type-id='9d26089a'/>
      <parameter is-variadic='yes'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='__realpath_chk' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='9d26089a'/>
      <parameter type-id='266fe297'/>
      <parameter type-id='b59d7dce'/>
      <return type-id='26a90f95'/>
    </function-decl>
    <function-decl name='__pread64_chk' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='95e97e5e'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='b59d7dce'/>
      <parameter type-id='724e4de6'/>
      <parameter type-id='b59d7dce'/>
      <return type-id='79a0948f'/>
    </function-decl>
    <function-decl name='ioctl' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='95e97e5e'/>
      <parameter type-id='7359adad'/>
      <parameter is-variadic='yes'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='fstat64' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='95e97e5e'/>
      <parameter type-id='62f7a03d'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-type size-in-bits='64' id='baa42fef'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='9c313c2d'/>
      <parameter type-id='37e3bd22'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' id='2ec2411e'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='5ce45b60'/>
      <parameter type-id='eaa32e2f'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' id='96ee24a5'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='eaa32e2f'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' id='29f040d2'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='5ce45b60'/>
      <return type-id='5ce45b60'/>
    </function-type>
    <function-type size-in-bits='64' id='f1abb096'>
      <parameter type-id='eabacd01'/>
      <return type-id='48b5725f'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='zutil_nicenum.c' language='LANG_C99'>
    <type-decl name='double' size-in-bits='64' id='a0eb0f08'/>
    <type-decl name='long double' size-in-bits='128' id='e095c704'/>
    <enum-decl name='zfs_nicenum_format' id='29cf1969'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='ZFS_NICENUM_1024' value='0'/>
      <enumerator name='ZFS_NICENUM_BYTES' value='1'/>
      <enumerator name='ZFS_NICENUM_TIME' value='2'/>
      <enumerator name='ZFS_NICENUM_RAW' value='3'/>
      <enumerator name='ZFS_NICENUM_RAWTIME' value='4'/>
    </enum-decl>
    <qualified-type-def type-id='8efea9e5' const='yes' id='3beb2af4'/>
    <pointer-type-def type-id='3beb2af4' size-in-bits='64' id='31347b7a'/>
    <pointer-type-def type-id='31347b7a' size-in-bits='64' id='c59e1ef0'/>
    <function-decl name='zfs_isnumber' mangled-name='zfs_isnumber' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_isnumber'>
      <parameter type-id='80f4b756' name='str'/>
      <return type-id='c19b74c3'/>
    </function-decl>
    <function-decl name='zfs_nicenum_format' mangled-name='zfs_nicenum_format' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_nicenum_format'>
      <parameter type-id='9c313c2d' name='num'/>
      <parameter type-id='26a90f95' name='buf'/>
      <parameter type-id='b59d7dce' name='buflen'/>
      <parameter type-id='29cf1969' name='format'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='zfs_nicenum' mangled-name='zfs_nicenum' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_nicenum'>
      <parameter type-id='9c313c2d' name='num'/>
      <parameter type-id='26a90f95' name='buf'/>
      <parameter type-id='b59d7dce' name='buflen'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='zfs_nicetime' mangled-name='zfs_nicetime' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_nicetime'>
      <parameter type-id='9c313c2d' name='num'/>
      <parameter type-id='26a90f95' name='buf'/>
      <parameter type-id='b59d7dce' name='buflen'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='zfs_niceraw' mangled-name='zfs_niceraw' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_niceraw'>
      <parameter type-id='9c313c2d' name='num'/>
      <parameter type-id='26a90f95' name='buf'/>
      <parameter type-id='b59d7dce' name='buflen'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='zfs_nicebytes' mangled-name='zfs_nicebytes' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_nicebytes'>
      <parameter type-id='9c313c2d' name='num'/>
      <parameter type-id='26a90f95' name='buf'/>
      <parameter type-id='b59d7dce' name='buflen'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='__ctype_b_loc' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='c59e1ef0'/>
    </function-decl>
    <function-decl name='powl' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='e095c704'/>
      <parameter type-id='e095c704'/>
      <return type-id='e095c704'/>
    </function-decl>
    <function-decl name='floor' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='a0eb0f08'/>
      <return type-id='a0eb0f08'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='zutil_pool.c' language='LANG_C99'>
    <array-type-def dimensions='1' type-id='853fd5dc' size-in-bits='32768' id='b505fc2f'>
      <subrange length='64' type-id='7359adad' id='b10be967'/>
    </array-type-def>
    <type-decl name='float' size-in-bits='32' id='a6c45d85'/>
    <class-decl name='ddt_stat' size-in-bits='512' is-struct='yes' visibility='default' id='65242dfe'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='dds_blocks' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='dds_lsize' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='dds_psize' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='dds_dsize' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='dds_ref_blocks' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='dds_ref_lsize' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='dds_ref_psize' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='dds_ref_dsize' type-id='9c313c2d' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='ddt_stat_t' type-id='65242dfe' id='853fd5dc'/>
    <class-decl name='ddt_histogram' size-in-bits='32768' is-struct='yes' visibility='default' id='bc2b3086'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ddh_stat' type-id='b505fc2f' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='ddt_histogram_t' type-id='bc2b3086' id='2d7fe832'/>
    <qualified-type-def type-id='2d7fe832' const='yes' id='ec92d602'/>
    <pointer-type-def type-id='ec92d602' size-in-bits='64' id='932720f8'/>
    <qualified-type-def type-id='853fd5dc' const='yes' id='764c298c'/>
    <pointer-type-def type-id='764c298c' size-in-bits='64' id='dfe59052'/>
    <qualified-type-def type-id='a9c79a1f' const='yes' id='cd087e36'/>
    <pointer-type-def type-id='cd087e36' size-in-bits='64' id='e05e8614'/>
    <pointer-type-def type-id='a9c79a1f' size-in-bits='64' id='3d83ba87'/>
    <function-decl name='zpool_dump_ddt' mangled-name='zpool_dump_ddt' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_dump_ddt'>
      <parameter type-id='dfe59052' name='dds_total'/>
      <parameter type-id='932720f8' name='ddh'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='zpool_history_unpack' mangled-name='zpool_history_unpack' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_history_unpack'>
      <parameter type-id='26a90f95' name='buf'/>
      <parameter type-id='9c313c2d' name='bytes_read'/>
      <parameter type-id='5d6479ae' name='leftover'/>
      <parameter type-id='75be733c' name='records'/>
      <parameter type-id='4dd26a40' name='numrecords'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='fsleep' mangled-name='fsleep' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fsleep'>
      <parameter type-id='a6c45d85' name='sec'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='zpool_getenv_int' mangled-name='zpool_getenv_int' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_getenv_int'>
      <parameter type-id='80f4b756' name='env'/>
      <parameter type-id='95e97e5e' name='default_val'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='realloc' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='b59d7dce'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='nanosleep' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='e05e8614'/>
      <parameter type-id='3d83ba87'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='__printf_chk' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='95e97e5e'/>
      <parameter type-id='80f4b756'/>
      <parameter is-variadic='yes'/>
      <return type-id='95e97e5e'/>
    </function-decl>
  </abi-instr>
</abi-corpus>
