<abi-corpus version='2.0' path='libzfs_core.so' architecture='elf-amd-x86_64' soname='libzfs_core.so.3'>
  <elf-needed>
    <dependency name='libuuid.so.1'/>
    <dependency name='libz.so.1'/>
    <dependency name='libm.so.6'/>
    <dependency name='libblkid.so.1'/>
    <dependency name='libudev.so.1'/>
    <dependency name='libnvpair.so.3'/>
    <dependency name='libtirpc.so.3'/>
    <dependency name='libpthread.so.0'/>
    <dependency name='libc.so.6'/>
    <dependency name='ld-linux-x86-64.so.2'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='_sol_getmntent' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='atomic_add_16' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='atomic_add_16_nv' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='atomic_add_32' type='func-type' binding='global-binding' visibility='default-visibility' alias='atomic_add_int' is-defined='yes'/>
    <elf-symbol name='atomic_add_32_nv' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='atomic_add_64' type='func-type' binding='global-binding' visibility='default-visibility' alias='atomic_add_ptr,atomic_add_long' is-defined='yes'/>

    <elf-symbol name='zfs_niceraw' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zfs_nicetime' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zfs_resolve_shortname' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zfs_strcmp_pathname' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zfs_strip_partition' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zfs_strip_path' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zpool_default_search_paths' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zpool_dump_ddt' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zpool_find_config' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zpool_find_import_blkid' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zpool_history_unpack' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zpool_label_disk_wait' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zpool_open_func' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zpool_read_label' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zpool_search_import' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zutil_alloc' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zutil_strdup' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <elf-variable-symbols>
    <elf-symbol name='aok' size='4' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='buf' size='4110' type='tls-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='default_vtoc_map' size='64' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='efi_debug' size='4' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='pagesize' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-variable-symbols>
  <abi-instr address-size='64' path='../../module/avl/avl.c' comp-dir-path='/home/hutter2/release20/lib/libavl' language='LANG_C99'>
    <function-decl name='avl_last' mangled-name='avl_last' filepath='../../module/avl/avl.c' line='206' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_last'>
      <parameter type-id='type-id-1' name='tree' filepath='../../module/avl/avl.c' line='206' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='avl_nearest' mangled-name='avl_nearest' filepath='../../module/avl/avl.c' line='230' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_nearest'>
      <parameter type-id='type-id-1' name='tree' filepath='../../module/avl/avl.c' line='230' column='1'/>
      <parameter type-id='type-id-3' name='where' filepath='../../module/avl/avl.c' line='230' column='1'/>
      <parameter type-id='type-id-4' name='direction' filepath='../../module/avl/avl.c' line='230' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='avl_insert_here' mangled-name='avl_insert_here' filepath='../../module/avl/avl.c' line='576' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_insert_here'>
      <parameter type-id='type-id-1' name='tree' filepath='../../module/avl/avl.c' line='577' column='1'/>
      <parameter type-id='type-id-2' name='new_data' filepath='../../module/avl/avl.c' line='578' column='1'/>
      <parameter type-id='type-id-2' name='here' filepath='../../module/avl/avl.c' line='579' column='1'/>
      <parameter type-id='type-id-4' name='direction' filepath='../../module/avl/avl.c' line='580' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='avl_add' mangled-name='avl_add' filepath='../../module/avl/avl.c' line='637' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_add'>
      <parameter type-id='type-id-1' name='tree' filepath='../../module/avl/avl.c' line='637' column='1'/>
      <parameter type-id='type-id-2' name='new_node' filepath='../../module/avl/avl.c' line='637' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='avl_remove' mangled-name='avl_remove' filepath='../../module/avl/avl.c' line='670' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_remove'>
      <parameter type-id='type-id-1' name='tree' filepath='../../module/avl/avl.c' line='670' column='1'/>
      <parameter type-id='type-id-2' name='data' filepath='../../module/avl/avl.c' line='670' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='avl_update_lt' mangled-name='avl_update_lt' filepath='../../module/avl/avl.c' line='820' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_update_lt'>
      <parameter type-id='type-id-1' name='t' filepath='../../module/avl/avl.c' line='820' column='1'/>
      <parameter type-id='type-id-2' name='obj' filepath='../../module/avl/avl.c' line='820' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='avl_update_gt' mangled-name='avl_update_gt' filepath='../../module/avl/avl.c' line='837' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_update_gt'>
      <parameter type-id='type-id-1' name='t' filepath='../../module/avl/avl.c' line='837' column='1'/>
      <parameter type-id='type-id-2' name='obj' filepath='../../module/avl/avl.c' line='837' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='avl_update' mangled-name='avl_update' filepath='../../module/avl/avl.c' line='854' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_update'>
      <parameter type-id='type-id-1' name='t' filepath='../../module/avl/avl.c' line='854' column='1'/>
      <parameter type-id='type-id-2' name='obj' filepath='../../module/avl/avl.c' line='854' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='avl_swap' mangled-name='avl_swap' filepath='../../module/avl/avl.c' line='874' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_swap'>
      <parameter type-id='type-id-1' name='tree1' filepath='../../module/avl/avl.c' line='874' column='1'/>
      <parameter type-id='type-id-1' name='tree2' filepath='../../module/avl/avl.c' line='874' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='avl_numnodes' mangled-name='avl_numnodes' filepath='../../module/avl/avl.c' line='930' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_numnodes'>
      <parameter type-id='type-id-1' name='tree' filepath='../../module/avl/avl.c' line='930' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='avl_is_empty' mangled-name='avl_is_empty' filepath='../../module/avl/avl.c' line='937' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_is_empty'>
      <parameter type-id='type-id-1' name='tree' filepath='../../module/avl/avl.c' line='937' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='rdwr_efi.c' comp-dir-path='/home/hutter2/release20/lib/libefi' language='LANG_C99'>
    <array-type-def dimensions='1' type-id='type-id-8' size-in-bits='512' id='type-id-9'>
      <subrange length='16' type-id='type-id-10' id='type-id-11'/>
    </array-type-def>
    <class-decl name='dk_map2' size-in-bits='32' is-struct='yes' visibility='default' filepath='../../lib/libspl/include/sys/dklabel.h' line='103' column='1' id='type-id-8'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='p_tag' type-id='type-id-12' visibility='default' filepath='../../lib/libspl/include/sys/dklabel.h' line='104' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='p_flag' type-id='type-id-12' visibility='default' filepath='../../lib/libspl/include/sys/dklabel.h' line='105' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='Byte' type-id='type-id-13' filepath='/usr/include/zconf.h' line='391' column='1' id='type-id-14'/>
    <typedef-decl name='uInt' type-id='type-id-15' filepath='/usr/include/zconf.h' line='393' column='1' id='type-id-16'/>
    <typedef-decl name='uLong' type-id='type-id-10' filepath='/usr/include/zconf.h' line='394' column='1' id='type-id-17'/>
    <typedef-decl name='Bytef' type-id='type-id-14' filepath='/usr/include/zconf.h' line='400' column='1' id='type-id-18'/>
    <qualified-type-def type-id='type-id-18' const='yes' id='type-id-19'/>
    <pointer-type-def type-id='type-id-19' size-in-bits='64' id='type-id-20'/>
    <qualified-type-def type-id='type-id-13' const='yes' id='type-id-21'/>
    <pointer-type-def type-id='type-id-21' size-in-bits='64' id='type-id-22'/>
    <pointer-type-def type-id='type-id-13' size-in-bits='64' id='type-id-23'/>
    <var-decl name='default_vtoc_map' type-id='type-id-9' mangled-name='default_vtoc_map' visibility='default' filepath='/home/hutter2/release20/lib/libefi/rdwr_efi.c' line='146' column='1' elf-symbol-id='default_vtoc_map'/>
    <var-decl name='efi_debug' type-id='type-id-4' mangled-name='efi_debug' visibility='default' filepath='/home/hutter2/release20/lib/libefi/rdwr_efi.c' line='177' column='1' elf-symbol-id='efi_debug'/>
    <function-decl name='efi_alloc_and_read' mangled-name='efi_alloc_and_read' filepath='/home/hutter2/release20/lib/libefi/rdwr_efi.c' line='439' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_alloc_and_read'>
      <parameter type-id='type-id-4' name='fd' filepath='/home/hutter2/release20/lib/libefi/rdwr_efi.c' line='439' column='1'/>
      <parameter type-id='type-id-24' name='vtoc' filepath='/home/hutter2/release20/lib/libefi/rdwr_efi.c' line='439' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='efi_rescan' mangled-name='efi_rescan' filepath='/home/hutter2/release20/lib/libefi/rdwr_efi.c' line='601' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_rescan'>
      <parameter type-id='type-id-4' name='fd' filepath='/home/hutter2/release20/lib/libefi/rdwr_efi.c' line='601' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='efi_use_whole_disk' mangled-name='efi_use_whole_disk' filepath='/home/hutter2/release20/lib/libefi/rdwr_efi.c' line='1154' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_use_whole_disk'>
      <parameter type-id='type-id-4' name='fd' filepath='/home/hutter2/release20/lib/libefi/rdwr_efi.c' line='1154' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='efi_write' mangled-name='efi_write' filepath='/home/hutter2/release20/lib/libefi/rdwr_efi.c' line='1370' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_write'>
      <parameter type-id='type-id-4' name='fd' filepath='/home/hutter2/release20/lib/libefi/rdwr_efi.c' line='1370' column='1'/>
      <parameter type-id='type-id-25' name='vtoc' filepath='/home/hutter2/release20/lib/libefi/rdwr_efi.c' line='1370' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='efi_type' mangled-name='efi_type' filepath='/home/hutter2/release20/lib/libefi/rdwr_efi.c' line='1584' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_type'>
      <parameter type-id='type-id-4' name='fd' filepath='/home/hutter2/release20/lib/libefi/rdwr_efi.c' line='1584' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='efi_err_check' mangled-name='efi_err_check' filepath='/home/hutter2/release20/lib/libefi/rdwr_efi.c' line='1606' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_err_check'>
      <parameter type-id='type-id-25' name='vtoc' filepath='/home/hutter2/release20/lib/libefi/rdwr_efi.c' line='1606' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='write' filepath='/usr/include/unistd.h' line='367' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-26'/>
      <return type-id='type-id-27'/>
    </function-decl>
    <function-decl name='fsync' filepath='/usr/include/unistd.h' line='968' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='uuid_generate' filepath='/usr/include/uuid/uuid.h' line='90' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-23'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='uuid_is_null' filepath='/usr/include/uuid/uuid.h' line='99' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-22'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='crc32' filepath='/usr/include/zlib.h' line='1726' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-20'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-10'/>
  </abi-instr>
  <abi-instr address-size='64' path='assert.c' comp-dir-path='/home/hutter2/release20/lib/libspl' language='LANG_C99'>
    <var-decl name='aok' type-id='type-id-4' mangled-name='aok' visibility='default' filepath='../../lib/libspl/include/assert.h' line='37' column='1' elf-symbol-id='aok'/>
    <function-decl name='vfprintf' filepath='/usr/include/stdio.h' line='341' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-28'/>
      <parameter type-id='type-id-29'/>
      <parameter type-id='type-id-30'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='abort' filepath='/usr/include/stdlib.h' line='591' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-5'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='list.c' comp-dir-path='/home/hutter2/release20/lib/libspl' language='LANG_C99'>
    <typedef-decl name='list_node_t' type-id='type-id-31' filepath='../../lib/libspl/include/sys/list.h' line='35' column='1' id='type-id-32'/>
    <typedef-decl name='list_t' type-id='type-id-33' filepath='../../lib/libspl/include/sys/list.h' line='36' column='1' id='type-id-34'/>
    <class-decl name='list_node' size-in-bits='128' is-struct='yes' visibility='default' filepath='../../lib/libspl/include/sys/list_impl.h' line='36' column='1' id='type-id-31'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-35' visibility='default' filepath='../../lib/libspl/include/sys/list_impl.h' line='37' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='prev' type-id='type-id-35' visibility='default' filepath='../../lib/libspl/include/sys/list_impl.h' line='38' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='list' size-in-bits='256' is-struct='yes' visibility='default' filepath='../../lib/libspl/include/sys/list_impl.h' line='41' column='1' id='type-id-33'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='list_size' type-id='type-id-26' visibility='default' filepath='../../lib/libspl/include/sys/list_impl.h' line='42' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='list_offset' type-id='type-id-26' visibility='default' filepath='../../lib/libspl/include/sys/list_impl.h' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='list_head' type-id='type-id-31' visibility='default' filepath='../../lib/libspl/include/sys/list_impl.h' line='44' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-31' size-in-bits='64' id='type-id-35'/>
    <pointer-type-def type-id='type-id-32' size-in-bits='64' id='type-id-36'/>
    <pointer-type-def type-id='type-id-34' size-in-bits='64' id='type-id-37'/>
    <function-decl name='list_create' mangled-name='list_create' filepath='/home/hutter2/release20/lib/libspl/list.c' line='62' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_create'>
      <parameter type-id='type-id-37' name='list' filepath='/home/hutter2/release20/lib/libspl/list.c' line='62' column='1'/>
      <parameter type-id='type-id-26' name='size' filepath='/home/hutter2/release20/lib/libspl/list.c' line='62' column='1'/>
      <parameter type-id='type-id-26' name='offset' filepath='/home/hutter2/release20/lib/libspl/list.c' line='62' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='list_destroy' mangled-name='list_destroy' filepath='/home/hutter2/release20/lib/libspl/list.c' line='74' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_destroy'>
      <parameter type-id='type-id-37' name='list' filepath='/home/hutter2/release20/lib/libspl/list.c' line='74' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='list_insert_after' mangled-name='list_insert_after' filepath='/home/hutter2/release20/lib/libspl/list.c' line='86' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_insert_after'>
      <parameter type-id='type-id-37' name='list' filepath='/home/hutter2/release20/lib/libspl/list.c' line='86' column='1'/>
      <parameter type-id='type-id-2' name='object' filepath='/home/hutter2/release20/lib/libspl/list.c' line='86' column='1'/>
      <parameter type-id='type-id-2' name='nobject' filepath='/home/hutter2/release20/lib/libspl/list.c' line='86' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='list_insert_before' mangled-name='list_insert_before' filepath='/home/hutter2/release20/lib/libspl/list.c' line='97' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_insert_before'>
      <parameter type-id='type-id-37' name='list' filepath='/home/hutter2/release20/lib/libspl/list.c' line='97' column='1'/>
      <parameter type-id='type-id-2' name='object' filepath='/home/hutter2/release20/lib/libspl/list.c' line='97' column='1'/>
      <parameter type-id='type-id-2' name='nobject' filepath='/home/hutter2/release20/lib/libspl/list.c' line='97' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='list_insert_head' mangled-name='list_insert_head' filepath='/home/hutter2/release20/lib/libspl/list.c' line='108' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_insert_head'>
      <parameter type-id='type-id-37' name='list' filepath='/home/hutter2/release20/lib/libspl/list.c' line='108' column='1'/>
      <parameter type-id='type-id-2' name='object' filepath='/home/hutter2/release20/lib/libspl/list.c' line='108' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='list_insert_tail' mangled-name='list_insert_tail' filepath='/home/hutter2/release20/lib/libspl/list.c' line='115' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_insert_tail'>
      <parameter type-id='type-id-37' name='list' filepath='/home/hutter2/release20/lib/libspl/list.c' line='115' column='1'/>
      <parameter type-id='type-id-2' name='object' filepath='/home/hutter2/release20/lib/libspl/list.c' line='115' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='list_remove' mangled-name='list_remove' filepath='/home/hutter2/release20/lib/libspl/list.c' line='122' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_remove'>
      <parameter type-id='type-id-37' name='list' filepath='/home/hutter2/release20/lib/libspl/list.c' line='122' column='1'/>
      <parameter type-id='type-id-2' name='object' filepath='/home/hutter2/release20/lib/libspl/list.c' line='122' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='list_remove_head' mangled-name='list_remove_head' filepath='/home/hutter2/release20/lib/libspl/list.c' line='131' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_remove_head'>
      <parameter type-id='type-id-37' name='list' filepath='/home/hutter2/release20/lib/libspl/list.c' line='131' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='list_remove_tail' mangled-name='list_remove_tail' filepath='/home/hutter2/release20/lib/libspl/list.c' line='141' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_remove_tail'>
      <parameter type-id='type-id-37' name='list' filepath='/home/hutter2/release20/lib/libspl/list.c' line='141' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='list_head' mangled-name='list_head' filepath='/home/hutter2/release20/lib/libspl/list.c' line='151' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_head'>
      <parameter type-id='type-id-37' name='list' filepath='/home/hutter2/release20/lib/libspl/list.c' line='151' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='list_tail' mangled-name='list_tail' filepath='/home/hutter2/release20/lib/libspl/list.c' line='159' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_tail'>
      <parameter type-id='type-id-37' name='list' filepath='/home/hutter2/release20/lib/libspl/list.c' line='159' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='list_next' mangled-name='list_next' filepath='/home/hutter2/release20/lib/libspl/list.c' line='167' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_next'>
      <parameter type-id='type-id-37' name='list' filepath='/home/hutter2/release20/lib/libspl/list.c' line='167' column='1'/>
      <parameter type-id='type-id-2' name='object' filepath='/home/hutter2/release20/lib/libspl/list.c' line='167' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='list_prev' mangled-name='list_prev' filepath='/home/hutter2/release20/lib/libspl/list.c' line='178' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_prev'>
      <parameter type-id='type-id-37' name='list' filepath='/home/hutter2/release20/lib/libspl/list.c' line='178' column='1'/>
      <parameter type-id='type-id-2' name='object' filepath='/home/hutter2/release20/lib/libspl/list.c' line='178' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='list_move_tail' mangled-name='list_move_tail' filepath='/home/hutter2/release20/lib/libspl/list.c' line='192' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_move_tail'>
      <parameter type-id='type-id-37' name='dst' filepath='/home/hutter2/release20/lib/libspl/list.c' line='192' column='1'/>
      <parameter type-id='type-id-37' name='src' filepath='/home/hutter2/release20/lib/libspl/list.c' line='192' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='list_link_replace' mangled-name='list_link_replace' filepath='/home/hutter2/release20/lib/libspl/list.c' line='213' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_link_replace'>
      <parameter type-id='type-id-36' name='lold' filepath='/home/hutter2/release20/lib/libspl/list.c' line='213' column='1'/>
      <parameter type-id='type-id-36' name='lnew' filepath='/home/hutter2/release20/lib/libspl/list.c' line='213' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='list_link_init' mangled-name='list_link_init' filepath='/home/hutter2/release20/lib/libspl/list.c' line='226' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_link_init'>
      <parameter type-id='type-id-36' name='ln' filepath='/home/hutter2/release20/lib/libspl/list.c' line='226' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='list_link_active' mangled-name='list_link_active' filepath='/home/hutter2/release20/lib/libspl/list.c' line='233' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_link_active'>
      <parameter type-id='type-id-36' name='ln' filepath='/home/hutter2/release20/lib/libspl/list.c' line='233' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='list_is_empty' mangled-name='list_is_empty' filepath='/home/hutter2/release20/lib/libspl/list.c' line='240' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_is_empty'>
      <parameter type-id='type-id-37' name='list' filepath='/home/hutter2/release20/lib/libspl/list.c' line='240' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='mkdirp.c' comp-dir-path='/home/hutter2/release20/lib/libspl' language='LANG_C99'>
    <typedef-decl name='mode_t' type-id='type-id-38' filepath='/usr/include/sys/types.h' line='69' column='1' id='type-id-39'/>
    <typedef-decl name='wchar_t' type-id='type-id-4' filepath='/usr/lib/gcc/x86_64-redhat-linux/10/include/stddef.h' line='321' column='1' id='type-id-40'/>
    <qualified-type-def type-id='type-id-40' const='yes' id='type-id-41'/>
    <pointer-type-def type-id='type-id-41' size-in-bits='64' id='type-id-42'/>
    <qualified-type-def type-id='type-id-42' restrict='yes' id='type-id-43'/>
    <pointer-type-def type-id='type-id-40' size-in-bits='64' id='type-id-44'/>
    <qualified-type-def type-id='type-id-44' restrict='yes' id='type-id-45'/>
    <function-decl name='mkdirp' mangled-name='mkdirp' filepath='/home/hutter2/release20/lib/libspl/mkdirp.c' line='50' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='mkdirp'>
      <parameter type-id='type-id-46' name='d' filepath='/home/hutter2/release20/lib/libspl/mkdirp.c' line='50' column='1'/>
      <parameter type-id='type-id-39' name='mode' filepath='/home/hutter2/release20/lib/libspl/mkdirp.c' line='50' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='mbstowcs' filepath='/usr/include/stdlib.h' line='933' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-45'/>
      <parameter type-id='type-id-29'/>
      <parameter type-id='type-id-26'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='wcstombs' filepath='/usr/include/stdlib.h' line='937' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-47'/>
      <parameter type-id='type-id-43'/>
      <parameter type-id='type-id-26'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='mkdir' filepath='/usr/include/sys/stat.h' line='317' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-46'/>
      <parameter type-id='type-id-38'/>
      <return type-id='type-id-4'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='os/linux/getexecname.c' comp-dir-path='/home/hutter2/release20/lib/libspl' language='LANG_C99'>
    <function-decl name='getexecname' mangled-name='getexecname' filepath='os/linux/getexecname.c' line='35' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getexecname'>
      <return type-id='type-id-46'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='os/linux/gethostid.c' comp-dir-path='/home/hutter2/release20/lib/libspl' language='LANG_C99'>
    <function-decl name='get_system_hostid' mangled-name='get_system_hostid' filepath='os/linux/gethostid.c' line='61' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='get_system_hostid'>
      <return type-id='type-id-10'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='os/linux/getmntany.c' comp-dir-path='/home/hutter2/release20/lib/libspl' language='LANG_C99'>
    <array-type-def dimensions='1' type-id='type-id-48' size-in-bits='32880' id='type-id-49'>
      <subrange length='4110' type-id='type-id-10' id='type-id-50'/>
    </array-type-def>
    <class-decl name='mnttab' size-in-bits='256' is-struct='yes' visibility='default' filepath='../../lib/libspl/include/os/linux/sys/mnttab.h' line='49' column='1' id='type-id-51'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mnt_special' type-id='type-id-52' visibility='default' filepath='../../lib/libspl/include/os/linux/sys/mnttab.h' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='mnt_mountp' type-id='type-id-52' visibility='default' filepath='../../lib/libspl/include/os/linux/sys/mnttab.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='mnt_fstype' type-id='type-id-52' visibility='default' filepath='../../lib/libspl/include/os/linux/sys/mnttab.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='mnt_mntopts' type-id='type-id-52' visibility='default' filepath='../../lib/libspl/include/os/linux/sys/mnttab.h' line='53' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='extmnttab' size-in-bits='320' is-struct='yes' visibility='default' filepath='../../lib/libspl/include/os/linux/sys/mnttab.h' line='62' column='1' id='type-id-53'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mnt_special' type-id='type-id-52' visibility='default' filepath='../../lib/libspl/include/os/linux/sys/mnttab.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='mnt_mountp' type-id='type-id-52' visibility='default' filepath='../../lib/libspl/include/os/linux/sys/mnttab.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='mnt_fstype' type-id='type-id-52' visibility='default' filepath='../../lib/libspl/include/os/linux/sys/mnttab.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='mnt_mntopts' type-id='type-id-52' visibility='default' filepath='../../lib/libspl/include/os/linux/sys/mnttab.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='mnt_major' type-id='type-id-54' visibility='default' filepath='../../lib/libspl/include/os/linux/sys/mnttab.h' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='mnt_minor' type-id='type-id-54' visibility='default' filepath='../../lib/libspl/include/os/linux/sys/mnttab.h' line='68' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='mntent' size-in-bits='320' is-struct='yes' visibility='default' filepath='/usr/include/mntent.h' line='51' column='1' id='type-id-55'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mnt_fsname' type-id='type-id-52' visibility='default' filepath='/usr/include/mntent.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='mnt_dir' type-id='type-id-52' visibility='default' filepath='/usr/include/mntent.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='mnt_type' type-id='type-id-52' visibility='default' filepath='/usr/include/mntent.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='mnt_opts' type-id='type-id-52' visibility='default' filepath='/usr/include/mntent.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='mnt_freq' type-id='type-id-4' visibility='default' filepath='/usr/include/mntent.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='mnt_passno' type-id='type-id-4' visibility='default' filepath='/usr/include/mntent.h' line='58' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-53' size-in-bits='64' id='type-id-56'/>
    <pointer-type-def type-id='type-id-55' size-in-bits='64' id='type-id-57'/>
    <qualified-type-def type-id='type-id-57' restrict='yes' id='type-id-58'/>
    <pointer-type-def type-id='type-id-51' size-in-bits='64' id='type-id-59'/>
    <function-decl name='getmntent_r' filepath='/usr/include/mntent.h' line='73' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-28'/>
      <parameter type-id='type-id-58'/>
      <parameter type-id='type-id-47'/>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-57'/>
    </function-decl>
    <function-decl name='feof' filepath='/usr/include/stdio.h' line='764' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-60'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <var-decl name='buf' type-id='type-id-49' mangled-name='buf' visibility='default' filepath='os/linux/getmntany.c' line='44' column='1' elf-symbol-id='buf'/>
    <function-decl name='getmntany' mangled-name='getmntany' filepath='os/linux/getmntany.c' line='51' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getmntany'>
      <parameter type-id='type-id-60' name='fp' filepath='os/linux/getmntany.c' line='51' column='1'/>
      <parameter type-id='type-id-59' name='mgetp' filepath='os/linux/getmntany.c' line='51' column='1'/>
      <parameter type-id='type-id-59' name='mrefp' filepath='os/linux/getmntany.c' line='51' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_sol_getmntent' mangled-name='_sol_getmntent' filepath='os/linux/getmntany.c' line='64' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_sol_getmntent'>
      <parameter type-id='type-id-60' name='fp' filepath='os/linux/getmntany.c' line='64' column='1'/>
      <parameter type-id='type-id-59' name='mgetp' filepath='os/linux/getmntany.c' line='64' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='getextmntent' mangled-name='getextmntent' filepath='os/linux/getmntany.c' line='106' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getextmntent'>
      <parameter type-id='type-id-46' name='path' filepath='os/linux/getmntany.c' line='106' column='1'/>
      <parameter type-id='type-id-56' name='entry' filepath='os/linux/getmntany.c' line='106' column='1'/>
      <parameter type-id='type-id-61' name='statbuf' filepath='os/linux/getmntany.c' line='106' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='os/linux/zone.c' comp-dir-path='/home/hutter2/release20/lib/libspl' language='LANG_C99'>
    <typedef-decl name='zoneid_t' type-id='type-id-4' filepath='../../lib/libspl/include/sys/types.h' line='47' column='1' id='type-id-62'/>
    <function-decl name='getzoneid' mangled-name='getzoneid' filepath='os/linux/zone.c' line='29' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getzoneid'>
      <return type-id='type-id-62'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='page.c' comp-dir-path='/home/hutter2/release20/lib/libspl' language='LANG_C99'>
    <var-decl name='pagesize' type-id='type-id-26' mangled-name='pagesize' visibility='default' filepath='/home/hutter2/release20/lib/libspl/page.c' line='25' column='1' elf-symbol-id='pagesize'/>
  </abi-instr>
  <abi-instr address-size='64' path='strlcat.c' comp-dir-path='/home/hutter2/release20/lib/libspl' language='LANG_C99'>
    <function-decl name='memcpy' filepath='/usr/include/string.h' line='43' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-26'/>
      <return type-id='type-id-2'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='timestamp.c' comp-dir-path='/home/hutter2/release20/lib/libspl' language='LANG_C99'>
    <class-decl name='tm' size-in-bits='448' is-struct='yes' visibility='default' filepath='/usr/include/bits/types/struct_tm.h' line='7' column='1' id='type-id-63'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tm_sec' type-id='type-id-4' visibility='default' filepath='/usr/include/bits/types/struct_tm.h' line='9' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='tm_min' type-id='type-id-4' visibility='default' filepath='/usr/include/bits/types/struct_tm.h' line='10' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tm_hour' type-id='type-id-4' visibility='default' filepath='/usr/include/bits/types/struct_tm.h' line='11' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='tm_mday' type-id='type-id-4' visibility='default' filepath='/usr/include/bits/types/struct_tm.h' line='12' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='tm_mon' type-id='type-id-4' visibility='default' filepath='/usr/include/bits/types/struct_tm.h' line='13' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='tm_year' type-id='type-id-4' visibility='default' filepath='/usr/include/bits/types/struct_tm.h' line='14' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='tm_wday' type-id='type-id-4' visibility='default' filepath='/usr/include/bits/types/struct_tm.h' line='15' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='tm_yday' type-id='type-id-4' visibility='default' filepath='/usr/include/bits/types/struct_tm.h' line='16' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='tm_isdst' type-id='type-id-4' visibility='default' filepath='/usr/include/bits/types/struct_tm.h' line='17' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='tm_gmtoff' type-id='type-id-64' visibility='default' filepath='/usr/include/bits/types/struct_tm.h' line='20' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='tm_zone' type-id='type-id-46' visibility='default' filepath='/usr/include/bits/types/struct_tm.h' line='21' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='time_t' type-id='type-id-65' filepath='/usr/include/bits/types/time_t.h' line='7' column='1' id='type-id-66'/>
    <typedef-decl name='nl_item' type-id='type-id-4' filepath='/usr/include/nl_types.h' line='36' column='1' id='type-id-67'/>
    <qualified-type-def type-id='type-id-66' const='yes' id='type-id-68'/>
    <pointer-type-def type-id='type-id-68' size-in-bits='64' id='type-id-69'/>
    <qualified-type-def type-id='type-id-63' const='yes' id='type-id-70'/>
    <pointer-type-def type-id='type-id-70' size-in-bits='64' id='type-id-71'/>
    <qualified-type-def type-id='type-id-71' restrict='yes' id='type-id-72'/>
    <pointer-type-def type-id='type-id-66' size-in-bits='64' id='type-id-73'/>
    <pointer-type-def type-id='type-id-63' size-in-bits='64' id='type-id-74'/>
    <function-decl name='print_timestamp' mangled-name='print_timestamp' filepath='/home/hutter2/release20/lib/libspl/timestamp.c' line='44' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='print_timestamp'>
      <parameter type-id='type-id-54' name='timestamp_fmt' filepath='/home/hutter2/release20/lib/libspl/timestamp.c' line='44' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nl_langinfo' filepath='/usr/include/langinfo.h' line='661' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-67'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='time' filepath='/usr/include/time.h' line='75' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-73'/>
      <return type-id='type-id-66'/>
    </function-decl>
    <function-decl name='strftime' filepath='/usr/include/time.h' line='88' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-47'/>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-29'/>
      <parameter type-id='type-id-72'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='localtime' filepath='/usr/include/time.h' line='123' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-69'/>
      <return type-id='type-id-74'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='thread_pool.c' comp-dir-path='/home/hutter2/release20/lib/libtpool' language='LANG_C99'>
    <array-type-def dimensions='1' type-id='type-id-75' size-in-bits='576' id='type-id-76'>
      <subrange length='1' type-id='type-id-10' id='type-id-77'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-78' size-in-bits='1024' id='type-id-79'>
      <subrange length='16' type-id='type-id-10' id='type-id-11'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-48' size-in-bits='384' id='type-id-80'>
      <subrange length='48' type-id='type-id-10' id='type-id-81'/>
    </array-type-def>
    <class-decl name='__jmp_buf_tag' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-82'/>
    <array-type-def dimensions='1' type-id='type-id-64' size-in-bits='512' id='type-id-83'>
      <subrange length='8' type-id='type-id-10' id='type-id-84'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-15' size-in-bits='64' id='type-id-85'>
      <subrange length='2' type-id='type-id-10' id='type-id-86'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-10' size-in-bits='1024' id='type-id-87'>
      <subrange length='16' type-id='type-id-10' id='type-id-11'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-2' size-in-bits='256' id='type-id-88'>
      <subrange length='4' type-id='type-id-10' id='type-id-89'/>
    </array-type-def>
    <typedef-decl name='tpool_job_t' type-id='type-id-90' filepath='/home/hutter2/release20/lib/libtpool/thread_pool_impl.h' line='44' column='1' id='type-id-91'/>
    <class-decl name='tpool_job' size-in-bits='192' is-struct='yes' visibility='default' filepath='/home/hutter2/release20/lib/libtpool/thread_pool_impl.h' line='45' column='1' id='type-id-90'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tpj_next' type-id='type-id-92' visibility='default' filepath='/home/hutter2/release20/lib/libtpool/thread_pool_impl.h' line='46' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tpj_func' type-id='type-id-93' visibility='default' filepath='/home/hutter2/release20/lib/libtpool/thread_pool_impl.h' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='tpj_arg' type-id='type-id-2' visibility='default' filepath='/home/hutter2/release20/lib/libtpool/thread_pool_impl.h' line='48' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='tpool_active_t' type-id='type-id-94' filepath='/home/hutter2/release20/lib/libtpool/thread_pool_impl.h' line='54' column='1' id='type-id-95'/>
    <class-decl name='tpool_active' size-in-bits='128' is-struct='yes' visibility='default' filepath='/home/hutter2/release20/lib/libtpool/thread_pool_impl.h' line='55' column='1' id='type-id-94'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tpa_next' type-id='type-id-96' visibility='default' filepath='/home/hutter2/release20/lib/libtpool/thread_pool_impl.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tpa_tid' type-id='type-id-97' visibility='default' filepath='/home/hutter2/release20/lib/libtpool/thread_pool_impl.h' line='57' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__cpu_mask' type-id='type-id-10' filepath='/usr/include/bits/cpu-set.h' line='32' column='1' id='type-id-78'/>
    <class-decl name='cpu_set_t' size-in-bits='1024' is-struct='yes' naming-typedef-id='type-id-98' visibility='default' filepath='/usr/include/bits/cpu-set.h' line='39' column='1' id='type-id-99'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__bits' type-id='type-id-79' visibility='default' filepath='/usr/include/bits/cpu-set.h' line='41' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='cpu_set_t' type-id='type-id-99' filepath='/usr/include/bits/cpu-set.h' line='42' column='1' id='type-id-98'/>
    <typedef-decl name='pthread_t' type-id='type-id-10' filepath='/usr/include/bits/pthreadtypes.h' line='27' column='1' id='type-id-97'/>
    <union-decl name='pthread_condattr_t' size-in-bits='32' naming-typedef-id='type-id-100' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='41' column='1' id='type-id-101'>
      <data-member access='public'>
        <var-decl name='__size' type-id='type-id-102' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='43' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__align' type-id='type-id-4' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='44' column='1'/>
      </data-member>
    </union-decl>
    <typedef-decl name='pthread_condattr_t' type-id='type-id-101' filepath='/usr/include/bits/pthreadtypes.h' line='45' column='1' id='type-id-100'/>
    <union-decl name='pthread_cond_t' size-in-bits='384' naming-typedef-id='type-id-103' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='75' column='1' id='type-id-104'>
      <data-member access='public'>
        <var-decl name='__data' type-id='type-id-105' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='77' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__size' type-id='type-id-80' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='78' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__align' type-id='type-id-106' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='79' column='1'/>
      </data-member>
    </union-decl>
    <typedef-decl name='pthread_cond_t' type-id='type-id-104' filepath='/usr/include/bits/pthreadtypes.h' line='80' column='1' id='type-id-103'/>
    <typedef-decl name='__jmp_buf' type-id='type-id-83' filepath='/usr/include/bits/setjmp.h' line='31' column='1' id='type-id-107'/>
    <class-decl name='__pthread_cond_s' size-in-bits='384' is-struct='yes' visibility='default' filepath='/usr/include/bits/thread-shared-types.h' line='92' column='1' id='type-id-105'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='' type-id='type-id-108' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='' type-id='type-id-109' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='__g_refs' type-id='type-id-85' visibility='default' filepath='/usr/include/bits/thread-shared-types.h' line='112' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='__g_size' type-id='type-id-85' visibility='default' filepath='/usr/include/bits/thread-shared-types.h' line='113' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='__g1_orig_size' type-id='type-id-15' visibility='default' filepath='/usr/include/bits/thread-shared-types.h' line='114' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='__wrefs' type-id='type-id-15' visibility='default' filepath='/usr/include/bits/thread-shared-types.h' line='115' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='__g_signals' type-id='type-id-85' visibility='default' filepath='/usr/include/bits/thread-shared-types.h' line='116' column='1'/>
      </data-member>
    </class-decl>
    <union-decl name='__anonymous_union__1' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='/usr/include/bits/thread-shared-types.h' line='94' column='1' id='type-id-108'>
      <data-member access='public'>
        <var-decl name='__wseq' type-id='type-id-110' visibility='default' filepath='/usr/include/bits/thread-shared-types.h' line='96' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__wseq32' type-id='type-id-111' visibility='default' filepath='/usr/include/bits/thread-shared-types.h' line='101' column='1'/>
      </data-member>
    </union-decl>
    <class-decl name='__anonymous_struct__1' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/bits/thread-shared-types.h' line='97' column='1' id='type-id-111'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__low' type-id='type-id-15' visibility='default' filepath='/usr/include/bits/thread-shared-types.h' line='99' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='__high' type-id='type-id-15' visibility='default' filepath='/usr/include/bits/thread-shared-types.h' line='100' column='1'/>
      </data-member>
    </class-decl>
    <union-decl name='__anonymous_union__2' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='/usr/include/bits/thread-shared-types.h' line='103' column='1' id='type-id-109'>
      <data-member access='public'>
        <var-decl name='__g1_start' type-id='type-id-110' visibility='default' filepath='/usr/include/bits/thread-shared-types.h' line='105' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__g1_start32' type-id='type-id-111' visibility='default' filepath='/usr/include/bits/thread-shared-types.h' line='110' column='1'/>
      </data-member>
    </union-decl>
    <class-decl name='__sigset_t' size-in-bits='1024' is-struct='yes' naming-typedef-id='type-id-112' visibility='default' filepath='/usr/include/bits/types/__sigset_t.h' line='5' column='1' id='type-id-113'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__val' type-id='type-id-87' visibility='default' filepath='/usr/include/bits/types/__sigset_t.h' line='7' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__sigset_t' type-id='type-id-113' filepath='/usr/include/bits/types/__sigset_t.h' line='8' column='1' id='type-id-112'/>
    <class-decl name='sched_param' size-in-bits='32' is-struct='yes' visibility='default' filepath='/usr/include/bits/types/struct_sched_param.h' line='23' column='1' id='type-id-114'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sched_priority' type-id='type-id-4' visibility='default' filepath='/usr/include/bits/types/struct_sched_param.h' line='25' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__pthread_unwind_buf_t' size-in-bits='832' is-struct='yes' naming-typedef-id='type-id-115' visibility='default' filepath='/usr/include/pthread.h' line='514' column='1' id='type-id-116'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__cancel_jmp_buf' type-id='type-id-76' visibility='default' filepath='/usr/include/pthread.h' line='520' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='__pad' type-id='type-id-88' visibility='default' filepath='/usr/include/pthread.h' line='521' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__1' size-in-bits='576' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/pthread.h' line='516' column='1' id='type-id-75'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__cancel_jmp_buf' type-id='type-id-107' visibility='default' filepath='/usr/include/pthread.h' line='518' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='__mask_was_saved' type-id='type-id-4' visibility='default' filepath='/usr/include/pthread.h' line='519' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__pthread_unwind_buf_t' type-id='type-id-116' filepath='/usr/include/pthread.h' line='522' column='1' id='type-id-115'/>
    <pointer-type-def type-id='type-id-82' size-in-bits='64' id='type-id-117'/>
    <pointer-type-def type-id='type-id-115' size-in-bits='64' id='type-id-118'/>
    <pointer-type-def type-id='type-id-112' size-in-bits='64' id='type-id-119'/>
    <qualified-type-def type-id='type-id-119' restrict='yes' id='type-id-120'/>
    <qualified-type-def type-id='type-id-112' const='yes' id='type-id-121'/>
    <pointer-type-def type-id='type-id-121' size-in-bits='64' id='type-id-122'/>
    <qualified-type-def type-id='type-id-122' restrict='yes' id='type-id-123'/>
    <qualified-type-def type-id='type-id-98' const='yes' id='type-id-124'/>
    <pointer-type-def type-id='type-id-124' size-in-bits='64' id='type-id-125'/>
    <qualified-type-def type-id='type-id-126' const='yes' id='type-id-127'/>
    <pointer-type-def type-id='type-id-127' size-in-bits='64' id='type-id-128'/>
    <qualified-type-def type-id='type-id-128' restrict='yes' id='type-id-129'/>
    <qualified-type-def type-id='type-id-100' const='yes' id='type-id-130'/>
    <pointer-type-def type-id='type-id-130' size-in-bits='64' id='type-id-131'/>
    <qualified-type-def type-id='type-id-131' restrict='yes' id='type-id-132'/>
    <qualified-type-def type-id='type-id-114' const='yes' id='type-id-133'/>
    <pointer-type-def type-id='type-id-133' size-in-bits='64' id='type-id-134'/>
    <qualified-type-def type-id='type-id-134' restrict='yes' id='type-id-135'/>
    <qualified-type-def type-id='type-id-136' const='yes' id='type-id-137'/>
    <pointer-type-def type-id='type-id-137' size-in-bits='64' id='type-id-138'/>
    <qualified-type-def type-id='type-id-138' restrict='yes' id='type-id-139'/>
    <pointer-type-def type-id='type-id-98' size-in-bits='64' id='type-id-140'/>
    <qualified-type-def type-id='type-id-141' restrict='yes' id='type-id-142'/>
    <qualified-type-def type-id='type-id-143' restrict='yes' id='type-id-144'/>
    <pointer-type-def type-id='type-id-103' size-in-bits='64' id='type-id-145'/>
    <qualified-type-def type-id='type-id-145' restrict='yes' id='type-id-146'/>
    <qualified-type-def type-id='type-id-147' restrict='yes' id='type-id-148'/>
    <pointer-type-def type-id='type-id-97' size-in-bits='64' id='type-id-149'/>
    <qualified-type-def type-id='type-id-149' restrict='yes' id='type-id-150'/>
    <pointer-type-def type-id='type-id-114' size-in-bits='64' id='type-id-151'/>
    <qualified-type-def type-id='type-id-151' restrict='yes' id='type-id-152'/>
    <qualified-type-def type-id='type-id-153' restrict='yes' id='type-id-154'/>
    <pointer-type-def type-id='type-id-95' size-in-bits='64' id='type-id-96'/>
    <pointer-type-def type-id='type-id-91' size-in-bits='64' id='type-id-92'/>
    <pointer-type-def type-id='type-id-155' size-in-bits='64' id='type-id-156'/>
    <qualified-type-def type-id='type-id-2' restrict='yes' id='type-id-157'/>
    <qualified-type-def type-id='type-id-158' restrict='yes' id='type-id-159'/>
    <class-decl name='__jmp_buf_tag' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-82'/>
    <function-decl name='tpool_abandon' mangled-name='tpool_abandon' filepath='/home/hutter2/release20/lib/libtpool/thread_pool.c' line='497' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='tpool_abandon'>
      <parameter type-id='type-id-160' name='tpool' filepath='/home/hutter2/release20/lib/libtpool/thread_pool.c' line='497' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='tpool_suspend' mangled-name='tpool_suspend' filepath='/home/hutter2/release20/lib/libtpool/thread_pool.c' line='536' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='tpool_suspend'>
      <parameter type-id='type-id-160' name='tpool' filepath='/home/hutter2/release20/lib/libtpool/thread_pool.c' line='536' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='tpool_suspended' mangled-name='tpool_suspended' filepath='/home/hutter2/release20/lib/libtpool/thread_pool.c' line='546' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='tpool_suspended'>
      <parameter type-id='type-id-160' name='tpool' filepath='/home/hutter2/release20/lib/libtpool/thread_pool.c' line='546' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='tpool_resume' mangled-name='tpool_resume' filepath='/home/hutter2/release20/lib/libtpool/thread_pool.c' line='560' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='tpool_resume'>
      <parameter type-id='type-id-160' name='tpool' filepath='/home/hutter2/release20/lib/libtpool/thread_pool.c' line='560' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='tpool_member' mangled-name='tpool_member' filepath='/home/hutter2/release20/lib/libtpool/thread_pool.c' line='583' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='tpool_member'>
      <parameter type-id='type-id-160' name='tpool' filepath='/home/hutter2/release20/lib/libtpool/thread_pool.c' line='583' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='pthread_sigmask' filepath='/usr/include/bits/sigthread.h' line='31' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-123'/>
      <parameter type-id='type-id-120'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='pthread_create' filepath='/usr/include/pthread.h' line='199' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-150'/>
      <parameter type-id='type-id-129'/>
      <parameter type-id='type-id-156'/>
      <parameter type-id='type-id-157'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='pthread_self' filepath='/usr/include/pthread.h' line='252' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-97'/>
    </function-decl>
    <function-decl name='pthread_attr_init' filepath='/usr/include/pthread.h' line='264' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-143'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='pthread_attr_destroy' filepath='/usr/include/pthread.h' line='267' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-143'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='pthread_attr_getdetachstate' filepath='/usr/include/pthread.h' line='271' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-128'/>
      <parameter type-id='type-id-141'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='pthread_attr_setdetachstate' filepath='/usr/include/pthread.h' line='276' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-143'/>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='pthread_attr_getguardsize' filepath='/usr/include/pthread.h' line='282' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-128'/>
      <parameter type-id='type-id-153'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='pthread_attr_setguardsize' filepath='/usr/include/pthread.h' line='287' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-143'/>
      <parameter type-id='type-id-26'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='pthread_attr_getschedparam' filepath='/usr/include/pthread.h' line='293' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-129'/>
      <parameter type-id='type-id-152'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='pthread_attr_setschedparam' filepath='/usr/include/pthread.h' line='298' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-144'/>
      <parameter type-id='type-id-135'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='pthread_attr_getschedpolicy' filepath='/usr/include/pthread.h' line='303' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-129'/>
      <parameter type-id='type-id-142'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='pthread_attr_setschedpolicy' filepath='/usr/include/pthread.h' line='308' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-143'/>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='pthread_attr_getinheritsched' filepath='/usr/include/pthread.h' line='312' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-129'/>
      <parameter type-id='type-id-142'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='pthread_attr_setinheritsched' filepath='/usr/include/pthread.h' line='317' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-143'/>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='pthread_attr_getscope' filepath='/usr/include/pthread.h' line='323' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-129'/>
      <parameter type-id='type-id-142'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='pthread_attr_setscope' filepath='/usr/include/pthread.h' line='328' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-143'/>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='pthread_attr_getstack' filepath='/usr/include/pthread.h' line='358' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-129'/>
      <parameter type-id='type-id-159'/>
      <parameter type-id='type-id-154'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='pthread_attr_setstack' filepath='/usr/include/pthread.h' line='366' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-143'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-26'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='pthread_attr_setaffinity_np' filepath='/usr/include/pthread.h' line='373' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-143'/>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-125'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='pthread_attr_getaffinity_np' filepath='/usr/include/pthread.h' line='380' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-128'/>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-140'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='pthread_setcancelstate' filepath='/usr/include/pthread.h' line='497' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-141'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='pthread_setcanceltype' filepath='/usr/include/pthread.h' line='501' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-141'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='pthread_cancel' filepath='/usr/include/pthread.h' line='504' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-97'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='__pthread_register_cancel' filepath='/usr/include/pthread.h' line='671' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-118'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='__pthread_unregister_cancel' filepath='/usr/include/pthread.h' line='683' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-118'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='__pthread_unwind_next' filepath='/usr/include/pthread.h' line='724' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-118'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='__sigsetjmp' filepath='/usr/include/pthread.h' line='734' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-117'/>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='pthread_cond_init' filepath='/usr/include/pthread.h' line='980' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-146'/>
      <parameter type-id='type-id-132'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='pthread_cond_signal' filepath='/usr/include/pthread.h' line='989' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-145'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='pthread_cond_broadcast' filepath='/usr/include/pthread.h' line='993' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-145'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='pthread_cond_wait' filepath='/usr/include/pthread.h' line='1001' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-146'/>
      <parameter type-id='type-id-148'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='pthread_cond_timedwait' filepath='/usr/include/pthread.h' line='1012' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-146'/>
      <parameter type-id='type-id-148'/>
      <parameter type-id='type-id-139'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-155'>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-2'/>
    </function-type>
    <pointer-type-def type-id='type-id-161' size-in-bits='64' id='type-id-160'/>
    <typedef-decl name='tpool_t' type-id='type-id-162' filepath='../../include/thread_pool.h' line='38' column='1' id='type-id-161'/>
    <class-decl name='tpool' size-in-bits='2496' is-struct='yes' visibility='default' filepath='/home/hutter2/release20/lib/libtpool/thread_pool_impl.h' line='63' column='1' id='type-id-162'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tp_forw' type-id='type-id-160' visibility='default' filepath='/home/hutter2/release20/lib/libtpool/thread_pool_impl.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tp_back' type-id='type-id-160' visibility='default' filepath='/home/hutter2/release20/lib/libtpool/thread_pool_impl.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='tp_mutex' type-id='type-id-163' visibility='default' filepath='/home/hutter2/release20/lib/libtpool/thread_pool_impl.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='tp_busycv' type-id='type-id-103' visibility='default' filepath='/home/hutter2/release20/lib/libtpool/thread_pool_impl.h' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='tp_workcv' type-id='type-id-103' visibility='default' filepath='/home/hutter2/release20/lib/libtpool/thread_pool_impl.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='tp_waitcv' type-id='type-id-103' visibility='default' filepath='/home/hutter2/release20/lib/libtpool/thread_pool_impl.h' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='tp_active' type-id='type-id-96' visibility='default' filepath='/home/hutter2/release20/lib/libtpool/thread_pool_impl.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='tp_head' type-id='type-id-92' visibility='default' filepath='/home/hutter2/release20/lib/libtpool/thread_pool_impl.h' line='71' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='tp_tail' type-id='type-id-92' visibility='default' filepath='/home/hutter2/release20/lib/libtpool/thread_pool_impl.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='tp_attr' type-id='type-id-126' visibility='default' filepath='/home/hutter2/release20/lib/libtpool/thread_pool_impl.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <var-decl name='tp_flags' type-id='type-id-4' visibility='default' filepath='/home/hutter2/release20/lib/libtpool/thread_pool_impl.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2272'>
        <var-decl name='tp_linger' type-id='type-id-54' visibility='default' filepath='/home/hutter2/release20/lib/libtpool/thread_pool_impl.h' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2304'>
        <var-decl name='tp_njobs' type-id='type-id-4' visibility='default' filepath='/home/hutter2/release20/lib/libtpool/thread_pool_impl.h' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2336'>
        <var-decl name='tp_minimum' type-id='type-id-4' visibility='default' filepath='/home/hutter2/release20/lib/libtpool/thread_pool_impl.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2368'>
        <var-decl name='tp_maximum' type-id='type-id-4' visibility='default' filepath='/home/hutter2/release20/lib/libtpool/thread_pool_impl.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2400'>
        <var-decl name='tp_current' type-id='type-id-4' visibility='default' filepath='/home/hutter2/release20/lib/libtpool/thread_pool_impl.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2432'>
        <var-decl name='tp_idle' type-id='type-id-4' visibility='default' filepath='/home/hutter2/release20/lib/libtpool/thread_pool_impl.h' line='80' column='1'/>
      </data-member>
    </class-decl>
    <function-type size-in-bits='64' id='type-id-164'>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-5'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='libzfs_core.c' comp-dir-path='/home/hutter2/release20/lib/libzfs_core' language='LANG_C99'>
    <type-decl name='char' size-in-bits='8' id='type-id-48'/>
    <array-type-def dimensions='1' type-id='type-id-48' size-in-bits='2048' id='type-id-165'>
      <subrange length='256' type-id='type-id-10' id='type-id-166'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-48' size-in-bits='32768' id='type-id-167'>
      <subrange length='4096' type-id='type-id-10' id='type-id-168'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-48' size-in-bits='320' id='type-id-169'>
      <subrange length='40' type-id='type-id-10' id='type-id-170'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-48' size-in-bits='65536' id='type-id-171'>
      <subrange length='8192' type-id='type-id-10' id='type-id-172'/>
    </array-type-def>
    <type-decl name='int' size-in-bits='32' id='type-id-4'/>
    <type-decl name='long int' size-in-bits='64' id='type-id-64'/>
    <type-decl name='short int' size-in-bits='16' id='type-id-173'/>
    <array-type-def dimensions='1' type-id='type-id-174' size-in-bits='128' id='type-id-175'>
      <subrange length='2' type-id='type-id-10' id='type-id-86'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-174' size-in-bits='2176' id='type-id-176'>
      <subrange length='34' type-id='type-id-10' id='type-id-177'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-174' size-in-bits='256' id='type-id-178'>
      <subrange length='4' type-id='type-id-10' id='type-id-89'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-179' size-in-bits='96' id='type-id-180'>
      <subrange length='12' type-id='type-id-10' id='type-id-181'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-179' size-in-bits='128' id='type-id-182'>
      <subrange length='16' type-id='type-id-10' id='type-id-11'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-179' size-in-bits='24' id='type-id-183'>
      <subrange length='3' type-id='type-id-10' id='type-id-184'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-179' size-in-bits='40' id='type-id-185'>
      <subrange length='5' type-id='type-id-10' id='type-id-186'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-179' size-in-bits='48' id='type-id-187'>
      <subrange length='6' type-id='type-id-10' id='type-id-188'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-179' size-in-bits='64' id='type-id-189'>
      <subrange length='8' type-id='type-id-10' id='type-id-84'/>
    </array-type-def>
    <type-decl name='unnamed-enum-underlying-type-32' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='type-id-190'/>
    <type-decl name='unsigned char' size-in-bits='8' id='type-id-13'/>
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-15'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-10'/>
    <type-decl name='variadic parameter type' id='type-id-191'/>
    <type-decl name='void' id='type-id-5'/>
    <enum-decl name='lzc_dataset_type' filepath='../../include/libzfs_core.h' line='47' column='1' id='type-id-192'>
      <underlying-type type-id='type-id-190'/>
      <enumerator name='LZC_DATSET_TYPE_ZFS' value='2'/>
      <enumerator name='LZC_DATSET_TYPE_ZVOL' value='3'/>
    </enum-decl>
    <enum-decl name='lzc_send_flags' filepath='../../include/libzfs_core.h' line='77' column='1' id='type-id-193'>
      <underlying-type type-id='type-id-190'/>
      <enumerator name='LZC_SEND_FLAG_EMBED_DATA' value='1'/>
      <enumerator name='LZC_SEND_FLAG_LARGE_BLOCK' value='2'/>
      <enumerator name='LZC_SEND_FLAG_COMPRESS' value='4'/>
      <enumerator name='LZC_SEND_FLAG_RAW' value='8'/>
      <enumerator name='LZC_SEND_FLAG_SAVED' value='16'/>
    </enum-decl>
    <class-decl name='ddt_key' size-in-bits='320' is-struct='yes' visibility='default' filepath='../../include/sys/ddt.h' line='67' column='1' id='type-id-194'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ddk_cksum' type-id='type-id-195' visibility='default' filepath='../../include/sys/ddt.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='ddk_prop' type-id='type-id-174' visibility='default' filepath='../../include/sys/ddt.h' line='76' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='ddt_key_t' type-id='type-id-194' filepath='../../include/sys/ddt.h' line='77' column='1' id='type-id-196'/>
    <enum-decl name='dmu_object_type' filepath='../../include/sys/dmu.h' line='168' column='1' id='type-id-197'>
      <underlying-type type-id='type-id-190'/>
      <enumerator name='DMU_OT_NONE' value='0'/>
      <enumerator name='DMU_OT_OBJECT_DIRECTORY' value='1'/>
      <enumerator name='DMU_OT_OBJECT_ARRAY' value='2'/>
      <enumerator name='DMU_OT_PACKED_NVLIST' value='3'/>
      <enumerator name='DMU_OT_PACKED_NVLIST_SIZE' value='4'/>
      <enumerator name='DMU_OT_BPOBJ' value='5'/>
      <enumerator name='DMU_OT_BPOBJ_HDR' value='6'/>
      <enumerator name='DMU_OT_SPACE_MAP_HEADER' value='7'/>
      <enumerator name='DMU_OT_SPACE_MAP' value='8'/>
      <enumerator name='DMU_OT_INTENT_LOG' value='9'/>
      <enumerator name='DMU_OT_DNODE' value='10'/>
      <enumerator name='DMU_OT_OBJSET' value='11'/>
      <enumerator name='DMU_OT_DSL_DIR' value='12'/>
      <enumerator name='DMU_OT_DSL_DIR_CHILD_MAP' value='13'/>
      <enumerator name='DMU_OT_DSL_DS_SNAP_MAP' value='14'/>
      <enumerator name='DMU_OT_DSL_PROPS' value='15'/>
      <enumerator name='DMU_OT_DSL_DATASET' value='16'/>
      <enumerator name='DMU_OT_ZNODE' value='17'/>
      <enumerator name='DMU_OT_OLDACL' value='18'/>
      <enumerator name='DMU_OT_PLAIN_FILE_CONTENTS' value='19'/>
      <enumerator name='DMU_OT_DIRECTORY_CONTENTS' value='20'/>
      <enumerator name='DMU_OT_MASTER_NODE' value='21'/>
      <enumerator name='DMU_OT_UNLINKED_SET' value='22'/>
      <enumerator name='DMU_OT_ZVOL' value='23'/>
      <enumerator name='DMU_OT_ZVOL_PROP' value='24'/>
      <enumerator name='DMU_OT_PLAIN_OTHER' value='25'/>
      <enumerator name='DMU_OT_UINT64_OTHER' value='26'/>
      <enumerator name='DMU_OT_ZAP_OTHER' value='27'/>
      <enumerator name='DMU_OT_ERROR_LOG' value='28'/>
      <enumerator name='DMU_OT_SPA_HISTORY' value='29'/>
      <enumerator name='DMU_OT_SPA_HISTORY_OFFSETS' value='30'/>
      <enumerator name='DMU_OT_POOL_PROPS' value='31'/>
      <enumerator name='DMU_OT_DSL_PERMS' value='32'/>
      <enumerator name='DMU_OT_ACL' value='33'/>
      <enumerator name='DMU_OT_SYSACL' value='34'/>
      <enumerator name='DMU_OT_FUID' value='35'/>
      <enumerator name='DMU_OT_FUID_SIZE' value='36'/>
      <enumerator name='DMU_OT_NEXT_CLONES' value='37'/>
      <enumerator name='DMU_OT_SCAN_QUEUE' value='38'/>
      <enumerator name='DMU_OT_USERGROUP_USED' value='39'/>
      <enumerator name='DMU_OT_USERGROUP_QUOTA' value='40'/>
      <enumerator name='DMU_OT_USERREFS' value='41'/>
      <enumerator name='DMU_OT_DDT_ZAP' value='42'/>
      <enumerator name='DMU_OT_DDT_STATS' value='43'/>
      <enumerator name='DMU_OT_SA' value='44'/>
      <enumerator name='DMU_OT_SA_MASTER_NODE' value='45'/>
      <enumerator name='DMU_OT_SA_ATTR_REGISTRATION' value='46'/>
      <enumerator name='DMU_OT_SA_ATTR_LAYOUTS' value='47'/>
      <enumerator name='DMU_OT_SCAN_XLATE' value='48'/>
      <enumerator name='DMU_OT_DEDUP' value='49'/>
      <enumerator name='DMU_OT_DEADLIST' value='50'/>
      <enumerator name='DMU_OT_DEADLIST_HDR' value='51'/>
      <enumerator name='DMU_OT_DSL_CLONES' value='52'/>
      <enumerator name='DMU_OT_BPOBJ_SUBOBJ' value='53'/>
      <enumerator name='DMU_OT_NUMTYPES' value='54'/>
      <enumerator name='DMU_OTN_UINT8_DATA' value='128'/>
      <enumerator name='DMU_OTN_UINT8_METADATA' value='192'/>
      <enumerator name='DMU_OTN_UINT16_DATA' value='129'/>
      <enumerator name='DMU_OTN_UINT16_METADATA' value='193'/>
      <enumerator name='DMU_OTN_UINT32_DATA' value='130'/>
      <enumerator name='DMU_OTN_UINT32_METADATA' value='194'/>
      <enumerator name='DMU_OTN_UINT64_DATA' value='131'/>
      <enumerator name='DMU_OTN_UINT64_METADATA' value='195'/>
      <enumerator name='DMU_OTN_ZAP_DATA' value='132'/>
      <enumerator name='DMU_OTN_ZAP_METADATA' value='196'/>
      <enumerator name='DMU_OTN_UINT8_ENC_DATA' value='160'/>
      <enumerator name='DMU_OTN_UINT8_ENC_METADATA' value='224'/>
      <enumerator name='DMU_OTN_UINT16_ENC_DATA' value='161'/>
      <enumerator name='DMU_OTN_UINT16_ENC_METADATA' value='225'/>
      <enumerator name='DMU_OTN_UINT32_ENC_DATA' value='162'/>
      <enumerator name='DMU_OTN_UINT32_ENC_METADATA' value='226'/>
      <enumerator name='DMU_OTN_UINT64_ENC_DATA' value='163'/>
      <enumerator name='DMU_OTN_UINT64_ENC_METADATA' value='227'/>
      <enumerator name='DMU_OTN_ZAP_ENC_DATA' value='164'/>
      <enumerator name='DMU_OTN_ZAP_ENC_METADATA' value='228'/>
    </enum-decl>
    <typedef-decl name='dmu_object_type_t' type-id='type-id-197' filepath='../../include/sys/dmu.h' line='272' column='1' id='type-id-198'/>
    <class-decl name='dmu_objset_stats' size-in-bits='2304' is-struct='yes' visibility='default' filepath='../../include/sys/dmu.h' line='934' column='1' id='type-id-199'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='dds_num_clones' type-id='type-id-174' visibility='default' filepath='../../include/sys/dmu.h' line='935' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='dds_creation_txg' type-id='type-id-174' visibility='default' filepath='../../include/sys/dmu.h' line='936' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='dds_guid' type-id='type-id-174' visibility='default' filepath='../../include/sys/dmu.h' line='937' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='dds_type' type-id='type-id-200' visibility='default' filepath='../../include/sys/dmu.h' line='938' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='dds_is_snapshot' type-id='type-id-179' visibility='default' filepath='../../include/sys/dmu.h' line='939' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='232'>
        <var-decl name='dds_inconsistent' type-id='type-id-179' visibility='default' filepath='../../include/sys/dmu.h' line='940' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='240'>
        <var-decl name='dds_redacted' type-id='type-id-179' visibility='default' filepath='../../include/sys/dmu.h' line='941' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='248'>
        <var-decl name='dds_origin' type-id='type-id-165' visibility='default' filepath='../../include/sys/dmu.h' line='942' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='dmu_objset_stats_t' type-id='type-id-199' filepath='../../include/sys/dmu.h' line='943' column='1' id='type-id-201'/>
    <enum-decl name='dmu_objset_type' filepath='../../include/sys/fs/zfs.h' line='64' column='1' id='type-id-202'>
      <underlying-type type-id='type-id-190'/>
      <enumerator name='DMU_OST_NONE' value='0'/>
      <enumerator name='DMU_OST_META' value='1'/>
      <enumerator name='DMU_OST_ZFS' value='2'/>
      <enumerator name='DMU_OST_ZVOL' value='3'/>
      <enumerator name='DMU_OST_OTHER' value='4'/>
      <enumerator name='DMU_OST_ANY' value='5'/>
      <enumerator name='DMU_OST_NUMTYPES' value='6'/>
    </enum-decl>
    <typedef-decl name='dmu_objset_type_t' type-id='type-id-202' filepath='../../include/sys/fs/zfs.h' line='72' column='1' id='type-id-200'/>
    <enum-decl name='pool_initialize_func' filepath='../../include/sys/fs/zfs.h' line='1138' column='1' id='type-id-203'>
      <underlying-type type-id='type-id-190'/>
      <enumerator name='POOL_INITIALIZE_START' value='0'/>
      <enumerator name='POOL_INITIALIZE_CANCEL' value='1'/>
      <enumerator name='POOL_INITIALIZE_SUSPEND' value='2'/>
      <enumerator name='POOL_INITIALIZE_FUNCS' value='3'/>
    </enum-decl>
    <typedef-decl name='pool_initialize_func_t' type-id='type-id-203' filepath='../../include/sys/fs/zfs.h' line='1143' column='1' id='type-id-204'/>
    <enum-decl name='pool_trim_func' filepath='../../include/sys/fs/zfs.h' line='1148' column='1' id='type-id-205'>
      <underlying-type type-id='type-id-190'/>
      <enumerator name='POOL_TRIM_START' value='0'/>
      <enumerator name='POOL_TRIM_CANCEL' value='1'/>
      <enumerator name='POOL_TRIM_SUSPEND' value='2'/>
      <enumerator name='POOL_TRIM_FUNCS' value='3'/>
    </enum-decl>
    <typedef-decl name='pool_trim_func_t' type-id='type-id-205' filepath='../../include/sys/fs/zfs.h' line='1153' column='1' id='type-id-206'/>
    <enum-decl name='zpool_wait_activity_t' naming-typedef-id='type-id-207' filepath='../../include/sys/fs/zfs.h' line='1398' column='1' id='type-id-208'>
      <underlying-type type-id='type-id-190'/>
      <enumerator name='ZPOOL_WAIT_CKPT_DISCARD' value='0'/>
      <enumerator name='ZPOOL_WAIT_FREE' value='1'/>
      <enumerator name='ZPOOL_WAIT_INITIALIZE' value='2'/>
      <enumerator name='ZPOOL_WAIT_REPLACE' value='3'/>
      <enumerator name='ZPOOL_WAIT_REMOVE' value='4'/>
      <enumerator name='ZPOOL_WAIT_RESILVER' value='5'/>
      <enumerator name='ZPOOL_WAIT_SCRUB' value='6'/>
      <enumerator name='ZPOOL_WAIT_TRIM' value='7'/>
      <enumerator name='ZPOOL_WAIT_NUM_ACTIVITIES' value='8'/>
    </enum-decl>
    <typedef-decl name='zpool_wait_activity_t' type-id='type-id-208' filepath='../../include/sys/fs/zfs.h' line='1408' column='1' id='type-id-207'/>
    <enum-decl name='zfs_wait_activity_t' naming-typedef-id='type-id-209' filepath='../../include/sys/fs/zfs.h' line='1410' column='1' id='type-id-210'>
      <underlying-type type-id='type-id-190'/>
      <enumerator name='ZFS_WAIT_DELETEQ' value='0'/>
      <enumerator name='ZFS_WAIT_NUM_ACTIVITIES' value='1'/>
    </enum-decl>
    <typedef-decl name='zfs_wait_activity_t' type-id='type-id-210' filepath='../../include/sys/fs/zfs.h' line='1413' column='1' id='type-id-209'/>
    <enum-decl name='data_type_t' naming-typedef-id='type-id-211' filepath='../../include/sys/nvpair.h' line='37' column='1' id='type-id-212'>
      <underlying-type type-id='type-id-190'/>
      <enumerator name='DATA_TYPE_DONTCARE' value='-1'/>
      <enumerator name='DATA_TYPE_UNKNOWN' value='0'/>
      <enumerator name='DATA_TYPE_BOOLEAN' value='1'/>
      <enumerator name='DATA_TYPE_BYTE' value='2'/>
      <enumerator name='DATA_TYPE_INT16' value='3'/>
      <enumerator name='DATA_TYPE_UINT16' value='4'/>
      <enumerator name='DATA_TYPE_INT32' value='5'/>
      <enumerator name='DATA_TYPE_UINT32' value='6'/>
      <enumerator name='DATA_TYPE_INT64' value='7'/>
      <enumerator name='DATA_TYPE_UINT64' value='8'/>
      <enumerator name='DATA_TYPE_STRING' value='9'/>
      <enumerator name='DATA_TYPE_BYTE_ARRAY' value='10'/>
      <enumerator name='DATA_TYPE_INT16_ARRAY' value='11'/>
      <enumerator name='DATA_TYPE_UINT16_ARRAY' value='12'/>
      <enumerator name='DATA_TYPE_INT32_ARRAY' value='13'/>
      <enumerator name='DATA_TYPE_UINT32_ARRAY' value='14'/>
      <enumerator name='DATA_TYPE_INT64_ARRAY' value='15'/>
      <enumerator name='DATA_TYPE_UINT64_ARRAY' value='16'/>
      <enumerator name='DATA_TYPE_STRING_ARRAY' value='17'/>
      <enumerator name='DATA_TYPE_HRTIME' value='18'/>
      <enumerator name='DATA_TYPE_NVLIST' value='19'/>
      <enumerator name='DATA_TYPE_NVLIST_ARRAY' value='20'/>
      <enumerator name='DATA_TYPE_BOOLEAN_VALUE' value='21'/>
      <enumerator name='DATA_TYPE_INT8' value='22'/>
      <enumerator name='DATA_TYPE_UINT8' value='23'/>
      <enumerator name='DATA_TYPE_BOOLEAN_ARRAY' value='24'/>
      <enumerator name='DATA_TYPE_INT8_ARRAY' value='25'/>
      <enumerator name='DATA_TYPE_UINT8_ARRAY' value='26'/>
      <enumerator name='DATA_TYPE_DOUBLE' value='27'/>
    </enum-decl>
    <typedef-decl name='data_type_t' type-id='type-id-212' filepath='../../include/sys/nvpair.h' line='71' column='1' id='type-id-211'/>
    <class-decl name='nvpair' size-in-bits='128' is-struct='yes' visibility='default' filepath='../../include/sys/nvpair.h' line='73' column='1' id='type-id-213'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nvp_size' type-id='type-id-214' visibility='default' filepath='../../include/sys/nvpair.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='nvp_name_sz' type-id='type-id-215' visibility='default' filepath='../../include/sys/nvpair.h' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='nvp_reserve' type-id='type-id-215' visibility='default' filepath='../../include/sys/nvpair.h' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='nvp_value_elem' type-id='type-id-214' visibility='default' filepath='../../include/sys/nvpair.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='nvp_type' type-id='type-id-211' visibility='default' filepath='../../include/sys/nvpair.h' line='78' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='nvpair_t' type-id='type-id-213' filepath='../../include/sys/nvpair.h' line='82' column='1' id='type-id-216'/>
    <class-decl name='nvlist' size-in-bits='192' is-struct='yes' visibility='default' filepath='../../include/sys/nvpair.h' line='85' column='1' id='type-id-217'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nvl_version' type-id='type-id-214' visibility='default' filepath='../../include/sys/nvpair.h' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='nvl_nvflag' type-id='type-id-218' visibility='default' filepath='../../include/sys/nvpair.h' line='87' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='nvl_priv' type-id='type-id-174' visibility='default' filepath='../../include/sys/nvpair.h' line='88' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='nvl_flag' type-id='type-id-218' visibility='default' filepath='../../include/sys/nvpair.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='nvl_pad' type-id='type-id-214' visibility='default' filepath='../../include/sys/nvpair.h' line='90' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='nvlist_t' type-id='type-id-217' filepath='../../include/sys/nvpair.h' line='91' column='1' id='type-id-219'/>
    <class-decl name='zio_cksum' size-in-bits='256' is-struct='yes' visibility='default' filepath='../../include/sys/spa_checksum.h' line='38' column='1' id='type-id-220'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='zc_word' type-id='type-id-178' visibility='default' filepath='../../include/sys/spa_checksum.h' line='39' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='zio_cksum_t' type-id='type-id-220' filepath='../../include/sys/spa_checksum.h' line='40' column='1' id='type-id-195'/>
    <class-decl name='drr_begin' size-in-bits='2432' is-struct='yes' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='231' column='1' id='type-id-221'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='drr_magic' type-id='type-id-174' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='232' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='drr_versioninfo' type-id='type-id-174' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='233' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='drr_creation_time' type-id='type-id-174' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='234' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='drr_type' type-id='type-id-200' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='235' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='drr_flags' type-id='type-id-218' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='236' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='drr_toguid' type-id='type-id-174' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='237' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='drr_fromguid' type-id='type-id-174' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='238' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='drr_toname' type-id='type-id-165' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='239' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='dmu_replay_record' size-in-bits='2496' is-struct='yes' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='242' column='1' id='type-id-222'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='drr_type' type-id='type-id-223' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='248' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='drr_payloadlen' type-id='type-id-218' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='249' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='drr_u' type-id='type-id-224' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='384' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' filepath='../../include/sys/zfs_ioctl.h' line='243' column='1' id='type-id-223'>
      <underlying-type type-id='type-id-190'/>
      <enumerator name='DRR_BEGIN' value='0'/>
      <enumerator name='DRR_OBJECT' value='1'/>
      <enumerator name='DRR_FREEOBJECTS' value='2'/>
      <enumerator name='DRR_WRITE' value='3'/>
      <enumerator name='DRR_FREE' value='4'/>
      <enumerator name='DRR_END' value='5'/>
      <enumerator name='DRR_WRITE_BYREF' value='6'/>
      <enumerator name='DRR_SPILL' value='7'/>
      <enumerator name='DRR_WRITE_EMBEDDED' value='8'/>
      <enumerator name='DRR_OBJECT_RANGE' value='9'/>
      <enumerator name='DRR_REDACT' value='10'/>
      <enumerator name='DRR_NUMTYPES' value='11'/>
    </enum-decl>
    <union-decl name='__anonymous_union__' size-in-bits='2432' is-anonymous='yes' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='250' column='1' id='type-id-224'>
      <data-member access='public'>
        <var-decl name='drr_begin' type-id='type-id-221' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='251' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='drr_end' type-id='type-id-225' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='255' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='drr_object' type-id='type-id-226' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='275' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='drr_freeobjects' type-id='type-id-227' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='280' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='drr_write' type-id='type-id-228' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='301' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='drr_free' type-id='type-id-229' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='307' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='drr_write_byref' type-id='type-id-230' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='323' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='drr_spill' type-id='type-id-231' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='338' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='drr_write_embedded' type-id='type-id-232' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='351' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='drr_object_range' type-id='type-id-233' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='361' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='drr_redact' type-id='type-id-234' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='367' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='drr_checksum' type-id='type-id-235' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='383' column='1'/>
      </data-member>
    </union-decl>
    <class-decl name='drr_end' size-in-bits='320' is-struct='yes' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='252' column='1' id='type-id-225'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='drr_checksum' type-id='type-id-195' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='253' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='drr_toguid' type-id='type-id-174' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='254' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='drr_object' size-in-bits='448' is-struct='yes' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='256' column='1' id='type-id-226'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='drr_object' type-id='type-id-174' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='257' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='drr_type' type-id='type-id-198' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='258' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='drr_bonustype' type-id='type-id-198' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='259' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='drr_blksz' type-id='type-id-218' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='260' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='drr_bonuslen' type-id='type-id-218' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='261' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='drr_checksumtype' type-id='type-id-179' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='262' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='200'>
        <var-decl name='drr_compress' type-id='type-id-179' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='263' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='208'>
        <var-decl name='drr_dn_slots' type-id='type-id-179' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='264' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='216'>
        <var-decl name='drr_flags' type-id='type-id-179' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='265' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='drr_raw_bonuslen' type-id='type-id-218' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='266' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='drr_toguid' type-id='type-id-174' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='267' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='drr_indblkshift' type-id='type-id-179' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='269' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='328'>
        <var-decl name='drr_nlevels' type-id='type-id-179' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='270' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='336'>
        <var-decl name='drr_nblkptr' type-id='type-id-179' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='271' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='344'>
        <var-decl name='drr_pad' type-id='type-id-185' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='272' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='drr_maxblkid' type-id='type-id-174' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='273' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='drr_freeobjects' size-in-bits='192' is-struct='yes' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='276' column='1' id='type-id-227'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='drr_firstobj' type-id='type-id-174' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='277' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='drr_numobjs' type-id='type-id-174' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='278' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='drr_toguid' type-id='type-id-174' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='279' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='drr_write' size-in-bits='1088' is-struct='yes' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='281' column='1' id='type-id-228'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='drr_object' type-id='type-id-174' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='282' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='drr_type' type-id='type-id-198' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='283' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='drr_pad' type-id='type-id-218' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='284' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='drr_offset' type-id='type-id-174' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='285' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='drr_logical_size' type-id='type-id-174' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='286' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='drr_toguid' type-id='type-id-174' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='287' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='drr_checksumtype' type-id='type-id-179' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='288' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='328'>
        <var-decl name='drr_flags' type-id='type-id-179' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='289' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='336'>
        <var-decl name='drr_compressiontype' type-id='type-id-179' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='290' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='344'>
        <var-decl name='drr_pad2' type-id='type-id-185' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='291' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='drr_key' type-id='type-id-196' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='293' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='drr_compressed_size' type-id='type-id-174' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='295' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='drr_salt' type-id='type-id-189' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='297' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='drr_iv' type-id='type-id-180' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='298' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='drr_mac' type-id='type-id-182' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='299' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='drr_free' size-in-bits='256' is-struct='yes' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='302' column='1' id='type-id-229'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='drr_object' type-id='type-id-174' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='303' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='drr_offset' type-id='type-id-174' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='304' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='drr_length' type-id='type-id-174' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='305' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='drr_toguid' type-id='type-id-174' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='306' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='drr_write_byref' size-in-bits='832' is-struct='yes' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='308' column='1' id='type-id-230'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='drr_object' type-id='type-id-174' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='310' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='drr_offset' type-id='type-id-174' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='311' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='drr_length' type-id='type-id-174' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='312' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='drr_toguid' type-id='type-id-174' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='313' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='drr_refguid' type-id='type-id-174' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='315' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='drr_refobject' type-id='type-id-174' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='316' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='drr_refoffset' type-id='type-id-174' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='317' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='drr_checksumtype' type-id='type-id-179' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='319' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='456'>
        <var-decl name='drr_flags' type-id='type-id-179' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='320' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='464'>
        <var-decl name='drr_pad2' type-id='type-id-187' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='321' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='drr_key' type-id='type-id-196' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='322' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='drr_spill' size-in-bits='640' is-struct='yes' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='324' column='1' id='type-id-231'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='drr_object' type-id='type-id-174' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='325' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='drr_length' type-id='type-id-174' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='326' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='drr_toguid' type-id='type-id-174' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='327' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='drr_flags' type-id='type-id-179' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='328' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='200'>
        <var-decl name='drr_compressiontype' type-id='type-id-179' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='329' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='208'>
        <var-decl name='drr_pad' type-id='type-id-187' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='330' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='drr_compressed_size' type-id='type-id-174' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='332' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='drr_salt' type-id='type-id-189' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='333' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='drr_iv' type-id='type-id-180' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='334' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='drr_mac' type-id='type-id-182' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='335' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='608'>
        <var-decl name='drr_type' type-id='type-id-198' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='336' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='drr_write_embedded' size-in-bits='384' is-struct='yes' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='339' column='1' id='type-id-232'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='drr_object' type-id='type-id-174' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='340' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='drr_offset' type-id='type-id-174' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='341' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='drr_length' type-id='type-id-174' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='343' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='drr_toguid' type-id='type-id-174' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='344' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='drr_compression' type-id='type-id-179' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='345' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='264'>
        <var-decl name='drr_etype' type-id='type-id-179' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='346' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='272'>
        <var-decl name='drr_pad' type-id='type-id-187' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='347' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='drr_lsize' type-id='type-id-218' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='348' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='drr_psize' type-id='type-id-218' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='349' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='drr_object_range' size-in-bits='512' is-struct='yes' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='352' column='1' id='type-id-233'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='drr_firstobj' type-id='type-id-174' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='353' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='drr_numslots' type-id='type-id-174' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='354' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='drr_toguid' type-id='type-id-174' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='355' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='drr_salt' type-id='type-id-189' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='356' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='drr_iv' type-id='type-id-180' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='357' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='drr_mac' type-id='type-id-182' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='358' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='drr_flags' type-id='type-id-179' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='359' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='488'>
        <var-decl name='drr_pad' type-id='type-id-183' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='360' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='drr_redact' size-in-bits='256' is-struct='yes' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='362' column='1' id='type-id-234'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='drr_object' type-id='type-id-174' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='363' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='drr_offset' type-id='type-id-174' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='364' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='drr_length' type-id='type-id-174' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='365' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='drr_toguid' type-id='type-id-174' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='366' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='drr_checksum' size-in-bits='2432' is-struct='yes' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='376' column='1' id='type-id-235'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='drr_pad' type-id='type-id-176' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='377' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='drr_checksum' type-id='type-id-195' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='382' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='dmu_replay_record_t' type-id='type-id-222' filepath='../../include/sys/zfs_ioctl.h' line='385' column='1' id='type-id-236'/>
    <class-decl name='zinject_record' size-in-bits='2816' is-struct='yes' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='403' column='1' id='type-id-237'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='zi_objset' type-id='type-id-174' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='404' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='zi_object' type-id='type-id-174' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='405' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='zi_start' type-id='type-id-174' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='406' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='zi_end' type-id='type-id-174' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='407' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='zi_guid' type-id='type-id-174' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='408' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='zi_level' type-id='type-id-218' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='409' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='zi_error' type-id='type-id-218' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='410' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='zi_type' type-id='type-id-174' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='411' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='zi_freq' type-id='type-id-218' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='412' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='zi_failfast' type-id='type-id-218' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='413' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='zi_func' type-id='type-id-165' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='414' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2560'>
        <var-decl name='zi_iotype' type-id='type-id-218' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='415' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2592'>
        <var-decl name='zi_duration' type-id='type-id-214' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='416' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2624'>
        <var-decl name='zi_timer' type-id='type-id-174' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='417' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2688'>
        <var-decl name='zi_nlanes' type-id='type-id-174' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='418' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2752'>
        <var-decl name='zi_cmd' type-id='type-id-218' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='419' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2784'>
        <var-decl name='zi_dvas' type-id='type-id-218' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='420' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='zinject_record_t' type-id='type-id-237' filepath='../../include/sys/zfs_ioctl.h' line='421' column='1' id='type-id-238'/>
    <class-decl name='zfs_share' size-in-bits='256' is-struct='yes' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='452' column='1' id='type-id-239'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='z_exportdata' type-id='type-id-174' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='453' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='z_sharedata' type-id='type-id-174' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='454' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='z_sharetype' type-id='type-id-174' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='455' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='z_sharemax' type-id='type-id-174' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='456' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='zfs_share_t' type-id='type-id-239' filepath='../../include/sys/zfs_ioctl.h' line='457' column='1' id='type-id-240'/>
    <class-decl name='zfs_cmd' size-in-bits='109952' is-struct='yes' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='477' column='1' id='type-id-241'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='zc_name' type-id='type-id-167' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='478' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32768'>
        <var-decl name='zc_nvlist_src' type-id='type-id-174' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='479' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32832'>
        <var-decl name='zc_nvlist_src_size' type-id='type-id-174' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='480' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32896'>
        <var-decl name='zc_nvlist_dst' type-id='type-id-174' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='481' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32960'>
        <var-decl name='zc_nvlist_dst_size' type-id='type-id-174' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='482' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='33024'>
        <var-decl name='zc_nvlist_dst_filled' type-id='type-id-6' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='483' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='33056'>
        <var-decl name='zc_pad2' type-id='type-id-4' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='484' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='33088'>
        <var-decl name='zc_history' type-id='type-id-174' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='490' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='33152'>
        <var-decl name='zc_value' type-id='type-id-171' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='491' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='98688'>
        <var-decl name='zc_string' type-id='type-id-165' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='492' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='100736'>
        <var-decl name='zc_guid' type-id='type-id-174' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='493' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='100800'>
        <var-decl name='zc_nvlist_conf' type-id='type-id-174' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='494' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='100864'>
        <var-decl name='zc_nvlist_conf_size' type-id='type-id-174' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='495' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='100928'>
        <var-decl name='zc_cookie' type-id='type-id-174' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='496' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='100992'>
        <var-decl name='zc_objset_type' type-id='type-id-174' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='497' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='101056'>
        <var-decl name='zc_perm_action' type-id='type-id-174' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='498' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='101120'>
        <var-decl name='zc_history_len' type-id='type-id-174' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='499' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='101184'>
        <var-decl name='zc_history_offset' type-id='type-id-174' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='500' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='101248'>
        <var-decl name='zc_obj' type-id='type-id-174' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='501' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='101312'>
        <var-decl name='zc_iflags' type-id='type-id-174' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='502' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='101376'>
        <var-decl name='zc_share' type-id='type-id-240' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='503' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='101632'>
        <var-decl name='zc_objset_stats' type-id='type-id-201' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='504' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='103936'>
        <var-decl name='zc_begin_record' type-id='type-id-221' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='505' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='106368'>
        <var-decl name='zc_inject_record' type-id='type-id-238' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='506' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109184'>
        <var-decl name='zc_defer_destroy' type-id='type-id-218' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='507' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109216'>
        <var-decl name='zc_flags' type-id='type-id-218' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='508' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109248'>
        <var-decl name='zc_action_handle' type-id='type-id-174' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='509' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109312'>
        <var-decl name='zc_cleanup_fd' type-id='type-id-4' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='510' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109344'>
        <var-decl name='zc_simple' type-id='type-id-179' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='511' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109352'>
        <var-decl name='zc_pad' type-id='type-id-183' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='512' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109376'>
        <var-decl name='zc_sendobj' type-id='type-id-174' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='513' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109440'>
        <var-decl name='zc_fromobj' type-id='type-id-174' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='514' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109504'>
        <var-decl name='zc_createtxg' type-id='type-id-174' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='515' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109568'>
        <var-decl name='zc_stat' type-id='type-id-242' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='516' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109888'>
        <var-decl name='zc_zoneid' type-id='type-id-174' visibility='default' filepath='../../include/sys/zfs_ioctl.h' line='517' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='zfs_stat' size-in-bits='320' is-struct='yes' visibility='default' filepath='../../include/sys/zfs_stat.h' line='42' column='1' id='type-id-243'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='zs_gen' type-id='type-id-174' visibility='default' filepath='../../include/sys/zfs_stat.h' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='zs_mode' type-id='type-id-174' visibility='default' filepath='../../include/sys/zfs_stat.h' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='zs_links' type-id='type-id-174' visibility='default' filepath='../../include/sys/zfs_stat.h' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='zs_ctime' type-id='type-id-175' visibility='default' filepath='../../include/sys/zfs_stat.h' line='46' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='zfs_stat_t' type-id='type-id-243' filepath='../../include/sys/zfs_stat.h' line='47' column='1' id='type-id-242'/>
    <enum-decl name='boolean_t' naming-typedef-id='type-id-6' filepath='../../lib/libspl/include/sys/stdtypes.h' line='26' column='1' id='type-id-244'>
      <underlying-type type-id='type-id-190'/>
      <enumerator name='B_FALSE' value='0'/>
      <enumerator name='B_TRUE' value='1'/>
    </enum-decl>
    <typedef-decl name='boolean_t' type-id='type-id-244' filepath='../../lib/libspl/include/sys/stdtypes.h' line='29' column='1' id='type-id-6'/>
    <typedef-decl name='uchar_t' type-id='type-id-13' filepath='../../lib/libspl/include/sys/stdtypes.h' line='31' column='1' id='type-id-245'/>
    <typedef-decl name='uint_t' type-id='type-id-15' filepath='../../lib/libspl/include/sys/stdtypes.h' line='33' column='1' id='type-id-54'/>
    <union-decl name='pthread_mutex_t' size-in-bits='320' naming-typedef-id='type-id-163' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='67' column='1' id='type-id-246'>
      <data-member access='public'>
        <var-decl name='__data' type-id='type-id-247' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='69' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__size' type-id='type-id-169' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='70' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__align' type-id='type-id-64' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='71' column='1'/>
      </data-member>
    </union-decl>
    <typedef-decl name='pthread_mutex_t' type-id='type-id-246' filepath='/usr/include/bits/pthreadtypes.h' line='72' column='1' id='type-id-163'/>
    <typedef-decl name='int16_t' type-id='type-id-248' filepath='/usr/include/bits/stdint-intn.h' line='25' column='1' id='type-id-215'/>
    <typedef-decl name='int32_t' type-id='type-id-249' filepath='/usr/include/bits/stdint-intn.h' line='26' column='1' id='type-id-214'/>
    <typedef-decl name='uint8_t' type-id='type-id-250' filepath='/usr/include/bits/stdint-uintn.h' line='24' column='1' id='type-id-179'/>
    <typedef-decl name='uint32_t' type-id='type-id-251' filepath='/usr/include/bits/stdint-uintn.h' line='26' column='1' id='type-id-218'/>
    <typedef-decl name='uint64_t' type-id='type-id-252' filepath='/usr/include/bits/stdint-uintn.h' line='27' column='1' id='type-id-174'/>
    <class-decl name='__pthread_mutex_s' size-in-bits='320' is-struct='yes' visibility='default' filepath='/usr/include/bits/struct_mutex.h' line='22' column='1' id='type-id-247'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__lock' type-id='type-id-4' visibility='default' filepath='/usr/include/bits/struct_mutex.h' line='24' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='__count' type-id='type-id-15' visibility='default' filepath='/usr/include/bits/struct_mutex.h' line='25' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__owner' type-id='type-id-4' visibility='default' filepath='/usr/include/bits/struct_mutex.h' line='26' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='__nusers' type-id='type-id-15' visibility='default' filepath='/usr/include/bits/struct_mutex.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='__kind' type-id='type-id-4' visibility='default' filepath='/usr/include/bits/struct_mutex.h' line='32' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='__spins' type-id='type-id-173' visibility='default' filepath='/usr/include/bits/struct_mutex.h' line='34' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='176'>
        <var-decl name='__elision' type-id='type-id-173' visibility='default' filepath='/usr/include/bits/struct_mutex.h' line='35' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='__list' type-id='type-id-253' visibility='default' filepath='/usr/include/bits/struct_mutex.h' line='36' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__pthread_internal_list' size-in-bits='128' is-struct='yes' visibility='default' filepath='/usr/include/bits/thread-shared-types.h' line='49' column='1' id='type-id-254'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__prev' type-id='type-id-255' visibility='default' filepath='/usr/include/bits/thread-shared-types.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__next' type-id='type-id-255' visibility='default' filepath='/usr/include/bits/thread-shared-types.h' line='52' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__pthread_list_t' type-id='type-id-254' filepath='/usr/include/bits/thread-shared-types.h' line='53' column='1' id='type-id-253'/>
    <typedef-decl name='__uint8_t' type-id='type-id-13' filepath='/usr/include/bits/types.h' line='38' column='1' id='type-id-250'/>
    <typedef-decl name='__int16_t' type-id='type-id-173' filepath='/usr/include/bits/types.h' line='39' column='1' id='type-id-248'/>
    <typedef-decl name='__int32_t' type-id='type-id-4' filepath='/usr/include/bits/types.h' line='41' column='1' id='type-id-249'/>
    <typedef-decl name='__uint32_t' type-id='type-id-15' filepath='/usr/include/bits/types.h' line='42' column='1' id='type-id-251'/>
    <typedef-decl name='__uint64_t' type-id='type-id-10' filepath='/usr/include/bits/types.h' line='45' column='1' id='type-id-252'/>
    <typedef-decl name='__ssize_t' type-id='type-id-64' filepath='/usr/include/bits/types.h' line='194' column='1' id='type-id-256'/>
    <typedef-decl name='ssize_t' type-id='type-id-256' filepath='/usr/include/sys/types.h' line='108' column='1' id='type-id-27'/>
    <typedef-decl name='size_t' type-id='type-id-10' filepath='/usr/lib/gcc/x86_64-redhat-linux/10/include/stddef.h' line='209' column='1' id='type-id-26'/>
    <pointer-type-def type-id='type-id-254' size-in-bits='64' id='type-id-255'/>
    <pointer-type-def type-id='type-id-6' size-in-bits='64' id='type-id-257'/>
    <pointer-type-def type-id='type-id-48' size-in-bits='64' id='type-id-52'/>
    <qualified-type-def type-id='type-id-48' const='yes' id='type-id-258'/>
    <pointer-type-def type-id='type-id-258' size-in-bits='64' id='type-id-46'/>
    <qualified-type-def type-id='type-id-236' const='yes' id='type-id-259'/>
    <pointer-type-def type-id='type-id-259' size-in-bits='64' id='type-id-260'/>
    <qualified-type-def type-id='type-id-219' const='yes' id='type-id-261'/>
    <pointer-type-def type-id='type-id-261' size-in-bits='64' id='type-id-262'/>
    <pointer-type-def type-id='type-id-4' size-in-bits='64' id='type-id-141'/>
    <pointer-type-def type-id='type-id-219' size-in-bits='64' id='type-id-263'/>
    <pointer-type-def type-id='type-id-263' size-in-bits='64' id='type-id-264'/>
    <pointer-type-def type-id='type-id-216' size-in-bits='64' id='type-id-265'/>
    <pointer-type-def type-id='type-id-163' size-in-bits='64' id='type-id-147'/>
    <pointer-type-def type-id='type-id-26' size-in-bits='64' id='type-id-153'/>
    <pointer-type-def type-id='type-id-245' size-in-bits='64' id='type-id-266'/>
    <pointer-type-def type-id='type-id-174' size-in-bits='64' id='type-id-267'/>
    <pointer-type-def type-id='type-id-179' size-in-bits='64' id='type-id-268'/>
    <pointer-type-def type-id='type-id-5' size-in-bits='64' id='type-id-2'/>
    <pointer-type-def type-id='type-id-241' size-in-bits='64' id='type-id-269'/>
    <function-decl name='zfs_ioctl_fd' mangled-name='zfs_ioctl_fd' filepath='../../include/libzutil.h' line='148' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_ioctl_fd'>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-269'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='nvlist_free' filepath='../../include/sys/nvpair.h' line='152' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-263'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvlist_unpack' filepath='../../include/sys/nvpair.h' line='155' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-52'/>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-264'/>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='nvlist_lookup_uint64' filepath='../../include/sys/nvpair.h' line='212' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-263'/>
      <parameter type-id='type-id-46'/>
      <parameter type-id='type-id-267'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='nvlist_lookup_nvlist' filepath='../../include/sys/nvpair.h' line='214' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-263'/>
      <parameter type-id='type-id-46'/>
      <parameter type-id='type-id-264'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='nvlist_next_nvpair' filepath='../../include/sys/nvpair.h' line='242' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-263'/>
      <parameter type-id='type-id-265'/>
      <return type-id='type-id-265'/>
    </function-decl>
    <function-decl name='nvpair_name' filepath='../../include/sys/nvpair.h' line='244' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-265'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='fnvlist_alloc' filepath='../../include/sys/nvpair.h' line='276' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-263'/>
    </function-decl>
    <function-decl name='fnvlist_free' filepath='../../include/sys/nvpair.h' line='277' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-263'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='fnvlist_pack' filepath='../../include/sys/nvpair.h' line='279' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-263'/>
      <parameter type-id='type-id-153'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='fnvlist_pack_free' filepath='../../include/sys/nvpair.h' line='280' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-52'/>
      <parameter type-id='type-id-26'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='fnvlist_unpack' filepath='../../include/sys/nvpair.h' line='281' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-52'/>
      <parameter type-id='type-id-26'/>
      <return type-id='type-id-263'/>
    </function-decl>
    <function-decl name='fnvlist_dup' filepath='../../include/sys/nvpair.h' line='282' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-263'/>
      <return type-id='type-id-263'/>
    </function-decl>
    <function-decl name='fnvlist_add_boolean' filepath='../../include/sys/nvpair.h' line='286' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-263'/>
      <parameter type-id='type-id-46'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='fnvlist_add_boolean_value' filepath='../../include/sys/nvpair.h' line='287' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-263'/>
      <parameter type-id='type-id-46'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='fnvlist_add_int32' filepath='../../include/sys/nvpair.h' line='293' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-263'/>
      <parameter type-id='type-id-46'/>
      <parameter type-id='type-id-214'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='fnvlist_add_uint64' filepath='../../include/sys/nvpair.h' line='296' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-263'/>
      <parameter type-id='type-id-46'/>
      <parameter type-id='type-id-174'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='fnvlist_add_string' filepath='../../include/sys/nvpair.h' line='297' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-263'/>
      <parameter type-id='type-id-46'/>
      <parameter type-id='type-id-46'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='fnvlist_add_nvlist' filepath='../../include/sys/nvpair.h' line='298' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-263'/>
      <parameter type-id='type-id-46'/>
      <parameter type-id='type-id-263'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='fnvlist_add_byte_array' filepath='../../include/sys/nvpair.h' line='301' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-263'/>
      <parameter type-id='type-id-46'/>
      <parameter type-id='type-id-266'/>
      <parameter type-id='type-id-54'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='fnvlist_add_uint8_array' filepath='../../include/sys/nvpair.h' line='303' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-263'/>
      <parameter type-id='type-id-46'/>
      <parameter type-id='type-id-268'/>
      <parameter type-id='type-id-54'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_boolean_value' filepath='../../include/sys/nvpair.h' line='318' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-263'/>
      <parameter type-id='type-id-46'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_uint64' filepath='../../include/sys/nvpair.h' line='327' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-263'/>
      <parameter type-id='type-id-46'/>
      <return type-id='type-id-174'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_string' filepath='../../include/sys/nvpair.h' line='328' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-263'/>
      <parameter type-id='type-id-46'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='libspl_assertf' mangled-name='libspl_assertf' filepath='../../lib/libspl/include/assert.h' line='40' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='libspl_assertf'>
      <parameter type-id='type-id-46'/>
      <parameter type-id='type-id-46'/>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-46'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='strlcpy' mangled-name='strlcpy' filepath='../../lib/libspl/include/string.h' line='37' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strlcpy'>
      <parameter type-id='type-id-52'/>
      <parameter type-id='type-id-46'/>
      <parameter type-id='type-id-26'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='libzfs_core_init' mangled-name='libzfs_core_init' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='136' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='libzfs_core_init'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='libzfs_core_fini' mangled-name='libzfs_core_fini' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='156' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='libzfs_core_fini'>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='lzc_create' mangled-name='lzc_create' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='249' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_create'>
      <parameter type-id='type-id-46' name='fsname' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='249' column='1'/>
      <parameter type-id='type-id-192' name='type' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='249' column='1'/>
      <parameter type-id='type-id-263' name='props' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='249' column='1'/>
      <parameter type-id='type-id-268' name='wkeydata' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='250' column='1'/>
      <parameter type-id='type-id-54' name='wkeylen' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='250' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='lzc_clone' mangled-name='lzc_clone' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='274' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_clone'>
      <parameter type-id='type-id-46' name='fsname' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='274' column='1'/>
      <parameter type-id='type-id-46' name='origin' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='274' column='1'/>
      <parameter type-id='type-id-263' name='props' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='274' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='lzc_promote' mangled-name='lzc_promote' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='290' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_promote'>
      <parameter type-id='type-id-46' name='fsname' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='290' column='1'/>
      <parameter type-id='type-id-52' name='snapnamebuf' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='290' column='1'/>
      <parameter type-id='type-id-4' name='snapnamelen' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='290' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='lzc_rename' mangled-name='lzc_rename' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='312' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_rename'>
      <parameter type-id='type-id-46' name='source' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='312' column='1'/>
      <parameter type-id='type-id-46' name='target' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='312' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='lzc_destroy' mangled-name='lzc_destroy' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='327' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_destroy'>
      <parameter type-id='type-id-46' name='fsname' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='327' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='lzc_snapshot' mangled-name='lzc_snapshot' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='352' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_snapshot'>
      <parameter type-id='type-id-263' name='snaps' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='352' column='1'/>
      <parameter type-id='type-id-263' name='props' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='352' column='1'/>
      <parameter type-id='type-id-264' name='errlist' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='352' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='lzc_destroy_snaps' mangled-name='lzc_destroy_snaps' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='404' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_destroy_snaps'>
      <parameter type-id='type-id-263' name='snaps' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='404' column='1'/>
      <parameter type-id='type-id-6' name='defer' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='404' column='1'/>
      <parameter type-id='type-id-264' name='errlist' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='404' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='lzc_snaprange_space' mangled-name='lzc_snaprange_space' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='430' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_snaprange_space'>
      <parameter type-id='type-id-46' name='firstsnap' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='430' column='1'/>
      <parameter type-id='type-id-46' name='lastsnap' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='430' column='1'/>
      <parameter type-id='type-id-267' name='usedp' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='431' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='lzc_exists' mangled-name='lzc_exists' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='459' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_exists'>
      <parameter type-id='type-id-46' name='dataset' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='459' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='lzc_sync' mangled-name='lzc_sync' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='481' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_sync'>
      <parameter type-id='type-id-46' name='pool_name' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='481' column='1'/>
      <parameter type-id='type-id-263' name='innvl' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='481' column='1'/>
      <parameter type-id='type-id-264' name='outnvl' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='481' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='lzc_hold' mangled-name='lzc_hold' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='514' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_hold'>
      <parameter type-id='type-id-263' name='holds' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='514' column='1'/>
      <parameter type-id='type-id-4' name='cleanup_fd' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='514' column='1'/>
      <parameter type-id='type-id-264' name='errlist' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='514' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='lzc_release' mangled-name='lzc_release' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='561' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_release'>
      <parameter type-id='type-id-263' name='holds' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='561' column='1'/>
      <parameter type-id='type-id-264' name='errlist' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='561' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='lzc_get_holds' mangled-name='lzc_get_holds' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='584' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_get_holds'>
      <parameter type-id='type-id-46' name='snapname' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='584' column='1'/>
      <parameter type-id='type-id-264' name='holdsp' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='584' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='lzc_send' mangled-name='lzc_send' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='625' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_send'>
      <parameter type-id='type-id-46' name='snapname' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='625' column='1'/>
      <parameter type-id='type-id-46' name='from' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='625' column='1'/>
      <parameter type-id='type-id-4' name='fd' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='625' column='1'/>
      <parameter type-id='type-id-193' name='flags' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='626' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='lzc_send_redacted' mangled-name='lzc_send_redacted' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='633' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_send_redacted'>
      <parameter type-id='type-id-46' name='snapname' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='633' column='1'/>
      <parameter type-id='type-id-46' name='from' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='633' column='1'/>
      <parameter type-id='type-id-4' name='fd' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='633' column='1'/>
      <parameter type-id='type-id-193' name='flags' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='634' column='1'/>
      <parameter type-id='type-id-46' name='redactbook' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='634' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='lzc_send_resume' mangled-name='lzc_send_resume' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='641' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_send_resume'>
      <parameter type-id='type-id-46' name='snapname' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='641' column='1'/>
      <parameter type-id='type-id-46' name='from' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='641' column='1'/>
      <parameter type-id='type-id-4' name='fd' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='641' column='1'/>
      <parameter type-id='type-id-193' name='flags' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='642' column='1'/>
      <parameter type-id='type-id-174' name='resumeobj' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='642' column='1'/>
      <parameter type-id='type-id-174' name='resumeoff' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='642' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='lzc_send_resume_redacted' mangled-name='lzc_send_resume_redacted' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='661' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_send_resume_redacted'>
      <parameter type-id='type-id-46' name='snapname' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='661' column='1'/>
      <parameter type-id='type-id-46' name='from' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='661' column='1'/>
      <parameter type-id='type-id-4' name='fd' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='661' column='1'/>
      <parameter type-id='type-id-193' name='flags' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='662' column='1'/>
      <parameter type-id='type-id-174' name='resumeobj' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='662' column='1'/>
      <parameter type-id='type-id-174' name='resumeoff' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='662' column='1'/>
      <parameter type-id='type-id-46' name='redactbook' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='663' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='lzc_send_space_resume_redacted' mangled-name='lzc_send_space_resume_redacted' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='711' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_send_space_resume_redacted'>
      <parameter type-id='type-id-46' name='snapname' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='711' column='1'/>
      <parameter type-id='type-id-46' name='from' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='711' column='1'/>
      <parameter type-id='type-id-193' name='flags' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='712' column='1'/>
      <parameter type-id='type-id-174' name='resumeobj' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='712' column='1'/>
      <parameter type-id='type-id-174' name='resumeoff' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='712' column='1'/>
      <parameter type-id='type-id-174' name='resume_bytes' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='713' column='1'/>
      <parameter type-id='type-id-46' name='redactbook' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='713' column='1'/>
      <parameter type-id='type-id-4' name='fd' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='713' column='1'/>
      <parameter type-id='type-id-267' name='spacep' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='713' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='lzc_send_space' mangled-name='lzc_send_space' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='749' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_send_space'>
      <parameter type-id='type-id-46' name='snapname' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='749' column='1'/>
      <parameter type-id='type-id-46' name='from' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='749' column='1'/>
      <parameter type-id='type-id-193' name='flags' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='750' column='1'/>
      <parameter type-id='type-id-267' name='spacep' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='750' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='lzc_receive' mangled-name='lzc_receive' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='966' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_receive'>
      <parameter type-id='type-id-46' name='snapname' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='966' column='1'/>
      <parameter type-id='type-id-263' name='props' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='966' column='1'/>
      <parameter type-id='type-id-46' name='origin' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='966' column='1'/>
      <parameter type-id='type-id-6' name='force' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='967' column='1'/>
      <parameter type-id='type-id-6' name='raw' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='967' column='1'/>
      <parameter type-id='type-id-4' name='fd' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='967' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='lzc_receive_resumable' mangled-name='lzc_receive_resumable' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='980' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_receive_resumable'>
      <parameter type-id='type-id-46' name='snapname' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='980' column='1'/>
      <parameter type-id='type-id-263' name='props' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='980' column='1'/>
      <parameter type-id='type-id-46' name='origin' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='980' column='1'/>
      <parameter type-id='type-id-6' name='force' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='981' column='1'/>
      <parameter type-id='type-id-6' name='raw' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='981' column='1'/>
      <parameter type-id='type-id-4' name='fd' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='981' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='lzc_receive_with_header' mangled-name='lzc_receive_with_header' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='999' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_receive_with_header'>
      <parameter type-id='type-id-46' name='snapname' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='999' column='1'/>
      <parameter type-id='type-id-263' name='props' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='999' column='1'/>
      <parameter type-id='type-id-46' name='origin' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='1000' column='1'/>
      <parameter type-id='type-id-6' name='force' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='1000' column='1'/>
      <parameter type-id='type-id-6' name='resumable' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='1000' column='1'/>
      <parameter type-id='type-id-6' name='raw' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='1000' column='1'/>
      <parameter type-id='type-id-4' name='fd' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='1001' column='1'/>
      <parameter type-id='type-id-260' name='begin_record' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='1001' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='lzc_receive_one' mangled-name='lzc_receive_one' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='1028' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_receive_one'>
      <parameter type-id='type-id-46' name='snapname' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='1028' column='1'/>
      <parameter type-id='type-id-263' name='props' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='1028' column='1'/>
      <parameter type-id='type-id-46' name='origin' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='1029' column='1'/>
      <parameter type-id='type-id-6' name='force' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='1029' column='1'/>
      <parameter type-id='type-id-6' name='resumable' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='1029' column='1'/>
      <parameter type-id='type-id-6' name='raw' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='1029' column='1'/>
      <parameter type-id='type-id-4' name='input_fd' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='1030' column='1'/>
      <parameter type-id='type-id-260' name='begin_record' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='1030' column='1'/>
      <parameter type-id='type-id-4' name='cleanup_fd' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='1030' column='1'/>
      <parameter type-id='type-id-267' name='read_bytes' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='1031' column='1'/>
      <parameter type-id='type-id-267' name='errflags' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='1031' column='1'/>
      <parameter type-id='type-id-267' name='action_handle' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='1031' column='1'/>
      <parameter type-id='type-id-264' name='errors' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='1032' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='lzc_receive_with_cmdprops' mangled-name='lzc_receive_with_cmdprops' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='1047' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_receive_with_cmdprops'>
      <parameter type-id='type-id-46' name='snapname' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='1047' column='1'/>
      <parameter type-id='type-id-263' name='props' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='1047' column='1'/>
      <parameter type-id='type-id-263' name='cmdprops' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='1048' column='1'/>
      <parameter type-id='type-id-268' name='wkeydata' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='1048' column='1'/>
      <parameter type-id='type-id-54' name='wkeylen' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='1048' column='1'/>
      <parameter type-id='type-id-46' name='origin' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='1048' column='1'/>
      <parameter type-id='type-id-6' name='force' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='1049' column='1'/>
      <parameter type-id='type-id-6' name='resumable' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='1049' column='1'/>
      <parameter type-id='type-id-6' name='raw' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='1049' column='1'/>
      <parameter type-id='type-id-4' name='input_fd' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='1049' column='1'/>
      <parameter type-id='type-id-260' name='begin_record' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='1050' column='1'/>
      <parameter type-id='type-id-4' name='cleanup_fd' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='1050' column='1'/>
      <parameter type-id='type-id-267' name='read_bytes' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='1051' column='1'/>
      <parameter type-id='type-id-267' name='errflags' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='1051' column='1'/>
      <parameter type-id='type-id-267' name='action_handle' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='1051' column='1'/>
      <parameter type-id='type-id-264' name='errors' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='1052' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='lzc_rollback' mangled-name='lzc_rollback' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='1070' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_rollback'>
      <parameter type-id='type-id-46' name='fsname' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='1070' column='1'/>
      <parameter type-id='type-id-52' name='snapnamebuf' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='1070' column='1'/>
      <parameter type-id='type-id-4' name='snapnamelen' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='1070' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='lzc_rollback_to' mangled-name='lzc_rollback_to' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='1095' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_rollback_to'>
      <parameter type-id='type-id-46' name='fsname' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='1095' column='1'/>
      <parameter type-id='type-id-46' name='snapname' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='1095' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='lzc_bookmark' mangled-name='lzc_bookmark' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='1125' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_bookmark'>
      <parameter type-id='type-id-263' name='bookmarks' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='1125' column='1'/>
      <parameter type-id='type-id-264' name='errlist' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='1125' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='lzc_get_bookmarks' mangled-name='lzc_get_bookmarks' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='1180' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_get_bookmarks'>
      <parameter type-id='type-id-46' name='fsname' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='1180' column='1'/>
      <parameter type-id='type-id-263' name='props' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='1180' column='1'/>
      <parameter type-id='type-id-264' name='bmarks' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='1180' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='lzc_get_bookmark_props' mangled-name='lzc_get_bookmark_props' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='1201' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_get_bookmark_props'>
      <parameter type-id='type-id-46' name='bookmark' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='1201' column='1'/>
      <parameter type-id='type-id-264' name='props' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='1201' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='lzc_destroy_bookmarks' mangled-name='lzc_destroy_bookmarks' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='1229' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_destroy_bookmarks'>
      <parameter type-id='type-id-263' name='bmarks' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='1229' column='1'/>
      <parameter type-id='type-id-264' name='errlist' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='1229' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='lzc_channel_program' mangled-name='lzc_channel_program' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='1300' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_channel_program'>
      <parameter type-id='type-id-46' name='pool' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='1300' column='1'/>
      <parameter type-id='type-id-46' name='program' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='1300' column='1'/>
      <parameter type-id='type-id-174' name='instrlimit' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='1300' column='1'/>
      <parameter type-id='type-id-174' name='memlimit' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='1301' column='1'/>
      <parameter type-id='type-id-263' name='argnvl' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='1301' column='1'/>
      <parameter type-id='type-id-264' name='outnvl' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='1301' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='lzc_pool_checkpoint' mangled-name='lzc_pool_checkpoint' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='1331' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_pool_checkpoint'>
      <parameter type-id='type-id-46' name='pool' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='1331' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='lzc_pool_checkpoint_discard' mangled-name='lzc_pool_checkpoint_discard' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='1360' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_pool_checkpoint_discard'>
      <parameter type-id='type-id-46' name='pool' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='1360' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='lzc_channel_program_nosync' mangled-name='lzc_channel_program_nosync' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='1388' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_channel_program_nosync'>
      <parameter type-id='type-id-46' name='pool' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='1388' column='1'/>
      <parameter type-id='type-id-46' name='program' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='1388' column='1'/>
      <parameter type-id='type-id-174' name='timeout' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='1389' column='1'/>
      <parameter type-id='type-id-174' name='memlimit' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='1389' column='1'/>
      <parameter type-id='type-id-263' name='argnvl' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='1389' column='1'/>
      <parameter type-id='type-id-264' name='outnvl' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='1389' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='lzc_load_key' mangled-name='lzc_load_key' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='1403' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_load_key'>
      <parameter type-id='type-id-46' name='fsname' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='1403' column='1'/>
      <parameter type-id='type-id-6' name='noop' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='1403' column='1'/>
      <parameter type-id='type-id-268' name='wkeydata' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='1403' column='1'/>
      <parameter type-id='type-id-54' name='wkeylen' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='1404' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='lzc_unload_key' mangled-name='lzc_unload_key' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='1427' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_unload_key'>
      <parameter type-id='type-id-46' name='fsname' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='1427' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='lzc_change_key' mangled-name='lzc_change_key' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='1433' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_change_key'>
      <parameter type-id='type-id-46' name='fsname' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='1433' column='1'/>
      <parameter type-id='type-id-174' name='crypt_cmd' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='1433' column='1'/>
      <parameter type-id='type-id-263' name='props' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='1433' column='1'/>
      <parameter type-id='type-id-268' name='wkeydata' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='1434' column='1'/>
      <parameter type-id='type-id-54' name='wkeylen' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='1434' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='lzc_reopen' mangled-name='lzc_reopen' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='1460' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_reopen'>
      <parameter type-id='type-id-46' name='pool_name' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='1460' column='1'/>
      <parameter type-id='type-id-6' name='scrub_restart' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='1460' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='lzc_initialize' mangled-name='lzc_initialize' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='1495' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_initialize'>
      <parameter type-id='type-id-46' name='poolname' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='1495' column='1'/>
      <parameter type-id='type-id-204' name='cmd_type' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='1495' column='1'/>
      <parameter type-id='type-id-263' name='vdevs' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='1496' column='1'/>
      <parameter type-id='type-id-264' name='errlist' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='1496' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='lzc_trim' mangled-name='lzc_trim' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='1535' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_trim'>
      <parameter type-id='type-id-46' name='poolname' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='1535' column='1'/>
      <parameter type-id='type-id-206' name='cmd_type' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='1535' column='1'/>
      <parameter type-id='type-id-174' name='rate' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='1535' column='1'/>
      <parameter type-id='type-id-6' name='secure' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='1536' column='1'/>
      <parameter type-id='type-id-263' name='vdevs' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='1536' column='1'/>
      <parameter type-id='type-id-264' name='errlist' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='1536' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='lzc_redact' mangled-name='lzc_redact' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='1558' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_redact'>
      <parameter type-id='type-id-46' name='snapshot' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='1558' column='1'/>
      <parameter type-id='type-id-46' name='bookname' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='1558' column='1'/>
      <parameter type-id='type-id-263' name='snapnv' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='1558' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='lzc_wait' mangled-name='lzc_wait' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='1592' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_wait'>
      <parameter type-id='type-id-46' name='pool' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='1592' column='1'/>
      <parameter type-id='type-id-207' name='activity' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='1592' column='1'/>
      <parameter type-id='type-id-257' name='waited' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='1592' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='lzc_wait_tag' mangled-name='lzc_wait_tag' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='1598' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_wait_tag'>
      <parameter type-id='type-id-46' name='pool' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='1598' column='1'/>
      <parameter type-id='type-id-207' name='activity' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='1598' column='1'/>
      <parameter type-id='type-id-174' name='tag' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='1598' column='1'/>
      <parameter type-id='type-id-257' name='waited' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='1599' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='lzc_wait_fs' mangled-name='lzc_wait_fs' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='1605' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_wait_fs'>
      <parameter type-id='type-id-46' name='fs' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='1605' column='1'/>
      <parameter type-id='type-id-209' name='activity' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='1605' column='1'/>
      <parameter type-id='type-id-257' name='waited' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='1605' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='lzc_set_bootenv' mangled-name='lzc_set_bootenv' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='1628' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_set_bootenv'>
      <parameter type-id='type-id-46' name='pool' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='1628' column='1'/>
      <parameter type-id='type-id-262' name='env' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='1628' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='lzc_get_bootenv' mangled-name='lzc_get_bootenv' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='1637' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lzc_get_bootenv'>
      <parameter type-id='type-id-46' name='pool' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='1637' column='1'/>
      <parameter type-id='type-id-264' name='outnvl' filepath='/home/hutter2/release20/lib/libzfs_core/libzfs_core.c' line='1637' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='__errno_location' filepath='/usr/include/errno.h' line='37' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-141'/>
    </function-decl>
    <function-decl name='pthread_mutex_lock' filepath='/usr/include/pthread.h' line='753' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-147'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='pthread_mutex_unlock' filepath='/usr/include/pthread.h' line='771' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-147'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='malloc' filepath='/usr/include/stdlib.h' line='539' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-26'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='free' filepath='/usr/include/stdlib.h' line='565' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='strchr' filepath='/usr/include/string.h' line='230' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-46'/>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='strrchr' filepath='/usr/include/string.h' line='257' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-46'/>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='strcspn' filepath='/usr/include/string.h' line='277' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-46'/>
      <parameter type-id='type-id-46'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='close' filepath='/usr/include/unistd.h' line='353' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='read' filepath='/usr/include/unistd.h' line='360' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-26'/>
      <return type-id='type-id-27'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='os/linux/zutil_device_path_os.c' comp-dir-path='/home/hutter2/release20/lib/libzutil' language='LANG_C99'>
    <array-type-def dimensions='1' type-id='type-id-48' size-in-bits='288' id='type-id-270'>
      <subrange length='36' type-id='type-id-10' id='type-id-271'/>
    </array-type-def>
    <class-decl name='udev' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-272'/>
    <class-decl name='udev_device' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-273'/>
    <array-type-def dimensions='1' type-id='type-id-274' size-in-bits='960' id='type-id-275'>
      <subrange length='1' type-id='type-id-10' id='type-id-77'/>
    </array-type-def>
    <type-decl name='long long int' size-in-bits='64' id='type-id-106'/>
    <array-type-def dimensions='1' type-id='type-id-54' size-in-bits='384' id='type-id-276'>
      <subrange length='12' type-id='type-id-10' id='type-id-181'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-54' size-in-bits='256' id='type-id-277'>
      <subrange length='8' type-id='type-id-10' id='type-id-84'/>
    </array-type-def>
    <class-decl name='dk_part' size-in-bits='960' is-struct='yes' visibility='default' filepath='../../include/sys/efi_partition.h' line='301' column='1' id='type-id-274'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='p_start' type-id='type-id-278' visibility='default' filepath='../../include/sys/efi_partition.h' line='302' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='p_size' type-id='type-id-278' visibility='default' filepath='../../include/sys/efi_partition.h' line='303' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='p_guid' type-id='type-id-279' visibility='default' filepath='../../include/sys/efi_partition.h' line='304' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='p_tag' type-id='type-id-280' visibility='default' filepath='../../include/sys/efi_partition.h' line='305' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='272'>
        <var-decl name='p_flag' type-id='type-id-280' visibility='default' filepath='../../include/sys/efi_partition.h' line='306' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='p_name' type-id='type-id-270' visibility='default' filepath='../../include/sys/efi_partition.h' line='307' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='p_uguid' type-id='type-id-279' visibility='default' filepath='../../include/sys/efi_partition.h' line='308' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='p_resv' type-id='type-id-277' visibility='default' filepath='../../include/sys/efi_partition.h' line='309' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='dk_gpt' size-in-bits='1920' is-struct='yes' visibility='default' filepath='../../include/sys/efi_partition.h' line='316' column='1' id='type-id-281'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='efi_version' type-id='type-id-54' visibility='default' filepath='../../include/sys/efi_partition.h' line='317' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='efi_nparts' type-id='type-id-54' visibility='default' filepath='../../include/sys/efi_partition.h' line='318' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='efi_part_size' type-id='type-id-54' visibility='default' filepath='../../include/sys/efi_partition.h' line='319' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='efi_lbasize' type-id='type-id-54' visibility='default' filepath='../../include/sys/efi_partition.h' line='321' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='efi_last_lba' type-id='type-id-278' visibility='default' filepath='../../include/sys/efi_partition.h' line='322' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='efi_first_u_lba' type-id='type-id-278' visibility='default' filepath='../../include/sys/efi_partition.h' line='323' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='efi_last_u_lba' type-id='type-id-278' visibility='default' filepath='../../include/sys/efi_partition.h' line='324' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='efi_disk_uguid' type-id='type-id-279' visibility='default' filepath='../../include/sys/efi_partition.h' line='325' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='efi_flags' type-id='type-id-54' visibility='default' filepath='../../include/sys/efi_partition.h' line='326' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='efi_reserved1' type-id='type-id-54' visibility='default' filepath='../../include/sys/efi_partition.h' line='327' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='efi_altern_lba' type-id='type-id-278' visibility='default' filepath='../../include/sys/efi_partition.h' line='328' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='efi_reserved' type-id='type-id-276' visibility='default' filepath='../../include/sys/efi_partition.h' line='329' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='efi_parts' type-id='type-id-275' visibility='default' filepath='../../include/sys/efi_partition.h' line='330' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='uuid' size-in-bits='128' is-struct='yes' visibility='default' filepath='../../include/sys/uuid.h' line='68' column='1' id='type-id-279'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='time_low' type-id='type-id-218' visibility='default' filepath='../../include/sys/uuid.h' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='time_mid' type-id='type-id-12' visibility='default' filepath='../../include/sys/uuid.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='time_hi_and_version' type-id='type-id-12' visibility='default' filepath='../../include/sys/uuid.h' line='71' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='clock_seq_hi_and_reserved' type-id='type-id-179' visibility='default' filepath='../../include/sys/uuid.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='72'>
        <var-decl name='clock_seq_low' type-id='type-id-179' visibility='default' filepath='../../include/sys/uuid.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='node_addr' type-id='type-id-187' visibility='default' filepath='../../include/sys/uuid.h' line='74' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='ushort_t' type-id='type-id-282' filepath='../../lib/libspl/include/sys/stdtypes.h' line='32' column='1' id='type-id-280'/>
    <typedef-decl name='longlong_t' type-id='type-id-106' filepath='../../lib/libspl/include/sys/stdtypes.h' line='36' column='1' id='type-id-283'/>
    <typedef-decl name='diskaddr_t' type-id='type-id-283' filepath='../../lib/libspl/include/sys/stdtypes.h' line='41' column='1' id='type-id-278'/>
    <class-decl name='dirent' size-in-bits='2240' is-struct='yes' visibility='default' filepath='/usr/include/bits/dirent.h' line='22' column='1' id='type-id-284'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='d_ino' type-id='type-id-285' visibility='default' filepath='/usr/include/bits/dirent.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='d_off' type-id='type-id-286' visibility='default' filepath='/usr/include/bits/dirent.h' line='29' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='d_reclen' type-id='type-id-282' visibility='default' filepath='/usr/include/bits/dirent.h' line='31' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='144'>
        <var-decl name='d_type' type-id='type-id-13' visibility='default' filepath='/usr/include/bits/dirent.h' line='32' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='152'>
        <var-decl name='d_name' type-id='type-id-165' visibility='default' filepath='/usr/include/bits/dirent.h' line='33' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='uint16_t' type-id='type-id-287' filepath='/usr/include/bits/stdint-uintn.h' line='25' column='1' id='type-id-12'/>
    <typedef-decl name='__uint16_t' type-id='type-id-282' filepath='/usr/include/bits/types.h' line='40' column='1' id='type-id-287'/>
    <pointer-type-def type-id='type-id-284' size-in-bits='64' id='type-id-288'/>
    <pointer-type-def type-id='type-id-281' size-in-bits='64' id='type-id-25'/>
    <pointer-type-def type-id='type-id-25' size-in-bits='64' id='type-id-24'/>
    <pointer-type-def type-id='type-id-272' size-in-bits='64' id='type-id-289'/>
    <pointer-type-def type-id='type-id-273' size-in-bits='64' id='type-id-290'/>
    <class-decl name='udev' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-272'/>
    <class-decl name='udev_device' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-273'/>
    <function-decl name='efi_alloc_and_init' mangled-name='efi_alloc_and_init' filepath='../../include/sys/efi_partition.h' line='366' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_alloc_and_init'>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-218'/>
      <parameter type-id='type-id-24'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='efi_free' mangled-name='efi_free' filepath='../../include/sys/efi_partition.h' line='370' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_free'>
      <parameter type-id='type-id-25'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='udev_new' filepath='/usr/include/libudev.h' line='23' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-289'/>
    </function-decl>
    <function-decl name='udev_device_unref' filepath='/usr/include/libudev.h' line='62' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-290'/>
      <return type-id='type-id-290'/>
    </function-decl>
    <function-decl name='udev_device_new_from_subsystem_sysname' filepath='/usr/include/libudev.h' line='66' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-289'/>
      <parameter type-id='type-id-46'/>
      <parameter type-id='type-id-46'/>
      <return type-id='type-id-290'/>
    </function-decl>
    <function-decl name='udev_device_get_property_value' filepath='/usr/include/libudev.h' line='86' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-290'/>
      <parameter type-id='type-id-46'/>
      <return type-id='type-id-46'/>
    </function-decl>
    <function-decl name='fclose' filepath='/usr/include/stdio.h' line='213' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-60'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='fgets' filepath='/usr/include/stdio.h' line='568' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-47'/>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-28'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='strstr' filepath='/usr/include/string.h' line='334' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-46'/>
      <parameter type-id='type-id-46'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='readlink' filepath='/usr/include/unistd.h' line='820' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-29'/>
      <parameter type-id='type-id-47'/>
      <parameter type-id='type-id-26'/>
      <return type-id='type-id-27'/>
    </function-decl>
    <function-decl name='zfs_strip_partition' mangled-name='zfs_strip_partition' filepath='os/linux/zutil_device_path_os.c' line='84' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_strip_partition'>
      <parameter type-id='type-id-52' name='path' filepath='os/linux/zutil_device_path_os.c' line='84' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='zfs_strip_path' mangled-name='zfs_strip_path' filepath='os/linux/zutil_device_path_os.c' line='152' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_strip_path'>
      <parameter type-id='type-id-52' name='path' filepath='os/linux/zutil_device_path_os.c' line='152' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='zfs_get_enclosure_sysfs_path' mangled-name='zfs_get_enclosure_sysfs_path' filepath='os/linux/zutil_device_path_os.c' line='301' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_get_enclosure_sysfs_path'>
      <parameter type-id='type-id-46' name='dev_name' filepath='os/linux/zutil_device_path_os.c' line='301' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='zfs_dev_is_dm' mangled-name='zfs_dev_is_dm' filepath='os/linux/zutil_device_path_os.c' line='503' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_dev_is_dm'>
      <parameter type-id='type-id-46' name='dev_name' filepath='os/linux/zutil_device_path_os.c' line='503' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_dev_is_whole_disk' mangled-name='zfs_dev_is_whole_disk' filepath='os/linux/zutil_device_path_os.c' line='524' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_dev_is_whole_disk'>
      <parameter type-id='type-id-46' name='dev_name' filepath='os/linux/zutil_device_path_os.c' line='524' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_get_underlying_path' mangled-name='zfs_get_underlying_path' filepath='os/linux/zutil_device_path_os.c' line='584' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_get_underlying_path'>
      <parameter type-id='type-id-46' name='dev_name' filepath='os/linux/zutil_device_path_os.c' line='584' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='is_mpath_whole_disk' mangled-name='is_mpath_whole_disk' filepath='os/linux/zutil_device_path_os.c' line='638' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='is_mpath_whole_disk'>
      <parameter type-id='type-id-46' name='path' filepath='os/linux/zutil_device_path_os.c' line='638' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <type-decl name='unsigned short int' size-in-bits='16' id='type-id-282'/>
  </abi-instr>
  <abi-instr address-size='64' path='os/linux/zutil_import_os.c' comp-dir-path='/home/hutter2/release20/lib/libzutil' language='LANG_C99'>
    <class-decl name='blkid_struct_cache' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-291'/>
    <class-decl name='blkid_struct_dev' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-292'/>
    <class-decl name='blkid_struct_dev_iterate' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-293'/>
    <class-decl name='udev_list_entry' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-294'/>
    <typedef-decl name='__useconds_t' type-id='type-id-15' filepath='/usr/include/bits/types.h' line='161' column='1' id='type-id-295'/>
    <typedef-decl name='__clockid_t' type-id='type-id-4' filepath='/usr/include/bits/types.h' line='169' column='1' id='type-id-296'/>
    <typedef-decl name='clockid_t' type-id='type-id-296' filepath='/usr/include/bits/types/clockid_t.h' line='7' column='1' id='type-id-297'/>
    <typedef-decl name='blkid_dev' type-id='type-id-298' filepath='/usr/include/blkid/blkid.h' line='41' column='1' id='type-id-299'/>
    <typedef-decl name='blkid_cache' type-id='type-id-300' filepath='/usr/include/blkid/blkid.h' line='48' column='1' id='type-id-301'/>
    <typedef-decl name='blkid_dev_iterate' type-id='type-id-302' filepath='/usr/include/blkid/blkid.h' line='104' column='1' id='type-id-303'/>
    <pointer-type-def type-id='type-id-301' size-in-bits='64' id='type-id-304'/>
    <pointer-type-def type-id='type-id-299' size-in-bits='64' id='type-id-305'/>
    <pointer-type-def type-id='type-id-291' size-in-bits='64' id='type-id-300'/>
    <pointer-type-def type-id='type-id-292' size-in-bits='64' id='type-id-298'/>
    <pointer-type-def type-id='type-id-293' size-in-bits='64' id='type-id-302'/>
    <pointer-type-def type-id='type-id-136' size-in-bits='64' id='type-id-306'/>
    <pointer-type-def type-id='type-id-294' size-in-bits='64' id='type-id-307'/>
    <class-decl name='blkid_struct_cache' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-291'/>
    <class-decl name='blkid_struct_dev' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-292'/>
    <class-decl name='blkid_struct_dev_iterate' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-293'/>
    <class-decl name='udev_list_entry' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-294'/>
    <function-decl name='nvlist_remove_all' filepath='../../include/sys/nvpair.h' line='199' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-263'/>
      <parameter type-id='type-id-46'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='blkid_put_cache' filepath='/usr/include/blkid/blkid.h' line='144' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-301'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='blkid_get_cache' filepath='/usr/include/blkid/blkid.h' line='145' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-304'/>
      <parameter type-id='type-id-46'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='blkid_dev_devname' filepath='/usr/include/blkid/blkid.h' line='149' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-299'/>
      <return type-id='type-id-46'/>
    </function-decl>
    <function-decl name='blkid_dev_iterate_begin' filepath='/usr/include/blkid/blkid.h' line='152' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-301'/>
      <return type-id='type-id-303'/>
    </function-decl>
    <function-decl name='blkid_dev_set_search' filepath='/usr/include/blkid/blkid.h' line='153' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-303'/>
      <parameter type-id='type-id-46'/>
      <parameter type-id='type-id-46'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='blkid_dev_next' filepath='/usr/include/blkid/blkid.h' line='155' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-303'/>
      <parameter type-id='type-id-305'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='blkid_dev_iterate_end' filepath='/usr/include/blkid/blkid.h' line='156' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-303'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='blkid_probe_all_new' filepath='/usr/include/blkid/blkid.h' line='167' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-301'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='udev_unref' filepath='/usr/include/libudev.h' line='22' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-289'/>
      <return type-id='type-id-289'/>
    </function-decl>
    <function-decl name='udev_list_entry_get_next' filepath='/usr/include/libudev.h' line='39' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-307'/>
      <return type-id='type-id-307'/>
    </function-decl>
    <function-decl name='udev_list_entry_get_name' filepath='/usr/include/libudev.h' line='41' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-307'/>
      <return type-id='type-id-46'/>
    </function-decl>
    <function-decl name='udev_device_get_parent_with_subsystem_devtype' filepath='/usr/include/libudev.h' line='71' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-290'/>
      <parameter type-id='type-id-46'/>
      <parameter type-id='type-id-46'/>
      <return type-id='type-id-290'/>
    </function-decl>
    <function-decl name='udev_device_get_devlinks_list_entry' filepath='/usr/include/libudev.h' line='82' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-290'/>
      <return type-id='type-id-307'/>
    </function-decl>
    <function-decl name='sched_yield' filepath='/usr/include/sched.h' line='68' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='strtoul' filepath='/usr/include/stdlib.h' line='180' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-29'/>
      <parameter type-id='type-id-308'/>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='strncasecmp' filepath='/usr/include/strings.h' line='120' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-46'/>
      <parameter type-id='type-id-46'/>
      <parameter type-id='type-id-26'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='__xstat64' filepath='/usr/include/sys/stat.h' line='430' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-46'/>
      <parameter type-id='type-id-61'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='clock_gettime' filepath='/usr/include/time.h' line='213' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-297'/>
      <parameter type-id='type-id-306'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='usleep' filepath='/usr/include/unistd.h' line='469' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-295'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zfs_dev_flush' mangled-name='zfs_dev_flush' filepath='os/linux/zutil_import_os.c' line='97' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_dev_flush'>
      <parameter type-id='type-id-4' name='fd' filepath='os/linux/zutil_import_os.c' line='97' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zfs_device_get_devid' mangled-name='zfs_device_get_devid' filepath='os/linux/zutil_import_os.c' line='412' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_device_get_devid'>
      <parameter type-id='type-id-290' name='dev' filepath='os/linux/zutil_import_os.c' line='412' column='1'/>
      <parameter type-id='type-id-52' name='bufptr' filepath='os/linux/zutil_import_os.c' line='412' column='1'/>
      <parameter type-id='type-id-26' name='buflen' filepath='os/linux/zutil_import_os.c' line='412' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zfs_device_get_physical' mangled-name='zfs_device_get_physical' filepath='os/linux/zutil_import_os.c' line='489' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_device_get_physical'>
      <parameter type-id='type-id-290' name='dev' filepath='os/linux/zutil_import_os.c' line='489' column='1'/>
      <parameter type-id='type-id-52' name='bufptr' filepath='os/linux/zutil_import_os.c' line='489' column='1'/>
      <parameter type-id='type-id-26' name='buflen' filepath='os/linux/zutil_import_os.c' line='489' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zpool_label_disk_wait' mangled-name='zpool_label_disk_wait' filepath='os/linux/zutil_import_os.c' line='608' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_label_disk_wait'>
      <parameter type-id='type-id-46' name='path' filepath='os/linux/zutil_import_os.c' line='608' column='1'/>
      <parameter type-id='type-id-4' name='timeout_ms' filepath='os/linux/zutil_import_os.c' line='608' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='zutil_device_path.c' comp-dir-path='/home/hutter2/release20/lib/libzutil' language='LANG_C99'>
    <qualified-type-def type-id='type-id-52' restrict='yes' id='type-id-47'/>
    <qualified-type-def type-id='type-id-46' const='yes' id='type-id-309'/>
    <pointer-type-def type-id='type-id-309' size-in-bits='64' id='type-id-310'/>
    <qualified-type-def type-id='type-id-46' restrict='yes' id='type-id-29'/>
    <function-decl name='zpool_default_search_paths' mangled-name='zpool_default_search_paths' filepath='../../include/libzutil.h' line='78' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_default_search_paths'>
      <parameter type-id='type-id-153'/>
      <return type-id='type-id-310'/>
    </function-decl>
    <function-decl name='zfs_append_partition' mangled-name='zfs_append_partition' filepath='../../include/libzutil.h' line='96' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_append_partition'>
      <parameter type-id='type-id-52'/>
      <parameter type-id='type-id-26'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='strlcat' mangled-name='strlcat' filepath='../../lib/libspl/include/string.h' line='33' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strlcat'>
      <parameter type-id='type-id-52'/>
      <parameter type-id='type-id-46'/>
      <parameter type-id='type-id-26'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='zfs_resolve_shortname' mangled-name='zfs_resolve_shortname' filepath='/home/hutter2/release20/lib/libzutil/zutil_device_path.c' line='41' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_resolve_shortname'>
      <parameter type-id='type-id-46' name='name' filepath='/home/hutter2/release20/lib/libzutil/zutil_device_path.c' line='41' column='1'/>
      <parameter type-id='type-id-52' name='path' filepath='/home/hutter2/release20/lib/libzutil/zutil_device_path.c' line='41' column='1'/>
      <parameter type-id='type-id-26' name='len' filepath='/home/hutter2/release20/lib/libzutil/zutil_device_path.c' line='41' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zfs_strcmp_pathname' mangled-name='zfs_strcmp_pathname' filepath='/home/hutter2/release20/lib/libzutil/zutil_device_path.c' line='139' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_strcmp_pathname'>
      <parameter type-id='type-id-46' name='name' filepath='/home/hutter2/release20/lib/libzutil/zutil_device_path.c' line='139' column='1'/>
      <parameter type-id='type-id-46' name='cmp' filepath='/home/hutter2/release20/lib/libzutil/zutil_device_path.c' line='139' column='1'/>
      <parameter type-id='type-id-4' name='wholedisk' filepath='/home/hutter2/release20/lib/libzutil/zutil_device_path.c' line='139' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='snprintf' filepath='/usr/include/stdio.h' line='354' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-52'/>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-46'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='getenv' filepath='/usr/include/stdlib.h' line='634' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-46'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='memset' filepath='/usr/include/string.h' line='61' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-26'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='strcmp' filepath='/usr/include/string.h' line='140' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-46'/>
      <parameter type-id='type-id-46'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='strdup' filepath='/usr/include/string.h' line='171' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-46'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='strtok' filepath='/usr/include/string.h' line='340' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-47'/>
      <parameter type-id='type-id-29'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='strlen' filepath='/usr/include/string.h' line='391' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-46'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='access' filepath='/usr/include/unistd.h' line='287' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-46'/>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-4'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='zutil_import.c' comp-dir-path='/home/hutter2/release20/lib/libzutil' language='LANG_C99'>
    <array-type-def dimensions='1' type-id='type-id-311' size-in-bits='192' id='type-id-312'>
      <subrange length='3' type-id='type-id-10' id='type-id-184'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-313' size-in-bits='128' id='type-id-314'>
      <subrange length='2' type-id='type-id-10' id='type-id-86'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-48' size-in-bits='8192' id='type-id-315'>
      <subrange length='1024' type-id='type-id-10' id='type-id-316'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-48' size-in-bits='8' id='type-id-317'>
      <subrange length='1' type-id='type-id-10' id='type-id-77'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-48' size-in-bits='160' id='type-id-318'>
      <subrange length='20' type-id='type-id-10' id='type-id-319'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-48' size-in-bits='32' id='type-id-102'>
      <subrange length='4' type-id='type-id-10' id='type-id-89'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-48' size-in-bits='448' id='type-id-320'>
      <subrange length='56' type-id='type-id-10' id='type-id-321'/>
    </array-type-def>
    <class-decl name='_IO_codecvt' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-322'/>
    <class-decl name='_IO_marker' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-323'/>
    <class-decl name='_IO_wide_data' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-324'/>
    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-325'/>
    <class-decl name='__va_list_tag' size-in-bits='192' is-struct='yes' visibility='default' id='type-id-326'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='gp_offset' type-id='type-id-15' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='fp_offset' type-id='type-id-15' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='overflow_arg_area' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='reg_save_area' type-id='type-id-2' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='tpool' size-in-bits='2496' is-struct='yes' visibility='default' filepath='/home/hutter2/release20/lib/libtpool/thread_pool_impl.h' line='63' column='1' id='type-id-162'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tp_forw' type-id='type-id-160' visibility='default' filepath='/home/hutter2/release20/lib/libtpool/thread_pool_impl.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tp_back' type-id='type-id-160' visibility='default' filepath='/home/hutter2/release20/lib/libtpool/thread_pool_impl.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='tp_mutex' type-id='type-id-163' visibility='default' filepath='/home/hutter2/release20/lib/libtpool/thread_pool_impl.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='tp_busycv' type-id='type-id-103' visibility='default' filepath='/home/hutter2/release20/lib/libtpool/thread_pool_impl.h' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='tp_workcv' type-id='type-id-103' visibility='default' filepath='/home/hutter2/release20/lib/libtpool/thread_pool_impl.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='tp_waitcv' type-id='type-id-103' visibility='default' filepath='/home/hutter2/release20/lib/libtpool/thread_pool_impl.h' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='tp_active' type-id='type-id-96' visibility='default' filepath='/home/hutter2/release20/lib/libtpool/thread_pool_impl.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='tp_head' type-id='type-id-92' visibility='default' filepath='/home/hutter2/release20/lib/libtpool/thread_pool_impl.h' line='71' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='tp_tail' type-id='type-id-92' visibility='default' filepath='/home/hutter2/release20/lib/libtpool/thread_pool_impl.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='tp_attr' type-id='type-id-126' visibility='default' filepath='/home/hutter2/release20/lib/libtpool/thread_pool_impl.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <var-decl name='tp_flags' type-id='type-id-4' visibility='default' filepath='/home/hutter2/release20/lib/libtpool/thread_pool_impl.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2272'>
        <var-decl name='tp_linger' type-id='type-id-54' visibility='default' filepath='/home/hutter2/release20/lib/libtpool/thread_pool_impl.h' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2304'>
        <var-decl name='tp_njobs' type-id='type-id-4' visibility='default' filepath='/home/hutter2/release20/lib/libtpool/thread_pool_impl.h' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2336'>
        <var-decl name='tp_minimum' type-id='type-id-4' visibility='default' filepath='/home/hutter2/release20/lib/libtpool/thread_pool_impl.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2368'>
        <var-decl name='tp_maximum' type-id='type-id-4' visibility='default' filepath='/home/hutter2/release20/lib/libtpool/thread_pool_impl.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2400'>
        <var-decl name='tp_current' type-id='type-id-4' visibility='default' filepath='/home/hutter2/release20/lib/libtpool/thread_pool_impl.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2432'>
        <var-decl name='tp_idle' type-id='type-id-4' visibility='default' filepath='/home/hutter2/release20/lib/libtpool/thread_pool_impl.h' line='80' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='long long unsigned int' size-in-bits='64' id='type-id-110'/>
    <type-decl name='signed char' size-in-bits='8' id='type-id-327'/>
    <type-decl name='unsigned short int' size-in-bits='16' id='type-id-282'/>
    <typedef-decl name='refresh_config_func_t' type-id='type-id-328' filepath='../../include/libzutil.h' line='47' column='1' id='type-id-329'/>
    <typedef-decl name='pool_active_func_t' type-id='type-id-330' filepath='../../include/libzutil.h' line='49' column='1' id='type-id-331'/>
    <class-decl name='pool_config_ops' size-in-bits='128' is-struct='yes' visibility='default' filepath='../../include/libzutil.h' line='51' column='1' id='type-id-332'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='pco_refresh_config' type-id='type-id-333' visibility='default' filepath='../../include/libzutil.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='pco_pool_active' type-id='type-id-334' visibility='default' filepath='../../include/libzutil.h' line='53' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='pool_config_ops_t' type-id='type-id-335' filepath='../../include/libzutil.h' line='54' column='1' id='type-id-336'/>
    <class-decl name='importargs' size-in-bits='448' is-struct='yes' visibility='default' filepath='../../include/libzutil.h' line='62' column='1' id='type-id-337'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='path' type-id='type-id-338' visibility='default' filepath='../../include/libzutil.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='paths' type-id='type-id-4' visibility='default' filepath='../../include/libzutil.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='poolname' type-id='type-id-46' visibility='default' filepath='../../include/libzutil.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='guid' type-id='type-id-174' visibility='default' filepath='../../include/libzutil.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='cachefile' type-id='type-id-46' visibility='default' filepath='../../include/libzutil.h' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='can_be_active' type-id='type-id-6' visibility='default' filepath='../../include/libzutil.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='scan' type-id='type-id-6' visibility='default' filepath='../../include/libzutil.h' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='policy' type-id='type-id-263' visibility='default' filepath='../../include/libzutil.h' line='70' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='importargs_t' type-id='type-id-337' filepath='../../include/libzutil.h' line='71' column='1' id='type-id-339'/>
    <typedef-decl name='pool_vdev_iter_f' type-id='type-id-340' filepath='../../include/libzutil.h' line='166' column='1' id='type-id-341'/>
    <typedef-decl name='avl_tree_t' type-id='type-id-342' filepath='../../include/sys/avl.h' line='119' column='1' id='type-id-343'/>
    <typedef-decl name='avl_index_t' type-id='type-id-344' filepath='../../include/sys/avl.h' line='130' column='1' id='type-id-3'/>
    <class-decl name='avl_node' size-in-bits='192' is-struct='yes' visibility='default' filepath='../../include/sys/avl_impl.h' line='90' column='1' id='type-id-345'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='avl_child' type-id='type-id-314' visibility='default' filepath='../../include/sys/avl_impl.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='avl_pcb' type-id='type-id-344' visibility='default' filepath='../../include/sys/avl_impl.h' line='92' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='avl_tree' size-in-bits='320' is-struct='yes' visibility='default' filepath='../../include/sys/avl_impl.h' line='146' column='1' id='type-id-342'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='avl_root' type-id='type-id-313' visibility='default' filepath='../../include/sys/avl_impl.h' line='147' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='avl_compar' type-id='type-id-346' visibility='default' filepath='../../include/sys/avl_impl.h' line='148' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='avl_offset' type-id='type-id-26' visibility='default' filepath='../../include/sys/avl_impl.h' line='149' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='avl_numnodes' type-id='type-id-7' visibility='default' filepath='../../include/sys/avl_impl.h' line='150' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='avl_size' type-id='type-id-26' visibility='default' filepath='../../include/sys/avl_impl.h' line='151' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='tpool_t' type-id='type-id-162' filepath='../../include/thread_pool.h' line='38' column='1' id='type-id-161'/>
    <typedef-decl name='ulong_t' type-id='type-id-10' filepath='../../lib/libspl/include/sys/stdtypes.h' line='34' column='1' id='type-id-7'/>
    <class-decl name='libpc_handle' size-in-bits='8448' is-struct='yes' visibility='default' filepath='/home/hutter2/release20/lib/libzutil/zutil_import.h' line='41' column='1' id='type-id-347'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='lpc_printerr' type-id='type-id-6' visibility='default' filepath='/home/hutter2/release20/lib/libzutil/zutil_import.h' line='42' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='lpc_open_access_error' type-id='type-id-6' visibility='default' filepath='/home/hutter2/release20/lib/libzutil/zutil_import.h' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='lpc_desc_active' type-id='type-id-6' visibility='default' filepath='/home/hutter2/release20/lib/libzutil/zutil_import.h' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='lpc_desc' type-id='type-id-315' visibility='default' filepath='/home/hutter2/release20/lib/libzutil/zutil_import.h' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8320'>
        <var-decl name='lpc_ops' type-id='type-id-348' visibility='default' filepath='/home/hutter2/release20/lib/libzutil/zutil_import.h' line='46' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8384'>
        <var-decl name='lpc_lib_handle' type-id='type-id-2' visibility='default' filepath='/home/hutter2/release20/lib/libzutil/zutil_import.h' line='47' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='libpc_handle_t' type-id='type-id-347' filepath='/home/hutter2/release20/lib/libzutil/zutil_import.h' line='48' column='1' id='type-id-349'/>
    <class-decl name='dirent64' size-in-bits='2240' is-struct='yes' visibility='default' filepath='/usr/include/bits/dirent.h' line='37' column='1' id='type-id-350'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='d_ino' type-id='type-id-285' visibility='default' filepath='/usr/include/bits/dirent.h' line='39' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='d_off' type-id='type-id-286' visibility='default' filepath='/usr/include/bits/dirent.h' line='40' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='d_reclen' type-id='type-id-282' visibility='default' filepath='/usr/include/bits/dirent.h' line='41' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='144'>
        <var-decl name='d_type' type-id='type-id-13' visibility='default' filepath='/usr/include/bits/dirent.h' line='42' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='152'>
        <var-decl name='d_name' type-id='type-id-165' visibility='default' filepath='/usr/include/bits/dirent.h' line='43' column='1'/>
      </data-member>
    </class-decl>
    <union-decl name='pthread_mutexattr_t' size-in-bits='32' naming-typedef-id='type-id-351' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='32' column='1' id='type-id-352'>
      <data-member access='public'>
        <var-decl name='__size' type-id='type-id-102' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='34' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__align' type-id='type-id-4' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='35' column='1'/>
      </data-member>
    </union-decl>
    <typedef-decl name='pthread_mutexattr_t' type-id='type-id-352' filepath='/usr/include/bits/pthreadtypes.h' line='36' column='1' id='type-id-351'/>
    <union-decl name='pthread_attr_t' size-in-bits='448' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='56' column='1' id='type-id-353'>
      <data-member access='public'>
        <var-decl name='__size' type-id='type-id-320' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='58' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__align' type-id='type-id-64' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='59' column='1'/>
      </data-member>
    </union-decl>
    <typedef-decl name='pthread_attr_t' type-id='type-id-353' filepath='/usr/include/bits/pthreadtypes.h' line='62' column='1' id='type-id-126'/>
    <class-decl name='stat' size-in-bits='1152' is-struct='yes' visibility='default' filepath='/usr/include/bits/stat.h' line='46' column='1' id='type-id-354'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='st_dev' type-id='type-id-355' visibility='default' filepath='/usr/include/bits/stat.h' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='st_ino' type-id='type-id-356' visibility='default' filepath='/usr/include/bits/stat.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='st_nlink' type-id='type-id-357' visibility='default' filepath='/usr/include/bits/stat.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='st_mode' type-id='type-id-38' visibility='default' filepath='/usr/include/bits/stat.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='st_uid' type-id='type-id-358' visibility='default' filepath='/usr/include/bits/stat.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='st_gid' type-id='type-id-359' visibility='default' filepath='/usr/include/bits/stat.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='__pad0' type-id='type-id-4' visibility='default' filepath='/usr/include/bits/stat.h' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='st_rdev' type-id='type-id-355' visibility='default' filepath='/usr/include/bits/stat.h' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='st_size' type-id='type-id-360' visibility='default' filepath='/usr/include/bits/stat.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='st_blksize' type-id='type-id-361' visibility='default' filepath='/usr/include/bits/stat.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='st_blocks' type-id='type-id-362' visibility='default' filepath='/usr/include/bits/stat.h' line='80' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='st_atim' type-id='type-id-136' visibility='default' filepath='/usr/include/bits/stat.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='st_mtim' type-id='type-id-136' visibility='default' filepath='/usr/include/bits/stat.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='st_ctim' type-id='type-id-136' visibility='default' filepath='/usr/include/bits/stat.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='__glibc_reserved' type-id='type-id-312' visibility='default' filepath='/usr/include/bits/stat.h' line='106' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='stat64' size-in-bits='1152' is-struct='yes' visibility='default' filepath='/usr/include/bits/stat.h' line='119' column='1' id='type-id-363'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='st_dev' type-id='type-id-355' visibility='default' filepath='/usr/include/bits/stat.h' line='121' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='st_ino' type-id='type-id-285' visibility='default' filepath='/usr/include/bits/stat.h' line='123' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='st_nlink' type-id='type-id-357' visibility='default' filepath='/usr/include/bits/stat.h' line='124' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='st_mode' type-id='type-id-38' visibility='default' filepath='/usr/include/bits/stat.h' line='125' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='st_uid' type-id='type-id-358' visibility='default' filepath='/usr/include/bits/stat.h' line='132' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='st_gid' type-id='type-id-359' visibility='default' filepath='/usr/include/bits/stat.h' line='133' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='__pad0' type-id='type-id-4' visibility='default' filepath='/usr/include/bits/stat.h' line='135' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='st_rdev' type-id='type-id-355' visibility='default' filepath='/usr/include/bits/stat.h' line='136' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='st_size' type-id='type-id-360' visibility='default' filepath='/usr/include/bits/stat.h' line='137' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='st_blksize' type-id='type-id-361' visibility='default' filepath='/usr/include/bits/stat.h' line='143' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='st_blocks' type-id='type-id-364' visibility='default' filepath='/usr/include/bits/stat.h' line='144' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='st_atim' type-id='type-id-136' visibility='default' filepath='/usr/include/bits/stat.h' line='152' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='st_mtim' type-id='type-id-136' visibility='default' filepath='/usr/include/bits/stat.h' line='153' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='st_ctim' type-id='type-id-136' visibility='default' filepath='/usr/include/bits/stat.h' line='154' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='__glibc_reserved' type-id='type-id-312' visibility='default' filepath='/usr/include/bits/stat.h' line='164' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__dev_t' type-id='type-id-10' filepath='/usr/include/bits/types.h' line='145' column='1' id='type-id-355'/>
    <typedef-decl name='__uid_t' type-id='type-id-15' filepath='/usr/include/bits/types.h' line='146' column='1' id='type-id-358'/>
    <typedef-decl name='__gid_t' type-id='type-id-15' filepath='/usr/include/bits/types.h' line='147' column='1' id='type-id-359'/>
    <typedef-decl name='__ino_t' type-id='type-id-10' filepath='/usr/include/bits/types.h' line='148' column='1' id='type-id-356'/>
    <typedef-decl name='__ino64_t' type-id='type-id-10' filepath='/usr/include/bits/types.h' line='149' column='1' id='type-id-285'/>
    <typedef-decl name='__mode_t' type-id='type-id-15' filepath='/usr/include/bits/types.h' line='150' column='1' id='type-id-38'/>
    <typedef-decl name='__nlink_t' type-id='type-id-10' filepath='/usr/include/bits/types.h' line='151' column='1' id='type-id-357'/>
    <typedef-decl name='__off_t' type-id='type-id-64' filepath='/usr/include/bits/types.h' line='152' column='1' id='type-id-360'/>
    <typedef-decl name='__off64_t' type-id='type-id-64' filepath='/usr/include/bits/types.h' line='153' column='1' id='type-id-286'/>
    <typedef-decl name='__time_t' type-id='type-id-64' filepath='/usr/include/bits/types.h' line='160' column='1' id='type-id-65'/>
    <typedef-decl name='__blksize_t' type-id='type-id-64' filepath='/usr/include/bits/types.h' line='175' column='1' id='type-id-361'/>
    <typedef-decl name='__blkcnt_t' type-id='type-id-64' filepath='/usr/include/bits/types.h' line='180' column='1' id='type-id-362'/>
    <typedef-decl name='__blkcnt64_t' type-id='type-id-64' filepath='/usr/include/bits/types.h' line='181' column='1' id='type-id-364'/>
    <typedef-decl name='__syscall_slong_t' type-id='type-id-64' filepath='/usr/include/bits/types.h' line='197' column='1' id='type-id-311'/>
    <typedef-decl name='FILE' type-id='type-id-365' filepath='/usr/include/bits/types/FILE.h' line='7' column='1' id='type-id-366'/>
    <typedef-decl name='_IO_lock_t' type-id='type-id-5' filepath='/usr/include/bits/types/struct_FILE.h' line='43' column='1' id='type-id-367'/>
    <class-decl name='_IO_FILE' size-in-bits='1728' is-struct='yes' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='49' column='1' id='type-id-365'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_flags' type-id='type-id-4' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_IO_read_ptr' type-id='type-id-52' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_IO_read_end' type-id='type-id-52' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_IO_read_base' type-id='type-id-52' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='_IO_write_base' type-id='type-id-52' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='_IO_write_ptr' type-id='type-id-52' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_IO_write_end' type-id='type-id-52' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='_IO_buf_base' type-id='type-id-52' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='_IO_buf_end' type-id='type-id-52' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='_IO_save_base' type-id='type-id-52' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='_IO_backup_base' type-id='type-id-52' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='_IO_save_end' type-id='type-id-52' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='_markers' type-id='type-id-368' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='_chain' type-id='type-id-369' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='_fileno' type-id='type-id-4' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='_flags2' type-id='type-id-4' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='_old_offset' type-id='type-id-360' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='_cur_column' type-id='type-id-282' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1040'>
        <var-decl name='_vtable_offset' type-id='type-id-327' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1048'>
        <var-decl name='_shortbuf' type-id='type-id-317' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='_lock' type-id='type-id-370' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='_offset' type-id='type-id-286' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='_codecvt' type-id='type-id-371' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='_wide_data' type-id='type-id-372' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='_freeres_list' type-id='type-id-369' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='_freeres_buf' type-id='type-id-2' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='__pad5' type-id='type-id-26' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='_mode' type-id='type-id-4' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='_unused2' type-id='type-id-318' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='98' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='timespec' size-in-bits='128' is-struct='yes' visibility='default' filepath='/usr/include/bits/types/struct_timespec.h' line='10' column='1' id='type-id-136'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tv_sec' type-id='type-id-65' visibility='default' filepath='/usr/include/bits/types/struct_timespec.h' line='12' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tv_nsec' type-id='type-id-311' visibility='default' filepath='/usr/include/bits/types/struct_timespec.h' line='16' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='DIR' type-id='type-id-325' filepath='/usr/include/dirent.h' line='127' column='1' id='type-id-373'/>
    <typedef-decl name='uintptr_t' type-id='type-id-10' filepath='/usr/include/stdint.h' line='90' column='1' id='type-id-344'/>
    <pointer-type-def type-id='type-id-373' size-in-bits='64' id='type-id-374'/>
    <pointer-type-def type-id='type-id-366' size-in-bits='64' id='type-id-60'/>
    <qualified-type-def type-id='type-id-60' restrict='yes' id='type-id-28'/>
    <pointer-type-def type-id='type-id-365' size-in-bits='64' id='type-id-369'/>
    <pointer-type-def type-id='type-id-322' size-in-bits='64' id='type-id-371'/>
    <pointer-type-def type-id='type-id-367' size-in-bits='64' id='type-id-370'/>
    <pointer-type-def type-id='type-id-323' size-in-bits='64' id='type-id-368'/>
    <pointer-type-def type-id='type-id-324' size-in-bits='64' id='type-id-372'/>
    <pointer-type-def type-id='type-id-326' size-in-bits='64' id='type-id-30'/>
    <pointer-type-def type-id='type-id-3' size-in-bits='64' id='type-id-375'/>
    <pointer-type-def type-id='type-id-345' size-in-bits='64' id='type-id-313'/>
    <pointer-type-def type-id='type-id-342' size-in-bits='64' id='type-id-376'/>
    <pointer-type-def type-id='type-id-343' size-in-bits='64' id='type-id-1'/>
    <pointer-type-def type-id='type-id-1' size-in-bits='64' id='type-id-377'/>
    <pointer-type-def type-id='type-id-52' size-in-bits='64' id='type-id-338'/>
    <qualified-type-def type-id='type-id-338' restrict='yes' id='type-id-308'/>
    <qualified-type-def type-id='type-id-332' const='yes' id='type-id-335'/>
    <qualified-type-def type-id='type-id-351' const='yes' id='type-id-378'/>
    <pointer-type-def type-id='type-id-378' size-in-bits='64' id='type-id-379'/>
    <pointer-type-def type-id='type-id-350' size-in-bits='64' id='type-id-380'/>
    <pointer-type-def type-id='type-id-339' size-in-bits='64' id='type-id-381'/>
    <pointer-type-def type-id='type-id-382' size-in-bits='64' id='type-id-340'/>
    <pointer-type-def type-id='type-id-383' size-in-bits='64' id='type-id-346'/>
    <pointer-type-def type-id='type-id-349' size-in-bits='64' id='type-id-384'/>
    <pointer-type-def type-id='type-id-264' size-in-bits='64' id='type-id-385'/>
    <pointer-type-def type-id='type-id-331' size-in-bits='64' id='type-id-334'/>
    <pointer-type-def type-id='type-id-336' size-in-bits='64' id='type-id-348'/>
    <pointer-type-def type-id='type-id-126' size-in-bits='64' id='type-id-143'/>
    <pointer-type-def type-id='type-id-329' size-in-bits='64' id='type-id-333'/>
    <pointer-type-def type-id='type-id-354' size-in-bits='64' id='type-id-386'/>
    <pointer-type-def type-id='type-id-363' size-in-bits='64' id='type-id-61'/>
    <pointer-type-def type-id='type-id-161' size-in-bits='64' id='type-id-160'/>
    <pointer-type-def type-id='type-id-267' size-in-bits='64' id='type-id-387'/>
    <pointer-type-def type-id='type-id-54' size-in-bits='64' id='type-id-388'/>
    <pointer-type-def type-id='type-id-164' size-in-bits='64' id='type-id-93'/>
    <pointer-type-def type-id='type-id-2' size-in-bits='64' id='type-id-158'/>
    <class-decl name='_IO_codecvt' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-322'/>
    <class-decl name='_IO_marker' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-323'/>
    <class-decl name='_IO_wide_data' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-324'/>
    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-325'/>
    <function-decl name='update_vdev_config_dev_strs' mangled-name='update_vdev_config_dev_strs' filepath='../../include/libzutil.h' line='87' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='update_vdev_config_dev_strs'>
      <parameter type-id='type-id-263'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='update_vdevs_config_dev_sysfs_path' mangled-name='update_vdevs_config_dev_sysfs_path' filepath='../../include/libzutil.h' line='171' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='update_vdevs_config_dev_sysfs_path'>
      <parameter type-id='type-id-263'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='avl_create' mangled-name='avl_create' filepath='../../include/sys/avl.h' line='163' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_create'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-346'/>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-26'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='avl_find' mangled-name='avl_find' filepath='../../include/sys/avl.h' line='175' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_find'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-375'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='avl_insert' mangled-name='avl_insert' filepath='../../include/sys/avl.h' line='183' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_insert'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='avl_first' mangled-name='avl_first' filepath='../../include/sys/avl.h' line='205' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_first'>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='avl_destroy_nodes' mangled-name='avl_destroy_nodes' filepath='../../include/sys/avl.h' line='309' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_destroy_nodes'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-158'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='avl_destroy' mangled-name='avl_destroy' filepath='../../include/sys/avl.h' line='317' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_destroy'>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='avl_walk' mangled-name='avl_walk' filepath='../../include/sys/avl_impl.h' line='158' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_walk'>
      <parameter type-id='type-id-376'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_alloc' filepath='../../include/sys/nvpair.h' line='151' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-264'/>
      <parameter type-id='type-id-54'/>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='nvlist_dup' filepath='../../include/sys/nvpair.h' line='156' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-263'/>
      <parameter type-id='type-id-264'/>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='nvlist_add_uint64' filepath='../../include/sys/nvpair.h' line='178' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-263'/>
      <parameter type-id='type-id-46'/>
      <parameter type-id='type-id-174'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='nvlist_add_string' filepath='../../include/sys/nvpair.h' line='179' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-263'/>
      <parameter type-id='type-id-46'/>
      <parameter type-id='type-id-46'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='nvlist_add_nvlist' filepath='../../include/sys/nvpair.h' line='180' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-263'/>
      <parameter type-id='type-id-46'/>
      <parameter type-id='type-id-263'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='nvlist_add_uint64_array' filepath='../../include/sys/nvpair.h' line='190' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-263'/>
      <parameter type-id='type-id-46'/>
      <parameter type-id='type-id-267'/>
      <parameter type-id='type-id-54'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='nvlist_add_nvlist_array' filepath='../../include/sys/nvpair.h' line='192' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-263'/>
      <parameter type-id='type-id-46'/>
      <parameter type-id='type-id-264'/>
      <parameter type-id='type-id-54'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='nvlist_remove' filepath='../../include/sys/nvpair.h' line='198' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-263'/>
      <parameter type-id='type-id-46'/>
      <parameter type-id='type-id-211'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='nvlist_lookup_string' filepath='../../include/sys/nvpair.h' line='213' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-263'/>
      <parameter type-id='type-id-46'/>
      <parameter type-id='type-id-338'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='nvlist_lookup_uint64_array' filepath='../../include/sys/nvpair.h' line='225' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-263'/>
      <parameter type-id='type-id-46'/>
      <parameter type-id='type-id-387'/>
      <parameter type-id='type-id-388'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='nvlist_lookup_nvlist_array' filepath='../../include/sys/nvpair.h' line='227' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-263'/>
      <parameter type-id='type-id-46'/>
      <parameter type-id='type-id-385'/>
      <parameter type-id='type-id-388'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='nvlist_empty' filepath='../../include/sys/nvpair.h' line='239' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-263'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='nvpair_value_nvlist' filepath='../../include/sys/nvpair.h' line='258' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-265'/>
      <parameter type-id='type-id-264'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_nvlist' filepath='../../include/sys/nvpair.h' line='329' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-263'/>
      <parameter type-id='type-id-46'/>
      <return type-id='type-id-263'/>
    </function-decl>
    <function-decl name='fnvpair_value_nvlist' filepath='../../include/sys/nvpair.h' line='352' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-265'/>
      <return type-id='type-id-263'/>
    </function-decl>
    <function-decl name='tpool_create' mangled-name='tpool_create' filepath='../../include/thread_pool.h' line='42' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='tpool_create'>
      <parameter type-id='type-id-54'/>
      <parameter type-id='type-id-54'/>
      <parameter type-id='type-id-54'/>
      <parameter type-id='type-id-143'/>
      <return type-id='type-id-160'/>
    </function-decl>
    <function-decl name='tpool_dispatch' mangled-name='tpool_dispatch' filepath='../../include/thread_pool.h' line='44' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='tpool_dispatch'>
      <parameter type-id='type-id-160'/>
      <parameter type-id='type-id-93'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='tpool_destroy' mangled-name='tpool_destroy' filepath='../../include/thread_pool.h' line='46' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='tpool_destroy'>
      <parameter type-id='type-id-160'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='tpool_wait' mangled-name='tpool_wait' filepath='../../include/thread_pool.h' line='48' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='tpool_wait'>
      <parameter type-id='type-id-160'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='spl_pagesize' mangled-name='spl_pagesize' filepath='../../lib/libspl/include/os/linux/sys/param.h' line='64' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spl_pagesize'>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='zutil_alloc' mangled-name='zutil_alloc' filepath='/home/hutter2/release20/lib/libzutil/zutil_import.c' line='135' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zutil_alloc'>
      <parameter type-id='type-id-384' name='hdl' filepath='/home/hutter2/release20/lib/libzutil/zutil_import.c' line='135' column='1'/>
      <parameter type-id='type-id-26' name='size' filepath='/home/hutter2/release20/lib/libzutil/zutil_import.c' line='135' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='zutil_strdup' mangled-name='zutil_strdup' filepath='/home/hutter2/release20/lib/libzutil/zutil_import.c' line='146' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zutil_strdup'>
      <parameter type-id='type-id-384' name='hdl' filepath='/home/hutter2/release20/lib/libzutil/zutil_import.c' line='146' column='1'/>
      <parameter type-id='type-id-46' name='str' filepath='/home/hutter2/release20/lib/libzutil/zutil_import.c' line='146' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='zpool_read_label' mangled-name='zpool_read_label' filepath='/home/hutter2/release20/lib/libzutil/zutil_import.c' line='887' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_read_label'>
      <parameter type-id='type-id-4' name='fd' filepath='/home/hutter2/release20/lib/libzutil/zutil_import.c' line='887' column='1'/>
      <parameter type-id='type-id-264' name='config' filepath='/home/hutter2/release20/lib/libzutil/zutil_import.c' line='887' column='1'/>
      <parameter type-id='type-id-141' name='num_labels' filepath='/home/hutter2/release20/lib/libzutil/zutil_import.c' line='887' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='slice_cache_compare' mangled-name='slice_cache_compare' filepath='/home/hutter2/release20/lib/libzutil/zutil_import.c' line='967' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='slice_cache_compare'>
      <parameter type-id='type-id-2' name='arg1' filepath='/home/hutter2/release20/lib/libzutil/zutil_import.c' line='967' column='1'/>
      <parameter type-id='type-id-2' name='arg2' filepath='/home/hutter2/release20/lib/libzutil/zutil_import.c' line='967' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='label_paths' mangled-name='label_paths' filepath='/home/hutter2/release20/lib/libzutil/zutil_import.c' line='1027' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='label_paths'>
      <parameter type-id='type-id-384' name='hdl' filepath='/home/hutter2/release20/lib/libzutil/zutil_import.c' line='1027' column='1'/>
      <parameter type-id='type-id-263' name='label' filepath='/home/hutter2/release20/lib/libzutil/zutil_import.c' line='1027' column='1'/>
      <parameter type-id='type-id-338' name='path' filepath='/home/hutter2/release20/lib/libzutil/zutil_import.c' line='1027' column='1'/>
      <parameter type-id='type-id-338' name='devid' filepath='/home/hutter2/release20/lib/libzutil/zutil_import.c' line='1027' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zpool_search_import' mangled-name='zpool_search_import' filepath='/home/hutter2/release20/lib/libzutil/zutil_import.c' line='1600' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_search_import'>
      <parameter type-id='type-id-2' name='hdl' filepath='/home/hutter2/release20/lib/libzutil/zutil_import.c' line='1600' column='1'/>
      <parameter type-id='type-id-381' name='import' filepath='/home/hutter2/release20/lib/libzutil/zutil_import.c' line='1600' column='1'/>
      <parameter type-id='type-id-348' name='pco' filepath='/home/hutter2/release20/lib/libzutil/zutil_import.c' line='1601' column='1'/>
      <return type-id='type-id-263'/>
    </function-decl>
    <function-decl name='zpool_find_config' mangled-name='zpool_find_config' filepath='/home/hutter2/release20/lib/libzutil/zutil_import.c' line='1643' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_find_config'>
      <parameter type-id='type-id-2' name='hdl' filepath='/home/hutter2/release20/lib/libzutil/zutil_import.c' line='1643' column='1'/>
      <parameter type-id='type-id-46' name='target' filepath='/home/hutter2/release20/lib/libzutil/zutil_import.c' line='1643' column='1'/>
      <parameter type-id='type-id-264' name='configp' filepath='/home/hutter2/release20/lib/libzutil/zutil_import.c' line='1643' column='1'/>
      <parameter type-id='type-id-381' name='args' filepath='/home/hutter2/release20/lib/libzutil/zutil_import.c' line='1644' column='1'/>
      <parameter type-id='type-id-348' name='pco' filepath='/home/hutter2/release20/lib/libzutil/zutil_import.c' line='1644' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='for_each_vdev_cb' mangled-name='for_each_vdev_cb' filepath='/home/hutter2/release20/lib/libzutil/zutil_import.c' line='1708' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='for_each_vdev_cb'>
      <parameter type-id='type-id-2' name='zhp' filepath='/home/hutter2/release20/lib/libzutil/zutil_import.c' line='1708' column='1'/>
      <parameter type-id='type-id-263' name='nv' filepath='/home/hutter2/release20/lib/libzutil/zutil_import.c' line='1708' column='1'/>
      <parameter type-id='type-id-341' name='func' filepath='/home/hutter2/release20/lib/libzutil/zutil_import.c' line='1708' column='1'/>
      <parameter type-id='type-id-2' name='data' filepath='/home/hutter2/release20/lib/libzutil/zutil_import.c' line='1709' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='for_each_vdev_in_nvlist' mangled-name='for_each_vdev_in_nvlist' filepath='/home/hutter2/release20/lib/libzutil/zutil_import.c' line='1758' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='for_each_vdev_in_nvlist'>
      <parameter type-id='type-id-263' name='nvroot' filepath='/home/hutter2/release20/lib/libzutil/zutil_import.c' line='1758' column='1'/>
      <parameter type-id='type-id-341' name='func' filepath='/home/hutter2/release20/lib/libzutil/zutil_import.c' line='1758' column='1'/>
      <parameter type-id='type-id-2' name='data' filepath='/home/hutter2/release20/lib/libzutil/zutil_import.c' line='1758' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zpool_find_import_blkid' mangled-name='zpool_find_import_blkid' filepath='/home/hutter2/release20/lib/libzutil/zutil_import.h' line='53' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_find_import_blkid'>
      <parameter type-id='type-id-384'/>
      <parameter type-id='type-id-147'/>
      <parameter type-id='type-id-377'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zpool_open_func' mangled-name='zpool_open_func' filepath='/home/hutter2/release20/lib/libzutil/zutil_import.h' line='74' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zpool_open_func'>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='opendir' filepath='/usr/include/dirent.h' line='134' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-46'/>
      <return type-id='type-id-374'/>
    </function-decl>
    <function-decl name='closedir' filepath='/usr/include/dirent.h' line='149' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-374'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='readdir64' filepath='/usr/include/dirent.h' line='173' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-374'/>
      <return type-id='type-id-380'/>
    </function-decl>
    <function-decl name='dirname' filepath='/usr/include/libgen.h' line='26' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-52'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='__xpg_basename' filepath='/usr/include/libgen.h' line='34' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-52'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='dcgettext' filepath='/usr/include/libintl.h' line='51' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-46'/>
      <parameter type-id='type-id-46'/>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='pthread_mutex_init' filepath='/usr/include/pthread.h' line='740' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-147'/>
      <parameter type-id='type-id-379'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='pthread_mutex_destroy' filepath='/usr/include/pthread.h' line='745' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-147'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='fprintf' filepath='/usr/include/stdio.h' line='326' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-28'/>
      <parameter type-id='type-id-29'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='vsnprintf' filepath='/usr/include/stdio.h' line='358' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-52'/>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-46'/>
      <parameter type-id='type-id-30'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='asprintf' filepath='/usr/include/stdio.h' line='372' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-308'/>
      <parameter type-id='type-id-29'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='strtoull' filepath='/usr/include/stdlib.h' line='205' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-29'/>
      <parameter type-id='type-id-308'/>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-110'/>
    </function-decl>
    <function-decl name='calloc' filepath='/usr/include/stdlib.h' line='542' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-26'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='posix_memalign' filepath='/usr/include/stdlib.h' line='580' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-158'/>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-26'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='exit' filepath='/usr/include/stdlib.h' line='617' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='realpath' filepath='/usr/include/stdlib.h' line='800' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-29'/>
      <parameter type-id='type-id-47'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='strncmp' filepath='/usr/include/string.h' line='143' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-46'/>
      <parameter type-id='type-id-46'/>
      <parameter type-id='type-id-26'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='strpbrk' filepath='/usr/include/string.h' line='307' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-46'/>
      <parameter type-id='type-id-46'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='strerror' filepath='/usr/include/string.h' line='403' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='ioctl' filepath='/usr/include/sys/ioctl.h' line='41' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-10'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='__fxstat64' filepath='/usr/include/sys/stat.h' line='428' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-61'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='pread64' filepath='/usr/include/unistd.h' line='411' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-286'/>
      <return type-id='type-id-27'/>
    </function-decl>
    <function-decl name='sysconf' filepath='/usr/include/unistd.h' line='630' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-64'/>
    </function-decl>
    <function-decl name='geteuid' filepath='/usr/include/unistd.h' line='690' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-358'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-330'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-46'/>
      <parameter type-id='type-id-174'/>
      <parameter type-id='type-id-257'/>
      <return type-id='type-id-4'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-382'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-263'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-4'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-383'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-4'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-328'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-263'/>
      <return type-id='type-id-263'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='zutil_nicenum.c' comp-dir-path='/home/hutter2/release20/lib/libzutil' language='LANG_C99'>
    <type-decl name='double' size-in-bits='64' id='type-id-389'/>
    <type-decl name='long double' size-in-bits='128' id='type-id-390'/>
    <enum-decl name='zfs_nicenum_format' filepath='../../include/libzutil.h' line='123' column='1' id='type-id-391'>
      <underlying-type type-id='type-id-190'/>
      <enumerator name='ZFS_NICENUM_1024' value='0'/>
      <enumerator name='ZFS_NICENUM_BYTES' value='1'/>
      <enumerator name='ZFS_NICENUM_TIME' value='2'/>
      <enumerator name='ZFS_NICENUM_RAW' value='3'/>
      <enumerator name='ZFS_NICENUM_RAWTIME' value='4'/>
    </enum-decl>
    <qualified-type-def type-id='type-id-282' const='yes' id='type-id-392'/>
    <pointer-type-def type-id='type-id-392' size-in-bits='64' id='type-id-393'/>
    <pointer-type-def type-id='type-id-393' size-in-bits='64' id='type-id-394'/>
    <function-decl name='zfs_isnumber' mangled-name='zfs_isnumber' filepath='/home/hutter2/release20/lib/libzutil/zutil_nicenum.c' line='37' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_isnumber'>
      <parameter type-id='type-id-46' name='str' filepath='/home/hutter2/release20/lib/libzutil/zutil_nicenum.c' line='37' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zfs_nicenum_format' mangled-name='zfs_nicenum_format' filepath='/home/hutter2/release20/lib/libzutil/zutil_nicenum.c' line='61' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_nicenum_format'>
      <parameter type-id='type-id-174' name='num' filepath='/home/hutter2/release20/lib/libzutil/zutil_nicenum.c' line='61' column='1'/>
      <parameter type-id='type-id-52' name='buf' filepath='/home/hutter2/release20/lib/libzutil/zutil_nicenum.c' line='61' column='1'/>
      <parameter type-id='type-id-26' name='buflen' filepath='/home/hutter2/release20/lib/libzutil/zutil_nicenum.c' line='61' column='1'/>
      <parameter type-id='type-id-391' name='format' filepath='/home/hutter2/release20/lib/libzutil/zutil_nicenum.c' line='62' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='zfs_nicenum' mangled-name='zfs_nicenum' filepath='/home/hutter2/release20/lib/libzutil/zutil_nicenum.c' line='153' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zfs_nicenum'>
      <parameter type-id='type-id-174' name='num' filepath='/home/hutter2/release20/lib/libzutil/zutil_nicenum.c' line='153' column='1'/>
      <parameter type-id='type-id-52' name='buf' filepath='/home/hutter2/release20/lib/libzutil/zutil_nicenum.c' line='153' column='1'/>
      <parameter type-id='type-id-26' name='buflen' filepath='/home/hutter2/release20/lib/libzutil/zutil_nicenum.c' line='153' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
