<abi-corpus version='2.0' architecture='elf-amd-x86_64' soname='libnvpair.so.3'>
  <elf-needed>
    <dependency name='libunwind.so.8'/>
    <dependency name='libtirpc.so.3'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='dump_nvlist' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fnvlist_add_boolean' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fnvlist_add_boolean_array' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fnvlist_add_boolean_value' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fnvlist_add_byte' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fnvlist_add_byte_array' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fnvlist_add_int16' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fnvlist_add_int16_array' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fnvlist_add_int32' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='nvpair_value_int32' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_int32_array' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_int64' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_int64_array' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_int8' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_int8_array' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_match' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_match_regex' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_nvlist' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_nvlist_array' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_string' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_string_array' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_uint16' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_uint16_array' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_uint32' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_uint32_array' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_uint64' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_uint64_array' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_uint8' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_uint8_array' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <elf-variable-symbols>
    <elf-symbol name='nv_alloc_nosleep' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nv_fixed_ops' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-variable-symbols>
  <abi-instr address-size='64' path='lib/libnvpair/libnvpair.c' language='LANG_C99'>
    <type-decl name='char' size-in-bits='8' id='a84c031d'/>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='8' id='89feb1ec'>
      <subrange length='1' type-id='7359adad' id='52f813b4'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='160' id='664ac0b7'>
      <subrange length='20' type-id='7359adad' id='fdca39cf'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='infinite' id='e84913bd'>
      <subrange length='infinite' type-id='7359adad' id='031f2035'/>
    </array-type-def>
    <class-decl name='_IO_codecvt' is-struct='yes' visibility='default' is-declaration-only='yes' id='a4036571'/>
    <class-decl name='_IO_marker' is-struct='yes' visibility='default' is-declaration-only='yes' id='010ae0b9'/>
    <class-decl name='_IO_wide_data' is-struct='yes' visibility='default' is-declaration-only='yes' id='79bd3751'/>
    <class-decl name='re_dfa_t' is-struct='yes' visibility='default' is-declaration-only='yes' id='b48d2441'/>
    <type-decl name='double' size-in-bits='64' id='a0eb0f08'/>
    <type-decl name='int' size-in-bits='32' id='95e97e5e'/>
    <type-decl name='long int' size-in-bits='64' id='bd54fe1a'/>
    <type-decl name='long long int' size-in-bits='64' id='1eb56b1e'/>
    <type-decl name='short int' size-in-bits='16' id='a2185560'/>
    <type-decl name='signed char' size-in-bits='8' id='28577a57'/>
    <type-decl name='unnamed-enum-underlying-type-32' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='9cac1fee'/>
    <type-decl name='unsigned char' size-in-bits='8' id='002ac4a6'/>
    <type-decl name='unsigned int' size-in-bits='32' id='f0981eeb'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='7359adad'/>
    <type-decl name='unsigned short int' size-in-bits='16' id='8efea9e5'/>
    <type-decl name='variadic parameter type' id='2c1145c5'/>
    <type-decl name='void' id='48b5725f'/>
    <typedef-decl name='nvlist_prtctl_t' type-id='196db161' id='b0c1ff8d'/>
    <enum-decl name='nvlist_indent_mode' id='628aafab'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='NVLIST_INDENT_ABS' value='0'/>
      <enumerator name='NVLIST_INDENT_TABBED' value='1'/>
    </enum-decl>
    <enum-decl name='nvlist_prtctl_fmt' id='c8dcc53a'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='NVLIST_FMT_MEMBER_NAME' value='0'/>
      <enumerator name='NVLIST_FMT_MEMBER_POSTAMBLE' value='1'/>
      <enumerator name='NVLIST_FMT_BTWN_ARRAY' value='2'/>
    </enum-decl>
    <enum-decl name='data_type_t' naming-typedef-id='8d0687d2' id='aeeae136'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='DATA_TYPE_DONTCARE' value='-1'/>
      <enumerator name='DATA_TYPE_UNKNOWN' value='0'/>
      <enumerator name='DATA_TYPE_BOOLEAN' value='1'/>
      <enumerator name='DATA_TYPE_BYTE' value='2'/>
      <enumerator name='DATA_TYPE_INT16' value='3'/>
      <enumerator name='DATA_TYPE_UINT16' value='4'/>
      <enumerator name='DATA_TYPE_INT32' value='5'/>
      <enumerator name='DATA_TYPE_UINT32' value='6'/>
      <enumerator name='DATA_TYPE_INT64' value='7'/>
      <enumerator name='DATA_TYPE_UINT64' value='8'/>
      <enumerator name='DATA_TYPE_STRING' value='9'/>
      <enumerator name='DATA_TYPE_BYTE_ARRAY' value='10'/>
      <enumerator name='DATA_TYPE_INT16_ARRAY' value='11'/>
      <enumerator name='DATA_TYPE_UINT16_ARRAY' value='12'/>
      <enumerator name='DATA_TYPE_INT32_ARRAY' value='13'/>
      <enumerator name='DATA_TYPE_UINT32_ARRAY' value='14'/>
      <enumerator name='DATA_TYPE_INT64_ARRAY' value='15'/>
      <enumerator name='DATA_TYPE_UINT64_ARRAY' value='16'/>
      <enumerator name='DATA_TYPE_STRING_ARRAY' value='17'/>
      <enumerator name='DATA_TYPE_HRTIME' value='18'/>
      <enumerator name='DATA_TYPE_NVLIST' value='19'/>
      <enumerator name='DATA_TYPE_NVLIST_ARRAY' value='20'/>
      <enumerator name='DATA_TYPE_BOOLEAN_VALUE' value='21'/>
      <enumerator name='DATA_TYPE_INT8' value='22'/>
      <enumerator name='DATA_TYPE_UINT8' value='23'/>
      <enumerator name='DATA_TYPE_BOOLEAN_ARRAY' value='24'/>
      <enumerator name='DATA_TYPE_INT8_ARRAY' value='25'/>
      <enumerator name='DATA_TYPE_UINT8_ARRAY' value='26'/>
      <enumerator name='DATA_TYPE_DOUBLE' value='27'/>
    </enum-decl>
    <typedef-decl name='data_type_t' type-id='aeeae136' id='8d0687d2'/>
    <class-decl name='nvpair' size-in-bits='128' is-struct='yes' visibility='default' id='1c34e459'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nvp_size' type-id='3ff5601b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='nvp_name_sz' type-id='23bd8cb5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='nvp_reserve' type-id='23bd8cb5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='nvp_value_elem' type-id='3ff5601b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='nvp_type' type-id='8d0687d2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='nvp_name' type-id='e84913bd' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='nvpair_t' type-id='1c34e459' id='57928edf'/>
    <class-decl name='nvlist' size-in-bits='192' is-struct='yes' visibility='default' id='ac266fd9'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nvl_version' type-id='3ff5601b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='nvl_nvflag' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='nvl_priv' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='nvl_flag' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='nvl_pad' type-id='3ff5601b' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='nvlist_t' type-id='ac266fd9' id='8e8d4be3'/>
    <enum-decl name='boolean_t' naming-typedef-id='c19b74c3' id='f58c8277'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='B_FALSE' value='0'/>
      <enumerator name='B_TRUE' value='1'/>
    </enum-decl>
    <typedef-decl name='boolean_t' type-id='f58c8277' id='c19b74c3'/>
    <typedef-decl name='uchar_t' type-id='002ac4a6' id='d8bf0010'/>
    <typedef-decl name='uint_t' type-id='f0981eeb' id='3502e3ff'/>
    <typedef-decl name='hrtime_t' type-id='1eb56b1e' id='cebdd548'/>
    <typedef-decl name='__re_long_size_t' type-id='7359adad' id='ba516949'/>
    <typedef-decl name='reg_syntax_t' type-id='7359adad' id='1b72c3b3'/>
    <class-decl name='re_pattern_buffer' size-in-bits='512' is-struct='yes' visibility='default' id='19fc9a8c'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='buffer' type-id='33976309' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='allocated' type-id='ba516949' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='used' type-id='ba516949' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='syntax' type-id='1b72c3b3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='fastmap' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='translate' type-id='cf536864' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='re_nsub' type-id='b59d7dce' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='can_be_null' type-id='f0981eeb' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='449'>
        <var-decl name='regs_allocated' type-id='f0981eeb' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='451'>
        <var-decl name='fastmap_accurate' type-id='f0981eeb' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='452'>
        <var-decl name='no_sub' type-id='f0981eeb' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='453'>
        <var-decl name='not_bol' type-id='f0981eeb' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='454'>
        <var-decl name='not_eol' type-id='f0981eeb' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='455'>
        <var-decl name='newline_anchor' type-id='f0981eeb' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='regex_t' type-id='19fc9a8c' id='aca3bac8'/>
    <typedef-decl name='regoff_t' type-id='95e97e5e' id='54a2a2a8'/>
    <class-decl name='regmatch_t' size-in-bits='64' is-struct='yes' naming-typedef-id='1b941664' visibility='default' id='4f932615'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='rm_so' type-id='54a2a2a8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='rm_eo' type-id='54a2a2a8' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='regmatch_t' type-id='4f932615' id='1b941664'/>
    <typedef-decl name='int8_t' type-id='2171a512' id='ee31ee44'/>
    <typedef-decl name='int16_t' type-id='03896e23' id='23bd8cb5'/>
    <typedef-decl name='int32_t' type-id='33f57a65' id='3ff5601b'/>
    <typedef-decl name='int64_t' type-id='0c9942d2' id='9da381c4'/>
    <typedef-decl name='uint8_t' type-id='c51d6389' id='b96825af'/>
    <typedef-decl name='uint16_t' type-id='253c2d2a' id='149c6638'/>
    <typedef-decl name='uint32_t' type-id='62f1140c' id='8f92235e'/>
    <typedef-decl name='uint64_t' type-id='8910171f' id='9c313c2d'/>
    <typedef-decl name='__int8_t' type-id='28577a57' id='2171a512'/>
    <typedef-decl name='__uint8_t' type-id='002ac4a6' id='c51d6389'/>
    <typedef-decl name='__int16_t' type-id='a2185560' id='03896e23'/>
    <typedef-decl name='__uint16_t' type-id='8efea9e5' id='253c2d2a'/>
    <typedef-decl name='__int32_t' type-id='95e97e5e' id='33f57a65'/>
    <typedef-decl name='__uint32_t' type-id='f0981eeb' id='62f1140c'/>
    <typedef-decl name='__int64_t' type-id='bd54fe1a' id='0c9942d2'/>
    <typedef-decl name='__uint64_t' type-id='7359adad' id='8910171f'/>
    <typedef-decl name='__off_t' type-id='bd54fe1a' id='79989e9c'/>
    <typedef-decl name='__off64_t' type-id='bd54fe1a' id='724e4de6'/>
    <typedef-decl name='FILE' type-id='ec1ed955' id='aa12d1ba'/>
    <typedef-decl name='_IO_lock_t' type-id='48b5725f' id='bb4788fa'/>
    <class-decl name='_IO_FILE' size-in-bits='1728' is-struct='yes' visibility='default' id='ec1ed955'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_flags' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_IO_read_ptr' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_IO_read_end' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_IO_read_base' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='_IO_write_base' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='_IO_write_ptr' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_IO_write_end' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='_IO_buf_base' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='_IO_buf_end' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='_IO_save_base' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='_IO_backup_base' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='_IO_save_end' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='_markers' type-id='e4c6fa61' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='_chain' type-id='dca988a5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='_fileno' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='_flags2' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='_old_offset' type-id='79989e9c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='_cur_column' type-id='8efea9e5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1040'>
        <var-decl name='_vtable_offset' type-id='28577a57' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1048'>
        <var-decl name='_shortbuf' type-id='89feb1ec' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='_lock' type-id='cecf4ea7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='_offset' type-id='724e4de6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='_codecvt' type-id='570f8c59' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='_wide_data' type-id='c65a1f29' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='_freeres_list' type-id='dca988a5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='_freeres_buf' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='__pad5' type-id='b59d7dce' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='_mode' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='_unused2' type-id='664ac0b7' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='size_t' type-id='7359adad' id='b59d7dce'/>
    <class-decl name='nvlist_printops' size-in-bits='3456' is-struct='yes' visibility='default' id='ebc6735b'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='print_boolean' type-id='e7f43f72' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='print_boolean_value' type-id='e7f43f73' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='print_byte' type-id='e7f43f74' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='print_int8' type-id='e7f43f75' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='print_uint8' type-id='e7f43f76' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='print_int16' type-id='e7f43f77' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='print_uint16' type-id='e7f43f78' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='print_int32' type-id='e7f43f79' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='print_uint32' type-id='e7f43f7a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='print_int64' type-id='e7f43f7b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='print_uint64' type-id='e7f43f7c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='print_double' type-id='e7f43f7d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='print_string' type-id='e7f43f7e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='print_hrtime' type-id='e7f43f7f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='print_nvlist' type-id='e7f43f80' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1920'>
        <var-decl name='print_boolean_array' type-id='e7f43f81' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='print_byte_array' type-id='e7f43f82' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='print_int8_array' type-id='e7f43f83' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2304'>
        <var-decl name='print_uint8_array' type-id='e7f43f84' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2432'>
        <var-decl name='print_int16_array' type-id='e7f43f85' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2560'>
        <var-decl name='print_uint16_array' type-id='e7f43f86' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2688'>
        <var-decl name='print_int32_array' type-id='e7f43f87' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2816'>
        <var-decl name='print_uint32_array' type-id='e7f43f88' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2944'>
        <var-decl name='print_int64_array' type-id='e7f43f89' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3072'>
        <var-decl name='print_uint64_array' type-id='e7f43f8a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3200'>
        <var-decl name='print_string_array' type-id='e7f43f8b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3328'>
        <var-decl name='print_nvlist_array' type-id='e7f43f8c' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f72'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='6d994334' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='eaa32e2f' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__1' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f73'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='6a2f50c1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='eaa32e2f' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__2' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f74'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='8a1fb33a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='eaa32e2f' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__3' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f75'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='506696a8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='eaa32e2f' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__4' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f76'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='39b623f9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='eaa32e2f' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__5' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f77'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='ea6be4eb' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='eaa32e2f' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__6' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f78'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='f10f1e84' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='eaa32e2f' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__7' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f79'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='1708018d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='eaa32e2f' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__8' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f7a'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='90174072' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='eaa32e2f' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__9' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f7b'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='d2af7f32' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='eaa32e2f' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__10' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f7c'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='0b22f759' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='eaa32e2f' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__11' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f7d'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='3be4d568' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='eaa32e2f' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__12' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f7e'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='bfc48fe4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='eaa32e2f' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__13' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f7f'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='e1c54c3c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='eaa32e2f' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__14' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f80'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='19ea27ae' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='eaa32e2f' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__15' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f81'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='7ef0e988' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='eaa32e2f' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__16' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f82'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='7391ed39' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='eaa32e2f' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__17' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f83'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='42257af5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='eaa32e2f' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__18' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f84'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='330cc0d0' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='eaa32e2f' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__19' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f85'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='506ab59a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='eaa32e2f' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__20' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f86'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='ed6a3a3d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='eaa32e2f' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__21' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f87'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='750cc41c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='eaa32e2f' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__22' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f88'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='292cdbcf' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='eaa32e2f' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__23' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f89'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='aaea91b5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='eaa32e2f' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__24' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f8a'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='7e85a9b6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='eaa32e2f' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__25' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f8b'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='337f4a72' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='eaa32e2f' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__26' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f8c'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='2835af80' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='eaa32e2f' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='nvlist_prtctl' size-in-bits='576' is-struct='yes' visibility='default' id='d2e8bad9'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nvprt_fp' type-id='822cd80b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='nvprt_indent_mode' type-id='628aafab' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='nvprt_indent' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='nvprt_indentinc' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='nvprt_nmfmt' type-id='80f4b756' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='nvprt_eomfmt' type-id='80f4b756' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='nvprt_btwnarrfmt' type-id='80f4b756' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='nvprt_btwnarrfmt_nl' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='nvprt_dfltops' type-id='7be54adb' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='nvprt_custops' type-id='7be54adb' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='aa12d1ba' size-in-bits='64' id='822cd80b'/>
    <qualified-type-def type-id='822cd80b' restrict='yes' id='e75a27e9'/>
    <pointer-type-def type-id='ec1ed955' size-in-bits='64' id='dca988a5'/>
    <pointer-type-def type-id='a4036571' size-in-bits='64' id='570f8c59'/>
    <pointer-type-def type-id='bb4788fa' size-in-bits='64' id='cecf4ea7'/>
    <pointer-type-def type-id='010ae0b9' size-in-bits='64' id='e4c6fa61'/>
    <pointer-type-def type-id='79bd3751' size-in-bits='64' id='c65a1f29'/>
    <pointer-type-def type-id='c19b74c3' size-in-bits='64' id='37e3bd22'/>
    <pointer-type-def type-id='37e3bd22' size-in-bits='64' id='03829398'/>
    <pointer-type-def type-id='a84c031d' size-in-bits='64' id='26a90f95'/>
    <qualified-type-def type-id='a84c031d' const='yes' id='9b45d938'/>
    <pointer-type-def type-id='9b45d938' size-in-bits='64' id='80f4b756'/>
    <qualified-type-def type-id='80f4b756' restrict='yes' id='9d26089a'/>
    <pointer-type-def type-id='80f4b756' size-in-bits='64' id='7d3cd834'/>
    <pointer-type-def type-id='7d3cd834' size-in-bits='64' id='44c8373a'/>
    <qualified-type-def type-id='57928edf' const='yes' id='642ee20f'/>
    <pointer-type-def type-id='642ee20f' size-in-bits='64' id='dace003f'/>
    <qualified-type-def type-id='aca3bac8' const='yes' id='2498fd78'/>
    <pointer-type-def type-id='2498fd78' size-in-bits='64' id='eed6c816'/>
    <qualified-type-def type-id='eed6c816' restrict='yes' id='a431a9da'/>
    <pointer-type-def type-id='a0eb0f08' size-in-bits='64' id='7408d286'/>
    <pointer-type-def type-id='cebdd548' size-in-bits='64' id='e379e62d'/>
    <pointer-type-def type-id='9f88f76e' size-in-bits='64' id='7ef0e988'/>
    <pointer-type-def type-id='889f3b42' size-in-bits='64' id='bfc48fe4'/>
    <pointer-type-def type-id='49055dd8' size-in-bits='64' id='337f4a72'/>
    <pointer-type-def type-id='70284cc6' size-in-bits='64' id='3be4d568'/>
    <pointer-type-def type-id='700c3bca' size-in-bits='64' id='6d994334'/>
    <pointer-type-def type-id='18ac1860' size-in-bits='64' id='506ab59a'/>
    <pointer-type-def type-id='328fee42' size-in-bits='64' id='750cc41c'/>
    <pointer-type-def type-id='7ba5cd31' size-in-bits='64' id='aaea91b5'/>
    <pointer-type-def type-id='a86d8029' size-in-bits='64' id='42257af5'/>
    <pointer-type-def type-id='0b4eb914' size-in-bits='64' id='19ea27ae'/>
    <pointer-type-def type-id='c6c8144e' size-in-bits='64' id='2835af80'/>
    <pointer-type-def type-id='20f7b475' size-in-bits='64' id='6a2f50c1'/>
    <pointer-type-def type-id='102ee17a' size-in-bits='64' id='e1c54c3c'/>
    <pointer-type-def type-id='49b69c77' size-in-bits='64' id='ea6be4eb'/>
    <pointer-type-def type-id='cb5d50f1' size-in-bits='64' id='1708018d'/>
    <pointer-type-def type-id='880d56b8' size-in-bits='64' id='d2af7f32'/>
    <pointer-type-def type-id='a739bfc6' size-in-bits='64' id='506696a8'/>
    <pointer-type-def type-id='234f35e8' size-in-bits='64' id='8a1fb33a'/>
    <pointer-type-def type-id='41f7168a' size-in-bits='64' id='f10f1e84'/>
    <pointer-type-def type-id='e8d6e508' size-in-bits='64' id='90174072'/>
    <pointer-type-def type-id='f3daafe5' size-in-bits='64' id='0b22f759'/>
    <pointer-type-def type-id='17ab04ad' size-in-bits='64' id='39b623f9'/>
    <pointer-type-def type-id='256cdd75' size-in-bits='64' id='7391ed39'/>
    <pointer-type-def type-id='cc10a041' size-in-bits='64' id='ed6a3a3d'/>
    <pointer-type-def type-id='9fd269d3' size-in-bits='64' id='292cdbcf'/>
    <pointer-type-def type-id='3bd73b0c' size-in-bits='64' id='7e85a9b6'/>
    <pointer-type-def type-id='0d445e26' size-in-bits='64' id='330cc0d0'/>
    <pointer-type-def type-id='e4b89f30' size-in-bits='64' id='ed8aa8ba'/>
    <pointer-type-def type-id='78e3bec8' size-in-bits='64' id='b38a1022'/>
    <pointer-type-def type-id='a5193bb2' size-in-bits='64' id='6263eda4'/>
    <pointer-type-def type-id='2783af3c' size-in-bits='64' id='e44553b6'/>
    <pointer-type-def type-id='33c6e3d8' size-in-bits='64' id='1263777a'/>
    <pointer-type-def type-id='dadb9eca' size-in-bits='64' id='cbda43ac'/>
    <pointer-type-def type-id='55b9e070' size-in-bits='64' id='b3fae562'/>
    <pointer-type-def type-id='8e63c78b' size-in-bits='64' id='8b41e457'/>
    <pointer-type-def type-id='c542ed33' size-in-bits='64' id='f9668a57'/>
    <pointer-type-def type-id='5dea179a' size-in-bits='64' id='001d8764'/>
    <pointer-type-def type-id='b6f659a0' size-in-bits='64' id='44f188f2'/>
    <pointer-type-def type-id='2765bd17' size-in-bits='64' id='976f721b'/>
    <pointer-type-def type-id='9e073b5c' size-in-bits='64' id='ee62ad8e'/>
    <pointer-type-def type-id='2c785071' size-in-bits='64' id='957d9f35'/>
    <pointer-type-def type-id='aad19bf7' size-in-bits='64' id='4db8acf3'/>
    <pointer-type-def type-id='0660e71a' size-in-bits='64' id='0ca7b13c'/>
    <pointer-type-def type-id='250287b8' size-in-bits='64' id='a91bad5a'/>
    <pointer-type-def type-id='e7344862' size-in-bits='64' id='519bf35c'/>
    <pointer-type-def type-id='32b6d968' size-in-bits='64' id='92988dea'/>
    <pointer-type-def type-id='5c975642' size-in-bits='64' id='7f8ee7e4'/>
    <pointer-type-def type-id='0155b993' size-in-bits='64' id='2c8c4457'/>
    <pointer-type-def type-id='6e8b02cb' size-in-bits='64' id='eb944897'/>
    <pointer-type-def type-id='d434b7d7' size-in-bits='64' id='108e6453'/>
    <pointer-type-def type-id='c645e10f' size-in-bits='64' id='5cbe16ab'/>
    <pointer-type-def type-id='de41f295' size-in-bits='64' id='d94cdfa1'/>
    <pointer-type-def type-id='b2fbf64a' size-in-bits='64' id='470a7fd4'/>
    <pointer-type-def type-id='cc22d314' size-in-bits='64' id='eddda806'/>
    <pointer-type-def type-id='23bd8cb5' size-in-bits='64' id='f76f73d0'/>
    <pointer-type-def type-id='f76f73d0' size-in-bits='64' id='7e73928e'/>
    <pointer-type-def type-id='3ff5601b' size-in-bits='64' id='4aafb922'/>
    <pointer-type-def type-id='4aafb922' size-in-bits='64' id='9aa04798'/>
    <pointer-type-def type-id='9da381c4' size-in-bits='64' id='cb785ebf'/>
    <pointer-type-def type-id='cb785ebf' size-in-bits='64' id='e37ce48f'/>
    <pointer-type-def type-id='ee31ee44' size-in-bits='64' id='256d5229'/>
    <pointer-type-def type-id='256d5229' size-in-bits='64' id='ee181ab9'/>
    <pointer-type-def type-id='ebc6735b' size-in-bits='64' id='7be54adb'/>
    <pointer-type-def type-id='d2e8bad9' size-in-bits='64' id='196db161'/>
    <pointer-type-def type-id='8e8d4be3' size-in-bits='64' id='5ce45b60'/>
    <pointer-type-def type-id='5ce45b60' size-in-bits='64' id='857bb57e'/>
    <pointer-type-def type-id='857bb57e' size-in-bits='64' id='75be733c'/>
    <pointer-type-def type-id='57928edf' size-in-bits='64' id='3fa542f0'/>
    <pointer-type-def type-id='b48d2441' size-in-bits='64' id='33976309'/>
    <pointer-type-def type-id='aca3bac8' size-in-bits='64' id='d33f11cb'/>
    <pointer-type-def type-id='1b941664' size-in-bits='64' id='7e2979d5'/>
    <qualified-type-def type-id='7e2979d5' restrict='yes' id='fc212857'/>
    <pointer-type-def type-id='d8bf0010' size-in-bits='64' id='45b65157'/>
    <pointer-type-def type-id='45b65157' size-in-bits='64' id='3b0247c7'/>
    <pointer-type-def type-id='149c6638' size-in-bits='64' id='8a121f49'/>
    <pointer-type-def type-id='8a121f49' size-in-bits='64' id='bd8768d9'/>
    <pointer-type-def type-id='8f92235e' size-in-bits='64' id='90421557'/>
    <pointer-type-def type-id='90421557' size-in-bits='64' id='9507d3c7'/>
    <pointer-type-def type-id='9c313c2d' size-in-bits='64' id='5d6479ae'/>
    <pointer-type-def type-id='5d6479ae' size-in-bits='64' id='892b4acc'/>
    <pointer-type-def type-id='b96825af' size-in-bits='64' id='ae3e8ca6'/>
    <pointer-type-def type-id='ae3e8ca6' size-in-bits='64' id='d8774064'/>
    <pointer-type-def type-id='3502e3ff' size-in-bits='64' id='4dd26a40'/>
    <pointer-type-def type-id='002ac4a6' size-in-bits='64' id='cf536864'/>
    <pointer-type-def type-id='48b5725f' size-in-bits='64' id='eaa32e2f'/>
    <class-decl name='_IO_codecvt' is-struct='yes' visibility='default' is-declaration-only='yes' id='a4036571'/>
    <class-decl name='_IO_marker' is-struct='yes' visibility='default' is-declaration-only='yes' id='010ae0b9'/>
    <class-decl name='_IO_wide_data' is-struct='yes' visibility='default' is-declaration-only='yes' id='79bd3751'/>
    <class-decl name='re_dfa_t' is-struct='yes' visibility='default' is-declaration-only='yes' id='b48d2441'/>
    <function-decl name='nvlist_next_nvpair' mangled-name='nvlist_next_nvpair' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_next_nvpair'>
      <parameter type-id='5ce45b60'/>
      <parameter type-id='dace003f'/>
      <return type-id='3fa542f0'/>
    </function-decl>
    <function-decl name='nvpair_name' mangled-name='nvpair_name' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_name'>
      <parameter type-id='dace003f'/>
      <return type-id='80f4b756'/>
    </function-decl>
    <function-decl name='nvpair_type' mangled-name='nvpair_type' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_type'>
      <parameter type-id='dace003f'/>
      <return type-id='8d0687d2'/>
    </function-decl>
    <function-decl name='nvpair_type_is_array' mangled-name='nvpair_type_is_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_type_is_array'>
      <parameter type-id='dace003f'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='nvpair_value_boolean_value' mangled-name='nvpair_value_boolean_value' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_boolean_value'>
      <parameter type-id='dace003f'/>
      <parameter type-id='37e3bd22'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='nvpair_value_byte' mangled-name='nvpair_value_byte' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_byte'>
      <parameter type-id='dace003f'/>
      <parameter type-id='45b65157'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='nvpair_value_int8' mangled-name='nvpair_value_int8' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_int8'>
      <parameter type-id='dace003f'/>
      <parameter type-id='256d5229'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='nvpair_value_uint8' mangled-name='nvpair_value_uint8' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_uint8'>
      <parameter type-id='dace003f'/>
      <parameter type-id='ae3e8ca6'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='nvpair_value_int16' mangled-name='nvpair_value_int16' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_int16'>
      <parameter type-id='dace003f'/>
      <parameter type-id='f76f73d0'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='nvpair_value_uint16' mangled-name='nvpair_value_uint16' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_uint16'>
      <parameter type-id='dace003f'/>
      <parameter type-id='8a121f49'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='nvpair_value_int32' mangled-name='nvpair_value_int32' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_int32'>
      <parameter type-id='dace003f'/>
      <parameter type-id='4aafb922'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='nvpair_value_uint32' mangled-name='nvpair_value_uint32' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_uint32'>
      <parameter type-id='dace003f'/>
      <parameter type-id='90421557'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='nvpair_value_int64' mangled-name='nvpair_value_int64' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_int64'>
      <parameter type-id='dace003f'/>
      <parameter type-id='cb785ebf'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='nvpair_value_uint64' mangled-name='nvpair_value_uint64' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_uint64'>
      <parameter type-id='dace003f'/>
      <parameter type-id='5d6479ae'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='nvpair_value_string' mangled-name='nvpair_value_string' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_string'>
      <parameter type-id='dace003f'/>
      <parameter type-id='7d3cd834'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='nvpair_value_nvlist' mangled-name='nvpair_value_nvlist' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_nvlist'>
      <parameter type-id='3fa542f0'/>
      <parameter type-id='857bb57e'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='nvpair_value_boolean_array' mangled-name='nvpair_value_boolean_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_boolean_array'>
      <parameter type-id='3fa542f0'/>
      <parameter type-id='03829398'/>
      <parameter type-id='4dd26a40'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='nvpair_value_byte_array' mangled-name='nvpair_value_byte_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_byte_array'>
      <parameter type-id='3fa542f0'/>
      <parameter type-id='3b0247c7'/>
      <parameter type-id='4dd26a40'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='nvpair_value_int8_array' mangled-name='nvpair_value_int8_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_int8_array'>
      <parameter type-id='3fa542f0'/>
      <parameter type-id='ee181ab9'/>
      <parameter type-id='4dd26a40'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='nvpair_value_uint8_array' mangled-name='nvpair_value_uint8_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_uint8_array'>
      <parameter type-id='3fa542f0'/>
      <parameter type-id='d8774064'/>
      <parameter type-id='4dd26a40'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='nvpair_value_int16_array' mangled-name='nvpair_value_int16_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_int16_array'>
      <parameter type-id='3fa542f0'/>
      <parameter type-id='7e73928e'/>
      <parameter type-id='4dd26a40'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='nvpair_value_uint16_array' mangled-name='nvpair_value_uint16_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_uint16_array'>
      <parameter type-id='3fa542f0'/>
      <parameter type-id='bd8768d9'/>
      <parameter type-id='4dd26a40'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='nvpair_value_int32_array' mangled-name='nvpair_value_int32_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_int32_array'>
      <parameter type-id='3fa542f0'/>
      <parameter type-id='9aa04798'/>
      <parameter type-id='4dd26a40'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='nvpair_value_uint32_array' mangled-name='nvpair_value_uint32_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_uint32_array'>
      <parameter type-id='3fa542f0'/>
      <parameter type-id='9507d3c7'/>
      <parameter type-id='4dd26a40'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='nvpair_value_int64_array' mangled-name='nvpair_value_int64_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_int64_array'>
      <parameter type-id='3fa542f0'/>
      <parameter type-id='e37ce48f'/>
      <parameter type-id='4dd26a40'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='nvpair_value_uint64_array' mangled-name='nvpair_value_uint64_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_uint64_array'>
      <parameter type-id='3fa542f0'/>
      <parameter type-id='892b4acc'/>
      <parameter type-id='4dd26a40'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='nvpair_value_string_array' mangled-name='nvpair_value_string_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_string_array'>
      <parameter type-id='3fa542f0'/>
      <parameter type-id='44c8373a'/>
      <parameter type-id='4dd26a40'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='nvpair_value_nvlist_array' mangled-name='nvpair_value_nvlist_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_nvlist_array'>
      <parameter type-id='3fa542f0'/>
      <parameter type-id='75be733c'/>
      <parameter type-id='4dd26a40'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='nvpair_value_hrtime' mangled-name='nvpair_value_hrtime' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_hrtime'>
      <parameter type-id='3fa542f0'/>
      <parameter type-id='e379e62d'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='nvpair_value_double' mangled-name='nvpair_value_double' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_double'>
      <parameter type-id='dace003f'/>
      <parameter type-id='7408d286'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='dcgettext' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='80f4b756'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='95e97e5e'/>
      <return type-id='26a90f95'/>
    </function-decl>
    <function-decl name='regexec' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='a431a9da'/>
      <parameter type-id='9d26089a'/>
      <parameter type-id='b59d7dce'/>
      <parameter type-id='fc212857'/>
      <parameter type-id='95e97e5e'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='malloc' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='b59d7dce'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='calloc' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='b59d7dce'/>
      <parameter type-id='b59d7dce'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='free' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='eaa32e2f'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='strcmp' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='80f4b756'/>
      <parameter type-id='80f4b756'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='strchr' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='80f4b756'/>
      <parameter type-id='95e97e5e'/>
      <return type-id='26a90f95'/>
    </function-decl>
    <function-decl name='strcspn' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='80f4b756'/>
      <parameter type-id='80f4b756'/>
      <return type-id='b59d7dce'/>
    </function-decl>
    <function-decl name='strspn' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='80f4b756'/>
      <parameter type-id='80f4b756'/>
      <return type-id='b59d7dce'/>
    </function-decl>
    <function-decl name='__fprintf_chk' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='e75a27e9'/>
      <parameter type-id='95e97e5e'/>
      <parameter type-id='9d26089a'/>
      <parameter is-variadic='yes'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='__printf_chk' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='95e97e5e'/>
      <parameter type-id='80f4b756'/>
      <parameter is-variadic='yes'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='nvlist_prtctl_setdest' mangled-name='nvlist_prtctl_setdest' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctl_setdest'>
      <parameter type-id='b0c1ff8d' name='pctl'/>
      <parameter type-id='822cd80b' name='fp'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='nvlist_prtctl_getdest' mangled-name='nvlist_prtctl_getdest' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctl_getdest'>
      <parameter type-id='b0c1ff8d' name='pctl'/>
      <return type-id='822cd80b'/>
    </function-decl>
    <function-decl name='nvlist_prtctl_setindent' mangled-name='nvlist_prtctl_setindent' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctl_setindent'>
      <parameter type-id='b0c1ff8d' name='pctl'/>
      <parameter type-id='628aafab' name='mode'/>
      <parameter type-id='95e97e5e' name='start'/>
      <parameter type-id='95e97e5e' name='inc'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='nvlist_prtctl_doindent' mangled-name='nvlist_prtctl_doindent' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctl_doindent'>
      <parameter type-id='b0c1ff8d' name='pctl'/>
      <parameter type-id='95e97e5e' name='onemore'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='nvlist_prtctl_setfmt' mangled-name='nvlist_prtctl_setfmt' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctl_setfmt'>
      <parameter type-id='b0c1ff8d' name='pctl'/>
      <parameter type-id='c8dcc53a' name='which'/>
      <parameter type-id='80f4b756' name='fmt'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='nvlist_prtctl_dofmt' mangled-name='nvlist_prtctl_dofmt' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctl_dofmt'>
      <parameter type-id='b0c1ff8d' name='pctl'/>
      <parameter type-id='c8dcc53a' name='which'/>
      <parameter is-variadic='yes'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_boolean' mangled-name='nvlist_prtctlop_boolean' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_boolean'>
      <parameter type-id='b0c1ff8d' name='pctl'/>
      <parameter type-id='1263777a' name='func'/>
      <parameter type-id='eaa32e2f' name='private'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_boolean_value' mangled-name='nvlist_prtctlop_boolean_value' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_boolean_value'>
      <parameter type-id='b0c1ff8d' name='pctl'/>
      <parameter type-id='976f721b' name='func'/>
      <parameter type-id='eaa32e2f' name='private'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_byte' mangled-name='nvlist_prtctlop_byte' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_byte'>
      <parameter type-id='b0c1ff8d' name='pctl'/>
      <parameter type-id='519bf35c' name='func'/>
      <parameter type-id='eaa32e2f' name='private'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_int8' mangled-name='nvlist_prtctlop_int8' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_int8'>
      <parameter type-id='b0c1ff8d' name='pctl'/>
      <parameter type-id='a91bad5a' name='func'/>
      <parameter type-id='eaa32e2f' name='private'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_uint8' mangled-name='nvlist_prtctlop_uint8' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_uint8'>
      <parameter type-id='b0c1ff8d' name='pctl'/>
      <parameter type-id='eb944897' name='func'/>
      <parameter type-id='eaa32e2f' name='private'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_int16' mangled-name='nvlist_prtctlop_int16' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_int16'>
      <parameter type-id='b0c1ff8d' name='pctl'/>
      <parameter type-id='957d9f35' name='func'/>
      <parameter type-id='eaa32e2f' name='private'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_uint16' mangled-name='nvlist_prtctlop_uint16' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_uint16'>
      <parameter type-id='b0c1ff8d' name='pctl'/>
      <parameter type-id='92988dea' name='func'/>
      <parameter type-id='eaa32e2f' name='private'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_int32' mangled-name='nvlist_prtctlop_int32' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_int32'>
      <parameter type-id='b0c1ff8d' name='pctl'/>
      <parameter type-id='4db8acf3' name='func'/>
      <parameter type-id='eaa32e2f' name='private'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_uint32' mangled-name='nvlist_prtctlop_uint32' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_uint32'>
      <parameter type-id='b0c1ff8d' name='pctl'/>
      <parameter type-id='7f8ee7e4' name='func'/>
      <parameter type-id='eaa32e2f' name='private'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_int64' mangled-name='nvlist_prtctlop_int64' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_int64'>
      <parameter type-id='b0c1ff8d' name='pctl'/>
      <parameter type-id='0ca7b13c' name='func'/>
      <parameter type-id='eaa32e2f' name='private'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_uint64' mangled-name='nvlist_prtctlop_uint64' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_uint64'>
      <parameter type-id='b0c1ff8d' name='pctl'/>
      <parameter type-id='2c8c4457' name='func'/>
      <parameter type-id='eaa32e2f' name='private'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_double' mangled-name='nvlist_prtctlop_double' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_double'>
      <parameter type-id='b0c1ff8d' name='pctl'/>
      <parameter type-id='e44553b6' name='func'/>
      <parameter type-id='eaa32e2f' name='private'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_string' mangled-name='nvlist_prtctlop_string' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_string'>
      <parameter type-id='b0c1ff8d' name='pctl'/>
      <parameter type-id='b38a1022' name='func'/>
      <parameter type-id='eaa32e2f' name='private'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_hrtime' mangled-name='nvlist_prtctlop_hrtime' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_hrtime'>
      <parameter type-id='b0c1ff8d' name='pctl'/>
      <parameter type-id='ee62ad8e' name='func'/>
      <parameter type-id='eaa32e2f' name='private'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_nvlist' mangled-name='nvlist_prtctlop_nvlist' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_nvlist'>
      <parameter type-id='b0c1ff8d' name='pctl'/>
      <parameter type-id='001d8764' name='func'/>
      <parameter type-id='eaa32e2f' name='private'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_boolean_array' mangled-name='nvlist_prtctlop_boolean_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_boolean_array'>
      <parameter type-id='b0c1ff8d' name='pctl'/>
      <parameter type-id='ed8aa8ba' name='func'/>
      <parameter type-id='eaa32e2f' name='private'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_byte_array' mangled-name='nvlist_prtctlop_byte_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_byte_array'>
      <parameter type-id='b0c1ff8d' name='pctl'/>
      <parameter type-id='108e6453' name='func'/>
      <parameter type-id='eaa32e2f' name='private'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_int8_array' mangled-name='nvlist_prtctlop_int8_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_int8_array'>
      <parameter type-id='b0c1ff8d' name='pctl'/>
      <parameter type-id='f9668a57' name='func'/>
      <parameter type-id='eaa32e2f' name='private'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_uint8_array' mangled-name='nvlist_prtctlop_uint8_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_uint8_array'>
      <parameter type-id='b0c1ff8d' name='pctl'/>
      <parameter type-id='eddda806' name='func'/>
      <parameter type-id='eaa32e2f' name='private'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_int16_array' mangled-name='nvlist_prtctlop_int16_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_int16_array'>
      <parameter type-id='b0c1ff8d' name='pctl'/>
      <parameter type-id='cbda43ac' name='func'/>
      <parameter type-id='eaa32e2f' name='private'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_uint16_array' mangled-name='nvlist_prtctlop_uint16_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_uint16_array'>
      <parameter type-id='b0c1ff8d' name='pctl'/>
      <parameter type-id='5cbe16ab' name='func'/>
      <parameter type-id='eaa32e2f' name='private'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_int32_array' mangled-name='nvlist_prtctlop_int32_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_int32_array'>
      <parameter type-id='b0c1ff8d' name='pctl'/>
      <parameter type-id='b3fae562' name='func'/>
      <parameter type-id='eaa32e2f' name='private'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_uint32_array' mangled-name='nvlist_prtctlop_uint32_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_uint32_array'>
      <parameter type-id='b0c1ff8d' name='pctl'/>
      <parameter type-id='d94cdfa1' name='func'/>
      <parameter type-id='eaa32e2f' name='private'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_int64_array' mangled-name='nvlist_prtctlop_int64_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_int64_array'>
      <parameter type-id='b0c1ff8d' name='pctl'/>
      <parameter type-id='8b41e457' name='func'/>
      <parameter type-id='eaa32e2f' name='private'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_uint64_array' mangled-name='nvlist_prtctlop_uint64_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_uint64_array'>
      <parameter type-id='b0c1ff8d' name='pctl'/>
      <parameter type-id='470a7fd4' name='func'/>
      <parameter type-id='eaa32e2f' name='private'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_string_array' mangled-name='nvlist_prtctlop_string_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_string_array'>
      <parameter type-id='b0c1ff8d' name='pctl'/>
      <parameter type-id='6263eda4' name='func'/>
      <parameter type-id='eaa32e2f' name='private'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_nvlist_array' mangled-name='nvlist_prtctlop_nvlist_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_nvlist_array'>
      <parameter type-id='b0c1ff8d' name='pctl'/>
      <parameter type-id='44f188f2' name='func'/>
      <parameter type-id='eaa32e2f' name='private'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='nvlist_prtctl_alloc' mangled-name='nvlist_prtctl_alloc' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctl_alloc'>
      <return type-id='b0c1ff8d'/>
    </function-decl>
    <function-decl name='nvlist_prtctl_free' mangled-name='nvlist_prtctl_free' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctl_free'>
      <parameter type-id='b0c1ff8d' name='pctl'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='nvlist_print' mangled-name='nvlist_print' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_print'>
      <parameter type-id='822cd80b' name='fp'/>
      <parameter type-id='5ce45b60' name='nvl'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='nvlist_prt' mangled-name='nvlist_prt' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prt'>
      <parameter type-id='5ce45b60' name='nvl'/>
      <parameter type-id='b0c1ff8d' name='pctl'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='dump_nvlist' mangled-name='dump_nvlist' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dump_nvlist'>
      <parameter type-id='5ce45b60' name='list'/>
      <parameter type-id='95e97e5e' name='indent'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='nvpair_value_match_regex' mangled-name='nvpair_value_match_regex' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_match_regex'>
      <parameter type-id='3fa542f0' name='nvp'/>
      <parameter type-id='95e97e5e' name='ai'/>
      <parameter type-id='80f4b756' name='value'/>
      <parameter type-id='d33f11cb' name='value_regex'/>
      <parameter type-id='7d3cd834' name='ep'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='nvpair_value_match' mangled-name='nvpair_value_match' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_match'>
      <parameter type-id='3fa542f0' name='nvp'/>
      <parameter type-id='95e97e5e' name='ai'/>
      <parameter type-id='80f4b756' name='value'/>
      <parameter type-id='7d3cd834' name='ep'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-type size-in-bits='64' id='9f88f76e'>
      <parameter type-id='196db161'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='5ce45b60'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='37e3bd22'/>
      <parameter type-id='3502e3ff'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' id='889f3b42'>
      <parameter type-id='196db161'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='5ce45b60'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='80f4b756'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' id='49055dd8'>
      <parameter type-id='196db161'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='5ce45b60'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='7d3cd834'/>
      <parameter type-id='3502e3ff'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' id='70284cc6'>
      <parameter type-id='196db161'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='5ce45b60'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='a0eb0f08'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' id='700c3bca'>
      <parameter type-id='196db161'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='5ce45b60'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='95e97e5e'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' id='18ac1860'>
      <parameter type-id='196db161'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='5ce45b60'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='f76f73d0'/>
      <parameter type-id='3502e3ff'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' id='328fee42'>
      <parameter type-id='196db161'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='5ce45b60'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='4aafb922'/>
      <parameter type-id='3502e3ff'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' id='7ba5cd31'>
      <parameter type-id='196db161'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='5ce45b60'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='cb785ebf'/>
      <parameter type-id='3502e3ff'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' id='a86d8029'>
      <parameter type-id='196db161'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='5ce45b60'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='256d5229'/>
      <parameter type-id='3502e3ff'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' id='0b4eb914'>
      <parameter type-id='196db161'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='5ce45b60'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='5ce45b60'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' id='c6c8144e'>
      <parameter type-id='196db161'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='5ce45b60'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='857bb57e'/>
      <parameter type-id='3502e3ff'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' id='20f7b475'>
      <parameter type-id='196db161'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='5ce45b60'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='c19b74c3'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' id='102ee17a'>
      <parameter type-id='196db161'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='5ce45b60'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='cebdd548'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' id='49b69c77'>
      <parameter type-id='196db161'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='5ce45b60'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='23bd8cb5'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' id='cb5d50f1'>
      <parameter type-id='196db161'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='5ce45b60'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='3ff5601b'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' id='880d56b8'>
      <parameter type-id='196db161'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='5ce45b60'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='9da381c4'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' id='a739bfc6'>
      <parameter type-id='196db161'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='5ce45b60'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='ee31ee44'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' id='234f35e8'>
      <parameter type-id='196db161'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='5ce45b60'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='d8bf0010'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' id='41f7168a'>
      <parameter type-id='196db161'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='5ce45b60'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='149c6638'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' id='e8d6e508'>
      <parameter type-id='196db161'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='5ce45b60'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='8f92235e'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' id='f3daafe5'>
      <parameter type-id='196db161'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='5ce45b60'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='9c313c2d'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' id='17ab04ad'>
      <parameter type-id='196db161'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='5ce45b60'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='b96825af'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' id='256cdd75'>
      <parameter type-id='196db161'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='5ce45b60'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='45b65157'/>
      <parameter type-id='3502e3ff'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' id='cc10a041'>
      <parameter type-id='196db161'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='5ce45b60'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='8a121f49'/>
      <parameter type-id='3502e3ff'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' id='9fd269d3'>
      <parameter type-id='196db161'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='5ce45b60'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='90421557'/>
      <parameter type-id='3502e3ff'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' id='3bd73b0c'>
      <parameter type-id='196db161'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='5ce45b60'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='5d6479ae'/>
      <parameter type-id='3502e3ff'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' id='0d445e26'>
      <parameter type-id='196db161'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='5ce45b60'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='ae3e8ca6'/>
      <parameter type-id='3502e3ff'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' id='e4b89f30'>
      <parameter type-id='b0c1ff8d'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='5ce45b60'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='37e3bd22'/>
      <parameter type-id='3502e3ff'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' id='78e3bec8'>
      <parameter type-id='b0c1ff8d'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='5ce45b60'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='80f4b756'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' id='a5193bb2'>
      <parameter type-id='b0c1ff8d'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='5ce45b60'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='7d3cd834'/>
      <parameter type-id='3502e3ff'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' id='2783af3c'>
      <parameter type-id='b0c1ff8d'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='5ce45b60'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='a0eb0f08'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' id='33c6e3d8'>
      <parameter type-id='b0c1ff8d'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='5ce45b60'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='95e97e5e'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' id='dadb9eca'>
      <parameter type-id='b0c1ff8d'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='5ce45b60'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='f76f73d0'/>
      <parameter type-id='3502e3ff'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' id='55b9e070'>
      <parameter type-id='b0c1ff8d'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='5ce45b60'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='4aafb922'/>
      <parameter type-id='3502e3ff'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' id='8e63c78b'>
      <parameter type-id='b0c1ff8d'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='5ce45b60'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='cb785ebf'/>
      <parameter type-id='3502e3ff'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' id='c542ed33'>
      <parameter type-id='b0c1ff8d'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='5ce45b60'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='256d5229'/>
      <parameter type-id='3502e3ff'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' id='5dea179a'>
      <parameter type-id='b0c1ff8d'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='5ce45b60'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='5ce45b60'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' id='b6f659a0'>
      <parameter type-id='b0c1ff8d'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='5ce45b60'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='857bb57e'/>
      <parameter type-id='3502e3ff'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' id='2765bd17'>
      <parameter type-id='b0c1ff8d'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='5ce45b60'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='c19b74c3'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' id='9e073b5c'>
      <parameter type-id='b0c1ff8d'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='5ce45b60'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='cebdd548'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' id='2c785071'>
      <parameter type-id='b0c1ff8d'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='5ce45b60'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='23bd8cb5'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' id='aad19bf7'>
      <parameter type-id='b0c1ff8d'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='5ce45b60'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='3ff5601b'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' id='0660e71a'>
      <parameter type-id='b0c1ff8d'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='5ce45b60'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='9da381c4'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' id='250287b8'>
      <parameter type-id='b0c1ff8d'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='5ce45b60'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='ee31ee44'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' id='e7344862'>
      <parameter type-id='b0c1ff8d'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='5ce45b60'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='d8bf0010'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' id='32b6d968'>
      <parameter type-id='b0c1ff8d'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='5ce45b60'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='149c6638'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' id='5c975642'>
      <parameter type-id='b0c1ff8d'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='5ce45b60'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='8f92235e'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' id='0155b993'>
      <parameter type-id='b0c1ff8d'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='5ce45b60'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='9c313c2d'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' id='6e8b02cb'>
      <parameter type-id='b0c1ff8d'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='5ce45b60'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='b96825af'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' id='d434b7d7'>
      <parameter type-id='b0c1ff8d'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='5ce45b60'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='45b65157'/>
      <parameter type-id='3502e3ff'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' id='c645e10f'>
      <parameter type-id='b0c1ff8d'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='5ce45b60'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='8a121f49'/>
      <parameter type-id='3502e3ff'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' id='de41f295'>
      <parameter type-id='b0c1ff8d'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='5ce45b60'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='90421557'/>
      <parameter type-id='3502e3ff'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' id='b2fbf64a'>
      <parameter type-id='b0c1ff8d'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='5ce45b60'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='5d6479ae'/>
      <parameter type-id='3502e3ff'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' id='cc22d314'>
      <parameter type-id='b0c1ff8d'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='5ce45b60'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='ae3e8ca6'/>
      <parameter type-id='3502e3ff'/>
      <return type-id='95e97e5e'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='lib/libnvpair/libnvpair_json.c' language='LANG_C99'>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='32' id='8e0573fd'>
      <subrange length='4' type-id='7359adad' id='16fe7105'/>
    </array-type-def>
    <class-decl name='__mbstate_t' size-in-bits='64' is-struct='yes' naming-typedef-id='55e5b2b5' visibility='default' id='87447a2e'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__count' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='__value' type-id='ac5ab595' visibility='default'/>
      </data-member>
    </class-decl>
    <union-decl name='__anonymous_union__' size-in-bits='32' is-anonymous='yes' visibility='default' id='ac5ab595'>
      <data-member access='public'>
        <var-decl name='__wch' type-id='f0981eeb' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__wchb' type-id='8e0573fd' visibility='default'/>
      </data-member>
    </union-decl>
    <typedef-decl name='__mbstate_t' type-id='87447a2e' id='55e5b2b5'/>
    <typedef-decl name='mbstate_t' type-id='55e5b2b5' id='3d7d8cbf'/>
    <typedef-decl name='wchar_t' type-id='95e97e5e' id='928221d2'/>
    <pointer-type-def type-id='3d7d8cbf' size-in-bits='64' id='a68021ce'/>
    <qualified-type-def type-id='a68021ce' restrict='yes' id='03aaab72'/>
    <pointer-type-def type-id='928221d2' size-in-bits='64' id='323d93c1'/>
    <qualified-type-def type-id='323d93c1' restrict='yes' id='f1358bc3'/>
    <function-decl name='fnvpair_value_boolean_value' mangled-name='fnvpair_value_boolean_value' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvpair_value_boolean_value'>
      <parameter type-id='dace003f'/>
      <return type-id='c19b74c3'/>
    </function-decl>
    <function-decl name='fnvpair_value_byte' mangled-name='fnvpair_value_byte' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvpair_value_byte'>
      <parameter type-id='dace003f'/>
      <return type-id='d8bf0010'/>
    </function-decl>
    <function-decl name='fnvpair_value_int8' mangled-name='fnvpair_value_int8' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvpair_value_int8'>
      <parameter type-id='dace003f'/>
      <return type-id='ee31ee44'/>
    </function-decl>
    <function-decl name='fnvpair_value_int16' mangled-name='fnvpair_value_int16' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvpair_value_int16'>
      <parameter type-id='dace003f'/>
      <return type-id='23bd8cb5'/>
    </function-decl>
    <function-decl name='fnvpair_value_int32' mangled-name='fnvpair_value_int32' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvpair_value_int32'>
      <parameter type-id='dace003f'/>
      <return type-id='3ff5601b'/>
    </function-decl>
    <function-decl name='fnvpair_value_int64' mangled-name='fnvpair_value_int64' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvpair_value_int64'>
      <parameter type-id='dace003f'/>
      <return type-id='9da381c4'/>
    </function-decl>
    <function-decl name='fnvpair_value_uint8' mangled-name='fnvpair_value_uint8' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvpair_value_uint8'>
      <parameter type-id='dace003f'/>
      <return type-id='b96825af'/>
    </function-decl>
    <function-decl name='fnvpair_value_uint16' mangled-name='fnvpair_value_uint16' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvpair_value_uint16'>
      <parameter type-id='dace003f'/>
      <return type-id='149c6638'/>
    </function-decl>
    <function-decl name='fnvpair_value_uint32' mangled-name='fnvpair_value_uint32' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvpair_value_uint32'>
      <parameter type-id='dace003f'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='fnvpair_value_uint64' mangled-name='fnvpair_value_uint64' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvpair_value_uint64'>
      <parameter type-id='dace003f'/>
      <return type-id='9c313c2d'/>
    </function-decl>
    <function-decl name='fnvpair_value_string' mangled-name='fnvpair_value_string' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvpair_value_string'>
      <parameter type-id='dace003f'/>
      <return type-id='80f4b756'/>
    </function-decl>
    <function-decl name='fnvpair_value_nvlist' mangled-name='fnvpair_value_nvlist' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvpair_value_nvlist'>
      <parameter type-id='3fa542f0'/>
      <return type-id='5ce45b60'/>
    </function-decl>
    <function-decl name='libspl_assertf' mangled-name='libspl_assertf' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='libspl_assertf'>
      <parameter type-id='80f4b756'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='95e97e5e'/>
      <parameter type-id='80f4b756'/>
      <parameter is-variadic='yes'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='__ctype_get_mb_cur_max' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='b59d7dce'/>
    </function-decl>
    <function-decl name='mbrtowc' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='f1358bc3'/>
      <parameter type-id='9d26089a'/>
      <parameter type-id='b59d7dce'/>
      <parameter type-id='03aaab72'/>
      <return type-id='b59d7dce'/>
    </function-decl>
    <function-decl name='nvlist_print_json' mangled-name='nvlist_print_json' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_print_json'>
      <parameter type-id='822cd80b' name='fp'/>
      <parameter type-id='5ce45b60' name='nvl'/>
      <return type-id='95e97e5e'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='lib/libnvpair/nvpair_alloc_system.c' language='LANG_C99'>
    <class-decl name='__va_list_tag' size-in-bits='192' is-struct='yes' visibility='default' id='d5027220'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='gp_offset' type-id='f0981eeb' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='fp_offset' type-id='f0981eeb' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='overflow_arg_area' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='reg_save_area' type-id='eaa32e2f' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='nv_alloc_ops_t' type-id='8f6cc4f4' id='03e8ffd6'/>
    <class-decl name='nv_alloc' size-in-bits='128' is-struct='yes' visibility='default' id='98213087'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nva_ops' type-id='ee1d4944' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='nva_arg' type-id='eaa32e2f' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='nv_alloc_t' type-id='98213087' id='cca08635'/>
    <class-decl name='nv_alloc_ops' size-in-bits='320' is-struct='yes' visibility='default' id='8f6cc4f4'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nv_ao_init' type-id='76da8447' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='nv_ao_fini' type-id='fe356f6f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='nv_ao_alloc' type-id='9ff7f508' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='nv_ao_free' type-id='520da3f4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='nv_ao_reset' type-id='fe356f6f' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='d5027220' size-in-bits='64' id='b7f2d5e6'/>
    <qualified-type-def type-id='03e8ffd6' const='yes' id='aca16c06'/>
    <pointer-type-def type-id='aca16c06' size-in-bits='64' id='ee1d4944'/>
    <pointer-type-def type-id='e9ff7293' size-in-bits='64' id='76da8447'/>
    <pointer-type-def type-id='cca08635' size-in-bits='64' id='11871392'/>
    <qualified-type-def type-id='11871392' const='yes' id='e1cbfe1d'/>
    <pointer-type-def type-id='51a21b4b' size-in-bits='64' id='fe356f6f'/>
    <pointer-type-def type-id='1169c032' size-in-bits='64' id='520da3f4'/>
    <pointer-type-def type-id='9fff962e' size-in-bits='64' id='9ff7f508'/>
    <var-decl name='nv_alloc_nosleep' type-id='e1cbfe1d' mangled-name='nv_alloc_nosleep' visibility='default' elf-symbol-id='nv_alloc_nosleep'/>
    <function-type size-in-bits='64' id='e9ff7293'>
      <parameter type-id='11871392'/>
      <parameter type-id='b7f2d5e6'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' id='51a21b4b'>
      <parameter type-id='11871392'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' id='1169c032'>
      <parameter type-id='11871392'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='b59d7dce'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' id='9fff962e'>
      <parameter type-id='11871392'/>
      <parameter type-id='b59d7dce'/>
      <return type-id='eaa32e2f'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='lib/libspl/assert.c' language='LANG_C99'>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='320' id='36c46961'>
      <subrange length='40' type-id='7359adad' id='8f80b239'/>
    </array-type-def>
    <union-decl name='pthread_mutex_t' size-in-bits='320' naming-typedef-id='7a6844eb' visibility='default' id='70681f9b'>
      <data-member access='public'>
        <var-decl name='__data' type-id='4c734837' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__size' type-id='36c46961' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__align' type-id='bd54fe1a' visibility='default'/>
      </data-member>
    </union-decl>
    <typedef-decl name='pthread_mutex_t' type-id='70681f9b' id='7a6844eb'/>
    <class-decl name='__pthread_mutex_s' size-in-bits='320' is-struct='yes' visibility='default' id='4c734837'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__lock' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='__count' type-id='f0981eeb' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__owner' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='__nusers' type-id='f0981eeb' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='__kind' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='__spins' type-id='a2185560' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='176'>
        <var-decl name='__elision' type-id='a2185560' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='__list' type-id='518fb49c' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__pthread_internal_list' size-in-bits='128' is-struct='yes' visibility='default' id='0e01899c'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__prev' type-id='4d98cd5a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__next' type-id='4d98cd5a' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__pthread_list_t' type-id='0e01899c' id='518fb49c'/>
    <typedef-decl name='__pid_t' type-id='95e97e5e' id='3629bad8'/>
    <pointer-type-def type-id='0e01899c' size-in-bits='64' id='4d98cd5a'/>
    <pointer-type-def type-id='7a6844eb' size-in-bits='64' id='18c91f9e'/>
    <function-decl name='libspl_backtrace' mangled-name='libspl_backtrace' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='libspl_backtrace'>
      <parameter type-id='95e97e5e'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='pthread_mutex_lock' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='18c91f9e'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='pthread_mutex_unlock' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='18c91f9e'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='abort' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='getpid' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='3629bad8'/>
    </function-decl>
    <function-decl name='__vfprintf_chk' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='e75a27e9'/>
      <parameter type-id='95e97e5e'/>
      <parameter type-id='9d26089a'/>
      <parameter type-id='b7f2d5e6'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='gettid' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='3629bad8'/>
    </function-decl>
    <function-decl name='prctl' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='95e97e5e'/>
      <parameter is-variadic='yes'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='libspl_set_assert_ok' mangled-name='libspl_set_assert_ok' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='libspl_set_assert_ok'>
      <parameter type-id='c19b74c3' name='val'/>
      <return type-id='48b5725f'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='lib/libspl/backtrace.c' language='LANG_C99'>
    <array-type-def dimensions='1' type-id='62f1140c' size-in-bits='768' id='b80f3d9b'>
      <subrange length='24' type-id='7359adad' id='fdd3342b'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='62f1140c' size-in-bits='128' id='bc19e735'>
      <subrange length='4' type-id='7359adad' id='16fe7105'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='22c546af' size-in-bits='1024' id='498c040b'>
      <subrange length='8' type-id='7359adad' id='56e0c0b1'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='4ea07cdb' size-in-bits='2048' id='4811c35e'>
      <subrange length='16' type-id='7359adad' id='848d0938'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='de572c22' size-in-bits='1472' id='6d3c2f42'>
      <subrange length='23' type-id='7359adad' id='fdd0f594'/>
    </array-type-def>
    <type-decl name='long long unsigned int' size-in-bits='64' id='3a47d82b'/>
    <array-type-def dimensions='1' type-id='3a47d82b' size-in-bits='256' id='a133ec23'>
      <subrange length='4' type-id='7359adad' id='16fe7105'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='3a47d82b' size-in-bits='512' id='a13e797f'>
      <subrange length='8' type-id='7359adad' id='56e0c0b1'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='7359adad' size-in-bits='1024' id='d2baa450'>
      <subrange length='16' type-id='7359adad' id='848d0938'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='8efea9e5' size-in-bits='48' id='ff2536e2'>
      <subrange length='3' type-id='7359adad' id='56f209d2'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='8efea9e5' size-in-bits='64' id='3f30d495'>
      <subrange length='4' type-id='7359adad' id='16fe7105'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='73d941c6' size-in-bits='8128' id='dc70ec0b'>
      <subrange length='127' type-id='7359adad' id='5ed08de5'/>
    </array-type-def>
    <typedef-decl name='__ssize_t' type-id='bd54fe1a' id='41060289'/>
    <class-decl name='__sigset_t' size-in-bits='1024' is-struct='yes' naming-typedef-id='b9c97942' visibility='default' id='2616147f'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__val' type-id='d2baa450' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__sigset_t' type-id='2616147f' id='b9c97942'/>
    <typedef-decl name='sigset_t' type-id='b9c97942' id='daf33c64'/>
    <class-decl name='stack_t' size-in-bits='192' is-struct='yes' naming-typedef-id='ac5e685f' visibility='default' id='380f9954'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ss_sp' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ss_flags' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ss_size' type-id='b59d7dce' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='stack_t' type-id='380f9954' id='ac5e685f'/>
    <class-decl name='unw_cursor' size-in-bits='8128' is-struct='yes' visibility='default' id='384a1f22'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='opaque' type-id='dc70ec0b' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='unw_cursor_t' type-id='384a1f22' id='1203d35c'/>
    <typedef-decl name='unw_context_t' type-id='190d09ef' id='8f527367'/>
    <typedef-decl name='unw_word_t' type-id='9c313c2d' id='73d941c6'/>
    <typedef-decl name='unw_tdep_context_t' type-id='c4daa689' id='190d09ef'/>
    <typedef-decl name='ssize_t' type-id='41060289' id='79a0948f'/>
    <typedef-decl name='greg_t' type-id='1eb56b1e' id='de572c22'/>
    <typedef-decl name='gregset_t' type-id='6d3c2f42' id='a66f139c'/>
    <class-decl name='_libc_fpxreg' size-in-bits='128' is-struct='yes' visibility='default' id='22c546af'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='significand' type-id='3f30d495' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='exponent' type-id='8efea9e5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='__glibc_reserved1' type-id='ff2536e2' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='_libc_xmmreg' size-in-bits='128' is-struct='yes' visibility='default' id='4ea07cdb'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='element' type-id='bc19e735' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='_libc_fpstate' size-in-bits='4096' is-struct='yes' visibility='default' id='81cbe5ca'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cwd' type-id='253c2d2a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='swd' type-id='253c2d2a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='ftw' type-id='253c2d2a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='fop' type-id='253c2d2a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='rip' type-id='8910171f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='rdp' type-id='8910171f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='mxcsr' type-id='62f1140c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='mxcr_mask' type-id='62f1140c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='_st' type-id='498c040b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='_xmm' type-id='4811c35e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3328'>
        <var-decl name='__glibc_reserved1' type-id='b80f3d9b' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='fpregset_t' type-id='5b1ab9a8' id='6e5851bb'/>
    <class-decl name='mcontext_t' size-in-bits='2048' is-struct='yes' naming-typedef-id='bacab071' visibility='default' id='76fab990'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='gregs' type-id='a66f139c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='fpregs' type-id='6e5851bb' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='__reserved1' type-id='a13e797f' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='mcontext_t' type-id='76fab990' id='bacab071'/>
    <class-decl name='ucontext_t' size-in-bits='7744' is-struct='yes' visibility='default' id='1ba65dc8'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='uc_flags' type-id='7359adad' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='uc_link' type-id='4ed508de' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='uc_stack' type-id='ac5e685f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='uc_mcontext' type-id='bacab071' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2368'>
        <var-decl name='uc_sigmask' type-id='daf33c64' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3392'>
        <var-decl name='__fpregs_mem' type-id='81cbe5ca' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7488'>
        <var-decl name='__ssp' type-id='a133ec23' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='ucontext_t' type-id='1ba65dc8' id='c4daa689'/>
    <pointer-type-def type-id='81cbe5ca' size-in-bits='64' id='5b1ab9a8'/>
    <pointer-type-def type-id='1ba65dc8' size-in-bits='64' id='4ed508de'/>
    <pointer-type-def type-id='8f527367' size-in-bits='64' id='2e408b96'/>
    <pointer-type-def type-id='1203d35c' size-in-bits='64' id='3946e4d1'/>
    <pointer-type-def type-id='190d09ef' size-in-bits='64' id='3e0601f0'/>
    <pointer-type-def type-id='73d941c6' size-in-bits='64' id='42f5faab'/>
    <function-decl name='write' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='95e97e5e'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='b59d7dce'/>
      <return type-id='79a0948f'/>
    </function-decl>
    <function-decl name='_ULx86_64_init_local' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='3946e4d1'/>
      <parameter type-id='2e408b96'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='_ULx86_64_step' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='3946e4d1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='_ULx86_64_get_reg' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='3946e4d1'/>
      <parameter type-id='95e97e5e'/>
      <parameter type-id='42f5faab'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='_ULx86_64_get_proc_name' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='3946e4d1'/>
      <parameter type-id='26a90f95'/>
      <parameter type-id='b59d7dce'/>
      <parameter type-id='42f5faab'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='_Ux86_64_getcontext' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='3e0601f0'/>
      <return type-id='95e97e5e'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='module/nvpair/fnvpair.c' language='LANG_C99'>
    <function-decl name='fnvlist_alloc' mangled-name='fnvlist_alloc' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_alloc'>
      <return type-id='5ce45b60'/>
    </function-decl>
    <function-decl name='fnvlist_free' mangled-name='fnvlist_free' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_free'>
      <parameter type-id='5ce45b60' name='nvl'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='fnvlist_size' mangled-name='fnvlist_size' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_size'>
      <parameter type-id='5ce45b60' name='nvl'/>
      <return type-id='b59d7dce'/>
    </function-decl>
    <function-decl name='fnvlist_pack' mangled-name='fnvlist_pack' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_pack'>
      <parameter type-id='5ce45b60' name='nvl'/>
      <parameter type-id='78c01427' name='sizep'/>
      <return type-id='26a90f95'/>
    </function-decl>
    <function-decl name='fnvlist_pack_free' mangled-name='fnvlist_pack_free' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_pack_free'>
      <parameter type-id='26a90f95' name='pack'/>
      <parameter type-id='b59d7dce' name='size'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='fnvlist_unpack' mangled-name='fnvlist_unpack' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_unpack'>
      <parameter type-id='26a90f95' name='buf'/>
      <parameter type-id='b59d7dce' name='buflen'/>
      <return type-id='5ce45b60'/>
    </function-decl>
    <function-decl name='fnvlist_dup' mangled-name='fnvlist_dup' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_dup'>
      <parameter type-id='22cce67b' name='nvl'/>
      <return type-id='5ce45b60'/>
    </function-decl>
    <function-decl name='fnvlist_merge' mangled-name='fnvlist_merge' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_merge'>
      <parameter type-id='5ce45b60' name='dst'/>
      <parameter type-id='5ce45b60' name='src'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='fnvlist_num_pairs' mangled-name='fnvlist_num_pairs' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_num_pairs'>
      <parameter type-id='5ce45b60' name='nvl'/>
      <return type-id='b59d7dce'/>
    </function-decl>
    <function-decl name='fnvlist_add_boolean' mangled-name='fnvlist_add_boolean' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_boolean'>
      <parameter type-id='5ce45b60' name='nvl'/>
      <parameter type-id='80f4b756' name='name'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='fnvlist_add_boolean_value' mangled-name='fnvlist_add_boolean_value' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_boolean_value'>
      <parameter type-id='5ce45b60' name='nvl'/>
      <parameter type-id='80f4b756' name='name'/>
      <parameter type-id='c19b74c3' name='val'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='fnvlist_add_byte' mangled-name='fnvlist_add_byte' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_byte'>
      <parameter type-id='5ce45b60' name='nvl'/>
      <parameter type-id='80f4b756' name='name'/>
      <parameter type-id='d8bf0010' name='val'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='fnvlist_add_int8' mangled-name='fnvlist_add_int8' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_int8'>
      <parameter type-id='5ce45b60' name='nvl'/>
      <parameter type-id='80f4b756' name='name'/>
      <parameter type-id='ee31ee44' name='val'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='fnvlist_add_uint8' mangled-name='fnvlist_add_uint8' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_uint8'>
      <parameter type-id='5ce45b60' name='nvl'/>
      <parameter type-id='80f4b756' name='name'/>
      <parameter type-id='b96825af' name='val'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='fnvlist_add_int16' mangled-name='fnvlist_add_int16' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_int16'>
      <parameter type-id='5ce45b60' name='nvl'/>
      <parameter type-id='80f4b756' name='name'/>
      <parameter type-id='23bd8cb5' name='val'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='fnvlist_add_uint16' mangled-name='fnvlist_add_uint16' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_uint16'>
      <parameter type-id='5ce45b60' name='nvl'/>
      <parameter type-id='80f4b756' name='name'/>
      <parameter type-id='149c6638' name='val'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='fnvlist_add_int32' mangled-name='fnvlist_add_int32' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_int32'>
      <parameter type-id='5ce45b60' name='nvl'/>
      <parameter type-id='80f4b756' name='name'/>
      <parameter type-id='3ff5601b' name='val'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='fnvlist_add_uint32' mangled-name='fnvlist_add_uint32' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_uint32'>
      <parameter type-id='5ce45b60' name='nvl'/>
      <parameter type-id='80f4b756' name='name'/>
      <parameter type-id='8f92235e' name='val'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='fnvlist_add_int64' mangled-name='fnvlist_add_int64' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_int64'>
      <parameter type-id='5ce45b60' name='nvl'/>
      <parameter type-id='80f4b756' name='name'/>
      <parameter type-id='9da381c4' name='val'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='fnvlist_add_uint64' mangled-name='fnvlist_add_uint64' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_uint64'>
      <parameter type-id='5ce45b60' name='nvl'/>
      <parameter type-id='80f4b756' name='name'/>
      <parameter type-id='9c313c2d' name='val'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='fnvlist_add_string' mangled-name='fnvlist_add_string' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_string'>
      <parameter type-id='5ce45b60' name='nvl'/>
      <parameter type-id='80f4b756' name='name'/>
      <parameter type-id='80f4b756' name='val'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='fnvlist_add_nvlist' mangled-name='fnvlist_add_nvlist' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_nvlist'>
      <parameter type-id='5ce45b60' name='nvl'/>
      <parameter type-id='80f4b756' name='name'/>
      <parameter type-id='5ce45b60' name='val'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='fnvlist_add_nvpair' mangled-name='fnvlist_add_nvpair' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_nvpair'>
      <parameter type-id='5ce45b60' name='nvl'/>
      <parameter type-id='3fa542f0' name='pair'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='fnvlist_add_boolean_array' mangled-name='fnvlist_add_boolean_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_boolean_array'>
      <parameter type-id='5ce45b60' name='nvl'/>
      <parameter type-id='80f4b756' name='name'/>
      <parameter type-id='c5f6c15b' name='val'/>
      <parameter type-id='3502e3ff' name='n'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='fnvlist_add_byte_array' mangled-name='fnvlist_add_byte_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_byte_array'>
      <parameter type-id='5ce45b60' name='nvl'/>
      <parameter type-id='80f4b756' name='name'/>
      <parameter type-id='d1db479e' name='val'/>
      <parameter type-id='3502e3ff' name='n'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='fnvlist_add_int8_array' mangled-name='fnvlist_add_int8_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_int8_array'>
      <parameter type-id='5ce45b60' name='nvl'/>
      <parameter type-id='80f4b756' name='name'/>
      <parameter type-id='a06445da' name='val'/>
      <parameter type-id='3502e3ff' name='n'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='fnvlist_add_uint8_array' mangled-name='fnvlist_add_uint8_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_uint8_array'>
      <parameter type-id='5ce45b60' name='nvl'/>
      <parameter type-id='80f4b756' name='name'/>
      <parameter type-id='9f7200cf' name='val'/>
      <parameter type-id='3502e3ff' name='n'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='fnvlist_add_int16_array' mangled-name='fnvlist_add_int16_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_int16_array'>
      <parameter type-id='5ce45b60' name='nvl'/>
      <parameter type-id='80f4b756' name='name'/>
      <parameter type-id='a3eb883d' name='val'/>
      <parameter type-id='3502e3ff' name='n'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='fnvlist_add_uint16_array' mangled-name='fnvlist_add_uint16_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_uint16_array'>
      <parameter type-id='5ce45b60' name='nvl'/>
      <parameter type-id='80f4b756' name='name'/>
      <parameter type-id='1b7d11c6' name='val'/>
      <parameter type-id='3502e3ff' name='n'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='fnvlist_add_int32_array' mangled-name='fnvlist_add_int32_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_int32_array'>
      <parameter type-id='5ce45b60' name='nvl'/>
      <parameter type-id='80f4b756' name='name'/>
      <parameter type-id='1f526493' name='val'/>
      <parameter type-id='3502e3ff' name='n'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='fnvlist_add_uint32_array' mangled-name='fnvlist_add_uint32_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_uint32_array'>
      <parameter type-id='5ce45b60' name='nvl'/>
      <parameter type-id='80f4b756' name='name'/>
      <parameter type-id='a6798dcc' name='val'/>
      <parameter type-id='3502e3ff' name='n'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='fnvlist_add_int64_array' mangled-name='fnvlist_add_int64_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_int64_array'>
      <parameter type-id='5ce45b60' name='nvl'/>
      <parameter type-id='80f4b756' name='name'/>
      <parameter type-id='505bed1a' name='val'/>
      <parameter type-id='3502e3ff' name='n'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='fnvlist_add_uint64_array' mangled-name='fnvlist_add_uint64_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_uint64_array'>
      <parameter type-id='5ce45b60' name='nvl'/>
      <parameter type-id='80f4b756' name='name'/>
      <parameter type-id='713a56f5' name='val'/>
      <parameter type-id='3502e3ff' name='n'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='fnvlist_add_string_array' mangled-name='fnvlist_add_string_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_string_array'>
      <parameter type-id='5ce45b60' name='nvl'/>
      <parameter type-id='80f4b756' name='name'/>
      <parameter type-id='13956559' name='val'/>
      <parameter type-id='3502e3ff' name='n'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='fnvlist_add_nvlist_array' mangled-name='fnvlist_add_nvlist_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_nvlist_array'>
      <parameter type-id='5ce45b60' name='nvl'/>
      <parameter type-id='80f4b756' name='name'/>
      <parameter type-id='3bbfee2e' name='val'/>
      <parameter type-id='3502e3ff' name='n'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='fnvlist_remove' mangled-name='fnvlist_remove' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_remove'>
      <parameter type-id='5ce45b60' name='nvl'/>
      <parameter type-id='80f4b756' name='name'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='fnvlist_remove_nvpair' mangled-name='fnvlist_remove_nvpair' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_remove_nvpair'>
      <parameter type-id='5ce45b60' name='nvl'/>
      <parameter type-id='3fa542f0' name='pair'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_nvpair' mangled-name='fnvlist_lookup_nvpair' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_lookup_nvpair'>
      <parameter type-id='5ce45b60' name='nvl'/>
      <parameter type-id='80f4b756' name='name'/>
      <return type-id='3fa542f0'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_boolean' mangled-name='fnvlist_lookup_boolean' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_lookup_boolean'>
      <parameter type-id='22cce67b' name='nvl'/>
      <parameter type-id='80f4b756' name='name'/>
      <return type-id='c19b74c3'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_boolean_value' mangled-name='fnvlist_lookup_boolean_value' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_lookup_boolean_value'>
      <parameter type-id='22cce67b' name='nvl'/>
      <parameter type-id='80f4b756' name='name'/>
      <return type-id='c19b74c3'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_byte' mangled-name='fnvlist_lookup_byte' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_lookup_byte'>
      <parameter type-id='22cce67b' name='nvl'/>
      <parameter type-id='80f4b756' name='name'/>
      <return type-id='d8bf0010'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_int8' mangled-name='fnvlist_lookup_int8' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_lookup_int8'>
      <parameter type-id='22cce67b' name='nvl'/>
      <parameter type-id='80f4b756' name='name'/>
      <return type-id='ee31ee44'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_int16' mangled-name='fnvlist_lookup_int16' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_lookup_int16'>
      <parameter type-id='22cce67b' name='nvl'/>
      <parameter type-id='80f4b756' name='name'/>
      <return type-id='23bd8cb5'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_int32' mangled-name='fnvlist_lookup_int32' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_lookup_int32'>
      <parameter type-id='22cce67b' name='nvl'/>
      <parameter type-id='80f4b756' name='name'/>
      <return type-id='3ff5601b'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_int64' mangled-name='fnvlist_lookup_int64' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_lookup_int64'>
      <parameter type-id='22cce67b' name='nvl'/>
      <parameter type-id='80f4b756' name='name'/>
      <return type-id='9da381c4'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_uint8' mangled-name='fnvlist_lookup_uint8' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_lookup_uint8'>
      <parameter type-id='22cce67b' name='nvl'/>
      <parameter type-id='80f4b756' name='name'/>
      <return type-id='b96825af'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_uint16' mangled-name='fnvlist_lookup_uint16' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_lookup_uint16'>
      <parameter type-id='22cce67b' name='nvl'/>
      <parameter type-id='80f4b756' name='name'/>
      <return type-id='149c6638'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_uint32' mangled-name='fnvlist_lookup_uint32' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_lookup_uint32'>
      <parameter type-id='22cce67b' name='nvl'/>
      <parameter type-id='80f4b756' name='name'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_uint64' mangled-name='fnvlist_lookup_uint64' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_lookup_uint64'>
      <parameter type-id='22cce67b' name='nvl'/>
      <parameter type-id='80f4b756' name='name'/>
      <return type-id='9c313c2d'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_string' mangled-name='fnvlist_lookup_string' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_lookup_string'>
      <parameter type-id='22cce67b' name='nvl'/>
      <parameter type-id='80f4b756' name='name'/>
      <return type-id='80f4b756'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_nvlist' mangled-name='fnvlist_lookup_nvlist' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_lookup_nvlist'>
      <parameter type-id='5ce45b60' name='nvl'/>
      <parameter type-id='80f4b756' name='name'/>
      <return type-id='5ce45b60'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_boolean_array' mangled-name='fnvlist_lookup_boolean_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_lookup_boolean_array'>
      <parameter type-id='5ce45b60' name='nvl'/>
      <parameter type-id='80f4b756' name='name'/>
      <parameter type-id='4dd26a40' name='n'/>
      <return type-id='37e3bd22'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_byte_array' mangled-name='fnvlist_lookup_byte_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_lookup_byte_array'>
      <parameter type-id='5ce45b60' name='nvl'/>
      <parameter type-id='80f4b756' name='name'/>
      <parameter type-id='4dd26a40' name='n'/>
      <return type-id='45b65157'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_int8_array' mangled-name='fnvlist_lookup_int8_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_lookup_int8_array'>
      <parameter type-id='5ce45b60' name='nvl'/>
      <parameter type-id='80f4b756' name='name'/>
      <parameter type-id='4dd26a40' name='n'/>
      <return type-id='256d5229'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_uint8_array' mangled-name='fnvlist_lookup_uint8_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_lookup_uint8_array'>
      <parameter type-id='5ce45b60' name='nvl'/>
      <parameter type-id='80f4b756' name='name'/>
      <parameter type-id='4dd26a40' name='n'/>
      <return type-id='ae3e8ca6'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_int16_array' mangled-name='fnvlist_lookup_int16_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_lookup_int16_array'>
      <parameter type-id='5ce45b60' name='nvl'/>
      <parameter type-id='80f4b756' name='name'/>
      <parameter type-id='4dd26a40' name='n'/>
      <return type-id='f76f73d0'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_uint16_array' mangled-name='fnvlist_lookup_uint16_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_lookup_uint16_array'>
      <parameter type-id='5ce45b60' name='nvl'/>
      <parameter type-id='80f4b756' name='name'/>
      <parameter type-id='4dd26a40' name='n'/>
      <return type-id='8a121f49'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_int32_array' mangled-name='fnvlist_lookup_int32_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_lookup_int32_array'>
      <parameter type-id='5ce45b60' name='nvl'/>
      <parameter type-id='80f4b756' name='name'/>
      <parameter type-id='4dd26a40' name='n'/>
      <return type-id='4aafb922'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_uint32_array' mangled-name='fnvlist_lookup_uint32_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_lookup_uint32_array'>
      <parameter type-id='5ce45b60' name='nvl'/>
      <parameter type-id='80f4b756' name='name'/>
      <parameter type-id='4dd26a40' name='n'/>
      <return type-id='90421557'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_int64_array' mangled-name='fnvlist_lookup_int64_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_lookup_int64_array'>
      <parameter type-id='5ce45b60' name='nvl'/>
      <parameter type-id='80f4b756' name='name'/>
      <parameter type-id='4dd26a40' name='n'/>
      <return type-id='cb785ebf'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_uint64_array' mangled-name='fnvlist_lookup_uint64_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_lookup_uint64_array'>
      <parameter type-id='5ce45b60' name='nvl'/>
      <parameter type-id='80f4b756' name='name'/>
      <parameter type-id='4dd26a40' name='n'/>
      <return type-id='5d6479ae'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='module/nvpair/nvpair.c' language='LANG_C99'>
    <typedef-decl name='bool_t' type-id='3ff5601b' id='310a70df'/>
    <enum-decl name='xdr_op' id='6badf1b8'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='XDR_ENCODE' value='0'/>
      <enumerator name='XDR_DECODE' value='1'/>
      <enumerator name='XDR_FREE' value='2'/>
    </enum-decl>
    <class-decl name='__rpc_xdr' size-in-bits='384' is-struct='yes' visibility='default' id='755707df'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='x_op' type-id='6badf1b8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='x_ops' type-id='3457e9c5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='x_public' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='x_private' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='x_base' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='x_handy' type-id='48f7c3f5' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='xdr_ops' size-in-bits='576' is-struct='yes' visibility='default' id='ea1474f2'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='x_getlong' type-id='a4e6dd3f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='x_putlong' type-id='d447b08c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='x_getbytes' type-id='b0b6ccaa' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='x_putbytes' type-id='581c24b7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='x_getpostn' type-id='1c77bdb0' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='x_setpostn' type-id='13fdb43e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='x_inline' type-id='788e1f25' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='x_destroy' type-id='d781e3b2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='x_control' type-id='733fc725' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='XDR' type-id='755707df' id='bc407f0e'/>
    <typedef-decl name='xdrproc_t' type-id='94d188f0' id='c28db3e9'/>
    <typedef-decl name='__u_short' type-id='8efea9e5' id='46c660f8'/>
    <typedef-decl name='__u_int' type-id='f0981eeb' id='8ae6822f'/>
    <typedef-decl name='__quad_t' type-id='bd54fe1a' id='2632227a'/>
    <typedef-decl name='__u_quad_t' type-id='7359adad' id='5f3d50a6'/>
    <typedef-decl name='u_short' type-id='46c660f8' id='32580e96'/>
    <typedef-decl name='u_int' type-id='8ae6822f' id='48f7c3f5'/>
    <typedef-decl name='quad_t' type-id='2632227a' id='f5ef0660'/>
    <typedef-decl name='u_quad_t' type-id='5f3d50a6' id='bd226ac0'/>
    <pointer-type-def type-id='bc407f0e' size-in-bits='64' id='17fd1621'/>
    <pointer-type-def type-id='755707df' size-in-bits='64' id='812c6697'/>
    <pointer-type-def type-id='26a90f95' size-in-bits='64' id='9b23c9ad'/>
    <qualified-type-def type-id='9b23c9ad' restrict='yes' id='8c85230f'/>
    <pointer-type-def type-id='9b23c9ad' size-in-bits='64' id='c0563f85'/>
    <qualified-type-def type-id='c19b74c3' const='yes' id='12373e33'/>
    <pointer-type-def type-id='12373e33' size-in-bits='64' id='c5f6c15b'/>
    <qualified-type-def type-id='80f4b756' const='yes' id='b99c00c9'/>
    <pointer-type-def type-id='b99c00c9' size-in-bits='64' id='13956559'/>
    <qualified-type-def type-id='23bd8cb5' const='yes' id='75f7b0c5'/>
    <pointer-type-def type-id='75f7b0c5' size-in-bits='64' id='a3eb883d'/>
    <qualified-type-def type-id='3ff5601b' const='yes' id='922df12b'/>
    <pointer-type-def type-id='922df12b' size-in-bits='64' id='1f526493'/>
    <qualified-type-def type-id='9da381c4' const='yes' id='f07b7694'/>
    <pointer-type-def type-id='f07b7694' size-in-bits='64' id='505bed1a'/>
    <qualified-type-def type-id='ee31ee44' const='yes' id='721c32d4'/>
    <pointer-type-def type-id='721c32d4' size-in-bits='64' id='a06445da'/>
    <qualified-type-def type-id='bd54fe1a' const='yes' id='9cb2385f'/>
    <pointer-type-def type-id='9cb2385f' size-in-bits='64' id='218ee02f'/>
    <qualified-type-def type-id='8e8d4be3' const='yes' id='693c3853'/>
    <pointer-type-def type-id='693c3853' size-in-bits='64' id='22cce67b'/>
    <qualified-type-def type-id='22cce67b' const='yes' id='d2816df0'/>
    <pointer-type-def type-id='d2816df0' size-in-bits='64' id='3bbfee2e'/>
    <qualified-type-def type-id='d8bf0010' const='yes' id='a9125480'/>
    <pointer-type-def type-id='a9125480' size-in-bits='64' id='d1db479e'/>
    <qualified-type-def type-id='149c6638' const='yes' id='b01a5ac8'/>
    <pointer-type-def type-id='b01a5ac8' size-in-bits='64' id='1b7d11c6'/>
    <qualified-type-def type-id='8f92235e' const='yes' id='b9930aae'/>
    <pointer-type-def type-id='b9930aae' size-in-bits='64' id='a6798dcc'/>
    <qualified-type-def type-id='9c313c2d' const='yes' id='c3b7ba7d'/>
    <pointer-type-def type-id='c3b7ba7d' size-in-bits='64' id='713a56f5'/>
    <qualified-type-def type-id='b96825af' const='yes' id='2b61797f'/>
    <pointer-type-def type-id='2b61797f' size-in-bits='64' id='9f7200cf'/>
    <qualified-type-def type-id='ea1474f2' const='yes' id='485ede6d'/>
    <pointer-type-def type-id='485ede6d' size-in-bits='64' id='3457e9c5'/>
    <pointer-type-def type-id='95e97e5e' size-in-bits='64' id='7292109c'/>
    <pointer-type-def type-id='441e0c31' size-in-bits='64' id='788e1f25'/>
    <pointer-type-def type-id='bd54fe1a' size-in-bits='64' id='3ccc2590'/>
    <pointer-type-def type-id='3fa542f0' size-in-bits='64' id='0b283d2e'/>
    <pointer-type-def type-id='f5ef0660' size-in-bits='64' id='de23782d'/>
    <pointer-type-def type-id='a2185560' size-in-bits='64' id='764e437e'/>
    <pointer-type-def type-id='b59d7dce' size-in-bits='64' id='78c01427'/>
    <pointer-type-def type-id='e80b47fe' size-in-bits='64' id='94d188f0'/>
