<abi-corpus path='libnvpair.so' architecture='elf-amd-x86_64' soname='libnvpair.so.3'>
  <elf-needed>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='dump_nvlist' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fnvlist_add_boolean' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fnvlist_add_boolean_array' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fnvlist_add_boolean_value' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fnvlist_add_byte' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fnvlist_add_byte_array' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fnvlist_add_int16' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fnvlist_add_int16_array' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fnvlist_add_int32' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='nvlist_remove_nvpair' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvlist_size' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvlist_unpack' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvlist_xalloc' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvlist_xdup' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvlist_xpack' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvlist_xunpack' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_name' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_type' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_type_is_array' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_boolean_array' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_boolean_value' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_byte' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_byte_array' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_double' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_hrtime' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_int16' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_int16_array' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_int32' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_int32_array' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_int64' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_int64_array' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_int8' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_int8_array' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_match' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_match_regex' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_nvlist' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_nvlist_array' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_string' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_string_array' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_uint16' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_uint16_array' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_uint32' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_uint32_array' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_uint64' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_uint64_array' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_uint8' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_uint8_array' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <elf-variable-symbols>
    <elf-symbol name='libspl_assert_ok' size='4' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nv_alloc_nosleep' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nv_fixed_ops' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-variable-symbols>
  <abi-instr version='1.0' address-size='64' path='libnvpair.c' comp-dir-path='/home/nabijaczleweli/store/code/zfs/lib/libnvpair' language='LANG_C99'>
    <type-decl name='void' id='type-id-1'/>
    <class-decl name='nvlist_prtctl' size-in-bits='576' is-struct='yes' visibility='default' id='type-id-2'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nvprt_fp' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='nvprt_indent_mode' type-id='type-id-4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='nvprt_indent' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='nvprt_indentinc' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='nvprt_nmfmt' type-id='type-id-6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='nvprt_eomfmt' type-id='type-id-6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='nvprt_btwnarrfmt' type-id='type-id-6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='nvprt_btwnarrfmt_nl' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='nvprt_dfltops' type-id='type-id-7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='nvprt_custops' type-id='type-id-7' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='_IO_FILE' size-in-bits='1728' is-struct='yes' visibility='default' id='type-id-8'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_flags' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_IO_read_ptr' type-id='type-id-9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_IO_read_end' type-id='type-id-9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_IO_read_base' type-id='type-id-9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='_IO_write_base' type-id='type-id-9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='_IO_write_ptr' type-id='type-id-9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_IO_write_end' type-id='type-id-9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='_IO_buf_base' type-id='type-id-9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='_IO_buf_end' type-id='type-id-9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='_IO_save_base' type-id='type-id-9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='_IO_backup_base' type-id='type-id-9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='_IO_save_end' type-id='type-id-9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='_markers' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='_chain' type-id='type-id-11' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='_fileno' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='_flags2' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='_old_offset' type-id='type-id-12' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='_cur_column' type-id='type-id-13' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1040'>
        <var-decl name='_vtable_offset' type-id='type-id-14' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1048'>
        <var-decl name='_shortbuf' type-id='type-id-15' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='_offset' type-id='type-id-16' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='_codecvt' type-id='type-id-17' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='_wide_data' type-id='type-id-18' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='_freeres_list' type-id='type-id-11' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='_freeres_buf' type-id='type-id-19' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='__pad5' type-id='type-id-20' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='_mode' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='_unused2' type-id='type-id-21' visibility='default'/>
      </data-member>
    </class-decl>
    <type-decl name='int' size-in-bits='32' id='type-id-5'/>
    <type-decl name='char' size-in-bits='8' id='type-id-22'/>
    <pointer-type-def type-id='type-id-22' size-in-bits='64' id='type-id-9'/>
    <class-decl name='_IO_marker' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-23'/>
    <pointer-type-def type-id='type-id-23' size-in-bits='64' id='type-id-10'/>
    <pointer-type-def type-id='type-id-8' size-in-bits='64' id='type-id-11'/>
    <type-decl name='long int' size-in-bits='64' id='type-id-24'/>
    <typedef-decl name='__off_t' type-id='type-id-24' id='type-id-12'/>
    <type-decl name='unsigned short int' size-in-bits='16' id='type-id-13'/>
    <type-decl name='signed char' size-in-bits='8' id='type-id-14'/>
    <type-decl name='__ARRAY_SIZE_TYPE__' size-in-bits='64' id='type-id-25'/>

    <array-type-def dimensions='1' type-id='type-id-22' size-in-bits='8' id='type-id-15'>
      <subrange length='1' type-id='type-id-25' id='type-id-26'/>

    </array-type-def>
    <typedef-decl name='__off64_t' type-id='type-id-24' id='type-id-16'/>
    <class-decl name='_IO_codecvt' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-27'/>
    <pointer-type-def type-id='type-id-27' size-in-bits='64' id='type-id-17'/>
    <class-decl name='_IO_wide_data' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-28'/>
    <pointer-type-def type-id='type-id-28' size-in-bits='64' id='type-id-18'/>
    <pointer-type-def type-id='type-id-1' size-in-bits='64' id='type-id-19'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-29'/>
    <typedef-decl name='size_t' type-id='type-id-29' id='type-id-20'/>

    <array-type-def dimensions='1' type-id='type-id-22' size-in-bits='160' id='type-id-21'>
      <subrange length='20' type-id='type-id-25' id='type-id-30'/>

    </array-type-def>
    <typedef-decl name='FILE' type-id='type-id-8' id='type-id-31'/>
    <pointer-type-def type-id='type-id-31' size-in-bits='64' id='type-id-3'/>
    <type-decl name='unnamed-enum-underlying-type' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='type-id-32'/>
    <enum-decl name='nvlist_indent_mode' id='type-id-4'>
      <underlying-type type-id='type-id-32'/>
      <enumerator name='NVLIST_INDENT_ABS' value='0'/>
      <enumerator name='NVLIST_INDENT_TABBED' value='1'/>
    </enum-decl>
    <qualified-type-def type-id='type-id-22' const='yes' id='type-id-33'/>
    <pointer-type-def type-id='type-id-33' size-in-bits='64' id='type-id-6'/>
    <class-decl name='nvlist_printops' size-in-bits='3456' is-struct='yes' visibility='default' id='type-id-34'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='print_boolean' type-id='type-id-35' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='print_boolean_value' type-id='type-id-36' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='print_byte' type-id='type-id-37' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='print_int8' type-id='type-id-38' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='print_uint8' type-id='type-id-39' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='print_int16' type-id='type-id-40' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='print_uint16' type-id='type-id-41' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='print_int32' type-id='type-id-42' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='print_uint32' type-id='type-id-43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='print_int64' type-id='type-id-44' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='print_uint64' type-id='type-id-45' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='print_double' type-id='type-id-46' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='print_string' type-id='type-id-47' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='print_hrtime' type-id='type-id-48' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='print_nvlist' type-id='type-id-49' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1920'>
        <var-decl name='print_boolean_array' type-id='type-id-50' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='print_byte_array' type-id='type-id-51' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='print_int8_array' type-id='type-id-52' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2304'>
        <var-decl name='print_uint8_array' type-id='type-id-53' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2432'>
        <var-decl name='print_int16_array' type-id='type-id-54' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2560'>
        <var-decl name='print_uint16_array' type-id='type-id-55' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2688'>
        <var-decl name='print_int32_array' type-id='type-id-56' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2816'>
        <var-decl name='print_uint32_array' type-id='type-id-57' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2944'>
        <var-decl name='print_int64_array' type-id='type-id-58' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3072'>
        <var-decl name='print_uint64_array' type-id='type-id-59' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3200'>
        <var-decl name='print_string_array' type-id='type-id-60' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3328'>
        <var-decl name='print_nvlist_array' type-id='type-id-61' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-35'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-62' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-19' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-2' size-in-bits='64' id='type-id-63'/>
    <class-decl name='nvlist' size-in-bits='192' is-struct='yes' visibility='default' id='type-id-64'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nvl_version' type-id='type-id-65' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='nvl_nvflag' type-id='type-id-66' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='nvl_priv' type-id='type-id-67' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='nvl_flag' type-id='type-id-66' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='nvl_pad' type-id='type-id-65' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__int32_t' type-id='type-id-5' id='type-id-68'/>
    <typedef-decl name='int32_t' type-id='type-id-68' id='type-id-65'/>
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-69'/>
    <typedef-decl name='__uint32_t' type-id='type-id-69' id='type-id-70'/>
    <typedef-decl name='uint32_t' type-id='type-id-70' id='type-id-66'/>
    <typedef-decl name='__uint64_t' type-id='type-id-29' id='type-id-71'/>
    <typedef-decl name='uint64_t' type-id='type-id-71' id='type-id-67'/>
    <typedef-decl name='nvlist_t' type-id='type-id-64' id='type-id-72'/>
    <pointer-type-def type-id='type-id-72' size-in-bits='64' id='type-id-73'/>
    <pointer-type-def type-id='type-id-74' size-in-bits='64' id='type-id-62'/>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-36'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-75' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-19' visibility='default'/>
      </data-member>
    </class-decl>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' id='type-id-76'>
      <underlying-type type-id='type-id-32'/>
      <enumerator name='B_FALSE' value='0'/>
      <enumerator name='B_TRUE' value='1'/>
    </enum-decl>
    <typedef-decl name='boolean_t' type-id='type-id-76' id='type-id-77'/>
    <pointer-type-def type-id='type-id-78' size-in-bits='64' id='type-id-75'/>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-37'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-79' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-19' visibility='default'/>
      </data-member>
    </class-decl>
    <type-decl name='unsigned char' size-in-bits='8' id='type-id-80'/>
    <typedef-decl name='uchar_t' type-id='type-id-80' id='type-id-81'/>
    <pointer-type-def type-id='type-id-82' size-in-bits='64' id='type-id-79'/>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-38'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-83' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-19' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__int8_t' type-id='type-id-14' id='type-id-84'/>
    <typedef-decl name='int8_t' type-id='type-id-84' id='type-id-85'/>
    <pointer-type-def type-id='type-id-86' size-in-bits='64' id='type-id-83'/>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-39'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-87' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-19' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__uint8_t' type-id='type-id-80' id='type-id-88'/>
    <typedef-decl name='uint8_t' type-id='type-id-88' id='type-id-89'/>
    <pointer-type-def type-id='type-id-90' size-in-bits='64' id='type-id-87'/>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-40'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-91' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-19' visibility='default'/>
      </data-member>
    </class-decl>
    <type-decl name='short int' size-in-bits='16' id='type-id-92'/>
    <typedef-decl name='__int16_t' type-id='type-id-92' id='type-id-93'/>
    <typedef-decl name='int16_t' type-id='type-id-93' id='type-id-94'/>
    <pointer-type-def type-id='type-id-95' size-in-bits='64' id='type-id-91'/>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-41'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-96' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-19' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__uint16_t' type-id='type-id-13' id='type-id-97'/>
    <typedef-decl name='uint16_t' type-id='type-id-97' id='type-id-98'/>
    <pointer-type-def type-id='type-id-99' size-in-bits='64' id='type-id-96'/>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-42'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-100' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-19' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-101' size-in-bits='64' id='type-id-100'/>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-43'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-102' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-19' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-103' size-in-bits='64' id='type-id-102'/>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-44'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-104' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-19' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__int64_t' type-id='type-id-24' id='type-id-105'/>
    <typedef-decl name='int64_t' type-id='type-id-105' id='type-id-106'/>
    <pointer-type-def type-id='type-id-107' size-in-bits='64' id='type-id-104'/>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-45'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-108' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-19' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-109' size-in-bits='64' id='type-id-108'/>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-46'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-110' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-19' visibility='default'/>
      </data-member>
    </class-decl>
    <type-decl name='double' size-in-bits='64' id='type-id-111'/>
    <pointer-type-def type-id='type-id-112' size-in-bits='64' id='type-id-110'/>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-47'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-113' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-19' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-114' size-in-bits='64' id='type-id-113'/>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-48'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-115' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-19' visibility='default'/>
      </data-member>
    </class-decl>
    <type-decl name='long long int' size-in-bits='64' id='type-id-116'/>
    <typedef-decl name='hrtime_t' type-id='type-id-116' id='type-id-117'/>
    <pointer-type-def type-id='type-id-118' size-in-bits='64' id='type-id-115'/>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-49'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-119' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-19' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-120' size-in-bits='64' id='type-id-119'/>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-50'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-121' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-19' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-77' size-in-bits='64' id='type-id-122'/>
    <typedef-decl name='uint_t' type-id='type-id-69' id='type-id-123'/>
    <pointer-type-def type-id='type-id-124' size-in-bits='64' id='type-id-121'/>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-51'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-125' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-19' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-81' size-in-bits='64' id='type-id-126'/>
    <pointer-type-def type-id='type-id-127' size-in-bits='64' id='type-id-125'/>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-52'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-128' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-19' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-85' size-in-bits='64' id='type-id-129'/>
    <pointer-type-def type-id='type-id-130' size-in-bits='64' id='type-id-128'/>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-53'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-131' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-19' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-89' size-in-bits='64' id='type-id-132'/>
    <pointer-type-def type-id='type-id-133' size-in-bits='64' id='type-id-131'/>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-54'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-134' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-19' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-94' size-in-bits='64' id='type-id-135'/>
    <pointer-type-def type-id='type-id-136' size-in-bits='64' id='type-id-134'/>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-55'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-137' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-19' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-98' size-in-bits='64' id='type-id-138'/>
    <pointer-type-def type-id='type-id-139' size-in-bits='64' id='type-id-137'/>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-56'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-140' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-19' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-65' size-in-bits='64' id='type-id-141'/>
    <pointer-type-def type-id='type-id-142' size-in-bits='64' id='type-id-140'/>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-57'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-143' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-19' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-66' size-in-bits='64' id='type-id-144'/>
    <pointer-type-def type-id='type-id-145' size-in-bits='64' id='type-id-143'/>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-58'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-146' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-19' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-106' size-in-bits='64' id='type-id-147'/>
    <pointer-type-def type-id='type-id-148' size-in-bits='64' id='type-id-146'/>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-59'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-149' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-19' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-67' size-in-bits='64' id='type-id-150'/>
    <pointer-type-def type-id='type-id-151' size-in-bits='64' id='type-id-149'/>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-60'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-152' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-19' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-9' size-in-bits='64' id='type-id-153'/>
    <pointer-type-def type-id='type-id-154' size-in-bits='64' id='type-id-152'/>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-61'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-155' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-19' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-73' size-in-bits='64' id='type-id-156'/>
    <pointer-type-def type-id='type-id-157' size-in-bits='64' id='type-id-155'/>
    <pointer-type-def type-id='type-id-34' size-in-bits='64' id='type-id-7'/>
    <typedef-decl name='nvlist_prtctl_t' type-id='type-id-63' id='type-id-158'/>
    <function-decl name='nvlist_prtctl_setdest' mangled-name='nvlist_prtctl_setdest' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctl_setdest'>
      <parameter type-id='type-id-158' name='pctl'/>
      <parameter type-id='type-id-3' name='fp'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='nvlist_prtctl_getdest' mangled-name='nvlist_prtctl_getdest' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctl_getdest'>
      <parameter type-id='type-id-158' name='pctl'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='nvlist_prtctl_setindent' mangled-name='nvlist_prtctl_setindent' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctl_setindent'>
      <parameter type-id='type-id-158' name='pctl'/>
      <parameter type-id='type-id-4' name='mode'/>
      <parameter type-id='type-id-5' name='start'/>
      <parameter type-id='type-id-5' name='inc'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='nvlist_prtctl_doindent' mangled-name='nvlist_prtctl_doindent' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctl_doindent'>
      <parameter type-id='type-id-158' name='pctl'/>
      <parameter type-id='type-id-5' name='onemore'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <enum-decl name='nvlist_prtctl_fmt' id='type-id-159'>
      <underlying-type type-id='type-id-32'/>
      <enumerator name='NVLIST_FMT_MEMBER_NAME' value='0'/>
      <enumerator name='NVLIST_FMT_MEMBER_POSTAMBLE' value='1'/>
      <enumerator name='NVLIST_FMT_BTWN_ARRAY' value='2'/>
    </enum-decl>
    <function-decl name='nvlist_prtctl_setfmt' mangled-name='nvlist_prtctl_setfmt' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctl_setfmt'>
      <parameter type-id='type-id-158' name='pctl'/>
      <parameter type-id='type-id-159' name='which'/>
      <parameter type-id='type-id-6' name='fmt'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='nvlist_prtctl_dofmt' mangled-name='nvlist_prtctl_dofmt' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctl_dofmt'>
      <parameter type-id='type-id-158' name='pctl'/>
      <parameter type-id='type-id-159' name='which'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <pointer-type-def type-id='type-id-160' size-in-bits='64' id='type-id-161'/>
    <function-decl name='nvlist_prtctlop_boolean' mangled-name='nvlist_prtctlop_boolean' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_boolean'>
      <parameter type-id='type-id-158' name='pctl'/>
      <parameter type-id='type-id-161' name='func'/>
      <parameter type-id='type-id-19' name='private'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <pointer-type-def type-id='type-id-162' size-in-bits='64' id='type-id-163'/>
    <function-decl name='nvlist_prtctlop_boolean_value' mangled-name='nvlist_prtctlop_boolean_value' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_boolean_value'>
      <parameter type-id='type-id-158' name='pctl'/>
      <parameter type-id='type-id-163' name='func'/>
      <parameter type-id='type-id-19' name='private'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <pointer-type-def type-id='type-id-164' size-in-bits='64' id='type-id-165'/>
    <function-decl name='nvlist_prtctlop_byte' mangled-name='nvlist_prtctlop_byte' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_byte'>
      <parameter type-id='type-id-158' name='pctl'/>
      <parameter type-id='type-id-165' name='func'/>
      <parameter type-id='type-id-19' name='private'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <pointer-type-def type-id='type-id-166' size-in-bits='64' id='type-id-167'/>
    <function-decl name='nvlist_prtctlop_int8' mangled-name='nvlist_prtctlop_int8' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_int8'>
      <parameter type-id='type-id-158' name='pctl'/>
      <parameter type-id='type-id-167' name='func'/>
      <parameter type-id='type-id-19' name='private'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <pointer-type-def type-id='type-id-168' size-in-bits='64' id='type-id-169'/>
    <function-decl name='nvlist_prtctlop_uint8' mangled-name='nvlist_prtctlop_uint8' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_uint8'>
      <parameter type-id='type-id-158' name='pctl'/>
      <parameter type-id='type-id-169' name='func'/>
      <parameter type-id='type-id-19' name='private'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <pointer-type-def type-id='type-id-170' size-in-bits='64' id='type-id-171'/>
    <function-decl name='nvlist_prtctlop_int16' mangled-name='nvlist_prtctlop_int16' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_int16'>
      <parameter type-id='type-id-158' name='pctl'/>
      <parameter type-id='type-id-171' name='func'/>
      <parameter type-id='type-id-19' name='private'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <pointer-type-def type-id='type-id-172' size-in-bits='64' id='type-id-173'/>
    <function-decl name='nvlist_prtctlop_uint16' mangled-name='nvlist_prtctlop_uint16' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_uint16'>
      <parameter type-id='type-id-158' name='pctl'/>
      <parameter type-id='type-id-173' name='func'/>
      <parameter type-id='type-id-19' name='private'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <pointer-type-def type-id='type-id-174' size-in-bits='64' id='type-id-175'/>
    <function-decl name='nvlist_prtctlop_int32' mangled-name='nvlist_prtctlop_int32' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_int32'>
      <parameter type-id='type-id-158' name='pctl'/>
      <parameter type-id='type-id-175' name='func'/>
      <parameter type-id='type-id-19' name='private'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <pointer-type-def type-id='type-id-176' size-in-bits='64' id='type-id-177'/>
    <function-decl name='nvlist_prtctlop_uint32' mangled-name='nvlist_prtctlop_uint32' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_uint32'>
      <parameter type-id='type-id-158' name='pctl'/>
      <parameter type-id='type-id-177' name='func'/>
      <parameter type-id='type-id-19' name='private'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <pointer-type-def type-id='type-id-178' size-in-bits='64' id='type-id-179'/>
    <function-decl name='nvlist_prtctlop_int64' mangled-name='nvlist_prtctlop_int64' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_int64'>
      <parameter type-id='type-id-158' name='pctl'/>
      <parameter type-id='type-id-179' name='func'/>
      <parameter type-id='type-id-19' name='private'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <pointer-type-def type-id='type-id-180' size-in-bits='64' id='type-id-181'/>
    <function-decl name='nvlist_prtctlop_uint64' mangled-name='nvlist_prtctlop_uint64' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_uint64'>
      <parameter type-id='type-id-158' name='pctl'/>
      <parameter type-id='type-id-181' name='func'/>
      <parameter type-id='type-id-19' name='private'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <pointer-type-def type-id='type-id-182' size-in-bits='64' id='type-id-183'/>
    <function-decl name='nvlist_prtctlop_double' mangled-name='nvlist_prtctlop_double' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_double'>
      <parameter type-id='type-id-158' name='pctl'/>
      <parameter type-id='type-id-183' name='func'/>
      <parameter type-id='type-id-19' name='private'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <pointer-type-def type-id='type-id-184' size-in-bits='64' id='type-id-185'/>
    <function-decl name='nvlist_prtctlop_string' mangled-name='nvlist_prtctlop_string' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_string'>
      <parameter type-id='type-id-158' name='pctl'/>
      <parameter type-id='type-id-185' name='func'/>
      <parameter type-id='type-id-19' name='private'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <pointer-type-def type-id='type-id-186' size-in-bits='64' id='type-id-187'/>
    <function-decl name='nvlist_prtctlop_hrtime' mangled-name='nvlist_prtctlop_hrtime' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_hrtime'>
      <parameter type-id='type-id-158' name='pctl'/>
      <parameter type-id='type-id-187' name='func'/>
      <parameter type-id='type-id-19' name='private'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <pointer-type-def type-id='type-id-188' size-in-bits='64' id='type-id-189'/>
    <function-decl name='nvlist_prtctlop_nvlist' mangled-name='nvlist_prtctlop_nvlist' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_nvlist'>
      <parameter type-id='type-id-158' name='pctl'/>
      <parameter type-id='type-id-189' name='func'/>
      <parameter type-id='type-id-19' name='private'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <pointer-type-def type-id='type-id-190' size-in-bits='64' id='type-id-191'/>
    <function-decl name='nvlist_prtctlop_boolean_array' mangled-name='nvlist_prtctlop_boolean_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_boolean_array'>
      <parameter type-id='type-id-158' name='pctl'/>
      <parameter type-id='type-id-191' name='func'/>
      <parameter type-id='type-id-19' name='private'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <pointer-type-def type-id='type-id-192' size-in-bits='64' id='type-id-193'/>
    <function-decl name='nvlist_prtctlop_byte_array' mangled-name='nvlist_prtctlop_byte_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_byte_array'>
      <parameter type-id='type-id-158' name='pctl'/>
      <parameter type-id='type-id-193' name='func'/>
      <parameter type-id='type-id-19' name='private'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <pointer-type-def type-id='type-id-194' size-in-bits='64' id='type-id-195'/>
    <function-decl name='nvlist_prtctlop_int8_array' mangled-name='nvlist_prtctlop_int8_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_int8_array'>
      <parameter type-id='type-id-158' name='pctl'/>
      <parameter type-id='type-id-195' name='func'/>
      <parameter type-id='type-id-19' name='private'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <pointer-type-def type-id='type-id-196' size-in-bits='64' id='type-id-197'/>
    <function-decl name='nvlist_prtctlop_uint8_array' mangled-name='nvlist_prtctlop_uint8_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_uint8_array'>
      <parameter type-id='type-id-158' name='pctl'/>
      <parameter type-id='type-id-197' name='func'/>
      <parameter type-id='type-id-19' name='private'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <pointer-type-def type-id='type-id-198' size-in-bits='64' id='type-id-199'/>
    <function-decl name='nvlist_prtctlop_int16_array' mangled-name='nvlist_prtctlop_int16_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_int16_array'>
      <parameter type-id='type-id-158' name='pctl'/>
      <parameter type-id='type-id-199' name='func'/>
      <parameter type-id='type-id-19' name='private'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <pointer-type-def type-id='type-id-200' size-in-bits='64' id='type-id-201'/>
    <function-decl name='nvlist_prtctlop_uint16_array' mangled-name='nvlist_prtctlop_uint16_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_uint16_array'>
      <parameter type-id='type-id-158' name='pctl'/>
      <parameter type-id='type-id-201' name='func'/>
      <parameter type-id='type-id-19' name='private'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <pointer-type-def type-id='type-id-202' size-in-bits='64' id='type-id-203'/>
    <function-decl name='nvlist_prtctlop_int32_array' mangled-name='nvlist_prtctlop_int32_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_int32_array'>
      <parameter type-id='type-id-158' name='pctl'/>
      <parameter type-id='type-id-203' name='func'/>
      <parameter type-id='type-id-19' name='private'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <pointer-type-def type-id='type-id-204' size-in-bits='64' id='type-id-205'/>
    <function-decl name='nvlist_prtctlop_uint32_array' mangled-name='nvlist_prtctlop_uint32_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_uint32_array'>
      <parameter type-id='type-id-158' name='pctl'/>
      <parameter type-id='type-id-205' name='func'/>
      <parameter type-id='type-id-19' name='private'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <pointer-type-def type-id='type-id-206' size-in-bits='64' id='type-id-207'/>
    <function-decl name='nvlist_prtctlop_int64_array' mangled-name='nvlist_prtctlop_int64_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_int64_array'>
      <parameter type-id='type-id-158' name='pctl'/>
      <parameter type-id='type-id-207' name='func'/>
      <parameter type-id='type-id-19' name='private'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <pointer-type-def type-id='type-id-208' size-in-bits='64' id='type-id-209'/>
    <function-decl name='nvlist_prtctlop_uint64_array' mangled-name='nvlist_prtctlop_uint64_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_uint64_array'>
      <parameter type-id='type-id-158' name='pctl'/>
      <parameter type-id='type-id-209' name='func'/>
      <parameter type-id='type-id-19' name='private'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <pointer-type-def type-id='type-id-210' size-in-bits='64' id='type-id-211'/>
    <function-decl name='nvlist_prtctlop_string_array' mangled-name='nvlist_prtctlop_string_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_string_array'>
      <parameter type-id='type-id-158' name='pctl'/>
      <parameter type-id='type-id-211' name='func'/>
      <parameter type-id='type-id-19' name='private'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <pointer-type-def type-id='type-id-212' size-in-bits='64' id='type-id-213'/>
    <function-decl name='nvlist_prtctlop_nvlist_array' mangled-name='nvlist_prtctlop_nvlist_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_nvlist_array'>
      <parameter type-id='type-id-158' name='pctl'/>
      <parameter type-id='type-id-213' name='func'/>
      <parameter type-id='type-id-19' name='private'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='nvlist_prtctl_alloc' mangled-name='nvlist_prtctl_alloc' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctl_alloc'>
      <return type-id='type-id-158'/>
    </function-decl>
    <function-decl name='nvlist_prtctl_free' mangled-name='nvlist_prtctl_free' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctl_free'>
      <parameter type-id='type-id-158' name='pctl'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='nvlist_print' mangled-name='nvlist_print' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_print'>
      <parameter type-id='type-id-3' name='fp'/>
      <parameter type-id='type-id-73' name='nvl'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <class-decl name='nvpair' size-in-bits='128' is-struct='yes' visibility='default' id='type-id-214'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nvp_size' type-id='type-id-65' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='nvp_name_sz' type-id='type-id-94' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='nvp_reserve' type-id='type-id-94' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='nvp_value_elem' type-id='type-id-65' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='nvp_type' type-id='type-id-215' visibility='default'/>
      </data-member>
    </class-decl>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' id='type-id-216'>
      <underlying-type type-id='type-id-32'/>
      <enumerator name='DATA_TYPE_DONTCARE' value='-1'/>
      <enumerator name='DATA_TYPE_UNKNOWN' value='0'/>
      <enumerator name='DATA_TYPE_BOOLEAN' value='1'/>
      <enumerator name='DATA_TYPE_BYTE' value='2'/>
      <enumerator name='DATA_TYPE_INT16' value='3'/>
      <enumerator name='DATA_TYPE_UINT16' value='4'/>
      <enumerator name='DATA_TYPE_INT32' value='5'/>
      <enumerator name='DATA_TYPE_UINT32' value='6'/>
      <enumerator name='DATA_TYPE_INT64' value='7'/>
      <enumerator name='DATA_TYPE_UINT64' value='8'/>
      <enumerator name='DATA_TYPE_STRING' value='9'/>
      <enumerator name='DATA_TYPE_BYTE_ARRAY' value='10'/>
      <enumerator name='DATA_TYPE_INT16_ARRAY' value='11'/>
      <enumerator name='DATA_TYPE_UINT16_ARRAY' value='12'/>
      <enumerator name='DATA_TYPE_INT32_ARRAY' value='13'/>
      <enumerator name='DATA_TYPE_UINT32_ARRAY' value='14'/>
      <enumerator name='DATA_TYPE_INT64_ARRAY' value='15'/>
      <enumerator name='DATA_TYPE_UINT64_ARRAY' value='16'/>
      <enumerator name='DATA_TYPE_STRING_ARRAY' value='17'/>
      <enumerator name='DATA_TYPE_HRTIME' value='18'/>
      <enumerator name='DATA_TYPE_NVLIST' value='19'/>
      <enumerator name='DATA_TYPE_NVLIST_ARRAY' value='20'/>
      <enumerator name='DATA_TYPE_BOOLEAN_VALUE' value='21'/>
      <enumerator name='DATA_TYPE_INT8' value='22'/>
      <enumerator name='DATA_TYPE_UINT8' value='23'/>
      <enumerator name='DATA_TYPE_BOOLEAN_ARRAY' value='24'/>
      <enumerator name='DATA_TYPE_INT8_ARRAY' value='25'/>
      <enumerator name='DATA_TYPE_UINT8_ARRAY' value='26'/>
      <enumerator name='DATA_TYPE_DOUBLE' value='27'/>
    </enum-decl>
    <typedef-decl name='data_type_t' type-id='type-id-216' id='type-id-215'/>
    <pointer-type-def type-id='type-id-214' size-in-bits='64' id='type-id-217'/>
    <pointer-type-def type-id='type-id-64' size-in-bits='64' id='type-id-218'/>
    <function-decl name='nvlist_next_nvpair' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-218'/>
      <parameter type-id='type-id-217'/>
      <return type-id='type-id-217'/>
    </function-decl>
    <function-decl name='nvpair_type' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-217'/>
      <return type-id='type-id-216'/>
    </function-decl>
    <function-decl name='nvpair_name' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-217'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <pointer-type-def type-id='type-id-80' size-in-bits='64' id='type-id-219'/>
    <function-decl name='nvpair_value_byte' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-217'/>
      <parameter type-id='type-id-219'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <pointer-type-def type-id='type-id-92' size-in-bits='64' id='type-id-220'/>
    <function-decl name='nvpair_value_int16' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-217'/>
      <parameter type-id='type-id-220'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <pointer-type-def type-id='type-id-13' size-in-bits='64' id='type-id-221'/>
    <function-decl name='nvpair_value_uint16' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-217'/>
      <parameter type-id='type-id-221'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <pointer-type-def type-id='type-id-5' size-in-bits='64' id='type-id-222'/>
    <function-decl name='nvpair_value_int32' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-217'/>
      <parameter type-id='type-id-222'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <pointer-type-def type-id='type-id-69' size-in-bits='64' id='type-id-223'/>
    <function-decl name='nvpair_value_uint32' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-217'/>
      <parameter type-id='type-id-223'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <pointer-type-def type-id='type-id-24' size-in-bits='64' id='type-id-224'/>
    <function-decl name='nvpair_value_int64' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-217'/>
      <parameter type-id='type-id-224'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <pointer-type-def type-id='type-id-29' size-in-bits='64' id='type-id-225'/>
    <function-decl name='nvpair_value_uint64' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-217'/>
      <parameter type-id='type-id-225'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvpair_value_string' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-217'/>
      <parameter type-id='type-id-153'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <pointer-type-def type-id='type-id-219' size-in-bits='64' id='type-id-226'/>
    <function-decl name='nvpair_value_byte_array' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-217'/>
      <parameter type-id='type-id-226'/>
      <parameter type-id='type-id-223'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <pointer-type-def type-id='type-id-220' size-in-bits='64' id='type-id-227'/>
    <function-decl name='nvpair_value_int16_array' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-217'/>
      <parameter type-id='type-id-227'/>
      <parameter type-id='type-id-223'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <pointer-type-def type-id='type-id-221' size-in-bits='64' id='type-id-228'/>
    <function-decl name='nvpair_value_uint16_array' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-217'/>
      <parameter type-id='type-id-228'/>
      <parameter type-id='type-id-223'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <pointer-type-def type-id='type-id-222' size-in-bits='64' id='type-id-229'/>
    <function-decl name='nvpair_value_int32_array' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-217'/>
      <parameter type-id='type-id-229'/>
      <parameter type-id='type-id-223'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <pointer-type-def type-id='type-id-223' size-in-bits='64' id='type-id-230'/>
    <function-decl name='nvpair_value_uint32_array' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-217'/>
      <parameter type-id='type-id-230'/>
      <parameter type-id='type-id-223'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <pointer-type-def type-id='type-id-224' size-in-bits='64' id='type-id-231'/>
    <function-decl name='nvpair_value_int64_array' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-217'/>
      <parameter type-id='type-id-231'/>
      <parameter type-id='type-id-223'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <pointer-type-def type-id='type-id-225' size-in-bits='64' id='type-id-232'/>
    <function-decl name='nvpair_value_uint64_array' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-217'/>
      <parameter type-id='type-id-232'/>
      <parameter type-id='type-id-223'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <pointer-type-def type-id='type-id-153' size-in-bits='64' id='type-id-233'/>
    <function-decl name='nvpair_value_string_array' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-217'/>
      <parameter type-id='type-id-233'/>
      <parameter type-id='type-id-223'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <pointer-type-def type-id='type-id-116' size-in-bits='64' id='type-id-234'/>
    <function-decl name='nvpair_value_hrtime' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-217'/>
      <parameter type-id='type-id-234'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <pointer-type-def type-id='type-id-218' size-in-bits='64' id='type-id-235'/>
    <function-decl name='nvpair_value_nvlist' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-217'/>
      <parameter type-id='type-id-235'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <pointer-type-def type-id='type-id-235' size-in-bits='64' id='type-id-236'/>
    <function-decl name='nvpair_value_nvlist_array' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-217'/>
      <parameter type-id='type-id-236'/>
      <parameter type-id='type-id-223'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <pointer-type-def type-id='type-id-76' size-in-bits='64' id='type-id-237'/>
    <function-decl name='nvpair_value_boolean_value' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-217'/>
      <parameter type-id='type-id-237'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <pointer-type-def type-id='type-id-14' size-in-bits='64' id='type-id-238'/>
    <function-decl name='nvpair_value_int8' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-217'/>
      <parameter type-id='type-id-238'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvpair_value_uint8' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-217'/>
      <parameter type-id='type-id-219'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <pointer-type-def type-id='type-id-237' size-in-bits='64' id='type-id-239'/>
    <function-decl name='nvpair_value_boolean_array' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-217'/>
      <parameter type-id='type-id-239'/>
      <parameter type-id='type-id-223'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <pointer-type-def type-id='type-id-238' size-in-bits='64' id='type-id-240'/>
    <function-decl name='nvpair_value_int8_array' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-217'/>
      <parameter type-id='type-id-240'/>
      <parameter type-id='type-id-223'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvpair_value_uint8_array' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-217'/>
      <parameter type-id='type-id-226'/>
      <parameter type-id='type-id-223'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <pointer-type-def type-id='type-id-111' size-in-bits='64' id='type-id-241'/>
    <function-decl name='nvpair_value_double' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-217'/>
      <parameter type-id='type-id-241'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvlist_prt' mangled-name='nvlist_prt' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prt'>
      <parameter type-id='type-id-73' name='nvl'/>
      <parameter type-id='type-id-158' name='pctl'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='dump_nvlist' mangled-name='dump_nvlist' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dump_nvlist'>
      <parameter type-id='type-id-73' name='list'/>
      <parameter type-id='type-id-5' name='indent'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='dcgettext' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <typedef-decl name='nvpair_t' type-id='type-id-214' id='type-id-242'/>
    <pointer-type-def type-id='type-id-242' size-in-bits='64' id='type-id-243'/>
    <class-decl name='re_pattern_buffer' size-in-bits='512' is-struct='yes' visibility='default' id='type-id-244'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='buffer' type-id='type-id-245' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='allocated' type-id='type-id-246' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='used' type-id='type-id-246' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='syntax' type-id='type-id-247' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='fastmap' type-id='type-id-9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='translate' type-id='type-id-219' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='re_nsub' type-id='type-id-20' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31'>
        <var-decl name='can_be_null' type-id='type-id-69' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='29'>
        <var-decl name='regs_allocated' type-id='type-id-69' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='28'>
        <var-decl name='fastmap_accurate' type-id='type-id-69' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='27'>
        <var-decl name='no_sub' type-id='type-id-69' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='26'>
        <var-decl name='not_bol' type-id='type-id-69' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='25'>
        <var-decl name='not_eol' type-id='type-id-69' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='newline_anchor' type-id='type-id-69' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='re_dfa_t' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-248'/>
    <pointer-type-def type-id='type-id-248' size-in-bits='64' id='type-id-245'/>
    <typedef-decl name='__re_long_size_t' type-id='type-id-29' id='type-id-246'/>
    <typedef-decl name='reg_syntax_t' type-id='type-id-29' id='type-id-247'/>
    <typedef-decl name='regex_t' type-id='type-id-244' id='type-id-249'/>
    <pointer-type-def type-id='type-id-249' size-in-bits='64' id='type-id-250'/>
    <function-decl name='nvpair_value_match_regex' mangled-name='nvpair_value_match_regex' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_match_regex'>
      <parameter type-id='type-id-243' name='nvp'/>
      <parameter type-id='type-id-5' name='ai'/>
      <parameter type-id='type-id-9' name='value'/>
      <parameter type-id='type-id-250' name='value_regex'/>
      <parameter type-id='type-id-153' name='ep'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvpair_type_is_array' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-217'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <qualified-type-def type-id='type-id-244' const='yes' id='type-id-251'/>
    <pointer-type-def type-id='type-id-251' size-in-bits='64' id='type-id-252'/>
    <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-253'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='rm_so' type-id='type-id-254' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='rm_eo' type-id='type-id-254' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='regoff_t' type-id='type-id-5' id='type-id-254'/>
    <pointer-type-def type-id='type-id-253' size-in-bits='64' id='type-id-255'/>
    <function-decl name='regexec' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-252'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-29'/>
      <parameter type-id='type-id-255'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvpair_value_match' mangled-name='nvpair_value_match' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_match'>
      <parameter type-id='type-id-243' name='nvp'/>
      <parameter type-id='type-id-5' name='ai'/>
      <parameter type-id='type-id-9' name='value'/>
      <parameter type-id='type-id-153' name='ep'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-124'>
      <parameter type-id='type-id-63'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-73'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-122'/>
      <parameter type-id='type-id-123'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-114'>
      <parameter type-id='type-id-63'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-73'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-154'>
      <parameter type-id='type-id-63'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-73'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-153'/>
      <parameter type-id='type-id-123'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-112'>
      <parameter type-id='type-id-63'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-73'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-111'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-74'>
      <parameter type-id='type-id-63'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-73'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-136'>
      <parameter type-id='type-id-63'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-73'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-135'/>
      <parameter type-id='type-id-123'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-142'>
      <parameter type-id='type-id-63'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-73'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-141'/>
      <parameter type-id='type-id-123'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-148'>
      <parameter type-id='type-id-63'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-73'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-147'/>
      <parameter type-id='type-id-123'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-130'>
      <parameter type-id='type-id-63'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-73'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-129'/>
      <parameter type-id='type-id-123'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-120'>
      <parameter type-id='type-id-63'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-73'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-73'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-157'>
      <parameter type-id='type-id-63'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-73'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-156'/>
      <parameter type-id='type-id-123'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-78'>
      <parameter type-id='type-id-63'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-73'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-77'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-118'>
      <parameter type-id='type-id-63'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-73'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-117'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-95'>
      <parameter type-id='type-id-63'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-73'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-94'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-101'>
      <parameter type-id='type-id-63'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-73'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-65'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-107'>
      <parameter type-id='type-id-63'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-73'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-106'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-86'>
      <parameter type-id='type-id-63'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-73'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-85'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-82'>
      <parameter type-id='type-id-63'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-73'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-81'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-99'>
      <parameter type-id='type-id-63'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-73'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-98'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-103'>
      <parameter type-id='type-id-63'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-73'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-66'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-109'>
      <parameter type-id='type-id-63'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-73'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-67'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-90'>
      <parameter type-id='type-id-63'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-73'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-89'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-127'>
      <parameter type-id='type-id-63'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-73'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-123'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-139'>
      <parameter type-id='type-id-63'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-73'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-138'/>
      <parameter type-id='type-id-123'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-145'>
      <parameter type-id='type-id-63'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-73'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-144'/>
      <parameter type-id='type-id-123'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-151'>
      <parameter type-id='type-id-63'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-73'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-150'/>
      <parameter type-id='type-id-123'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-133'>
      <parameter type-id='type-id-63'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-73'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-132'/>
      <parameter type-id='type-id-123'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-190'>
      <parameter type-id='type-id-158'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-73'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-122'/>
      <parameter type-id='type-id-123'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-184'>
      <parameter type-id='type-id-158'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-73'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-210'>
      <parameter type-id='type-id-158'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-73'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-153'/>
      <parameter type-id='type-id-123'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-182'>
      <parameter type-id='type-id-158'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-73'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-111'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-160'>
      <parameter type-id='type-id-158'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-73'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-198'>
      <parameter type-id='type-id-158'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-73'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-135'/>
      <parameter type-id='type-id-123'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-202'>
      <parameter type-id='type-id-158'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-73'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-141'/>
      <parameter type-id='type-id-123'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-206'>
      <parameter type-id='type-id-158'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-73'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-147'/>
      <parameter type-id='type-id-123'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-194'>
      <parameter type-id='type-id-158'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-73'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-129'/>
      <parameter type-id='type-id-123'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-188'>
      <parameter type-id='type-id-158'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-73'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-73'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-212'>
      <parameter type-id='type-id-158'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-73'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-156'/>
      <parameter type-id='type-id-123'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-162'>
      <parameter type-id='type-id-158'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-73'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-77'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-186'>
      <parameter type-id='type-id-158'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-73'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-117'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-170'>
      <parameter type-id='type-id-158'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-73'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-94'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-174'>
      <parameter type-id='type-id-158'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-73'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-65'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-178'>
      <parameter type-id='type-id-158'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-73'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-106'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-166'>
      <parameter type-id='type-id-158'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-73'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-85'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-164'>
      <parameter type-id='type-id-158'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-73'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-81'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-172'>
      <parameter type-id='type-id-158'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-73'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-98'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-176'>
      <parameter type-id='type-id-158'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-73'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-66'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-180'>
      <parameter type-id='type-id-158'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-73'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-67'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-168'>
      <parameter type-id='type-id-158'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-73'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-89'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-192'>
      <parameter type-id='type-id-158'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-73'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-123'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-200'>
      <parameter type-id='type-id-158'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-73'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-138'/>
      <parameter type-id='type-id-123'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-204'>
      <parameter type-id='type-id-158'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-73'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-144'/>
      <parameter type-id='type-id-123'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-208'>
      <parameter type-id='type-id-158'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-73'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-150'/>
      <parameter type-id='type-id-123'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-196'>
      <parameter type-id='type-id-158'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-73'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-132'/>
      <parameter type-id='type-id-123'/>
      <return type-id='type-id-5'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='libnvpair_json.c' comp-dir-path='/home/nabijaczleweli/store/code/zfs/lib/libnvpair' language='LANG_C99'>
    <function-decl name='nvlist_print_json' mangled-name='nvlist_print_json' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_print_json'>
      <parameter type-id='type-id-3' name='fp'/>
      <parameter type-id='type-id-73' name='nvl'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='fnvpair_value_byte' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-217'/>
      <return type-id='type-id-80'/>
    </function-decl>
    <function-decl name='fnvpair_value_int16' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-217'/>
      <return type-id='type-id-92'/>
    </function-decl>
    <function-decl name='fnvpair_value_uint16' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-217'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='fnvpair_value_int32' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-217'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='fnvpair_value_uint32' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-217'/>
      <return type-id='type-id-69'/>
    </function-decl>
    <function-decl name='fnvpair_value_int64' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-217'/>
      <return type-id='type-id-24'/>
    </function-decl>
    <function-decl name='fnvpair_value_uint64' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-217'/>
      <return type-id='type-id-29'/>
    </function-decl>
    <function-decl name='fnvpair_value_string' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-217'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='libspl_assertf' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-6'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='fnvpair_value_nvlist' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-217'/>
      <return type-id='type-id-218'/>
    </function-decl>
    <function-decl name='fnvpair_value_boolean_value' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-217'/>
      <return type-id='type-id-76'/>
    </function-decl>
    <function-decl name='fnvpair_value_int8' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-217'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='fnvpair_value_uint8' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-217'/>
      <return type-id='type-id-80'/>
    </function-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-256'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__count' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='__value' type-id='type-id-257' visibility='default'/>
      </data-member>
    </class-decl>
    <union-decl name='__anonymous_union__' size-in-bits='32' is-anonymous='yes' visibility='default' id='type-id-257'>
      <data-member access='private'>
        <var-decl name='__wch' type-id='type-id-69' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='__wchb' type-id='type-id-258' visibility='default'/>
      </data-member>
    </union-decl>

    <array-type-def dimensions='1' type-id='type-id-22' size-in-bits='32' id='type-id-258'>
      <subrange length='4' type-id='type-id-25' id='type-id-259'/>

    </array-type-def>
    <pointer-type-def type-id='type-id-256' size-in-bits='64' id='type-id-260'/>
    <function-decl name='mbrtowc' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-222'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-29'/>
      <parameter type-id='type-id-260'/>
      <return type-id='type-id-29'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='nvpair_alloc_system.c' comp-dir-path='/home/nabijaczleweli/store/code/zfs/lib/libnvpair' language='LANG_C99'>
    <class-decl name='nv_alloc' size-in-bits='128' is-struct='yes' visibility='default' id='type-id-261'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nva_ops' type-id='type-id-262' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='nva_arg' type-id='type-id-19' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='nv_alloc_ops' size-in-bits='320' is-struct='yes' visibility='default' id='type-id-263'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nv_ao_init' type-id='type-id-264' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='nv_ao_fini' type-id='type-id-265' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='nv_ao_alloc' type-id='type-id-266' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='nv_ao_free' type-id='type-id-267' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='nv_ao_reset' type-id='type-id-265' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='nv_alloc_t' type-id='type-id-261' id='type-id-268'/>
    <pointer-type-def type-id='type-id-268' size-in-bits='64' id='type-id-269'/>
    <class-decl name='__va_list_tag' size-in-bits='192' is-struct='yes' visibility='default' id='type-id-270'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='gp_offset' type-id='type-id-69' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='fp_offset' type-id='type-id-69' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='overflow_arg_area' type-id='type-id-19' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='reg_save_area' type-id='type-id-19' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-270' size-in-bits='64' id='type-id-271'/>
    <pointer-type-def type-id='type-id-272' size-in-bits='64' id='type-id-264'/>
    <pointer-type-def type-id='type-id-273' size-in-bits='64' id='type-id-265'/>
    <pointer-type-def type-id='type-id-274' size-in-bits='64' id='type-id-266'/>
    <pointer-type-def type-id='type-id-275' size-in-bits='64' id='type-id-267'/>
    <typedef-decl name='nv_alloc_ops_t' type-id='type-id-263' id='type-id-276'/>
    <qualified-type-def type-id='type-id-276' const='yes' id='type-id-277'/>
    <pointer-type-def type-id='type-id-277' size-in-bits='64' id='type-id-262'/>
    <var-decl name='nv_alloc_nosleep' type-id='type-id-269' mangled-name='nv_alloc_nosleep' visibility='default' elf-symbol-id='nv_alloc_nosleep'/>
    <function-type size-in-bits='64' id='type-id-272'>
      <parameter type-id='type-id-269'/>
      <parameter type-id='type-id-271'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-273'>
      <parameter type-id='type-id-269'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-275'>
      <parameter type-id='type-id-269'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-20'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-274'>
      <parameter type-id='type-id-269'/>
      <parameter type-id='type-id-20'/>
      <return type-id='type-id-19'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../../module/nvpair/nvpair_alloc_fixed.c' comp-dir-path='/home/nabijaczleweli/store/code/zfs/lib/libnvpair' language='LANG_C99'>
    <var-decl name='nv_fixed_ops' type-id='type-id-262' mangled-name='nv_fixed_ops' visibility='default' elf-symbol-id='nv_fixed_ops'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../../module/nvpair/nvpair.c' comp-dir-path='/home/nabijaczleweli/store/code/zfs/lib/libnvpair' language='LANG_C99'>
    <function-decl name='nv_alloc_init' mangled-name='nv_alloc_init' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nv_alloc_init'>
      <parameter type-id='type-id-269' name='nva'/>
      <parameter type-id='type-id-262' name='nvo'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nv_alloc_reset' mangled-name='nv_alloc_reset' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nv_alloc_reset'>
      <parameter type-id='type-id-269' name='nva'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='nv_alloc_fini' mangled-name='nv_alloc_fini' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nv_alloc_fini'>
      <parameter type-id='type-id-269' name='nva'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='nvlist_lookup_nv_alloc' mangled-name='nvlist_lookup_nv_alloc' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_nv_alloc'>
      <parameter type-id='type-id-73' name='nvl'/>
      <return type-id='type-id-269'/>
    </function-decl>
    <function-decl name='nvlist_nvflag' mangled-name='nvlist_nvflag' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_nvflag'>
      <parameter type-id='type-id-73' name='nvl'/>
      <return type-id='type-id-123'/>
    </function-decl>
    <function-decl name='nvlist_alloc' mangled-name='nvlist_alloc' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_alloc'>
      <parameter type-id='type-id-156' name='nvlp'/>
      <parameter type-id='type-id-123' name='nvflag'/>
      <parameter type-id='type-id-5' name='kmflag'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvlist_xalloc' mangled-name='nvlist_xalloc' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_xalloc'>
      <parameter type-id='type-id-156' name='nvlp'/>
      <parameter type-id='type-id-123' name='nvflag'/>
      <parameter type-id='type-id-269' name='nva'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvlist_free' mangled-name='nvlist_free' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_free'>
      <parameter type-id='type-id-73' name='nvl'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='nvlist_dup' mangled-name='nvlist_dup' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_dup'>
      <parameter type-id='type-id-73' name='nvl'/>
      <parameter type-id='type-id-156' name='nvlp'/>
      <parameter type-id='type-id-5' name='kmflag'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvlist_xdup' mangled-name='nvlist_xdup' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_xdup'>
      <parameter type-id='type-id-73' name='nvl'/>
      <parameter type-id='type-id-156' name='nvlp'/>
      <parameter type-id='type-id-269' name='nva'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvlist_remove_all' mangled-name='nvlist_remove_all' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_remove_all'>
      <parameter type-id='type-id-73' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvlist_remove_nvpair' mangled-name='nvlist_remove_nvpair' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_remove_nvpair'>
      <parameter type-id='type-id-73' name='nvl'/>
      <parameter type-id='type-id-243' name='nvp'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvlist_remove' mangled-name='nvlist_remove' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_remove'>
      <parameter type-id='type-id-73' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-215' name='type'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvlist_add_boolean' mangled-name='nvlist_add_boolean' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_boolean'>
      <parameter type-id='type-id-73' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvlist_add_boolean_value' mangled-name='nvlist_add_boolean_value' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_boolean_value'>
      <parameter type-id='type-id-73' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-77' name='val'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvlist_add_byte' mangled-name='nvlist_add_byte' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_byte'>
      <parameter type-id='type-id-73' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-81' name='val'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvlist_add_int8' mangled-name='nvlist_add_int8' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_int8'>
      <parameter type-id='type-id-73' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-85' name='val'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvlist_add_uint8' mangled-name='nvlist_add_uint8' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_uint8'>
      <parameter type-id='type-id-73' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-89' name='val'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvlist_add_int16' mangled-name='nvlist_add_int16' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_int16'>
      <parameter type-id='type-id-73' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-94' name='val'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvlist_add_uint16' mangled-name='nvlist_add_uint16' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_uint16'>
      <parameter type-id='type-id-73' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-98' name='val'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvlist_add_int32' mangled-name='nvlist_add_int32' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_int32'>
      <parameter type-id='type-id-73' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-65' name='val'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvlist_add_uint32' mangled-name='nvlist_add_uint32' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_uint32'>
      <parameter type-id='type-id-73' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-66' name='val'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvlist_add_int64' mangled-name='nvlist_add_int64' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_int64'>
      <parameter type-id='type-id-73' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-106' name='val'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvlist_add_uint64' mangled-name='nvlist_add_uint64' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_uint64'>
      <parameter type-id='type-id-73' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-67' name='val'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvlist_add_double' mangled-name='nvlist_add_double' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_double'>
      <parameter type-id='type-id-73' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-111' name='val'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvlist_add_string' mangled-name='nvlist_add_string' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_string'>
      <parameter type-id='type-id-73' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-6' name='val'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvlist_add_boolean_array' mangled-name='nvlist_add_boolean_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_boolean_array'>
      <parameter type-id='type-id-73' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-122' name='a'/>
      <parameter type-id='type-id-123' name='n'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvlist_add_byte_array' mangled-name='nvlist_add_byte_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_byte_array'>
      <parameter type-id='type-id-73' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-126' name='a'/>
      <parameter type-id='type-id-123' name='n'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvlist_add_int8_array' mangled-name='nvlist_add_int8_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_int8_array'>
      <parameter type-id='type-id-73' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-129' name='a'/>
      <parameter type-id='type-id-123' name='n'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvlist_add_uint8_array' mangled-name='nvlist_add_uint8_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_uint8_array'>
      <parameter type-id='type-id-73' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-132' name='a'/>
      <parameter type-id='type-id-123' name='n'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvlist_add_int16_array' mangled-name='nvlist_add_int16_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_int16_array'>
      <parameter type-id='type-id-73' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-135' name='a'/>
      <parameter type-id='type-id-123' name='n'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvlist_add_uint16_array' mangled-name='nvlist_add_uint16_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_uint16_array'>
      <parameter type-id='type-id-73' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-138' name='a'/>
      <parameter type-id='type-id-123' name='n'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvlist_add_int32_array' mangled-name='nvlist_add_int32_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_int32_array'>
      <parameter type-id='type-id-73' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-141' name='a'/>
      <parameter type-id='type-id-123' name='n'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvlist_add_uint32_array' mangled-name='nvlist_add_uint32_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_uint32_array'>
      <parameter type-id='type-id-73' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-144' name='a'/>
      <parameter type-id='type-id-123' name='n'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvlist_add_int64_array' mangled-name='nvlist_add_int64_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_int64_array'>
      <parameter type-id='type-id-73' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-147' name='a'/>
      <parameter type-id='type-id-123' name='n'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvlist_add_uint64_array' mangled-name='nvlist_add_uint64_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_uint64_array'>
      <parameter type-id='type-id-73' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-150' name='a'/>
      <parameter type-id='type-id-123' name='n'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <qualified-type-def type-id='type-id-9' const='yes' id='type-id-278'/>
    <pointer-type-def type-id='type-id-278' size-in-bits='64' id='type-id-279'/>
    <function-decl name='nvlist_add_string_array' mangled-name='nvlist_add_string_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_string_array'>
      <parameter type-id='type-id-73' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-279' name='a'/>
      <parameter type-id='type-id-123' name='n'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvlist_add_hrtime' mangled-name='nvlist_add_hrtime' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_hrtime'>
      <parameter type-id='type-id-73' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-117' name='val'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvlist_add_nvlist' mangled-name='nvlist_add_nvlist' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_nvlist'>
      <parameter type-id='type-id-73' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-73' name='val'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvlist_add_nvlist_array' mangled-name='nvlist_add_nvlist_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_nvlist_array'>
      <parameter type-id='type-id-73' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-156' name='a'/>
      <parameter type-id='type-id-123' name='n'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvlist_next_nvpair' mangled-name='nvlist_next_nvpair' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_next_nvpair'>
      <parameter type-id='type-id-73' name='nvl'/>
      <parameter type-id='type-id-243' name='nvp'/>
      <return type-id='type-id-243'/>
    </function-decl>
    <function-decl name='nvlist_prev_nvpair' mangled-name='nvlist_prev_nvpair' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prev_nvpair'>
      <parameter type-id='type-id-73' name='nvl'/>
      <parameter type-id='type-id-243' name='nvp'/>
      <return type-id='type-id-243'/>
    </function-decl>
    <function-decl name='nvlist_empty' mangled-name='nvlist_empty' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_empty'>
      <parameter type-id='type-id-73' name='nvl'/>
      <return type-id='type-id-77'/>
    </function-decl>
    <function-decl name='nvpair_name' mangled-name='nvpair_name' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_name'>
      <parameter type-id='type-id-243' name='nvp'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='nvpair_type' mangled-name='nvpair_type' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_type'>
      <parameter type-id='type-id-243' name='nvp'/>
      <return type-id='type-id-215'/>
    </function-decl>
    <function-decl name='nvpair_type_is_array' mangled-name='nvpair_type_is_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_type_is_array'>
      <parameter type-id='type-id-243' name='nvp'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvlist_lookup_boolean' mangled-name='nvlist_lookup_boolean' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_boolean'>
      <parameter type-id='type-id-73' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvlist_lookup_boolean_value' mangled-name='nvlist_lookup_boolean_value' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_boolean_value'>
      <parameter type-id='type-id-73' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-122' name='val'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvlist_lookup_byte' mangled-name='nvlist_lookup_byte' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_byte'>
      <parameter type-id='type-id-73' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-126' name='val'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvlist_lookup_int8' mangled-name='nvlist_lookup_int8' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_int8'>
      <parameter type-id='type-id-73' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-129' name='val'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvlist_lookup_uint8' mangled-name='nvlist_lookup_uint8' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_uint8'>
      <parameter type-id='type-id-73' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-132' name='val'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvlist_lookup_int16' mangled-name='nvlist_lookup_int16' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_int16'>
      <parameter type-id='type-id-73' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-135' name='val'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvlist_lookup_uint16' mangled-name='nvlist_lookup_uint16' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_uint16'>
      <parameter type-id='type-id-73' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-138' name='val'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvlist_lookup_int32' mangled-name='nvlist_lookup_int32' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_int32'>
      <parameter type-id='type-id-73' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-141' name='val'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvlist_lookup_uint32' mangled-name='nvlist_lookup_uint32' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_uint32'>
      <parameter type-id='type-id-73' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-144' name='val'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvlist_lookup_int64' mangled-name='nvlist_lookup_int64' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_int64'>
      <parameter type-id='type-id-73' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-147' name='val'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvlist_lookup_uint64' mangled-name='nvlist_lookup_uint64' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_uint64'>
      <parameter type-id='type-id-73' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-150' name='val'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvlist_lookup_double' mangled-name='nvlist_lookup_double' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_double'>
      <parameter type-id='type-id-73' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-241' name='val'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvlist_lookup_string' mangled-name='nvlist_lookup_string' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_string'>
      <parameter type-id='type-id-73' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-153' name='val'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvlist_lookup_nvlist' mangled-name='nvlist_lookup_nvlist' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_nvlist'>
      <parameter type-id='type-id-73' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-156' name='val'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <pointer-type-def type-id='type-id-122' size-in-bits='64' id='type-id-280'/>
    <pointer-type-def type-id='type-id-123' size-in-bits='64' id='type-id-281'/>
    <function-decl name='nvlist_lookup_boolean_array' mangled-name='nvlist_lookup_boolean_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_boolean_array'>
      <parameter type-id='type-id-73' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-280' name='a'/>
      <parameter type-id='type-id-281' name='n'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <pointer-type-def type-id='type-id-126' size-in-bits='64' id='type-id-282'/>
    <function-decl name='nvlist_lookup_byte_array' mangled-name='nvlist_lookup_byte_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_byte_array'>
      <parameter type-id='type-id-73' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-282' name='a'/>
      <parameter type-id='type-id-281' name='n'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <pointer-type-def type-id='type-id-129' size-in-bits='64' id='type-id-283'/>
    <function-decl name='nvlist_lookup_int8_array' mangled-name='nvlist_lookup_int8_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_int8_array'>
      <parameter type-id='type-id-73' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-283' name='a'/>
      <parameter type-id='type-id-281' name='n'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <pointer-type-def type-id='type-id-132' size-in-bits='64' id='type-id-284'/>
    <function-decl name='nvlist_lookup_uint8_array' mangled-name='nvlist_lookup_uint8_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_uint8_array'>
      <parameter type-id='type-id-73' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-284' name='a'/>
      <parameter type-id='type-id-281' name='n'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <pointer-type-def type-id='type-id-135' size-in-bits='64' id='type-id-285'/>
    <function-decl name='nvlist_lookup_int16_array' mangled-name='nvlist_lookup_int16_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_int16_array'>
      <parameter type-id='type-id-73' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-285' name='a'/>
      <parameter type-id='type-id-281' name='n'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <pointer-type-def type-id='type-id-138' size-in-bits='64' id='type-id-286'/>
    <function-decl name='nvlist_lookup_uint16_array' mangled-name='nvlist_lookup_uint16_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_uint16_array'>
      <parameter type-id='type-id-73' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-286' name='a'/>
      <parameter type-id='type-id-281' name='n'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <pointer-type-def type-id='type-id-141' size-in-bits='64' id='type-id-287'/>
    <function-decl name='nvlist_lookup_int32_array' mangled-name='nvlist_lookup_int32_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_int32_array'>
      <parameter type-id='type-id-73' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-287' name='a'/>
      <parameter type-id='type-id-281' name='n'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <pointer-type-def type-id='type-id-144' size-in-bits='64' id='type-id-288'/>
    <function-decl name='nvlist_lookup_uint32_array' mangled-name='nvlist_lookup_uint32_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_uint32_array'>
      <parameter type-id='type-id-73' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-288' name='a'/>
      <parameter type-id='type-id-281' name='n'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <pointer-type-def type-id='type-id-147' size-in-bits='64' id='type-id-289'/>
    <function-decl name='nvlist_lookup_int64_array' mangled-name='nvlist_lookup_int64_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_int64_array'>
      <parameter type-id='type-id-73' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-289' name='a'/>
      <parameter type-id='type-id-281' name='n'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <pointer-type-def type-id='type-id-150' size-in-bits='64' id='type-id-290'/>
    <function-decl name='nvlist_lookup_uint64_array' mangled-name='nvlist_lookup_uint64_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_uint64_array'>
      <parameter type-id='type-id-73' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-290' name='a'/>
      <parameter type-id='type-id-281' name='n'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvlist_lookup_string_array' mangled-name='nvlist_lookup_string_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_string_array'>
      <parameter type-id='type-id-73' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-233' name='a'/>
      <parameter type-id='type-id-281' name='n'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <pointer-type-def type-id='type-id-156' size-in-bits='64' id='type-id-291'/>
    <function-decl name='nvlist_lookup_nvlist_array' mangled-name='nvlist_lookup_nvlist_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_nvlist_array'>
      <parameter type-id='type-id-73' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-291' name='a'/>
      <parameter type-id='type-id-281' name='n'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <pointer-type-def type-id='type-id-117' size-in-bits='64' id='type-id-292'/>
    <function-decl name='nvlist_lookup_hrtime' mangled-name='nvlist_lookup_hrtime' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_hrtime'>
      <parameter type-id='type-id-73' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-292' name='val'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvlist_lookup_pairs' mangled-name='nvlist_lookup_pairs' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_pairs'>
      <parameter type-id='type-id-73' name='nvl'/>
      <parameter type-id='type-id-5' name='flag'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <pointer-type-def type-id='type-id-243' size-in-bits='64' id='type-id-293'/>
    <function-decl name='nvlist_lookup_nvpair' mangled-name='nvlist_lookup_nvpair' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_nvpair'>
      <parameter type-id='type-id-73' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-293' name='ret'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvlist_lookup_nvpair_embedded_index' mangled-name='nvlist_lookup_nvpair_embedded_index' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_nvpair_embedded_index'>
      <parameter type-id='type-id-73' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <parameter type-id='type-id-293' name='ret'/>
      <parameter type-id='type-id-222' name='ip'/>
      <parameter type-id='type-id-153' name='ep'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvlist_exists' mangled-name='nvlist_exists' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_exists'>
      <parameter type-id='type-id-73' name='nvl'/>
      <parameter type-id='type-id-6' name='name'/>
      <return type-id='type-id-77'/>
    </function-decl>
    <function-decl name='nvpair_value_boolean_value' mangled-name='nvpair_value_boolean_value' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_boolean_value'>
      <parameter type-id='type-id-243' name='nvp'/>
      <parameter type-id='type-id-122' name='val'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvpair_value_byte' mangled-name='nvpair_value_byte' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_byte'>
      <parameter type-id='type-id-243' name='nvp'/>
      <parameter type-id='type-id-126' name='val'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvpair_value_int8' mangled-name='nvpair_value_int8' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_int8'>
      <parameter type-id='type-id-243' name='nvp'/>
      <parameter type-id='type-id-129' name='val'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvpair_value_uint8' mangled-name='nvpair_value_uint8' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_uint8'>
      <parameter type-id='type-id-243' name='nvp'/>
      <parameter type-id='type-id-132' name='val'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvpair_value_int16' mangled-name='nvpair_value_int16' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_int16'>
      <parameter type-id='type-id-243' name='nvp'/>
      <parameter type-id='type-id-135' name='val'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvpair_value_uint16' mangled-name='nvpair_value_uint16' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_uint16'>
      <parameter type-id='type-id-243' name='nvp'/>
      <parameter type-id='type-id-138' name='val'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvpair_value_int32' mangled-name='nvpair_value_int32' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_int32'>
      <parameter type-id='type-id-243' name='nvp'/>
      <parameter type-id='type-id-141' name='val'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvpair_value_uint32' mangled-name='nvpair_value_uint32' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_uint32'>
      <parameter type-id='type-id-243' name='nvp'/>
      <parameter type-id='type-id-144' name='val'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvpair_value_int64' mangled-name='nvpair_value_int64' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_int64'>
      <parameter type-id='type-id-243' name='nvp'/>
      <parameter type-id='type-id-147' name='val'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvpair_value_uint64' mangled-name='nvpair_value_uint64' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_uint64'>
      <parameter type-id='type-id-243' name='nvp'/>
      <parameter type-id='type-id-150' name='val'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvpair_value_double' mangled-name='nvpair_value_double' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_double'>
      <parameter type-id='type-id-243' name='nvp'/>
      <parameter type-id='type-id-241' name='val'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvpair_value_string' mangled-name='nvpair_value_string' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_string'>
      <parameter type-id='type-id-243' name='nvp'/>
      <parameter type-id='type-id-153' name='val'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvpair_value_nvlist' mangled-name='nvpair_value_nvlist' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_nvlist'>
      <parameter type-id='type-id-243' name='nvp'/>
      <parameter type-id='type-id-156' name='val'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvpair_value_boolean_array' mangled-name='nvpair_value_boolean_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_boolean_array'>
      <parameter type-id='type-id-243' name='nvp'/>
      <parameter type-id='type-id-280' name='val'/>
      <parameter type-id='type-id-281' name='nelem'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvpair_value_byte_array' mangled-name='nvpair_value_byte_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_byte_array'>
      <parameter type-id='type-id-243' name='nvp'/>
      <parameter type-id='type-id-282' name='val'/>
      <parameter type-id='type-id-281' name='nelem'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvpair_value_int8_array' mangled-name='nvpair_value_int8_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_int8_array'>
      <parameter type-id='type-id-243' name='nvp'/>
      <parameter type-id='type-id-283' name='val'/>
      <parameter type-id='type-id-281' name='nelem'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvpair_value_uint8_array' mangled-name='nvpair_value_uint8_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_uint8_array'>
      <parameter type-id='type-id-243' name='nvp'/>
      <parameter type-id='type-id-284' name='val'/>
      <parameter type-id='type-id-281' name='nelem'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvpair_value_int16_array' mangled-name='nvpair_value_int16_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_int16_array'>
      <parameter type-id='type-id-243' name='nvp'/>
      <parameter type-id='type-id-285' name='val'/>
      <parameter type-id='type-id-281' name='nelem'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvpair_value_uint16_array' mangled-name='nvpair_value_uint16_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_uint16_array'>
      <parameter type-id='type-id-243' name='nvp'/>
      <parameter type-id='type-id-286' name='val'/>
      <parameter type-id='type-id-281' name='nelem'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvpair_value_int32_array' mangled-name='nvpair_value_int32_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_int32_array'>
      <parameter type-id='type-id-243' name='nvp'/>
      <parameter type-id='type-id-287' name='val'/>
      <parameter type-id='type-id-281' name='nelem'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvpair_value_uint32_array' mangled-name='nvpair_value_uint32_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_uint32_array'>
      <parameter type-id='type-id-243' name='nvp'/>
      <parameter type-id='type-id-288' name='val'/>
      <parameter type-id='type-id-281' name='nelem'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvpair_value_int64_array' mangled-name='nvpair_value_int64_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_int64_array'>
      <parameter type-id='type-id-243' name='nvp'/>
      <parameter type-id='type-id-289' name='val'/>
      <parameter type-id='type-id-281' name='nelem'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvpair_value_uint64_array' mangled-name='nvpair_value_uint64_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_uint64_array'>
      <parameter type-id='type-id-243' name='nvp'/>
      <parameter type-id='type-id-290' name='val'/>
      <parameter type-id='type-id-281' name='nelem'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvpair_value_string_array' mangled-name='nvpair_value_string_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_string_array'>
      <parameter type-id='type-id-243' name='nvp'/>
      <parameter type-id='type-id-233' name='val'/>
      <parameter type-id='type-id-281' name='nelem'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvpair_value_nvlist_array' mangled-name='nvpair_value_nvlist_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_nvlist_array'>
      <parameter type-id='type-id-243' name='nvp'/>
      <parameter type-id='type-id-291' name='val'/>
      <parameter type-id='type-id-281' name='nelem'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvpair_value_hrtime' mangled-name='nvpair_value_hrtime' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_hrtime'>
      <parameter type-id='type-id-243' name='nvp'/>
      <parameter type-id='type-id-292' name='val'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvlist_add_nvpair' mangled-name='nvlist_add_nvpair' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_nvpair'>
      <parameter type-id='type-id-73' name='nvl'/>
      <parameter type-id='type-id-243' name='nvp'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvlist_merge' mangled-name='nvlist_merge' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_merge'>
      <parameter type-id='type-id-73' name='dst'/>
      <parameter type-id='type-id-73' name='nvl'/>
      <parameter type-id='type-id-5' name='flag'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <pointer-type-def type-id='type-id-20' size-in-bits='64' id='type-id-294'/>
    <function-decl name='nvlist_size' mangled-name='nvlist_size' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_size'>
      <parameter type-id='type-id-73' name='nvl'/>
      <parameter type-id='type-id-294' name='size'/>
      <parameter type-id='type-id-5' name='encoding'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <class-decl name='XDR' size-in-bits='384' is-struct='yes' visibility='default' id='type-id-295'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='x_op' type-id='type-id-296' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='x_ops' type-id='type-id-297' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='x_public' type-id='type-id-298' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='x_private' type-id='type-id-298' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='x_base' type-id='type-id-298' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='x_handy' type-id='type-id-299' visibility='default'/>
      </data-member>
    </class-decl>
    <enum-decl name='xdr_op' id='type-id-296'>
      <underlying-type type-id='type-id-32'/>
      <enumerator name='XDR_ENCODE' value='0'/>
      <enumerator name='XDR_DECODE' value='1'/>
      <enumerator name='XDR_FREE' value='2'/>
    </enum-decl>
    <class-decl name='xdr_ops' size-in-bits='640' is-struct='yes' visibility='default' id='type-id-300'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='x_getlong' type-id='type-id-301' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='x_putlong' type-id='type-id-302' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='x_getbytes' type-id='type-id-303' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='x_putbytes' type-id='type-id-304' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='x_getpostn' type-id='type-id-305' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='x_setpostn' type-id='type-id-306' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='x_inline' type-id='type-id-307' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='x_destroy' type-id='type-id-308' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='x_getint32' type-id='type-id-309' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='x_putint32' type-id='type-id-310' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='bool_t' type-id='type-id-5' id='type-id-311'/>
    <typedef-decl name='XDR' type-id='type-id-295' id='type-id-312'/>
    <pointer-type-def type-id='type-id-312' size-in-bits='64' id='type-id-313'/>
    <pointer-type-def type-id='type-id-314' size-in-bits='64' id='type-id-301'/>
    <qualified-type-def type-id='type-id-24' const='yes' id='type-id-315'/>
    <pointer-type-def type-id='type-id-315' size-in-bits='64' id='type-id-316'/>
    <pointer-type-def type-id='type-id-317' size-in-bits='64' id='type-id-302'/>
    <typedef-decl name='__caddr_t' type-id='type-id-9' id='type-id-318'/>
    <typedef-decl name='caddr_t' type-id='type-id-318' id='type-id-298'/>
    <typedef-decl name='__u_int' type-id='type-id-69' id='type-id-319'/>
    <typedef-decl name='u_int' type-id='type-id-319' id='type-id-299'/>
    <pointer-type-def type-id='type-id-320' size-in-bits='64' id='type-id-303'/>
    <pointer-type-def type-id='type-id-321' size-in-bits='64' id='type-id-304'/>
    <qualified-type-def type-id='type-id-312' const='yes' id='type-id-322'/>
    <pointer-type-def type-id='type-id-322' size-in-bits='64' id='type-id-323'/>
    <pointer-type-def type-id='type-id-324' size-in-bits='64' id='type-id-305'/>
    <pointer-type-def type-id='type-id-325' size-in-bits='64' id='type-id-306'/>
    <pointer-type-def type-id='type-id-326' size-in-bits='64' id='type-id-307'/>
    <pointer-type-def type-id='type-id-327' size-in-bits='64' id='type-id-308'/>
    <pointer-type-def type-id='type-id-328' size-in-bits='64' id='type-id-309'/>
    <qualified-type-def type-id='type-id-65' const='yes' id='type-id-329'/>
    <pointer-type-def type-id='type-id-329' size-in-bits='64' id='type-id-330'/>
    <pointer-type-def type-id='type-id-331' size-in-bits='64' id='type-id-310'/>
    <pointer-type-def type-id='type-id-300' size-in-bits='64' id='type-id-297'/>
    <function-decl name='xdrmem_create' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-313'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-69'/>
      <parameter type-id='type-id-296'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='nvlist_pack' mangled-name='nvlist_pack' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_pack'>
      <parameter type-id='type-id-73' name='nvl'/>
      <parameter type-id='type-id-153' name='bufp'/>
      <parameter type-id='type-id-294' name='buflen'/>
      <parameter type-id='type-id-5' name='encoding'/>
      <parameter type-id='type-id-5' name='kmflag'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvlist_xpack' mangled-name='nvlist_xpack' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_xpack'>
      <parameter type-id='type-id-73' name='nvl'/>
      <parameter type-id='type-id-153' name='bufp'/>
      <parameter type-id='type-id-294' name='buflen'/>
      <parameter type-id='type-id-5' name='encoding'/>
      <parameter type-id='type-id-269' name='nva'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvlist_unpack' mangled-name='nvlist_unpack' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_unpack'>
      <parameter type-id='type-id-9' name='buf'/>
      <parameter type-id='type-id-20' name='buflen'/>
      <parameter type-id='type-id-156' name='nvlp'/>
      <parameter type-id='type-id-5' name='kmflag'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvlist_xunpack' mangled-name='nvlist_xunpack' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_xunpack'>
      <parameter type-id='type-id-9' name='buf'/>
      <parameter type-id='type-id-20' name='buflen'/>
