<abi-corpus path='libnvpair.so' architecture='elf-amd-x86_64' soname='libnvpair.so.3'>
  <elf-needed>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='dump_nvlist' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fnvlist_add_boolean' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fnvlist_add_boolean_array' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fnvlist_add_boolean_value' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fnvlist_add_byte' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fnvlist_add_byte_array' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fnvlist_add_int16' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fnvlist_add_int16_array' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fnvlist_add_int32' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='nvlist_remove_nvpair' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvlist_size' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvlist_unpack' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvlist_xalloc' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvlist_xdup' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvlist_xpack' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvlist_xunpack' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_name' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_type' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_type_is_array' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_boolean_array' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_boolean_value' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_byte' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_byte_array' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_double' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_hrtime' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_int16' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_int16_array' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_int32' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_int32_array' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_int64' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_int64_array' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_int8' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_int8_array' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_match' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_match_regex' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_nvlist' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_nvlist_array' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_string' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_string_array' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_uint16' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_uint16_array' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_uint32' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_uint32_array' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_uint64' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_uint64_array' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_uint8' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_uint8_array' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <elf-variable-symbols>
    <elf-symbol name='libspl_assert_ok' size='4' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nv_alloc_nosleep' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nv_fixed_ops' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-variable-symbols>
  <abi-instr version='1.0' address-size='64' path='libnvpair.c' comp-dir-path='/home/allan/openzfs/lib/libnvpair' language='LANG_C99'>
    <type-decl name='int' size-in-bits='32' id='type-id-1'/>
    <class-decl name='nvpair' size-in-bits='128' is-struct='yes' visibility='default' id='type-id-2'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nvp_size' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='nvp_name_sz' type-id='type-id-4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='nvp_reserve' type-id='type-id-4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='nvp_value_elem' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='nvp_type' type-id='type-id-5' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__int32_t' type-id='type-id-1' id='type-id-6'/>
    <typedef-decl name='int32_t' type-id='type-id-6' id='type-id-3'/>
    <type-decl name='short int' size-in-bits='16' id='type-id-7'/>
    <typedef-decl name='__int16_t' type-id='type-id-7' id='type-id-8'/>
    <typedef-decl name='int16_t' type-id='type-id-8' id='type-id-4'/>
    <type-decl name='unnamed-enum-underlying-type' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='type-id-9'/>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' id='type-id-10'>
      <underlying-type type-id='type-id-9'/>
      <enumerator name='DATA_TYPE_DONTCARE' value='-1'/>
      <enumerator name='DATA_TYPE_UNKNOWN' value='0'/>
      <enumerator name='DATA_TYPE_BOOLEAN' value='1'/>
      <enumerator name='DATA_TYPE_BYTE' value='2'/>
      <enumerator name='DATA_TYPE_INT16' value='3'/>
      <enumerator name='DATA_TYPE_UINT16' value='4'/>
      <enumerator name='DATA_TYPE_INT32' value='5'/>
      <enumerator name='DATA_TYPE_UINT32' value='6'/>
      <enumerator name='DATA_TYPE_INT64' value='7'/>
      <enumerator name='DATA_TYPE_UINT64' value='8'/>
      <enumerator name='DATA_TYPE_STRING' value='9'/>
      <enumerator name='DATA_TYPE_BYTE_ARRAY' value='10'/>
      <enumerator name='DATA_TYPE_INT16_ARRAY' value='11'/>
      <enumerator name='DATA_TYPE_UINT16_ARRAY' value='12'/>
      <enumerator name='DATA_TYPE_INT32_ARRAY' value='13'/>
      <enumerator name='DATA_TYPE_UINT32_ARRAY' value='14'/>
      <enumerator name='DATA_TYPE_INT64_ARRAY' value='15'/>
      <enumerator name='DATA_TYPE_UINT64_ARRAY' value='16'/>
      <enumerator name='DATA_TYPE_STRING_ARRAY' value='17'/>
      <enumerator name='DATA_TYPE_HRTIME' value='18'/>
      <enumerator name='DATA_TYPE_NVLIST' value='19'/>
      <enumerator name='DATA_TYPE_NVLIST_ARRAY' value='20'/>
      <enumerator name='DATA_TYPE_BOOLEAN_VALUE' value='21'/>
      <enumerator name='DATA_TYPE_INT8' value='22'/>
      <enumerator name='DATA_TYPE_UINT8' value='23'/>
      <enumerator name='DATA_TYPE_BOOLEAN_ARRAY' value='24'/>
      <enumerator name='DATA_TYPE_INT8_ARRAY' value='25'/>
      <enumerator name='DATA_TYPE_UINT8_ARRAY' value='26'/>
      <enumerator name='DATA_TYPE_DOUBLE' value='27'/>
    </enum-decl>
    <typedef-decl name='data_type_t' type-id='type-id-10' id='type-id-5'/>
    <typedef-decl name='nvpair_t' type-id='type-id-2' id='type-id-11'/>
    <pointer-type-def type-id='type-id-11' size-in-bits='64' id='type-id-12'/>
    <type-decl name='char' size-in-bits='8' id='type-id-13'/>
    <pointer-type-def type-id='type-id-13' size-in-bits='64' id='type-id-14'/>
    <pointer-type-def type-id='type-id-14' size-in-bits='64' id='type-id-15'/>
    <function-decl name='nvpair_value_match' mangled-name='nvpair_value_match' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_match'>
      <parameter type-id='type-id-12' name='nvp'/>
      <parameter type-id='type-id-1' name='ai'/>
      <parameter type-id='type-id-14' name='value'/>
      <parameter type-id='type-id-15' name='ep'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <type-decl name='void' id='type-id-16'/>
    <class-decl name='nvlist' size-in-bits='192' is-struct='yes' visibility='default' id='type-id-17'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nvl_version' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='nvl_nvflag' type-id='type-id-18' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='nvl_priv' type-id='type-id-19' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='nvl_flag' type-id='type-id-18' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='nvl_pad' type-id='type-id-3' visibility='default'/>
      </data-member>
    </class-decl>
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-20'/>
    <typedef-decl name='__uint32_t' type-id='type-id-20' id='type-id-21'/>
    <typedef-decl name='uint32_t' type-id='type-id-21' id='type-id-18'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-22'/>
    <typedef-decl name='__uint64_t' type-id='type-id-22' id='type-id-23'/>
    <typedef-decl name='uint64_t' type-id='type-id-23' id='type-id-19'/>
    <typedef-decl name='nvlist_t' type-id='type-id-17' id='type-id-24'/>
    <pointer-type-def type-id='type-id-24' size-in-bits='64' id='type-id-25'/>
    <function-decl name='dump_nvlist' mangled-name='dump_nvlist' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dump_nvlist'>
      <parameter type-id='type-id-25' name='list'/>
      <parameter type-id='type-id-1' name='indent'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <class-decl name='nvlist_prtctl' size-in-bits='576' is-struct='yes' visibility='default' id='type-id-26'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nvprt_fp' type-id='type-id-27' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='nvprt_indent_mode' type-id='type-id-28' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='nvprt_indent' type-id='type-id-1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='nvprt_indentinc' type-id='type-id-1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='nvprt_nmfmt' type-id='type-id-29' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='nvprt_eomfmt' type-id='type-id-29' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='nvprt_btwnarrfmt' type-id='type-id-29' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='nvprt_btwnarrfmt_nl' type-id='type-id-1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='nvprt_dfltops' type-id='type-id-30' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='nvprt_custops' type-id='type-id-30' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='_IO_FILE' size-in-bits='1728' is-struct='yes' visibility='default' id='type-id-31'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_flags' type-id='type-id-1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_IO_read_ptr' type-id='type-id-14' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_IO_read_end' type-id='type-id-14' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_IO_read_base' type-id='type-id-14' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='_IO_write_base' type-id='type-id-14' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='_IO_write_ptr' type-id='type-id-14' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_IO_write_end' type-id='type-id-14' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='_IO_buf_base' type-id='type-id-14' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='_IO_buf_end' type-id='type-id-14' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='_IO_save_base' type-id='type-id-14' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='_IO_backup_base' type-id='type-id-14' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='_IO_save_end' type-id='type-id-14' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='_markers' type-id='type-id-32' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='_chain' type-id='type-id-33' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='_fileno' type-id='type-id-1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='_flags2' type-id='type-id-1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='_old_offset' type-id='type-id-34' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='_cur_column' type-id='type-id-35' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1040'>
        <var-decl name='_vtable_offset' type-id='type-id-36' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1048'>
        <var-decl name='_shortbuf' type-id='type-id-37' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='_lock' type-id='type-id-38' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='_offset' type-id='type-id-39' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='_codecvt' type-id='type-id-40' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='_wide_data' type-id='type-id-41' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='_freeres_list' type-id='type-id-33' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='_freeres_buf' type-id='type-id-42' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='__pad5' type-id='type-id-43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='_mode' type-id='type-id-1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='_unused2' type-id='type-id-44' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='_IO_marker' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-45'/>
    <pointer-type-def type-id='type-id-45' size-in-bits='64' id='type-id-32'/>
    <pointer-type-def type-id='type-id-31' size-in-bits='64' id='type-id-33'/>
    <type-decl name='long int' size-in-bits='64' id='type-id-46'/>
    <typedef-decl name='__off_t' type-id='type-id-46' id='type-id-34'/>
    <type-decl name='unsigned short int' size-in-bits='16' id='type-id-35'/>
    <type-decl name='signed char' size-in-bits='8' id='type-id-36'/>

    <array-type-def dimensions='1' type-id='type-id-13' size-in-bits='8' id='type-id-37'>
      <subrange length='1' type-id='type-id-22' id='type-id-47'/>

    </array-type-def>
    <typedef-decl name='_IO_lock_t' type-id='type-id-16' id='type-id-48'/>
    <pointer-type-def type-id='type-id-48' size-in-bits='64' id='type-id-38'/>
    <typedef-decl name='__off64_t' type-id='type-id-46' id='type-id-39'/>
    <class-decl name='_IO_codecvt' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-49'/>
    <pointer-type-def type-id='type-id-49' size-in-bits='64' id='type-id-40'/>
    <class-decl name='_IO_wide_data' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-50'/>
    <pointer-type-def type-id='type-id-50' size-in-bits='64' id='type-id-41'/>
    <pointer-type-def type-id='type-id-16' size-in-bits='64' id='type-id-42'/>
    <typedef-decl name='size_t' type-id='type-id-22' id='type-id-43'/>

    <array-type-def dimensions='1' type-id='type-id-13' size-in-bits='160' id='type-id-44'>
      <subrange length='20' type-id='type-id-22' id='type-id-51'/>

    </array-type-def>
    <typedef-decl name='FILE' type-id='type-id-31' id='type-id-52'/>
    <pointer-type-def type-id='type-id-52' size-in-bits='64' id='type-id-27'/>
    <enum-decl name='nvlist_indent_mode' id='type-id-28'>
      <underlying-type type-id='type-id-9'/>
      <enumerator name='NVLIST_INDENT_ABS' value='0'/>
      <enumerator name='NVLIST_INDENT_TABBED' value='1'/>
    </enum-decl>
    <qualified-type-def type-id='type-id-13' const='yes' id='type-id-53'/>
    <pointer-type-def type-id='type-id-53' size-in-bits='64' id='type-id-29'/>
    <class-decl name='nvlist_printops' size-in-bits='3456' is-struct='yes' visibility='default' id='type-id-54'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='print_boolean' type-id='type-id-55' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='print_boolean_value' type-id='type-id-56' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='print_byte' type-id='type-id-57' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='print_int8' type-id='type-id-58' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='print_uint8' type-id='type-id-59' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='print_int16' type-id='type-id-60' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='print_uint16' type-id='type-id-61' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='print_int32' type-id='type-id-62' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='print_uint32' type-id='type-id-63' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='print_int64' type-id='type-id-64' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='print_uint64' type-id='type-id-65' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='print_double' type-id='type-id-66' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='print_string' type-id='type-id-67' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='print_hrtime' type-id='type-id-68' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='print_nvlist' type-id='type-id-69' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1920'>
        <var-decl name='print_boolean_array' type-id='type-id-70' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='print_byte_array' type-id='type-id-71' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='print_int8_array' type-id='type-id-72' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2304'>
        <var-decl name='print_uint8_array' type-id='type-id-73' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2432'>
        <var-decl name='print_int16_array' type-id='type-id-74' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2560'>
        <var-decl name='print_uint16_array' type-id='type-id-75' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2688'>
        <var-decl name='print_int32_array' type-id='type-id-76' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2816'>
        <var-decl name='print_uint32_array' type-id='type-id-77' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2944'>
        <var-decl name='print_int64_array' type-id='type-id-78' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3072'>
        <var-decl name='print_uint64_array' type-id='type-id-79' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3200'>
        <var-decl name='print_string_array' type-id='type-id-80' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3328'>
        <var-decl name='print_nvlist_array' type-id='type-id-81' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-55'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-82' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-42' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-26' size-in-bits='64' id='type-id-83'/>
    <pointer-type-def type-id='type-id-84' size-in-bits='64' id='type-id-82'/>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-56'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-85' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-42' visibility='default'/>
      </data-member>
    </class-decl>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' id='type-id-86'>
      <underlying-type type-id='type-id-9'/>
      <enumerator name='B_FALSE' value='0'/>
      <enumerator name='B_TRUE' value='1'/>
    </enum-decl>
    <typedef-decl name='boolean_t' type-id='type-id-86' id='type-id-87'/>
    <pointer-type-def type-id='type-id-88' size-in-bits='64' id='type-id-85'/>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-57'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-89' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-42' visibility='default'/>
      </data-member>
    </class-decl>
    <type-decl name='unsigned char' size-in-bits='8' id='type-id-90'/>
    <typedef-decl name='uchar_t' type-id='type-id-90' id='type-id-91'/>
    <pointer-type-def type-id='type-id-92' size-in-bits='64' id='type-id-89'/>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-58'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-93' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-42' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__int8_t' type-id='type-id-36' id='type-id-94'/>
    <typedef-decl name='int8_t' type-id='type-id-94' id='type-id-95'/>
    <pointer-type-def type-id='type-id-96' size-in-bits='64' id='type-id-93'/>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-59'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-97' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-42' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__uint8_t' type-id='type-id-90' id='type-id-98'/>
    <typedef-decl name='uint8_t' type-id='type-id-98' id='type-id-99'/>
    <pointer-type-def type-id='type-id-100' size-in-bits='64' id='type-id-97'/>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-60'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-101' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-42' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-102' size-in-bits='64' id='type-id-101'/>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-61'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-103' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-42' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__uint16_t' type-id='type-id-35' id='type-id-104'/>
    <typedef-decl name='uint16_t' type-id='type-id-104' id='type-id-105'/>
    <pointer-type-def type-id='type-id-106' size-in-bits='64' id='type-id-103'/>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-62'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-107' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-42' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-108' size-in-bits='64' id='type-id-107'/>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-63'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-109' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-42' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-110' size-in-bits='64' id='type-id-109'/>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-64'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-111' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-42' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__int64_t' type-id='type-id-46' id='type-id-112'/>
    <typedef-decl name='int64_t' type-id='type-id-112' id='type-id-113'/>
    <pointer-type-def type-id='type-id-114' size-in-bits='64' id='type-id-111'/>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-65'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-115' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-42' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-116' size-in-bits='64' id='type-id-115'/>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-66'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-117' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-42' visibility='default'/>
      </data-member>
    </class-decl>
    <type-decl name='double' size-in-bits='64' id='type-id-118'/>
    <pointer-type-def type-id='type-id-119' size-in-bits='64' id='type-id-117'/>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-67'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-120' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-42' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-121' size-in-bits='64' id='type-id-120'/>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-68'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-122' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-42' visibility='default'/>
      </data-member>
    </class-decl>
    <type-decl name='long long int' size-in-bits='64' id='type-id-123'/>
    <typedef-decl name='hrtime_t' type-id='type-id-123' id='type-id-124'/>
    <pointer-type-def type-id='type-id-125' size-in-bits='64' id='type-id-122'/>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-69'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-126' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-42' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-127' size-in-bits='64' id='type-id-126'/>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-70'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-128' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-42' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-87' size-in-bits='64' id='type-id-129'/>
    <typedef-decl name='uint_t' type-id='type-id-20' id='type-id-130'/>
    <pointer-type-def type-id='type-id-131' size-in-bits='64' id='type-id-128'/>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-71'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-132' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-42' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-91' size-in-bits='64' id='type-id-133'/>
    <pointer-type-def type-id='type-id-134' size-in-bits='64' id='type-id-132'/>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-72'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-135' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-42' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-95' size-in-bits='64' id='type-id-136'/>
    <pointer-type-def type-id='type-id-137' size-in-bits='64' id='type-id-135'/>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-73'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-138' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-42' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-99' size-in-bits='64' id='type-id-139'/>
    <pointer-type-def type-id='type-id-140' size-in-bits='64' id='type-id-138'/>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-74'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-141' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-42' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-4' size-in-bits='64' id='type-id-142'/>
    <pointer-type-def type-id='type-id-143' size-in-bits='64' id='type-id-141'/>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-75'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-144' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-42' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-105' size-in-bits='64' id='type-id-145'/>
    <pointer-type-def type-id='type-id-146' size-in-bits='64' id='type-id-144'/>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-76'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-147' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-42' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-3' size-in-bits='64' id='type-id-148'/>
    <pointer-type-def type-id='type-id-149' size-in-bits='64' id='type-id-147'/>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-77'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-150' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-42' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-18' size-in-bits='64' id='type-id-151'/>
    <pointer-type-def type-id='type-id-152' size-in-bits='64' id='type-id-150'/>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-78'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-153' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-42' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-113' size-in-bits='64' id='type-id-154'/>
    <pointer-type-def type-id='type-id-155' size-in-bits='64' id='type-id-153'/>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-79'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-156' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-42' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-19' size-in-bits='64' id='type-id-157'/>
    <pointer-type-def type-id='type-id-158' size-in-bits='64' id='type-id-156'/>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-80'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-159' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-42' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-160' size-in-bits='64' id='type-id-159'/>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-81'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-161' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-42' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-25' size-in-bits='64' id='type-id-162'/>
    <pointer-type-def type-id='type-id-163' size-in-bits='64' id='type-id-161'/>
    <pointer-type-def type-id='type-id-54' size-in-bits='64' id='type-id-30'/>
    <typedef-decl name='nvlist_prtctl_t' type-id='type-id-83' id='type-id-164'/>
    <function-decl name='nvlist_prt' mangled-name='nvlist_prt' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prt'>
      <parameter type-id='type-id-25' name='nvl'/>
      <parameter type-id='type-id-164' name='pctl'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='nvlist_print' mangled-name='nvlist_print' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_print'>
      <parameter type-id='type-id-27' name='fp'/>
      <parameter type-id='type-id-25' name='nvl'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='nvlist_prtctl_free' mangled-name='nvlist_prtctl_free' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctl_free'>
      <parameter type-id='type-id-164' name='pctl'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='nvlist_prtctl_alloc' mangled-name='nvlist_prtctl_alloc' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctl_alloc'>
      <return type-id='type-id-164'/>
    </function-decl>
    <pointer-type-def type-id='type-id-165' size-in-bits='64' id='type-id-166'/>
    <function-decl name='nvlist_prtctlop_nvlist_array' mangled-name='nvlist_prtctlop_nvlist_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_nvlist_array'>
      <parameter type-id='type-id-164' name='pctl'/>
      <parameter type-id='type-id-166' name='func'/>
      <parameter type-id='type-id-42' name='private'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <pointer-type-def type-id='type-id-167' size-in-bits='64' id='type-id-168'/>
    <function-decl name='nvlist_prtctlop_string_array' mangled-name='nvlist_prtctlop_string_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_string_array'>
      <parameter type-id='type-id-164' name='pctl'/>
      <parameter type-id='type-id-168' name='func'/>
      <parameter type-id='type-id-42' name='private'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <pointer-type-def type-id='type-id-169' size-in-bits='64' id='type-id-170'/>
    <function-decl name='nvlist_prtctlop_uint64_array' mangled-name='nvlist_prtctlop_uint64_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_uint64_array'>
      <parameter type-id='type-id-164' name='pctl'/>
      <parameter type-id='type-id-170' name='func'/>
      <parameter type-id='type-id-42' name='private'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <pointer-type-def type-id='type-id-171' size-in-bits='64' id='type-id-172'/>
    <function-decl name='nvlist_prtctlop_int64_array' mangled-name='nvlist_prtctlop_int64_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_int64_array'>
      <parameter type-id='type-id-164' name='pctl'/>
      <parameter type-id='type-id-172' name='func'/>
      <parameter type-id='type-id-42' name='private'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <pointer-type-def type-id='type-id-173' size-in-bits='64' id='type-id-174'/>
    <function-decl name='nvlist_prtctlop_uint32_array' mangled-name='nvlist_prtctlop_uint32_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_uint32_array'>
      <parameter type-id='type-id-164' name='pctl'/>
      <parameter type-id='type-id-174' name='func'/>
      <parameter type-id='type-id-42' name='private'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <pointer-type-def type-id='type-id-175' size-in-bits='64' id='type-id-176'/>
    <function-decl name='nvlist_prtctlop_int32_array' mangled-name='nvlist_prtctlop_int32_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_int32_array'>
      <parameter type-id='type-id-164' name='pctl'/>
      <parameter type-id='type-id-176' name='func'/>
      <parameter type-id='type-id-42' name='private'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <pointer-type-def type-id='type-id-177' size-in-bits='64' id='type-id-178'/>
    <function-decl name='nvlist_prtctlop_uint16_array' mangled-name='nvlist_prtctlop_uint16_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_uint16_array'>
      <parameter type-id='type-id-164' name='pctl'/>
      <parameter type-id='type-id-178' name='func'/>
      <parameter type-id='type-id-42' name='private'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <pointer-type-def type-id='type-id-179' size-in-bits='64' id='type-id-180'/>
    <function-decl name='nvlist_prtctlop_int16_array' mangled-name='nvlist_prtctlop_int16_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_int16_array'>
      <parameter type-id='type-id-164' name='pctl'/>
      <parameter type-id='type-id-180' name='func'/>
      <parameter type-id='type-id-42' name='private'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <pointer-type-def type-id='type-id-181' size-in-bits='64' id='type-id-182'/>
    <function-decl name='nvlist_prtctlop_uint8_array' mangled-name='nvlist_prtctlop_uint8_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_uint8_array'>
      <parameter type-id='type-id-164' name='pctl'/>
      <parameter type-id='type-id-182' name='func'/>
      <parameter type-id='type-id-42' name='private'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <pointer-type-def type-id='type-id-183' size-in-bits='64' id='type-id-184'/>
    <function-decl name='nvlist_prtctlop_int8_array' mangled-name='nvlist_prtctlop_int8_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_int8_array'>
      <parameter type-id='type-id-164' name='pctl'/>
      <parameter type-id='type-id-184' name='func'/>
      <parameter type-id='type-id-42' name='private'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <pointer-type-def type-id='type-id-185' size-in-bits='64' id='type-id-186'/>
    <function-decl name='nvlist_prtctlop_byte_array' mangled-name='nvlist_prtctlop_byte_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_byte_array'>
      <parameter type-id='type-id-164' name='pctl'/>
      <parameter type-id='type-id-186' name='func'/>
      <parameter type-id='type-id-42' name='private'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <pointer-type-def type-id='type-id-187' size-in-bits='64' id='type-id-188'/>
    <function-decl name='nvlist_prtctlop_boolean_array' mangled-name='nvlist_prtctlop_boolean_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_boolean_array'>
      <parameter type-id='type-id-164' name='pctl'/>
      <parameter type-id='type-id-188' name='func'/>
      <parameter type-id='type-id-42' name='private'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <pointer-type-def type-id='type-id-189' size-in-bits='64' id='type-id-190'/>
    <function-decl name='nvlist_prtctlop_nvlist' mangled-name='nvlist_prtctlop_nvlist' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_nvlist'>
      <parameter type-id='type-id-164' name='pctl'/>
      <parameter type-id='type-id-190' name='func'/>
      <parameter type-id='type-id-42' name='private'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <pointer-type-def type-id='type-id-191' size-in-bits='64' id='type-id-192'/>
    <function-decl name='nvlist_prtctlop_hrtime' mangled-name='nvlist_prtctlop_hrtime' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_hrtime'>
      <parameter type-id='type-id-164' name='pctl'/>
      <parameter type-id='type-id-192' name='func'/>
      <parameter type-id='type-id-42' name='private'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <pointer-type-def type-id='type-id-193' size-in-bits='64' id='type-id-194'/>
    <function-decl name='nvlist_prtctlop_string' mangled-name='nvlist_prtctlop_string' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_string'>
      <parameter type-id='type-id-164' name='pctl'/>
      <parameter type-id='type-id-194' name='func'/>
      <parameter type-id='type-id-42' name='private'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <pointer-type-def type-id='type-id-195' size-in-bits='64' id='type-id-196'/>
    <function-decl name='nvlist_prtctlop_double' mangled-name='nvlist_prtctlop_double' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_double'>
      <parameter type-id='type-id-164' name='pctl'/>
      <parameter type-id='type-id-196' name='func'/>
      <parameter type-id='type-id-42' name='private'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <pointer-type-def type-id='type-id-197' size-in-bits='64' id='type-id-198'/>
    <function-decl name='nvlist_prtctlop_uint64' mangled-name='nvlist_prtctlop_uint64' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_uint64'>
      <parameter type-id='type-id-164' name='pctl'/>
      <parameter type-id='type-id-198' name='func'/>
      <parameter type-id='type-id-42' name='private'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <pointer-type-def type-id='type-id-199' size-in-bits='64' id='type-id-200'/>
    <function-decl name='nvlist_prtctlop_int64' mangled-name='nvlist_prtctlop_int64' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_int64'>
      <parameter type-id='type-id-164' name='pctl'/>
      <parameter type-id='type-id-200' name='func'/>
      <parameter type-id='type-id-42' name='private'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <pointer-type-def type-id='type-id-201' size-in-bits='64' id='type-id-202'/>
    <function-decl name='nvlist_prtctlop_uint32' mangled-name='nvlist_prtctlop_uint32' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_uint32'>
      <parameter type-id='type-id-164' name='pctl'/>
      <parameter type-id='type-id-202' name='func'/>
      <parameter type-id='type-id-42' name='private'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <pointer-type-def type-id='type-id-203' size-in-bits='64' id='type-id-204'/>
    <function-decl name='nvlist_prtctlop_int32' mangled-name='nvlist_prtctlop_int32' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_int32'>
      <parameter type-id='type-id-164' name='pctl'/>
      <parameter type-id='type-id-204' name='func'/>
      <parameter type-id='type-id-42' name='private'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <pointer-type-def type-id='type-id-205' size-in-bits='64' id='type-id-206'/>
    <function-decl name='nvlist_prtctlop_uint16' mangled-name='nvlist_prtctlop_uint16' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_uint16'>
      <parameter type-id='type-id-164' name='pctl'/>
      <parameter type-id='type-id-206' name='func'/>
      <parameter type-id='type-id-42' name='private'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <pointer-type-def type-id='type-id-207' size-in-bits='64' id='type-id-208'/>
    <function-decl name='nvlist_prtctlop_int16' mangled-name='nvlist_prtctlop_int16' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_int16'>
      <parameter type-id='type-id-164' name='pctl'/>
      <parameter type-id='type-id-208' name='func'/>
      <parameter type-id='type-id-42' name='private'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <pointer-type-def type-id='type-id-209' size-in-bits='64' id='type-id-210'/>
    <function-decl name='nvlist_prtctlop_uint8' mangled-name='nvlist_prtctlop_uint8' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_uint8'>
      <parameter type-id='type-id-164' name='pctl'/>
      <parameter type-id='type-id-210' name='func'/>
      <parameter type-id='type-id-42' name='private'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <pointer-type-def type-id='type-id-211' size-in-bits='64' id='type-id-212'/>
    <function-decl name='nvlist_prtctlop_int8' mangled-name='nvlist_prtctlop_int8' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_int8'>
      <parameter type-id='type-id-164' name='pctl'/>
      <parameter type-id='type-id-212' name='func'/>
      <parameter type-id='type-id-42' name='private'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <pointer-type-def type-id='type-id-213' size-in-bits='64' id='type-id-214'/>
    <function-decl name='nvlist_prtctlop_byte' mangled-name='nvlist_prtctlop_byte' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_byte'>
      <parameter type-id='type-id-164' name='pctl'/>
      <parameter type-id='type-id-214' name='func'/>
      <parameter type-id='type-id-42' name='private'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <pointer-type-def type-id='type-id-215' size-in-bits='64' id='type-id-216'/>
    <function-decl name='nvlist_prtctlop_boolean_value' mangled-name='nvlist_prtctlop_boolean_value' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_boolean_value'>
      <parameter type-id='type-id-164' name='pctl'/>
      <parameter type-id='type-id-216' name='func'/>
      <parameter type-id='type-id-42' name='private'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <pointer-type-def type-id='type-id-217' size-in-bits='64' id='type-id-218'/>
    <function-decl name='nvlist_prtctlop_boolean' mangled-name='nvlist_prtctlop_boolean' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_boolean'>
      <parameter type-id='type-id-164' name='pctl'/>
      <parameter type-id='type-id-218' name='func'/>
      <parameter type-id='type-id-42' name='private'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <enum-decl name='nvlist_prtctl_fmt' id='type-id-219'>
      <underlying-type type-id='type-id-9'/>
      <enumerator name='NVLIST_FMT_MEMBER_NAME' value='0'/>
      <enumerator name='NVLIST_FMT_MEMBER_POSTAMBLE' value='1'/>
      <enumerator name='NVLIST_FMT_BTWN_ARRAY' value='2'/>
    </enum-decl>
    <function-decl name='nvlist_prtctl_dofmt' mangled-name='nvlist_prtctl_dofmt' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctl_dofmt'>
      <parameter type-id='type-id-164' name='pctl'/>
      <parameter type-id='type-id-219' name='which'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='nvlist_prtctl_setfmt' mangled-name='nvlist_prtctl_setfmt' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctl_setfmt'>
      <parameter type-id='type-id-164' name='pctl'/>
      <parameter type-id='type-id-219' name='which'/>
      <parameter type-id='type-id-29' name='fmt'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='nvlist_prtctl_doindent' mangled-name='nvlist_prtctl_doindent' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctl_doindent'>
      <parameter type-id='type-id-164' name='pctl'/>
      <parameter type-id='type-id-1' name='onemore'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='nvlist_prtctl_setindent' mangled-name='nvlist_prtctl_setindent' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctl_setindent'>
      <parameter type-id='type-id-164' name='pctl'/>
      <parameter type-id='type-id-28' name='mode'/>
      <parameter type-id='type-id-1' name='start'/>
      <parameter type-id='type-id-1' name='inc'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='nvlist_prtctl_getdest' mangled-name='nvlist_prtctl_getdest' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctl_getdest'>
      <parameter type-id='type-id-164' name='pctl'/>
      <return type-id='type-id-27'/>
    </function-decl>
    <function-decl name='nvlist_prtctl_setdest' mangled-name='nvlist_prtctl_setdest' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctl_setdest'>
      <parameter type-id='type-id-164' name='pctl'/>
      <parameter type-id='type-id-27' name='fp'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <class-decl name='re_pattern_buffer' size-in-bits='512' is-struct='yes' visibility='default' id='type-id-220'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='buffer' type-id='type-id-221' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='allocated' type-id='type-id-222' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='used' type-id='type-id-222' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='syntax' type-id='type-id-223' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='fastmap' type-id='type-id-14' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='translate' type-id='type-id-224' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='re_nsub' type-id='type-id-43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31'>
        <var-decl name='can_be_null' type-id='type-id-20' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='29'>
        <var-decl name='regs_allocated' type-id='type-id-20' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='28'>
        <var-decl name='fastmap_accurate' type-id='type-id-20' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='27'>
        <var-decl name='no_sub' type-id='type-id-20' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='26'>
        <var-decl name='not_bol' type-id='type-id-20' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='25'>
        <var-decl name='not_eol' type-id='type-id-20' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='newline_anchor' type-id='type-id-20' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='re_dfa_t' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-225'/>
    <pointer-type-def type-id='type-id-225' size-in-bits='64' id='type-id-221'/>
    <typedef-decl name='__re_long_size_t' type-id='type-id-22' id='type-id-222'/>
    <typedef-decl name='reg_syntax_t' type-id='type-id-22' id='type-id-223'/>
    <pointer-type-def type-id='type-id-90' size-in-bits='64' id='type-id-224'/>
    <typedef-decl name='regex_t' type-id='type-id-220' id='type-id-226'/>
    <pointer-type-def type-id='type-id-226' size-in-bits='64' id='type-id-227'/>
    <function-decl name='nvpair_value_match_regex' mangled-name='nvpair_value_match_regex' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_match_regex'>
      <parameter type-id='type-id-12' name='nvp'/>
      <parameter type-id='type-id-1' name='ai'/>
      <parameter type-id='type-id-14' name='value'/>
      <parameter type-id='type-id-227' name='value_regex'/>
      <parameter type-id='type-id-15' name='ep'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='nvpair_value_byte' mangled-name='nvpair_value_byte' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='nvpair_value_int8' mangled-name='nvpair_value_int8' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='__printf_chk' mangled-name='__printf_chk' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='nvpair_name' mangled-name='nvpair_name' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='nvpair_value_uint8' mangled-name='nvpair_value_uint8' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='nvpair_value_int16' mangled-name='nvpair_value_int16' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='nvpair_value_uint16' mangled-name='nvpair_value_uint16' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='nvpair_value_int32' mangled-name='nvpair_value_int32' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='nvpair_value_uint32' mangled-name='nvpair_value_uint32' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='nvpair_value_int64' mangled-name='nvpair_value_int64' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='nvpair_value_uint64' mangled-name='nvpair_value_uint64' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='nvpair_value_string' mangled-name='nvpair_value_string' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='nvpair_value_byte_array' mangled-name='nvpair_value_byte_array' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='nvpair_value_int8_array' mangled-name='nvpair_value_int8_array' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='nvpair_value_uint8_array' mangled-name='nvpair_value_uint8_array' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='nvpair_value_int16_array' mangled-name='nvpair_value_int16_array' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='nvpair_value_uint16_array' mangled-name='nvpair_value_uint16_array' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='nvpair_value_int32_array' mangled-name='nvpair_value_int32_array' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='nvpair_value_uint32_array' mangled-name='nvpair_value_uint32_array' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='nvpair_value_int64_array' mangled-name='nvpair_value_int64_array' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='nvpair_value_uint64_array' mangled-name='nvpair_value_uint64_array' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='nvpair_value_string_array' mangled-name='nvpair_value_string_array' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='nvlist_next_nvpair' mangled-name='nvlist_next_nvpair' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='nvpair_type' mangled-name='nvpair_type' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='dcgettext' mangled-name='dcgettext' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='nvpair_value_nvlist' mangled-name='nvpair_value_nvlist' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='nvpair_value_nvlist_array' mangled-name='nvpair_value_nvlist_array' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='nvpair_value_boolean_value' mangled-name='nvpair_value_boolean_value' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='__stack_chk_fail' mangled-name='__stack_chk_fail' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='nvpair_value_double' mangled-name='nvpair_value_double' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='nvpair_value_boolean_array' mangled-name='nvpair_value_boolean_array' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='nvpair_value_hrtime' mangled-name='nvpair_value_hrtime' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='__builtin_fputs' mangled-name='fputs' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='__fprintf_chk' mangled-name='__fprintf_chk' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='free' mangled-name='free' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='malloc' mangled-name='malloc' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='calloc' mangled-name='calloc' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='__builtin_strchr' mangled-name='strchr' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='__builtin_fputc' mangled-name='fputc' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='sscanf' mangled-name='__isoc99_sscanf' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='regexec' mangled-name='regexec' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='strcmp' mangled-name='strcmp' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='strspn' mangled-name='strspn' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='strcspn' mangled-name='strcspn' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='nvpair_type_is_array' mangled-name='nvpair_type_is_array' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-131'>
      <parameter type-id='type-id-83'/>
      <parameter type-id='type-id-42'/>
      <parameter type-id='type-id-25'/>
      <parameter type-id='type-id-29'/>
      <parameter type-id='type-id-129'/>
      <parameter type-id='type-id-130'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-121'>
      <parameter type-id='type-id-83'/>
      <parameter type-id='type-id-42'/>
      <parameter type-id='type-id-25'/>
      <parameter type-id='type-id-29'/>
      <parameter type-id='type-id-14'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-160'>
      <parameter type-id='type-id-83'/>
      <parameter type-id='type-id-42'/>
      <parameter type-id='type-id-25'/>
      <parameter type-id='type-id-29'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-130'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-119'>
      <parameter type-id='type-id-83'/>
      <parameter type-id='type-id-42'/>
      <parameter type-id='type-id-25'/>
      <parameter type-id='type-id-29'/>
      <parameter type-id='type-id-118'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-84'>
      <parameter type-id='type-id-83'/>
      <parameter type-id='type-id-42'/>
      <parameter type-id='type-id-25'/>
      <parameter type-id='type-id-29'/>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-143'>
      <parameter type-id='type-id-83'/>
      <parameter type-id='type-id-42'/>
      <parameter type-id='type-id-25'/>
      <parameter type-id='type-id-29'/>
      <parameter type-id='type-id-142'/>
      <parameter type-id='type-id-130'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-149'>
      <parameter type-id='type-id-83'/>
      <parameter type-id='type-id-42'/>
      <parameter type-id='type-id-25'/>
      <parameter type-id='type-id-29'/>
      <parameter type-id='type-id-148'/>
      <parameter type-id='type-id-130'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-155'>
      <parameter type-id='type-id-83'/>
      <parameter type-id='type-id-42'/>
      <parameter type-id='type-id-25'/>
      <parameter type-id='type-id-29'/>
      <parameter type-id='type-id-154'/>
      <parameter type-id='type-id-130'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-137'>
      <parameter type-id='type-id-83'/>
      <parameter type-id='type-id-42'/>
      <parameter type-id='type-id-25'/>
      <parameter type-id='type-id-29'/>
      <parameter type-id='type-id-136'/>
      <parameter type-id='type-id-130'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-127'>
      <parameter type-id='type-id-83'/>
      <parameter type-id='type-id-42'/>
      <parameter type-id='type-id-25'/>
      <parameter type-id='type-id-29'/>
      <parameter type-id='type-id-25'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-163'>
      <parameter type-id='type-id-83'/>
      <parameter type-id='type-id-42'/>
      <parameter type-id='type-id-25'/>
      <parameter type-id='type-id-29'/>
      <parameter type-id='type-id-162'/>
      <parameter type-id='type-id-130'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-88'>
      <parameter type-id='type-id-83'/>
      <parameter type-id='type-id-42'/>
      <parameter type-id='type-id-25'/>
      <parameter type-id='type-id-29'/>
      <parameter type-id='type-id-87'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-125'>
      <parameter type-id='type-id-83'/>
      <parameter type-id='type-id-42'/>
      <parameter type-id='type-id-25'/>
      <parameter type-id='type-id-29'/>
      <parameter type-id='type-id-124'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-102'>
      <parameter type-id='type-id-83'/>
      <parameter type-id='type-id-42'/>
      <parameter type-id='type-id-25'/>
      <parameter type-id='type-id-29'/>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-108'>
      <parameter type-id='type-id-83'/>
      <parameter type-id='type-id-42'/>
      <parameter type-id='type-id-25'/>
      <parameter type-id='type-id-29'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-114'>
      <parameter type-id='type-id-83'/>
      <parameter type-id='type-id-42'/>
      <parameter type-id='type-id-25'/>
      <parameter type-id='type-id-29'/>
      <parameter type-id='type-id-113'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-96'>
      <parameter type-id='type-id-83'/>
      <parameter type-id='type-id-42'/>
      <parameter type-id='type-id-25'/>
      <parameter type-id='type-id-29'/>
      <parameter type-id='type-id-95'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-92'>
      <parameter type-id='type-id-83'/>
      <parameter type-id='type-id-42'/>
      <parameter type-id='type-id-25'/>
      <parameter type-id='type-id-29'/>
      <parameter type-id='type-id-91'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-106'>
      <parameter type-id='type-id-83'/>
      <parameter type-id='type-id-42'/>
      <parameter type-id='type-id-25'/>
      <parameter type-id='type-id-29'/>
      <parameter type-id='type-id-105'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-110'>
      <parameter type-id='type-id-83'/>
      <parameter type-id='type-id-42'/>
      <parameter type-id='type-id-25'/>
      <parameter type-id='type-id-29'/>
      <parameter type-id='type-id-18'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-116'>
      <parameter type-id='type-id-83'/>
      <parameter type-id='type-id-42'/>
      <parameter type-id='type-id-25'/>
      <parameter type-id='type-id-29'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-100'>
      <parameter type-id='type-id-83'/>
      <parameter type-id='type-id-42'/>
      <parameter type-id='type-id-25'/>
      <parameter type-id='type-id-29'/>
      <parameter type-id='type-id-99'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-134'>
      <parameter type-id='type-id-83'/>
      <parameter type-id='type-id-42'/>
      <parameter type-id='type-id-25'/>
      <parameter type-id='type-id-29'/>
      <parameter type-id='type-id-133'/>
      <parameter type-id='type-id-130'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-146'>
      <parameter type-id='type-id-83'/>
      <parameter type-id='type-id-42'/>
      <parameter type-id='type-id-25'/>
      <parameter type-id='type-id-29'/>
      <parameter type-id='type-id-145'/>
      <parameter type-id='type-id-130'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-152'>
      <parameter type-id='type-id-83'/>
      <parameter type-id='type-id-42'/>
      <parameter type-id='type-id-25'/>
      <parameter type-id='type-id-29'/>
      <parameter type-id='type-id-151'/>
      <parameter type-id='type-id-130'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-158'>
      <parameter type-id='type-id-83'/>
      <parameter type-id='type-id-42'/>
      <parameter type-id='type-id-25'/>
      <parameter type-id='type-id-29'/>
      <parameter type-id='type-id-157'/>
      <parameter type-id='type-id-130'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-140'>
      <parameter type-id='type-id-83'/>
      <parameter type-id='type-id-42'/>
      <parameter type-id='type-id-25'/>
      <parameter type-id='type-id-29'/>
      <parameter type-id='type-id-139'/>
      <parameter type-id='type-id-130'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-187'>
      <parameter type-id='type-id-164'/>
      <parameter type-id='type-id-42'/>
      <parameter type-id='type-id-25'/>
      <parameter type-id='type-id-29'/>
      <parameter type-id='type-id-129'/>
      <parameter type-id='type-id-130'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-193'>
      <parameter type-id='type-id-164'/>
      <parameter type-id='type-id-42'/>
      <parameter type-id='type-id-25'/>
      <parameter type-id='type-id-29'/>
      <parameter type-id='type-id-14'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-167'>
      <parameter type-id='type-id-164'/>
      <parameter type-id='type-id-42'/>
      <parameter type-id='type-id-25'/>
      <parameter type-id='type-id-29'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-130'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-195'>
      <parameter type-id='type-id-164'/>
      <parameter type-id='type-id-42'/>
      <parameter type-id='type-id-25'/>
      <parameter type-id='type-id-29'/>
      <parameter type-id='type-id-118'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-217'>
      <parameter type-id='type-id-164'/>
      <parameter type-id='type-id-42'/>
      <parameter type-id='type-id-25'/>
      <parameter type-id='type-id-29'/>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-179'>
      <parameter type-id='type-id-164'/>
      <parameter type-id='type-id-42'/>
      <parameter type-id='type-id-25'/>
      <parameter type-id='type-id-29'/>
      <parameter type-id='type-id-142'/>
      <parameter type-id='type-id-130'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-175'>
      <parameter type-id='type-id-164'/>
      <parameter type-id='type-id-42'/>
      <parameter type-id='type-id-25'/>
      <parameter type-id='type-id-29'/>
      <parameter type-id='type-id-148'/>
      <parameter type-id='type-id-130'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-171'>
      <parameter type-id='type-id-164'/>
      <parameter type-id='type-id-42'/>
      <parameter type-id='type-id-25'/>
      <parameter type-id='type-id-29'/>
      <parameter type-id='type-id-154'/>
      <parameter type-id='type-id-130'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-183'>
      <parameter type-id='type-id-164'/>
      <parameter type-id='type-id-42'/>
      <parameter type-id='type-id-25'/>
      <parameter type-id='type-id-29'/>
      <parameter type-id='type-id-136'/>
      <parameter type-id='type-id-130'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-189'>
      <parameter type-id='type-id-164'/>
      <parameter type-id='type-id-42'/>
      <parameter type-id='type-id-25'/>
      <parameter type-id='type-id-29'/>
      <parameter type-id='type-id-25'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-165'>
      <parameter type-id='type-id-164'/>
      <parameter type-id='type-id-42'/>
      <parameter type-id='type-id-25'/>
      <parameter type-id='type-id-29'/>
      <parameter type-id='type-id-162'/>
      <parameter type-id='type-id-130'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-215'>
      <parameter type-id='type-id-164'/>
      <parameter type-id='type-id-42'/>
      <parameter type-id='type-id-25'/>
      <parameter type-id='type-id-29'/>
      <parameter type-id='type-id-87'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-191'>
      <parameter type-id='type-id-164'/>
      <parameter type-id='type-id-42'/>
      <parameter type-id='type-id-25'/>
      <parameter type-id='type-id-29'/>
      <parameter type-id='type-id-124'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-207'>
      <parameter type-id='type-id-164'/>
      <parameter type-id='type-id-42'/>
      <parameter type-id='type-id-25'/>
      <parameter type-id='type-id-29'/>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-203'>
      <parameter type-id='type-id-164'/>
      <parameter type-id='type-id-42'/>
      <parameter type-id='type-id-25'/>
      <parameter type-id='type-id-29'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-199'>
      <parameter type-id='type-id-164'/>
      <parameter type-id='type-id-42'/>
      <parameter type-id='type-id-25'/>
      <parameter type-id='type-id-29'/>
      <parameter type-id='type-id-113'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-211'>
      <parameter type-id='type-id-164'/>
      <parameter type-id='type-id-42'/>
      <parameter type-id='type-id-25'/>
      <parameter type-id='type-id-29'/>
      <parameter type-id='type-id-95'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-213'>
      <parameter type-id='type-id-164'/>
      <parameter type-id='type-id-42'/>
      <parameter type-id='type-id-25'/>
      <parameter type-id='type-id-29'/>
      <parameter type-id='type-id-91'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-205'>
      <parameter type-id='type-id-164'/>
      <parameter type-id='type-id-42'/>
      <parameter type-id='type-id-25'/>
      <parameter type-id='type-id-29'/>
      <parameter type-id='type-id-105'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-201'>
      <parameter type-id='type-id-164'/>
      <parameter type-id='type-id-42'/>
      <parameter type-id='type-id-25'/>
      <parameter type-id='type-id-29'/>
      <parameter type-id='type-id-18'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-197'>
      <parameter type-id='type-id-164'/>
      <parameter type-id='type-id-42'/>
      <parameter type-id='type-id-25'/>
      <parameter type-id='type-id-29'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-209'>
      <parameter type-id='type-id-164'/>
      <parameter type-id='type-id-42'/>
      <parameter type-id='type-id-25'/>
      <parameter type-id='type-id-29'/>
      <parameter type-id='type-id-99'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-185'>
      <parameter type-id='type-id-164'/>
      <parameter type-id='type-id-42'/>
      <parameter type-id='type-id-25'/>
      <parameter type-id='type-id-29'/>
      <parameter type-id='type-id-133'/>
      <parameter type-id='type-id-130'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-177'>
      <parameter type-id='type-id-164'/>
      <parameter type-id='type-id-42'/>
      <parameter type-id='type-id-25'/>
      <parameter type-id='type-id-29'/>
      <parameter type-id='type-id-145'/>
      <parameter type-id='type-id-130'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-173'>
      <parameter type-id='type-id-164'/>
      <parameter type-id='type-id-42'/>
      <parameter type-id='type-id-25'/>
      <parameter type-id='type-id-29'/>
      <parameter type-id='type-id-151'/>
      <parameter type-id='type-id-130'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-169'>
      <parameter type-id='type-id-164'/>
      <parameter type-id='type-id-42'/>
      <parameter type-id='type-id-25'/>
      <parameter type-id='type-id-29'/>
      <parameter type-id='type-id-157'/>
      <parameter type-id='type-id-130'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-181'>
      <parameter type-id='type-id-164'/>
      <parameter type-id='type-id-42'/>
      <parameter type-id='type-id-25'/>
      <parameter type-id='type-id-29'/>
      <parameter type-id='type-id-139'/>
      <parameter type-id='type-id-130'/>
      <return type-id='type-id-1'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='libnvpair_json.c' comp-dir-path='/home/allan/openzfs/lib/libnvpair' language='LANG_C99'>
    <function-decl name='nvlist_print_json' mangled-name='nvlist_print_json' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_print_json'>
      <parameter type-id='type-id-27' name='fp'/>
      <parameter type-id='type-id-25' name='nvl'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='fnvpair_value_string' mangled-name='fnvpair_value_string' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='libspl_assertf' mangled-name='libspl_assertf' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='fnvpair_value_int64' mangled-name='fnvpair_value_int64' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='fnvpair_value_byte' mangled-name='fnvpair_value_byte' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='fnvpair_value_int16' mangled-name='fnvpair_value_int16' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='fnvpair_value_uint16' mangled-name='fnvpair_value_uint16' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='fnvpair_value_int32' mangled-name='fnvpair_value_int32' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='fnvpair_value_uint32' mangled-name='fnvpair_value_uint32' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='fnvpair_value_uint64' mangled-name='fnvpair_value_uint64' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='fnvpair_value_nvlist' mangled-name='fnvpair_value_nvlist' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='fnvpair_value_boolean_value' mangled-name='fnvpair_value_boolean_value' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='fnvpair_value_int8' mangled-name='fnvpair_value_int8' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='fnvpair_value_uint8' mangled-name='fnvpair_value_uint8' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='__ctype_get_mb_cur_max' mangled-name='__ctype_get_mb_cur_max' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='mbrtowc' mangled-name='mbrtowc' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-16'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='nvpair_alloc_system.c' comp-dir-path='/home/allan/openzfs/lib/libnvpair' language='LANG_C99'>
    <class-decl name='nv_alloc' size-in-bits='128' is-struct='yes' visibility='default' id='type-id-228'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nva_ops' type-id='type-id-229' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='nva_arg' type-id='type-id-42' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='nv_alloc_ops' size-in-bits='320' is-struct='yes' visibility='default' id='type-id-230'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nv_ao_init' type-id='type-id-231' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='nv_ao_fini' type-id='type-id-232' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='nv_ao_alloc' type-id='type-id-233' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='nv_ao_free' type-id='type-id-234' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='nv_ao_reset' type-id='type-id-232' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='nv_alloc_t' type-id='type-id-228' id='type-id-235'/>
    <pointer-type-def type-id='type-id-235' size-in-bits='64' id='type-id-236'/>
    <class-decl name='__va_list_tag' size-in-bits='192' is-struct='yes' visibility='default' id='type-id-237'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='gp_offset' type-id='type-id-20' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='fp_offset' type-id='type-id-20' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='overflow_arg_area' type-id='type-id-42' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='reg_save_area' type-id='type-id-42' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-237' size-in-bits='64' id='type-id-238'/>
    <pointer-type-def type-id='type-id-239' size-in-bits='64' id='type-id-231'/>
    <pointer-type-def type-id='type-id-240' size-in-bits='64' id='type-id-232'/>
    <pointer-type-def type-id='type-id-241' size-in-bits='64' id='type-id-233'/>
    <pointer-type-def type-id='type-id-242' size-in-bits='64' id='type-id-234'/>
    <typedef-decl name='nv_alloc_ops_t' type-id='type-id-230' id='type-id-243'/>
    <qualified-type-def type-id='type-id-243' const='yes' id='type-id-244'/>
    <pointer-type-def type-id='type-id-244' size-in-bits='64' id='type-id-229'/>
    <var-decl name='nv_alloc_nosleep' type-id='type-id-236' mangled-name='nv_alloc_nosleep' visibility='default' elf-symbol-id='nv_alloc_nosleep'/>
    <function-type size-in-bits='64' id='type-id-239'>
      <parameter type-id='type-id-236'/>
      <parameter type-id='type-id-238'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-240'>
      <parameter type-id='type-id-236'/>
      <return type-id='type-id-16'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-242'>
      <parameter type-id='type-id-236'/>
      <parameter type-id='type-id-42'/>
      <parameter type-id='type-id-43'/>
      <return type-id='type-id-16'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-241'>
      <parameter type-id='type-id-236'/>
      <parameter type-id='type-id-43'/>
      <return type-id='type-id-42'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../../module/nvpair/nvpair_alloc_fixed.c' comp-dir-path='/home/allan/openzfs/lib/libnvpair' language='LANG_C99'>
    <var-decl name='nv_fixed_ops' type-id='type-id-229' mangled-name='nv_fixed_ops' visibility='default' elf-symbol-id='nv_fixed_ops'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../../module/nvpair/nvpair.c' comp-dir-path='/home/allan/openzfs/lib/libnvpair' language='LANG_C99'>
    <function-decl name='nvlist_xunpack' mangled-name='nvlist_xunpack' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_xunpack'>
      <parameter type-id='type-id-14' name='buf'/>
      <parameter type-id='type-id-43' name='buflen'/>
      <parameter type-id='type-id-162' name='nvlp'/>
      <parameter type-id='type-id-236' name='nva'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='nvlist_unpack' mangled-name='nvlist_unpack' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_unpack'>
      <parameter type-id='type-id-14' name='buf'/>
      <parameter type-id='type-id-43' name='buflen'/>
      <parameter type-id='type-id-162' name='nvlp'/>
      <parameter type-id='type-id-1' name='kmflag'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <pointer-type-def type-id='type-id-43' size-in-bits='64' id='type-id-245'/>
    <function-decl name='nvlist_pack' mangled-name='nvlist_pack' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_pack'>
      <parameter type-id='type-id-25' name='nvl'/>
      <parameter type-id='type-id-15' name='bufp'/>
      <parameter type-id='type-id-245' name='buflen'/>
      <parameter type-id='type-id-1' name='encoding'/>
      <parameter type-id='type-id-1' name='kmflag'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='nvlist_size' mangled-name='nvlist_size' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_size'>
      <parameter type-id='type-id-25' name='nvl'/>
      <parameter type-id='type-id-245' name='size'/>
      <parameter type-id='type-id-1' name='encoding'/>
      <return type-id='type-id-1'/>
    </function-decl>
