<abi-corpus version='2.0' path='libnvpair.so' architecture='elf-amd-x86_64' soname='libnvpair.so.3'>
  <elf-needed>
    <dependency name='libtirpc.so.3'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='dump_nvlist' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fnvlist_add_boolean' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fnvlist_add_boolean_array' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fnvlist_add_boolean_value' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fnvlist_add_byte' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fnvlist_add_byte_array' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fnvlist_add_int16' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fnvlist_add_int16_array' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fnvlist_add_int32' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='nvpair_value_nvlist' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_nvlist_array' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_string' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_string_array' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_uint16' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_uint16_array' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_uint32' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_uint32_array' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_uint64' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_uint64_array' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_uint8' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_uint8_array' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <elf-variable-symbols>
    <elf-symbol name='aok' size='4' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nv_alloc_nosleep' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nv_alloc_nosleep_def' size='16' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nv_alloc_sleep' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nv_alloc_sleep_def' size='16' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nv_fixed_ops' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nv_fixed_ops_def' size='40' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvlist_hashtable_init_size' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_max_recursion' size='4' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-variable-symbols>
  <abi-instr address-size='64' path='../../module/nvpair/fnvpair.c' comp-dir-path='/home/hutter2/release20/lib/libnvpair' language='LANG_C99'>
    <function-decl name='fnvlist_alloc' mangled-name='fnvlist_alloc' filepath='../../module/nvpair/fnvpair.c' line='51' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_alloc'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='fnvlist_free' mangled-name='fnvlist_free' filepath='../../module/nvpair/fnvpair.c' line='59' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_free'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='59' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fnvlist_size' mangled-name='fnvlist_size' filepath='../../module/nvpair/fnvpair.c' line='65' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_size'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='65' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='fnvlist_pack' mangled-name='fnvlist_pack' filepath='../../module/nvpair/fnvpair.c' line='77' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_pack'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='77' column='1'/>
      <parameter type-id='type-id-4' name='sizep' filepath='../../module/nvpair/fnvpair.c' line='77' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='fnvlist_pack_free' mangled-name='fnvlist_pack_free' filepath='../../module/nvpair/fnvpair.c' line='87' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_pack_free'>
      <parameter type-id='type-id-5' name='pack' filepath='../../module/nvpair/fnvpair.c' line='87' column='1'/>
      <parameter type-id='type-id-3' name='size' filepath='../../module/nvpair/fnvpair.c' line='87' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fnvlist_unpack' mangled-name='fnvlist_unpack' filepath='../../module/nvpair/fnvpair.c' line='97' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_unpack'>
      <parameter type-id='type-id-5' name='buf' filepath='../../module/nvpair/fnvpair.c' line='97' column='1'/>
      <parameter type-id='type-id-3' name='buflen' filepath='../../module/nvpair/fnvpair.c' line='97' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='fnvlist_dup' mangled-name='fnvlist_dup' filepath='../../module/nvpair/fnvpair.c' line='105' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_dup'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='105' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='fnvlist_merge' mangled-name='fnvlist_merge' filepath='../../module/nvpair/fnvpair.c' line='113' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_merge'>
      <parameter type-id='type-id-1' name='dst' filepath='../../module/nvpair/fnvpair.c' line='113' column='1'/>
      <parameter type-id='type-id-1' name='src' filepath='../../module/nvpair/fnvpair.c' line='113' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fnvlist_num_pairs' mangled-name='fnvlist_num_pairs' filepath='../../module/nvpair/fnvpair.c' line='119' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_num_pairs'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='119' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='fnvlist_add_boolean' mangled-name='fnvlist_add_boolean' filepath='../../module/nvpair/fnvpair.c' line='131' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_boolean'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='131' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='131' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fnvlist_add_boolean_value' mangled-name='fnvlist_add_boolean_value' filepath='../../module/nvpair/fnvpair.c' line='137' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_boolean_value'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='137' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='137' column='1'/>
      <parameter type-id='type-id-7' name='val' filepath='../../module/nvpair/fnvpair.c' line='137' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fnvlist_add_byte' mangled-name='fnvlist_add_byte' filepath='../../module/nvpair/fnvpair.c' line='143' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_byte'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='143' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='143' column='1'/>
      <parameter type-id='type-id-8' name='val' filepath='../../module/nvpair/fnvpair.c' line='143' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fnvlist_add_int8' mangled-name='fnvlist_add_int8' filepath='../../module/nvpair/fnvpair.c' line='149' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_int8'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='149' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='149' column='1'/>
      <parameter type-id='type-id-9' name='val' filepath='../../module/nvpair/fnvpair.c' line='149' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fnvlist_add_uint8' mangled-name='fnvlist_add_uint8' filepath='../../module/nvpair/fnvpair.c' line='155' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_uint8'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='155' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='155' column='1'/>
      <parameter type-id='type-id-10' name='val' filepath='../../module/nvpair/fnvpair.c' line='155' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fnvlist_add_int16' mangled-name='fnvlist_add_int16' filepath='../../module/nvpair/fnvpair.c' line='161' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_int16'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='161' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='161' column='1'/>
      <parameter type-id='type-id-11' name='val' filepath='../../module/nvpair/fnvpair.c' line='161' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fnvlist_add_uint16' mangled-name='fnvlist_add_uint16' filepath='../../module/nvpair/fnvpair.c' line='167' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_uint16'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='167' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='167' column='1'/>
      <parameter type-id='type-id-12' name='val' filepath='../../module/nvpair/fnvpair.c' line='167' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fnvlist_add_int32' mangled-name='fnvlist_add_int32' filepath='../../module/nvpair/fnvpair.c' line='173' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_int32'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='173' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='173' column='1'/>
      <parameter type-id='type-id-13' name='val' filepath='../../module/nvpair/fnvpair.c' line='173' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fnvlist_add_uint32' mangled-name='fnvlist_add_uint32' filepath='../../module/nvpair/fnvpair.c' line='179' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_uint32'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='179' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='179' column='1'/>
      <parameter type-id='type-id-14' name='val' filepath='../../module/nvpair/fnvpair.c' line='179' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fnvlist_add_int64' mangled-name='fnvlist_add_int64' filepath='../../module/nvpair/fnvpair.c' line='185' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_int64'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='185' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='185' column='1'/>
      <parameter type-id='type-id-15' name='val' filepath='../../module/nvpair/fnvpair.c' line='185' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fnvlist_add_uint64' mangled-name='fnvlist_add_uint64' filepath='../../module/nvpair/fnvpair.c' line='191' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_uint64'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='191' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='191' column='1'/>
      <parameter type-id='type-id-16' name='val' filepath='../../module/nvpair/fnvpair.c' line='191' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fnvlist_add_string' mangled-name='fnvlist_add_string' filepath='../../module/nvpair/fnvpair.c' line='197' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_string'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='197' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='197' column='1'/>
      <parameter type-id='type-id-6' name='val' filepath='../../module/nvpair/fnvpair.c' line='197' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fnvlist_add_nvlist' mangled-name='fnvlist_add_nvlist' filepath='../../module/nvpair/fnvpair.c' line='203' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_nvlist'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='203' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='203' column='1'/>
      <parameter type-id='type-id-1' name='val' filepath='../../module/nvpair/fnvpair.c' line='203' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fnvlist_add_nvpair' mangled-name='fnvlist_add_nvpair' filepath='../../module/nvpair/fnvpair.c' line='209' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_nvpair'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='209' column='1'/>
      <parameter type-id='type-id-17' name='pair' filepath='../../module/nvpair/fnvpair.c' line='209' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fnvlist_add_boolean_array' mangled-name='fnvlist_add_boolean_array' filepath='../../module/nvpair/fnvpair.c' line='215' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_boolean_array'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='215' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='215' column='1'/>
      <parameter type-id='type-id-18' name='val' filepath='../../module/nvpair/fnvpair.c' line='216' column='1'/>
      <parameter type-id='type-id-19' name='n' filepath='../../module/nvpair/fnvpair.c' line='216' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fnvlist_add_byte_array' mangled-name='fnvlist_add_byte_array' filepath='../../module/nvpair/fnvpair.c' line='222' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_byte_array'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='222' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='222' column='1'/>
      <parameter type-id='type-id-20' name='val' filepath='../../module/nvpair/fnvpair.c' line='222' column='1'/>
      <parameter type-id='type-id-19' name='n' filepath='../../module/nvpair/fnvpair.c' line='222' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fnvlist_add_int8_array' mangled-name='fnvlist_add_int8_array' filepath='../../module/nvpair/fnvpair.c' line='228' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_int8_array'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='228' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='228' column='1'/>
      <parameter type-id='type-id-21' name='val' filepath='../../module/nvpair/fnvpair.c' line='228' column='1'/>
      <parameter type-id='type-id-19' name='n' filepath='../../module/nvpair/fnvpair.c' line='228' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fnvlist_add_uint8_array' mangled-name='fnvlist_add_uint8_array' filepath='../../module/nvpair/fnvpair.c' line='234' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_uint8_array'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='234' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='234' column='1'/>
      <parameter type-id='type-id-22' name='val' filepath='../../module/nvpair/fnvpair.c' line='234' column='1'/>
      <parameter type-id='type-id-19' name='n' filepath='../../module/nvpair/fnvpair.c' line='234' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fnvlist_add_int16_array' mangled-name='fnvlist_add_int16_array' filepath='../../module/nvpair/fnvpair.c' line='240' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_int16_array'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='240' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='240' column='1'/>
      <parameter type-id='type-id-23' name='val' filepath='../../module/nvpair/fnvpair.c' line='240' column='1'/>
      <parameter type-id='type-id-19' name='n' filepath='../../module/nvpair/fnvpair.c' line='240' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fnvlist_add_uint16_array' mangled-name='fnvlist_add_uint16_array' filepath='../../module/nvpair/fnvpair.c' line='246' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_uint16_array'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='246' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='246' column='1'/>
      <parameter type-id='type-id-24' name='val' filepath='../../module/nvpair/fnvpair.c' line='247' column='1'/>
      <parameter type-id='type-id-19' name='n' filepath='../../module/nvpair/fnvpair.c' line='247' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fnvlist_add_int32_array' mangled-name='fnvlist_add_int32_array' filepath='../../module/nvpair/fnvpair.c' line='253' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_int32_array'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='253' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='253' column='1'/>
      <parameter type-id='type-id-25' name='val' filepath='../../module/nvpair/fnvpair.c' line='253' column='1'/>
      <parameter type-id='type-id-19' name='n' filepath='../../module/nvpair/fnvpair.c' line='253' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fnvlist_add_uint32_array' mangled-name='fnvlist_add_uint32_array' filepath='../../module/nvpair/fnvpair.c' line='259' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_uint32_array'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='259' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='259' column='1'/>
      <parameter type-id='type-id-26' name='val' filepath='../../module/nvpair/fnvpair.c' line='260' column='1'/>
      <parameter type-id='type-id-19' name='n' filepath='../../module/nvpair/fnvpair.c' line='260' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fnvlist_add_int64_array' mangled-name='fnvlist_add_int64_array' filepath='../../module/nvpair/fnvpair.c' line='266' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_int64_array'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='266' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='266' column='1'/>
      <parameter type-id='type-id-27' name='val' filepath='../../module/nvpair/fnvpair.c' line='266' column='1'/>
      <parameter type-id='type-id-19' name='n' filepath='../../module/nvpair/fnvpair.c' line='266' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fnvlist_add_uint64_array' mangled-name='fnvlist_add_uint64_array' filepath='../../module/nvpair/fnvpair.c' line='272' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_uint64_array'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='272' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='272' column='1'/>
      <parameter type-id='type-id-28' name='val' filepath='../../module/nvpair/fnvpair.c' line='273' column='1'/>
      <parameter type-id='type-id-19' name='n' filepath='../../module/nvpair/fnvpair.c' line='273' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fnvlist_add_string_array' mangled-name='fnvlist_add_string_array' filepath='../../module/nvpair/fnvpair.c' line='279' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_string_array'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='279' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='279' column='1'/>
      <parameter type-id='type-id-29' name='val' filepath='../../module/nvpair/fnvpair.c' line='280' column='1'/>
      <parameter type-id='type-id-19' name='n' filepath='../../module/nvpair/fnvpair.c' line='280' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fnvlist_add_nvlist_array' mangled-name='fnvlist_add_nvlist_array' filepath='../../module/nvpair/fnvpair.c' line='286' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_nvlist_array'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='286' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='286' column='1'/>
      <parameter type-id='type-id-30' name='val' filepath='../../module/nvpair/fnvpair.c' line='287' column='1'/>
      <parameter type-id='type-id-19' name='n' filepath='../../module/nvpair/fnvpair.c' line='287' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fnvlist_remove' mangled-name='fnvlist_remove' filepath='../../module/nvpair/fnvpair.c' line='293' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_remove'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='293' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='293' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fnvlist_remove_nvpair' mangled-name='fnvlist_remove_nvpair' filepath='../../module/nvpair/fnvpair.c' line='299' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_remove_nvpair'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='299' column='1'/>
      <parameter type-id='type-id-17' name='pair' filepath='../../module/nvpair/fnvpair.c' line='299' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_nvpair' mangled-name='fnvlist_lookup_nvpair' filepath='../../module/nvpair/fnvpair.c' line='305' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_lookup_nvpair'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='305' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='305' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_boolean' mangled-name='fnvlist_lookup_boolean' filepath='../../module/nvpair/fnvpair.c' line='314' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_lookup_boolean'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='314' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='314' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_boolean_value' mangled-name='fnvlist_lookup_boolean_value' filepath='../../module/nvpair/fnvpair.c' line='320' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_lookup_boolean_value'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='320' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='320' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_byte' mangled-name='fnvlist_lookup_byte' filepath='../../module/nvpair/fnvpair.c' line='328' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_lookup_byte'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='328' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='328' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_int8' mangled-name='fnvlist_lookup_int8' filepath='../../module/nvpair/fnvpair.c' line='336' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_lookup_int8'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='336' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='336' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_int16' mangled-name='fnvlist_lookup_int16' filepath='../../module/nvpair/fnvpair.c' line='344' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_lookup_int16'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='344' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='344' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_int32' mangled-name='fnvlist_lookup_int32' filepath='../../module/nvpair/fnvpair.c' line='352' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_lookup_int32'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='352' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='352' column='1'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_int64' mangled-name='fnvlist_lookup_int64' filepath='../../module/nvpair/fnvpair.c' line='360' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_lookup_int64'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='360' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='360' column='1'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_uint8' mangled-name='fnvlist_lookup_uint8' filepath='../../module/nvpair/fnvpair.c' line='368' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_lookup_uint8'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='368' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='368' column='1'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_uint16' mangled-name='fnvlist_lookup_uint16' filepath='../../module/nvpair/fnvpair.c' line='376' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_lookup_uint16'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='376' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='376' column='1'/>
      <return type-id='type-id-12'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_uint32' mangled-name='fnvlist_lookup_uint32' filepath='../../module/nvpair/fnvpair.c' line='384' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_lookup_uint32'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='384' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='384' column='1'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_uint64' mangled-name='fnvlist_lookup_uint64' filepath='../../module/nvpair/fnvpair.c' line='392' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_lookup_uint64'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='392' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='392' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_string' mangled-name='fnvlist_lookup_string' filepath='../../module/nvpair/fnvpair.c' line='400' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_lookup_string'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='400' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='400' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_nvlist' mangled-name='fnvlist_lookup_nvlist' filepath='../../module/nvpair/fnvpair.c' line='408' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_lookup_nvlist'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='408' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='408' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_boolean_array' mangled-name='fnvlist_lookup_boolean_array' filepath='../../module/nvpair/fnvpair.c' line='415' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_lookup_boolean_array'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='415' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='415' column='1'/>
      <parameter type-id='type-id-31' name='n' filepath='../../module/nvpair/fnvpair.c' line='415' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_byte_array' mangled-name='fnvlist_lookup_byte_array' filepath='../../module/nvpair/fnvpair.c' line='423' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_lookup_byte_array'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='423' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='423' column='1'/>
      <parameter type-id='type-id-31' name='n' filepath='../../module/nvpair/fnvpair.c' line='423' column='1'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_int8_array' mangled-name='fnvlist_lookup_int8_array' filepath='../../module/nvpair/fnvpair.c' line='431' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_lookup_int8_array'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='431' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='431' column='1'/>
      <parameter type-id='type-id-31' name='n' filepath='../../module/nvpair/fnvpair.c' line='431' column='1'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_uint8_array' mangled-name='fnvlist_lookup_uint8_array' filepath='../../module/nvpair/fnvpair.c' line='439' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_lookup_uint8_array'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='439' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='439' column='1'/>
      <parameter type-id='type-id-31' name='n' filepath='../../module/nvpair/fnvpair.c' line='439' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_int16_array' mangled-name='fnvlist_lookup_int16_array' filepath='../../module/nvpair/fnvpair.c' line='447' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_lookup_int16_array'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='447' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='447' column='1'/>
      <parameter type-id='type-id-31' name='n' filepath='../../module/nvpair/fnvpair.c' line='447' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_uint16_array' mangled-name='fnvlist_lookup_uint16_array' filepath='../../module/nvpair/fnvpair.c' line='455' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_lookup_uint16_array'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='455' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='455' column='1'/>
      <parameter type-id='type-id-31' name='n' filepath='../../module/nvpair/fnvpair.c' line='455' column='1'/>
      <return type-id='type-id-24'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_int32_array' mangled-name='fnvlist_lookup_int32_array' filepath='../../module/nvpair/fnvpair.c' line='463' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_lookup_int32_array'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='463' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='463' column='1'/>
      <parameter type-id='type-id-31' name='n' filepath='../../module/nvpair/fnvpair.c' line='463' column='1'/>
      <return type-id='type-id-25'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_uint32_array' mangled-name='fnvlist_lookup_uint32_array' filepath='../../module/nvpair/fnvpair.c' line='471' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_lookup_uint32_array'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='471' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='471' column='1'/>
      <parameter type-id='type-id-31' name='n' filepath='../../module/nvpair/fnvpair.c' line='471' column='1'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_int64_array' mangled-name='fnvlist_lookup_int64_array' filepath='../../module/nvpair/fnvpair.c' line='479' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_lookup_int64_array'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='479' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='479' column='1'/>
      <parameter type-id='type-id-31' name='n' filepath='../../module/nvpair/fnvpair.c' line='479' column='1'/>
      <return type-id='type-id-27'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_uint64_array' mangled-name='fnvlist_lookup_uint64_array' filepath='../../module/nvpair/fnvpair.c' line='487' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_lookup_uint64_array'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='487' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='487' column='1'/>
      <parameter type-id='type-id-31' name='n' filepath='../../module/nvpair/fnvpair.c' line='487' column='1'/>
      <return type-id='type-id-28'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../../module/nvpair/nvpair.c' comp-dir-path='/home/hutter2/release20/lib/libnvpair' language='LANG_C99'>
    <typedef-decl name='__u_short' type-id='type-id-32' filepath='/usr/include/bits/types.h' line='32' column='1' id='type-id-33'/>
    <typedef-decl name='__u_int' type-id='type-id-34' filepath='/usr/include/bits/types.h' line='33' column='1' id='type-id-35'/>
    <typedef-decl name='__quad_t' type-id='type-id-36' filepath='/usr/include/bits/types.h' line='63' column='1' id='type-id-37'/>
    <typedef-decl name='__u_quad_t' type-id='type-id-38' filepath='/usr/include/bits/types.h' line='64' column='1' id='type-id-39'/>
    <typedef-decl name='u_short' type-id='type-id-33' filepath='/usr/include/sys/types.h' line='34' column='1' id='type-id-40'/>
    <typedef-decl name='u_int' type-id='type-id-35' filepath='/usr/include/sys/types.h' line='35' column='1' id='type-id-41'/>
    <typedef-decl name='quad_t' type-id='type-id-37' filepath='/usr/include/sys/types.h' line='37' column='1' id='type-id-42'/>
    <typedef-decl name='u_quad_t' type-id='type-id-39' filepath='/usr/include/sys/types.h' line='38' column='1' id='type-id-43'/>
    <typedef-decl name='bool_t' type-id='type-id-13' filepath='/usr/include/tirpc/rpc/types.h' line='43' column='1' id='type-id-44'/>
    <enum-decl name='xdr_op' filepath='/usr/include/tirpc/rpc/xdr.h' line='83' column='1' id='type-id-45'>
      <underlying-type type-id='type-id-46'/>
      <enumerator name='XDR_ENCODE' value='0'/>
      <enumerator name='XDR_DECODE' value='1'/>
      <enumerator name='XDR_FREE' value='2'/>
    </enum-decl>
    <class-decl name='__rpc_xdr' size-in-bits='384' is-struct='yes' visibility='default' filepath='/usr/include/tirpc/rpc/xdr.h' line='102' column='1' id='type-id-47'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='x_op' type-id='type-id-45' visibility='default' filepath='/usr/include/tirpc/rpc/xdr.h' line='103' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='x_ops' type-id='type-id-48' visibility='default' filepath='/usr/include/tirpc/rpc/xdr.h' line='122' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='x_public' type-id='type-id-5' visibility='default' filepath='/usr/include/tirpc/rpc/xdr.h' line='123' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='x_private' type-id='type-id-49' visibility='default' filepath='/usr/include/tirpc/rpc/xdr.h' line='124' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='x_base' type-id='type-id-5' visibility='default' filepath='/usr/include/tirpc/rpc/xdr.h' line='125' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='x_handy' type-id='type-id-41' visibility='default' filepath='/usr/include/tirpc/rpc/xdr.h' line='126' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='xdr_ops' size-in-bits='576' is-struct='yes' visibility='default' filepath='/usr/include/tirpc/rpc/xdr.h' line='104' column='1' id='type-id-50'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='x_getlong' type-id='type-id-51' visibility='default' filepath='/usr/include/tirpc/rpc/xdr.h' line='106' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='x_putlong' type-id='type-id-52' visibility='default' filepath='/usr/include/tirpc/rpc/xdr.h' line='108' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='x_getbytes' type-id='type-id-53' visibility='default' filepath='/usr/include/tirpc/rpc/xdr.h' line='110' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='x_putbytes' type-id='type-id-54' visibility='default' filepath='/usr/include/tirpc/rpc/xdr.h' line='112' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='x_getpostn' type-id='type-id-55' visibility='default' filepath='/usr/include/tirpc/rpc/xdr.h' line='114' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='x_setpostn' type-id='type-id-56' visibility='default' filepath='/usr/include/tirpc/rpc/xdr.h' line='116' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='x_inline' type-id='type-id-57' visibility='default' filepath='/usr/include/tirpc/rpc/xdr.h' line='118' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='x_destroy' type-id='type-id-58' visibility='default' filepath='/usr/include/tirpc/rpc/xdr.h' line='120' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='x_control' type-id='type-id-59' visibility='default' filepath='/usr/include/tirpc/rpc/xdr.h' line='121' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='XDR' type-id='type-id-47' filepath='/usr/include/tirpc/rpc/xdr.h' line='127' column='1' id='type-id-60'/>
    <typedef-decl name='xdrproc_t' type-id='type-id-61' filepath='/usr/include/tirpc/rpc/xdr.h' line='143' column='1' id='type-id-62'/>
    <pointer-type-def type-id='type-id-60' size-in-bits='64' id='type-id-63'/>
    <pointer-type-def type-id='type-id-47' size-in-bits='64' id='type-id-64'/>
    <qualified-type-def type-id='type-id-5' const='yes' id='type-id-65'/>
    <pointer-type-def type-id='type-id-65' size-in-bits='64' id='type-id-29'/>
    <qualified-type-def type-id='type-id-66' restrict='yes' id='type-id-67'/>
    <qualified-type-def type-id='type-id-36' const='yes' id='type-id-68'/>
    <pointer-type-def type-id='type-id-68' size-in-bits='64' id='type-id-69'/>
    <qualified-type-def type-id='type-id-50' const='yes' id='type-id-70'/>
    <pointer-type-def type-id='type-id-70' size-in-bits='64' id='type-id-48'/>
    <pointer-type-def type-id='type-id-71' size-in-bits='64' id='type-id-72'/>
    <pointer-type-def type-id='type-id-73' size-in-bits='64' id='type-id-57'/>
    <pointer-type-def type-id='type-id-36' size-in-bits='64' id='type-id-74'/>
    <pointer-type-def type-id='type-id-17' size-in-bits='64' id='type-id-75'/>
    <pointer-type-def type-id='type-id-42' size-in-bits='64' id='type-id-76'/>
    <pointer-type-def type-id='type-id-77' size-in-bits='64' id='type-id-78'/>
    <pointer-type-def type-id='type-id-3' size-in-bits='64' id='type-id-4'/>
    <pointer-type-def type-id='type-id-79' size-in-bits='64' id='type-id-61'/>
    <pointer-type-def type-id='type-id-80' size-in-bits='64' id='type-id-53'/>
    <pointer-type-def type-id='type-id-81' size-in-bits='64' id='type-id-54'/>
    <pointer-type-def type-id='type-id-82' size-in-bits='64' id='type-id-52'/>
    <pointer-type-def type-id='type-id-83' size-in-bits='64' id='type-id-59'/>
    <pointer-type-def type-id='type-id-84' size-in-bits='64' id='type-id-51'/>
    <pointer-type-def type-id='type-id-85' size-in-bits='64' id='type-id-56'/>
    <pointer-type-def type-id='type-id-86' size-in-bits='64' id='type-id-55'/>
    <pointer-type-def type-id='type-id-41' size-in-bits='64' id='type-id-87'/>
    <pointer-type-def type-id='type-id-43' size-in-bits='64' id='type-id-88'/>
    <pointer-type-def type-id='type-id-40' size-in-bits='64' id='type-id-89'/>
    <pointer-type-def type-id='type-id-90' size-in-bits='64' id='type-id-58'/>
    <var-decl name='nvpair_max_recursion' type-id='type-id-71' mangled-name='nvpair_max_recursion' visibility='default' filepath='../../module/nvpair/nvpair.c' line='151' column='1' elf-symbol-id='nvpair_max_recursion'/>
    <var-decl name='nvlist_hashtable_init_size' type-id='type-id-16' mangled-name='nvlist_hashtable_init_size' visibility='default' filepath='../../module/nvpair/nvpair.c' line='154' column='1' elf-symbol-id='nvlist_hashtable_init_size'/>
    <function-decl name='nv_alloc_init' mangled-name='nv_alloc_init' filepath='../../module/nvpair/nvpair.c' line='157' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nv_alloc_init'>
      <parameter type-id='type-id-91' name='nva' filepath='../../module/nvpair/nvpair.c' line='157' column='1'/>
      <parameter type-id='type-id-92' name='nvo' filepath='../../module/nvpair/nvpair.c' line='157' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-71'/>
    </function-decl>
    <function-decl name='nv_alloc_reset' mangled-name='nv_alloc_reset' filepath='../../module/nvpair/nvpair.c' line='174' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nv_alloc_reset'>
      <parameter type-id='type-id-91' name='nva' filepath='../../module/nvpair/nvpair.c' line='174' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nv_alloc_fini' mangled-name='nv_alloc_fini' filepath='../../module/nvpair/nvpair.c' line='181' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nv_alloc_fini'>
      <parameter type-id='type-id-91' name='nva' filepath='../../module/nvpair/nvpair.c' line='181' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_lookup_nv_alloc' mangled-name='nvlist_lookup_nv_alloc' filepath='../../module/nvpair/nvpair.c' line='188' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_nv_alloc'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='188' column='1'/>
      <return type-id='type-id-91'/>
    </function-decl>
    <function-decl name='nvlist_nvflag' mangled-name='nvlist_nvflag' filepath='../../module/nvpair/nvpair.c' line='561' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_nvflag'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='561' column='1'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='nvlist_alloc' mangled-name='nvlist_alloc' filepath='../../module/nvpair/nvpair.c' line='587' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_alloc'>
      <parameter type-id='type-id-30' name='nvlp' filepath='../../module/nvpair/nvpair.c' line='587' column='1'/>
      <parameter type-id='type-id-19' name='nvflag' filepath='../../module/nvpair/nvpair.c' line='587' column='1'/>
      <parameter type-id='type-id-71' name='kmflag' filepath='../../module/nvpair/nvpair.c' line='587' column='1'/>
      <return type-id='type-id-71'/>
    </function-decl>
    <function-decl name='nvlist_xalloc' mangled-name='nvlist_xalloc' filepath='../../module/nvpair/nvpair.c' line='593' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_xalloc'>
      <parameter type-id='type-id-30' name='nvlp' filepath='../../module/nvpair/nvpair.c' line='593' column='1'/>
      <parameter type-id='type-id-19' name='nvflag' filepath='../../module/nvpair/nvpair.c' line='593' column='1'/>
      <parameter type-id='type-id-91' name='nva' filepath='../../module/nvpair/nvpair.c' line='593' column='1'/>
      <return type-id='type-id-71'/>
    </function-decl>
    <function-decl name='nvlist_free' mangled-name='nvlist_free' filepath='../../module/nvpair/nvpair.c' line='868' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_free'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='868' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_dup' mangled-name='nvlist_dup' filepath='../../module/nvpair/nvpair.c' line='918' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_dup'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='918' column='1'/>
      <parameter type-id='type-id-30' name='nvlp' filepath='../../module/nvpair/nvpair.c' line='918' column='1'/>
      <parameter type-id='type-id-71' name='kmflag' filepath='../../module/nvpair/nvpair.c' line='918' column='1'/>
      <return type-id='type-id-71'/>
    </function-decl>
    <function-decl name='nvlist_xdup' mangled-name='nvlist_xdup' filepath='../../module/nvpair/nvpair.c' line='924' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_xdup'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='924' column='1'/>
      <parameter type-id='type-id-30' name='nvlp' filepath='../../module/nvpair/nvpair.c' line='924' column='1'/>
      <parameter type-id='type-id-91' name='nva' filepath='../../module/nvpair/nvpair.c' line='924' column='1'/>
      <return type-id='type-id-71'/>
    </function-decl>
    <function-decl name='nvlist_remove_all' mangled-name='nvlist_remove_all' filepath='../../module/nvpair/nvpair.c' line='947' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_remove_all'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='947' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='947' column='1'/>
      <return type-id='type-id-71'/>
    </function-decl>
    <function-decl name='nvlist_remove' mangled-name='nvlist_remove' filepath='../../module/nvpair/nvpair.c' line='967' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_remove'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='967' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='967' column='1'/>
      <parameter type-id='type-id-93' name='type' filepath='../../module/nvpair/nvpair.c' line='967' column='1'/>
      <return type-id='type-id-71'/>
    </function-decl>
    <function-decl name='nvlist_remove_nvpair' mangled-name='nvlist_remove_nvpair' filepath='../../module/nvpair/nvpair.c' line='980' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_remove_nvpair'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='980' column='1'/>
      <parameter type-id='type-id-17' name='nvp' filepath='../../module/nvpair/nvpair.c' line='980' column='1'/>
      <return type-id='type-id-71'/>
    </function-decl>
    <function-decl name='nvlist_add_boolean' mangled-name='nvlist_add_boolean' filepath='../../module/nvpair/nvpair.c' line='1278' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_boolean'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1278' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1278' column='1'/>
      <return type-id='type-id-71'/>
    </function-decl>
    <function-decl name='nvlist_add_boolean_value' mangled-name='nvlist_add_boolean_value' filepath='../../module/nvpair/nvpair.c' line='1284' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_boolean_value'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1284' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1284' column='1'/>
      <parameter type-id='type-id-7' name='val' filepath='../../module/nvpair/nvpair.c' line='1284' column='1'/>
      <return type-id='type-id-71'/>
    </function-decl>
    <function-decl name='nvlist_add_byte' mangled-name='nvlist_add_byte' filepath='../../module/nvpair/nvpair.c' line='1290' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_byte'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1290' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1290' column='1'/>
      <parameter type-id='type-id-8' name='val' filepath='../../module/nvpair/nvpair.c' line='1290' column='1'/>
      <return type-id='type-id-71'/>
    </function-decl>
    <function-decl name='nvlist_add_int8' mangled-name='nvlist_add_int8' filepath='../../module/nvpair/nvpair.c' line='1296' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_int8'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1296' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1296' column='1'/>
      <parameter type-id='type-id-9' name='val' filepath='../../module/nvpair/nvpair.c' line='1296' column='1'/>
      <return type-id='type-id-71'/>
    </function-decl>
    <function-decl name='nvlist_add_uint8' mangled-name='nvlist_add_uint8' filepath='../../module/nvpair/nvpair.c' line='1302' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_uint8'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1302' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1302' column='1'/>
      <parameter type-id='type-id-10' name='val' filepath='../../module/nvpair/nvpair.c' line='1302' column='1'/>
      <return type-id='type-id-71'/>
    </function-decl>
    <function-decl name='nvlist_add_int16' mangled-name='nvlist_add_int16' filepath='../../module/nvpair/nvpair.c' line='1308' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_int16'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1308' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1308' column='1'/>
      <parameter type-id='type-id-11' name='val' filepath='../../module/nvpair/nvpair.c' line='1308' column='1'/>
      <return type-id='type-id-71'/>
    </function-decl>
    <function-decl name='nvlist_add_uint16' mangled-name='nvlist_add_uint16' filepath='../../module/nvpair/nvpair.c' line='1314' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_uint16'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1314' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1314' column='1'/>
      <parameter type-id='type-id-12' name='val' filepath='../../module/nvpair/nvpair.c' line='1314' column='1'/>
      <return type-id='type-id-71'/>
    </function-decl>
    <function-decl name='nvlist_add_int32' mangled-name='nvlist_add_int32' filepath='../../module/nvpair/nvpair.c' line='1320' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_int32'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1320' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1320' column='1'/>
      <parameter type-id='type-id-13' name='val' filepath='../../module/nvpair/nvpair.c' line='1320' column='1'/>
      <return type-id='type-id-71'/>
    </function-decl>
    <function-decl name='nvlist_add_uint32' mangled-name='nvlist_add_uint32' filepath='../../module/nvpair/nvpair.c' line='1326' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_uint32'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1326' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1326' column='1'/>
      <parameter type-id='type-id-14' name='val' filepath='../../module/nvpair/nvpair.c' line='1326' column='1'/>
      <return type-id='type-id-71'/>
    </function-decl>
    <function-decl name='nvlist_add_int64' mangled-name='nvlist_add_int64' filepath='../../module/nvpair/nvpair.c' line='1332' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_int64'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1332' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1332' column='1'/>
      <parameter type-id='type-id-15' name='val' filepath='../../module/nvpair/nvpair.c' line='1332' column='1'/>
      <return type-id='type-id-71'/>
    </function-decl>
    <function-decl name='nvlist_add_uint64' mangled-name='nvlist_add_uint64' filepath='../../module/nvpair/nvpair.c' line='1338' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_uint64'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1338' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1338' column='1'/>
      <parameter type-id='type-id-16' name='val' filepath='../../module/nvpair/nvpair.c' line='1338' column='1'/>
      <return type-id='type-id-71'/>
    </function-decl>
    <function-decl name='nvlist_add_double' mangled-name='nvlist_add_double' filepath='../../module/nvpair/nvpair.c' line='1345' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_double'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1345' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1345' column='1'/>
      <parameter type-id='type-id-94' name='val' filepath='../../module/nvpair/nvpair.c' line='1345' column='1'/>
      <return type-id='type-id-71'/>
    </function-decl>
    <function-decl name='nvlist_add_string' mangled-name='nvlist_add_string' filepath='../../module/nvpair/nvpair.c' line='1352' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_string'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1352' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1352' column='1'/>
      <parameter type-id='type-id-6' name='val' filepath='../../module/nvpair/nvpair.c' line='1352' column='1'/>
      <return type-id='type-id-71'/>
    </function-decl>
    <function-decl name='nvlist_add_boolean_array' mangled-name='nvlist_add_boolean_array' filepath='../../module/nvpair/nvpair.c' line='1358' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_boolean_array'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1358' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1358' column='1'/>
      <parameter type-id='type-id-18' name='a' filepath='../../module/nvpair/nvpair.c' line='1359' column='1'/>
      <parameter type-id='type-id-19' name='n' filepath='../../module/nvpair/nvpair.c' line='1359' column='1'/>
      <return type-id='type-id-71'/>
    </function-decl>
    <function-decl name='nvlist_add_byte_array' mangled-name='nvlist_add_byte_array' filepath='../../module/nvpair/nvpair.c' line='1365' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_byte_array'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1365' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1365' column='1'/>
      <parameter type-id='type-id-20' name='a' filepath='../../module/nvpair/nvpair.c' line='1365' column='1'/>
      <parameter type-id='type-id-19' name='n' filepath='../../module/nvpair/nvpair.c' line='1365' column='1'/>
      <return type-id='type-id-71'/>
    </function-decl>
    <function-decl name='nvlist_add_int8_array' mangled-name='nvlist_add_int8_array' filepath='../../module/nvpair/nvpair.c' line='1371' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_int8_array'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1371' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1371' column='1'/>
      <parameter type-id='type-id-21' name='a' filepath='../../module/nvpair/nvpair.c' line='1371' column='1'/>
      <parameter type-id='type-id-19' name='n' filepath='../../module/nvpair/nvpair.c' line='1371' column='1'/>
      <return type-id='type-id-71'/>
    </function-decl>
    <function-decl name='nvlist_add_uint8_array' mangled-name='nvlist_add_uint8_array' filepath='../../module/nvpair/nvpair.c' line='1377' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_uint8_array'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1377' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1377' column='1'/>
      <parameter type-id='type-id-22' name='a' filepath='../../module/nvpair/nvpair.c' line='1377' column='1'/>
      <parameter type-id='type-id-19' name='n' filepath='../../module/nvpair/nvpair.c' line='1377' column='1'/>
      <return type-id='type-id-71'/>
    </function-decl>
    <function-decl name='nvlist_add_int16_array' mangled-name='nvlist_add_int16_array' filepath='../../module/nvpair/nvpair.c' line='1383' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_int16_array'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1383' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1383' column='1'/>
      <parameter type-id='type-id-23' name='a' filepath='../../module/nvpair/nvpair.c' line='1383' column='1'/>
      <parameter type-id='type-id-19' name='n' filepath='../../module/nvpair/nvpair.c' line='1383' column='1'/>
      <return type-id='type-id-71'/>
    </function-decl>
    <function-decl name='nvlist_add_uint16_array' mangled-name='nvlist_add_uint16_array' filepath='../../module/nvpair/nvpair.c' line='1389' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_uint16_array'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1389' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1389' column='1'/>
      <parameter type-id='type-id-24' name='a' filepath='../../module/nvpair/nvpair.c' line='1389' column='1'/>
      <parameter type-id='type-id-19' name='n' filepath='../../module/nvpair/nvpair.c' line='1389' column='1'/>
      <return type-id='type-id-71'/>
    </function-decl>
    <function-decl name='nvlist_add_int32_array' mangled-name='nvlist_add_int32_array' filepath='../../module/nvpair/nvpair.c' line='1395' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_int32_array'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1395' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1395' column='1'/>
      <parameter type-id='type-id-25' name='a' filepath='../../module/nvpair/nvpair.c' line='1395' column='1'/>
      <parameter type-id='type-id-19' name='n' filepath='../../module/nvpair/nvpair.c' line='1395' column='1'/>
      <return type-id='type-id-71'/>
    </function-decl>
    <function-decl name='nvlist_add_uint32_array' mangled-name='nvlist_add_uint32_array' filepath='../../module/nvpair/nvpair.c' line='1401' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_uint32_array'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1401' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1401' column='1'/>
      <parameter type-id='type-id-26' name='a' filepath='../../module/nvpair/nvpair.c' line='1401' column='1'/>
      <parameter type-id='type-id-19' name='n' filepath='../../module/nvpair/nvpair.c' line='1401' column='1'/>
      <return type-id='type-id-71'/>
    </function-decl>
    <function-decl name='nvlist_add_int64_array' mangled-name='nvlist_add_int64_array' filepath='../../module/nvpair/nvpair.c' line='1407' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_int64_array'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1407' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1407' column='1'/>
      <parameter type-id='type-id-27' name='a' filepath='../../module/nvpair/nvpair.c' line='1407' column='1'/>
      <parameter type-id='type-id-19' name='n' filepath='../../module/nvpair/nvpair.c' line='1407' column='1'/>
      <return type-id='type-id-71'/>
    </function-decl>
    <function-decl name='nvlist_add_uint64_array' mangled-name='nvlist_add_uint64_array' filepath='../../module/nvpair/nvpair.c' line='1413' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_uint64_array'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1413' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1413' column='1'/>
      <parameter type-id='type-id-28' name='a' filepath='../../module/nvpair/nvpair.c' line='1413' column='1'/>
      <parameter type-id='type-id-19' name='n' filepath='../../module/nvpair/nvpair.c' line='1413' column='1'/>
      <return type-id='type-id-71'/>
    </function-decl>
    <function-decl name='nvlist_add_string_array' mangled-name='nvlist_add_string_array' filepath='../../module/nvpair/nvpair.c' line='1419' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_string_array'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1419' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1419' column='1'/>
      <parameter type-id='type-id-29' name='a' filepath='../../module/nvpair/nvpair.c' line='1420' column='1'/>
      <parameter type-id='type-id-19' name='n' filepath='../../module/nvpair/nvpair.c' line='1420' column='1'/>
      <return type-id='type-id-71'/>
    </function-decl>
    <function-decl name='nvlist_add_hrtime' mangled-name='nvlist_add_hrtime' filepath='../../module/nvpair/nvpair.c' line='1426' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_hrtime'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1426' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1426' column='1'/>
      <parameter type-id='type-id-95' name='val' filepath='../../module/nvpair/nvpair.c' line='1426' column='1'/>
      <return type-id='type-id-71'/>
    </function-decl>
    <function-decl name='nvlist_add_nvlist' mangled-name='nvlist_add_nvlist' filepath='../../module/nvpair/nvpair.c' line='1432' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_nvlist'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1432' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1432' column='1'/>
      <parameter type-id='type-id-1' name='val' filepath='../../module/nvpair/nvpair.c' line='1432' column='1'/>
      <return type-id='type-id-71'/>
    </function-decl>
    <function-decl name='nvlist_add_nvlist_array' mangled-name='nvlist_add_nvlist_array' filepath='../../module/nvpair/nvpair.c' line='1438' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_nvlist_array'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1438' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1438' column='1'/>
      <parameter type-id='type-id-30' name='a' filepath='../../module/nvpair/nvpair.c' line='1438' column='1'/>
      <parameter type-id='type-id-19' name='n' filepath='../../module/nvpair/nvpair.c' line='1438' column='1'/>
      <return type-id='type-id-71'/>
    </function-decl>
    <function-decl name='nvlist_prev_nvpair' mangled-name='nvlist_prev_nvpair' filepath='../../module/nvpair/nvpair.c' line='1474' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prev_nvpair'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1474' column='1'/>
      <parameter type-id='type-id-17' name='nvp' filepath='../../module/nvpair/nvpair.c' line='1474' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='nvlist_empty' mangled-name='nvlist_empty' filepath='../../module/nvpair/nvpair.c' line='1498' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_empty'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1498' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='nvlist_lookup_boolean' mangled-name='nvlist_lookup_boolean' filepath='../../module/nvpair/nvpair.c' line='1638' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_boolean'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1638' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1638' column='1'/>
      <return type-id='type-id-71'/>
    </function-decl>
    <function-decl name='nvlist_lookup_boolean_value' mangled-name='nvlist_lookup_boolean_value' filepath='../../module/nvpair/nvpair.c' line='1644' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_boolean_value'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1644' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1644' column='1'/>
      <parameter type-id='type-id-18' name='val' filepath='../../module/nvpair/nvpair.c' line='1644' column='1'/>
      <return type-id='type-id-71'/>
    </function-decl>
    <function-decl name='nvlist_lookup_byte' mangled-name='nvlist_lookup_byte' filepath='../../module/nvpair/nvpair.c' line='1651' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_byte'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1651' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1651' column='1'/>
      <parameter type-id='type-id-20' name='val' filepath='../../module/nvpair/nvpair.c' line='1651' column='1'/>
      <return type-id='type-id-71'/>
    </function-decl>
    <function-decl name='nvlist_lookup_int8' mangled-name='nvlist_lookup_int8' filepath='../../module/nvpair/nvpair.c' line='1657' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_int8'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1657' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1657' column='1'/>
      <parameter type-id='type-id-21' name='val' filepath='../../module/nvpair/nvpair.c' line='1657' column='1'/>
      <return type-id='type-id-71'/>
    </function-decl>
    <function-decl name='nvlist_lookup_uint8' mangled-name='nvlist_lookup_uint8' filepath='../../module/nvpair/nvpair.c' line='1663' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_uint8'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1663' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1663' column='1'/>
      <parameter type-id='type-id-22' name='val' filepath='../../module/nvpair/nvpair.c' line='1663' column='1'/>
      <return type-id='type-id-71'/>
    </function-decl>
    <function-decl name='nvlist_lookup_int16' mangled-name='nvlist_lookup_int16' filepath='../../module/nvpair/nvpair.c' line='1669' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_int16'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1669' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1669' column='1'/>
      <parameter type-id='type-id-23' name='val' filepath='../../module/nvpair/nvpair.c' line='1669' column='1'/>
      <return type-id='type-id-71'/>
    </function-decl>
    <function-decl name='nvlist_lookup_uint16' mangled-name='nvlist_lookup_uint16' filepath='../../module/nvpair/nvpair.c' line='1675' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_uint16'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1675' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1675' column='1'/>
      <parameter type-id='type-id-24' name='val' filepath='../../module/nvpair/nvpair.c' line='1675' column='1'/>
      <return type-id='type-id-71'/>
    </function-decl>
    <function-decl name='nvlist_lookup_int32' mangled-name='nvlist_lookup_int32' filepath='../../module/nvpair/nvpair.c' line='1681' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_int32'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1681' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1681' column='1'/>
      <parameter type-id='type-id-25' name='val' filepath='../../module/nvpair/nvpair.c' line='1681' column='1'/>
      <return type-id='type-id-71'/>
    </function-decl>
    <function-decl name='nvlist_lookup_uint32' mangled-name='nvlist_lookup_uint32' filepath='../../module/nvpair/nvpair.c' line='1687' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_uint32'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1687' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1687' column='1'/>
      <parameter type-id='type-id-26' name='val' filepath='../../module/nvpair/nvpair.c' line='1687' column='1'/>
      <return type-id='type-id-71'/>
    </function-decl>
    <function-decl name='nvlist_lookup_int64' mangled-name='nvlist_lookup_int64' filepath='../../module/nvpair/nvpair.c' line='1693' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_int64'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1693' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1693' column='1'/>
      <parameter type-id='type-id-27' name='val' filepath='../../module/nvpair/nvpair.c' line='1693' column='1'/>
      <return type-id='type-id-71'/>
    </function-decl>
    <function-decl name='nvlist_lookup_uint64' mangled-name='nvlist_lookup_uint64' filepath='../../module/nvpair/nvpair.c' line='1699' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_uint64'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1699' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1699' column='1'/>
      <parameter type-id='type-id-28' name='val' filepath='../../module/nvpair/nvpair.c' line='1699' column='1'/>
      <return type-id='type-id-71'/>
    </function-decl>
    <function-decl name='nvlist_lookup_double' mangled-name='nvlist_lookup_double' filepath='../../module/nvpair/nvpair.c' line='1706' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_double'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1706' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1706' column='1'/>
      <parameter type-id='type-id-96' name='val' filepath='../../module/nvpair/nvpair.c' line='1706' column='1'/>
      <return type-id='type-id-71'/>
    </function-decl>
    <function-decl name='nvlist_lookup_string' mangled-name='nvlist_lookup_string' filepath='../../module/nvpair/nvpair.c' line='1713' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_string'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1713' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1713' column='1'/>
      <parameter type-id='type-id-66' name='val' filepath='../../module/nvpair/nvpair.c' line='1713' column='1'/>
      <return type-id='type-id-71'/>
    </function-decl>
    <function-decl name='nvlist_lookup_nvlist' mangled-name='nvlist_lookup_nvlist' filepath='../../module/nvpair/nvpair.c' line='1719' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_nvlist'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1719' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1719' column='1'/>
      <parameter type-id='type-id-30' name='val' filepath='../../module/nvpair/nvpair.c' line='1719' column='1'/>
      <return type-id='type-id-71'/>
    </function-decl>
    <function-decl name='nvlist_lookup_boolean_array' mangled-name='nvlist_lookup_boolean_array' filepath='../../module/nvpair/nvpair.c' line='1725' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_boolean_array'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1725' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1725' column='1'/>
      <parameter type-id='type-id-97' name='a' filepath='../../module/nvpair/nvpair.c' line='1726' column='1'/>
      <parameter type-id='type-id-31' name='n' filepath='../../module/nvpair/nvpair.c' line='1726' column='1'/>
      <return type-id='type-id-71'/>
    </function-decl>
    <function-decl name='nvlist_lookup_byte_array' mangled-name='nvlist_lookup_byte_array' filepath='../../module/nvpair/nvpair.c' line='1733' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_byte_array'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1733' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1733' column='1'/>
      <parameter type-id='type-id-98' name='a' filepath='../../module/nvpair/nvpair.c' line='1734' column='1'/>
      <parameter type-id='type-id-31' name='n' filepath='../../module/nvpair/nvpair.c' line='1734' column='1'/>
      <return type-id='type-id-71'/>
    </function-decl>
    <function-decl name='nvlist_lookup_int8_array' mangled-name='nvlist_lookup_int8_array' filepath='../../module/nvpair/nvpair.c' line='1740' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_int8_array'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1740' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1740' column='1'/>
      <parameter type-id='type-id-99' name='a' filepath='../../module/nvpair/nvpair.c' line='1740' column='1'/>
      <parameter type-id='type-id-31' name='n' filepath='../../module/nvpair/nvpair.c' line='1740' column='1'/>
      <return type-id='type-id-71'/>
    </function-decl>
    <function-decl name='nvlist_lookup_uint8_array' mangled-name='nvlist_lookup_uint8_array' filepath='../../module/nvpair/nvpair.c' line='1746' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_uint8_array'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1746' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1746' column='1'/>
      <parameter type-id='type-id-100' name='a' filepath='../../module/nvpair/nvpair.c' line='1747' column='1'/>
      <parameter type-id='type-id-31' name='n' filepath='../../module/nvpair/nvpair.c' line='1747' column='1'/>
      <return type-id='type-id-71'/>
    </function-decl>
    <function-decl name='nvlist_lookup_int16_array' mangled-name='nvlist_lookup_int16_array' filepath='../../module/nvpair/nvpair.c' line='1753' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_int16_array'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1753' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1753' column='1'/>
      <parameter type-id='type-id-101' name='a' filepath='../../module/nvpair/nvpair.c' line='1754' column='1'/>
      <parameter type-id='type-id-31' name='n' filepath='../../module/nvpair/nvpair.c' line='1754' column='1'/>
      <return type-id='type-id-71'/>
    </function-decl>
    <function-decl name='nvlist_lookup_uint16_array' mangled-name='nvlist_lookup_uint16_array' filepath='../../module/nvpair/nvpair.c' line='1760' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_uint16_array'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1760' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1760' column='1'/>
      <parameter type-id='type-id-102' name='a' filepath='../../module/nvpair/nvpair.c' line='1761' column='1'/>
      <parameter type-id='type-id-31' name='n' filepath='../../module/nvpair/nvpair.c' line='1761' column='1'/>
      <return type-id='type-id-71'/>
    </function-decl>
    <function-decl name='nvlist_lookup_int32_array' mangled-name='nvlist_lookup_int32_array' filepath='../../module/nvpair/nvpair.c' line='1767' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_int32_array'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1767' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1767' column='1'/>
      <parameter type-id='type-id-103' name='a' filepath='../../module/nvpair/nvpair.c' line='1768' column='1'/>
      <parameter type-id='type-id-31' name='n' filepath='../../module/nvpair/nvpair.c' line='1768' column='1'/>
      <return type-id='type-id-71'/>
    </function-decl>
    <function-decl name='nvlist_lookup_uint32_array' mangled-name='nvlist_lookup_uint32_array' filepath='../../module/nvpair/nvpair.c' line='1774' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_uint32_array'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1774' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1774' column='1'/>
      <parameter type-id='type-id-104' name='a' filepath='../../module/nvpair/nvpair.c' line='1775' column='1'/>
      <parameter type-id='type-id-31' name='n' filepath='../../module/nvpair/nvpair.c' line='1775' column='1'/>
      <return type-id='type-id-71'/>
    </function-decl>
    <function-decl name='nvlist_lookup_int64_array' mangled-name='nvlist_lookup_int64_array' filepath='../../module/nvpair/nvpair.c' line='1781' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_int64_array'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1781' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1781' column='1'/>
      <parameter type-id='type-id-105' name='a' filepath='../../module/nvpair/nvpair.c' line='1782' column='1'/>
      <parameter type-id='type-id-31' name='n' filepath='../../module/nvpair/nvpair.c' line='1782' column='1'/>
      <return type-id='type-id-71'/>
    </function-decl>
    <function-decl name='nvlist_lookup_uint64_array' mangled-name='nvlist_lookup_uint64_array' filepath='../../module/nvpair/nvpair.c' line='1788' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_uint64_array'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1788' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1788' column='1'/>
      <parameter type-id='type-id-106' name='a' filepath='../../module/nvpair/nvpair.c' line='1789' column='1'/>
      <parameter type-id='type-id-31' name='n' filepath='../../module/nvpair/nvpair.c' line='1789' column='1'/>
      <return type-id='type-id-71'/>
    </function-decl>
    <function-decl name='nvlist_lookup_string_array' mangled-name='nvlist_lookup_string_array' filepath='../../module/nvpair/nvpair.c' line='1795' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_string_array'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1795' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1795' column='1'/>
      <parameter type-id='type-id-107' name='a' filepath='../../module/nvpair/nvpair.c' line='1796' column='1'/>
      <parameter type-id='type-id-31' name='n' filepath='../../module/nvpair/nvpair.c' line='1796' column='1'/>
      <return type-id='type-id-71'/>
    </function-decl>
    <function-decl name='nvlist_lookup_nvlist_array' mangled-name='nvlist_lookup_nvlist_array' filepath='../../module/nvpair/nvpair.c' line='1802' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_nvlist_array'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1802' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1802' column='1'/>
      <parameter type-id='type-id-108' name='a' filepath='../../module/nvpair/nvpair.c' line='1803' column='1'/>
      <parameter type-id='type-id-31' name='n' filepath='../../module/nvpair/nvpair.c' line='1803' column='1'/>
      <return type-id='type-id-71'/>
    </function-decl>
    <function-decl name='nvlist_lookup_hrtime' mangled-name='nvlist_lookup_hrtime' filepath='../../module/nvpair/nvpair.c' line='1809' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_hrtime'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1809' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1809' column='1'/>
      <parameter type-id='type-id-109' name='val' filepath='../../module/nvpair/nvpair.c' line='1809' column='1'/>
      <return type-id='type-id-71'/>
    </function-decl>
    <function-decl name='nvlist_lookup_pairs' mangled-name='nvlist_lookup_pairs' filepath='../../module/nvpair/nvpair.c' line='1815' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_pairs'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1815' column='1'/>
      <parameter type-id='type-id-71' name='flag' filepath='../../module/nvpair/nvpair.c' line='1815' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-71'/>
    </function-decl>
    <function-decl name='nvlist_lookup_nvpair' mangled-name='nvlist_lookup_nvpair' filepath='../../module/nvpair/nvpair.c' line='2065' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_nvpair'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='2065' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='2065' column='1'/>
      <parameter type-id='type-id-75' name='ret' filepath='../../module/nvpair/nvpair.c' line='2065' column='1'/>
      <return type-id='type-id-71'/>
    </function-decl>
    <function-decl name='nvlist_lookup_nvpair_embedded_index' mangled-name='nvlist_lookup_nvpair_embedded_index' filepath='../../module/nvpair/nvpair.c' line='2075' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_nvpair_embedded_index'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='2075' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='2076' column='1'/>
      <parameter type-id='type-id-75' name='ret' filepath='../../module/nvpair/nvpair.c' line='2076' column='1'/>
      <parameter type-id='type-id-72' name='ip' filepath='../../module/nvpair/nvpair.c' line='2076' column='1'/>
      <parameter type-id='type-id-66' name='ep' filepath='../../module/nvpair/nvpair.c' line='2076' column='1'/>
      <return type-id='type-id-71'/>
    </function-decl>
    <function-decl name='nvlist_exists' mangled-name='nvlist_exists' filepath='../../module/nvpair/nvpair.c' line='2082' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_exists'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='2082' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='2082' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='nvlist_add_nvpair' mangled-name='nvlist_add_nvpair' filepath='../../module/nvpair/nvpair.c' line='2264' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_nvpair'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='2264' column='1'/>
      <parameter type-id='type-id-17' name='nvp' filepath='../../module/nvpair/nvpair.c' line='2264' column='1'/>
      <return type-id='type-id-71'/>
    </function-decl>
    <function-decl name='nvlist_merge' mangled-name='nvlist_merge' filepath='../../module/nvpair/nvpair.c' line='2281' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_merge'>
      <parameter type-id='type-id-1' name='dst' filepath='../../module/nvpair/nvpair.c' line='2281' column='1'/>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='2281' column='1'/>
      <parameter type-id='type-id-71' name='flag' filepath='../../module/nvpair/nvpair.c' line='2281' column='1'/>
      <return type-id='type-id-71'/>
    </function-decl>
    <function-decl name='nvlist_size' mangled-name='nvlist_size' filepath='../../module/nvpair/nvpair.c' line='2650' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_size'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='2650' column='1'/>
      <parameter type-id='type-id-4' name='size' filepath='../../module/nvpair/nvpair.c' line='2650' column='1'/>
      <parameter type-id='type-id-71' name='encoding' filepath='../../module/nvpair/nvpair.c' line='2650' column='1'/>
      <return type-id='type-id-71'/>
    </function-decl>
    <function-decl name='nvlist_pack' mangled-name='nvlist_pack' filepath='../../module/nvpair/nvpair.c' line='2659' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_pack'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='2659' column='1'/>
      <parameter type-id='type-id-66' name='bufp' filepath='../../module/nvpair/nvpair.c' line='2659' column='1'/>
      <parameter type-id='type-id-4' name='buflen' filepath='../../module/nvpair/nvpair.c' line='2659' column='1'/>
      <parameter type-id='type-id-71' name='encoding' filepath='../../module/nvpair/nvpair.c' line='2659' column='1'/>
      <parameter type-id='type-id-71' name='kmflag' filepath='../../module/nvpair/nvpair.c' line='2660' column='1'/>
      <return type-id='type-id-71'/>
    </function-decl>
    <function-decl name='nvlist_xpack' mangled-name='nvlist_xpack' filepath='../../module/nvpair/nvpair.c' line='2667' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_xpack'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='2667' column='1'/>
      <parameter type-id='type-id-66' name='bufp' filepath='../../module/nvpair/nvpair.c' line='2667' column='1'/>
      <parameter type-id='type-id-4' name='buflen' filepath='../../module/nvpair/nvpair.c' line='2667' column='1'/>
      <parameter type-id='type-id-71' name='encoding' filepath='../../module/nvpair/nvpair.c' line='2667' column='1'/>
      <parameter type-id='type-id-91' name='nva' filepath='../../module/nvpair/nvpair.c' line='2668' column='1'/>
      <return type-id='type-id-71'/>
    </function-decl>
    <function-decl name='nvlist_unpack' mangled-name='nvlist_unpack' filepath='../../module/nvpair/nvpair.c' line='2717' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_unpack'>
      <parameter type-id='type-id-5' name='buf' filepath='../../module/nvpair/nvpair.c' line='2717' column='1'/>
      <parameter type-id='type-id-3' name='buflen' filepath='../../module/nvpair/nvpair.c' line='2717' column='1'/>
      <parameter type-id='type-id-30' name='nvlp' filepath='../../module/nvpair/nvpair.c' line='2717' column='1'/>
      <parameter type-id='type-id-71' name='kmflag' filepath='../../module/nvpair/nvpair.c' line='2717' column='1'/>
      <return type-id='type-id-71'/>
    </function-decl>
    <function-decl name='nvlist_xunpack' mangled-name='nvlist_xunpack' filepath='../../module/nvpair/nvpair.c' line='2723' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_xunpack'>
      <parameter type-id='type-id-5' name='buf' filepath='../../module/nvpair/nvpair.c' line='2723' column='1'/>
      <parameter type-id='type-id-3' name='buflen' filepath='../../module/nvpair/nvpair.c' line='2723' column='1'/>
      <parameter type-id='type-id-30' name='nvlp' filepath='../../module/nvpair/nvpair.c' line='2723' column='1'/>
      <parameter type-id='type-id-91' name='nva' filepath='../../module/nvpair/nvpair.c' line='2723' column='1'/>
      <return type-id='type-id-71'/>
    </function-decl>
    <function-decl name='strtol' filepath='/usr/include/stdlib.h' line='176' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-110'/>
      <parameter type-id='type-id-67'/>
      <parameter type-id='type-id-71'/>
      <return type-id='type-id-36'/>
    </function-decl>
    <function-decl name='strncmp' filepath='/usr/include/string.h' line='143' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-71'/>
    </function-decl>
    <function-decl name='strchr' filepath='/usr/include/string.h' line='230' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-71'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='strlen' filepath='/usr/include/string.h' line='391' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='xdr_int' filepath='/usr/include/tirpc/rpc/xdr.h' line='289' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-63'/>
      <parameter type-id='type-id-72'/>
      <return type-id='type-id-44'/>
    </function-decl>
    <function-decl name='xdr_u_int' filepath='/usr/include/tirpc/rpc/xdr.h' line='290' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-63'/>
      <parameter type-id='type-id-87'/>
      <return type-id='type-id-44'/>
    </function-decl>
    <function-decl name='xdr_short' filepath='/usr/include/tirpc/rpc/xdr.h' line='293' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-63'/>
      <parameter type-id='type-id-78'/>
      <return type-id='type-id-44'/>
    </function-decl>
    <function-decl name='xdr_u_short' filepath='/usr/include/tirpc/rpc/xdr.h' line='294' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-63'/>
      <parameter type-id='type-id-89'/>
      <return type-id='type-id-44'/>
    </function-decl>
    <function-decl name='xdr_array' filepath='/usr/include/tirpc/rpc/xdr.h' line='311' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-63'/>
      <parameter type-id='type-id-66'/>
      <parameter type-id='type-id-87'/>
      <parameter type-id='type-id-41'/>
      <parameter type-id='type-id-41'/>
      <parameter type-id='type-id-62'/>
      <return type-id='type-id-44'/>
    </function-decl>
    <function-decl name='xdr_opaque' filepath='/usr/include/tirpc/rpc/xdr.h' line='313' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-63'/>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-41'/>
      <return type-id='type-id-44'/>
    </function-decl>
    <function-decl name='xdr_string' filepath='/usr/include/tirpc/rpc/xdr.h' line='314' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-63'/>
      <parameter type-id='type-id-66'/>
      <parameter type-id='type-id-41'/>
      <return type-id='type-id-44'/>
    </function-decl>
    <function-decl name='xdr_char' filepath='/usr/include/tirpc/rpc/xdr.h' line='316' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-63'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-44'/>
    </function-decl>
    <function-decl name='xdr_double' filepath='/usr/include/tirpc/rpc/xdr.h' line='320' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-63'/>
      <parameter type-id='type-id-96'/>
      <return type-id='type-id-44'/>
    </function-decl>
    <function-decl name='xdr_longlong_t' filepath='/usr/include/tirpc/rpc/xdr.h' line='328' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-63'/>
      <parameter type-id='type-id-76'/>
      <return type-id='type-id-44'/>
    </function-decl>
    <function-decl name='xdr_u_longlong_t' filepath='/usr/include/tirpc/rpc/xdr.h' line='329' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-63'/>
      <parameter type-id='type-id-88'/>
      <return type-id='type-id-44'/>
    </function-decl>
    <function-decl name='xdrmem_create' filepath='/usr/include/tirpc/rpc/xdr.h' line='355' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-63'/>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-41'/>
      <parameter type-id='type-id-45'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-73'>
      <parameter type-id='type-id-64'/>
      <parameter type-id='type-id-41'/>
      <return type-id='type-id-25'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-79'>
      <parameter type-id='type-id-63'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-44'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-80'>
      <parameter type-id='type-id-64'/>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-41'/>
      <return type-id='type-id-44'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-81'>
      <parameter type-id='type-id-64'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-41'/>
      <return type-id='type-id-44'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-82'>
      <parameter type-id='type-id-64'/>
      <parameter type-id='type-id-69'/>
      <return type-id='type-id-44'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-83'>
      <parameter type-id='type-id-64'/>
      <parameter type-id='type-id-71'/>
      <parameter type-id='type-id-49'/>
      <return type-id='type-id-44'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-84'>
      <parameter type-id='type-id-64'/>
      <parameter type-id='type-id-74'/>
      <return type-id='type-id-44'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-85'>
      <parameter type-id='type-id-64'/>
      <parameter type-id='type-id-41'/>
      <return type-id='type-id-44'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-86'>
      <parameter type-id='type-id-64'/>
      <return type-id='type-id-41'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-90'>
      <parameter type-id='type-id-64'/>
      <return type-id='type-id-2'/>
    </function-type>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-38'/>
    <type-decl name='unsigned short int' size-in-bits='16' id='type-id-32'/>
  </abi-instr>
  <abi-instr address-size='64' path='../../module/nvpair/nvpair_alloc_fixed.c' comp-dir-path='/home/hutter2/release20/lib/libnvpair' language='LANG_C99'>
    <var-decl name='nv_fixed_ops' type-id='type-id-92' mangled-name='nv_fixed_ops' visibility='default' filepath='../../include/sys/nvpair.h' line='138' column='1' elf-symbol-id='nv_fixed_ops'/>
    <var-decl name='nv_fixed_ops_def' type-id='type-id-111' mangled-name='nv_fixed_ops_def' visibility='default' filepath='../../module/nvpair/nvpair_alloc_fixed.c' line='103' column='1' elf-symbol-id='nv_fixed_ops_def'/>
  </abi-instr>
  <abi-instr address-size='64' path='libnvpair.c' comp-dir-path='/home/hutter2/release20/lib/libnvpair' language='LANG_C99'>
    <type-decl name='char' size-in-bits='8' id='type-id-112'/>
    <array-type-def dimensions='1' type-id='type-id-112' size-in-bits='8' id='type-id-113'>
      <subrange length='1' type-id='type-id-38' id='type-id-114'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-112' size-in-bits='160' id='type-id-115'>
      <subrange length='20' type-id='type-id-38' id='type-id-116'/>
    </array-type-def>
    <class-decl name='_IO_codecvt' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-117'/>
    <class-decl name='_IO_marker' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-118'/>
    <class-decl name='_IO_wide_data' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-119'/>
    <class-decl name='re_dfa_t' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-120'/>
    <type-decl name='double' size-in-bits='64' id='type-id-94'/>
    <type-decl name='int' size-in-bits='32' id='type-id-71'/>
    <type-decl name='long int' size-in-bits='64' id='type-id-36'/>
    <type-decl name='long long int' size-in-bits='64' id='type-id-121'/>
    <type-decl name='short int' size-in-bits='16' id='type-id-77'/>
    <type-decl name='signed char' size-in-bits='8' id='type-id-122'/>
    <type-decl name='unnamed-enum-underlying-type-32' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='type-id-46'/>
    <type-decl name='unsigned char' size-in-bits='8' id='type-id-123'/>
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-34'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-38'/>
    <type-decl name='unsigned short int' size-in-bits='16' id='type-id-32'/>
    <type-decl name='variadic parameter type' id='type-id-124'/>
    <type-decl name='void' id='type-id-2'/>
    <typedef-decl name='nvlist_prtctl_t' type-id='type-id-125' filepath='../../include/libnvpair.h' line='84' column='1' id='type-id-126'/>
    <enum-decl name='nvlist_indent_mode' filepath='../../include/libnvpair.h' line='86' column='1' id='type-id-127'>
      <underlying-type type-id='type-id-46'/>
      <enumerator name='NVLIST_INDENT_ABS' value='0'/>
      <enumerator name='NVLIST_INDENT_TABBED' value='1'/>
    </enum-decl>
    <enum-decl name='nvlist_prtctl_fmt' filepath='../../include/libnvpair.h' line='104' column='1' id='type-id-128'>
      <underlying-type type-id='type-id-46'/>
      <enumerator name='NVLIST_FMT_MEMBER_NAME' value='0'/>
      <enumerator name='NVLIST_FMT_MEMBER_POSTAMBLE' value='1'/>
      <enumerator name='NVLIST_FMT_BTWN_ARRAY' value='2'/>
    </enum-decl>
    <enum-decl name='data_type_t' naming-typedef-id='type-id-93' filepath='../../include/sys/nvpair.h' line='37' column='1' id='type-id-129'>
      <underlying-type type-id='type-id-46'/>
      <enumerator name='DATA_TYPE_DONTCARE' value='-1'/>
      <enumerator name='DATA_TYPE_UNKNOWN' value='0'/>
      <enumerator name='DATA_TYPE_BOOLEAN' value='1'/>
      <enumerator name='DATA_TYPE_BYTE' value='2'/>
      <enumerator name='DATA_TYPE_INT16' value='3'/>
      <enumerator name='DATA_TYPE_UINT16' value='4'/>
      <enumerator name='DATA_TYPE_INT32' value='5'/>
      <enumerator name='DATA_TYPE_UINT32' value='6'/>
      <enumerator name='DATA_TYPE_INT64' value='7'/>
      <enumerator name='DATA_TYPE_UINT64' value='8'/>
      <enumerator name='DATA_TYPE_STRING' value='9'/>
      <enumerator name='DATA_TYPE_BYTE_ARRAY' value='10'/>
      <enumerator name='DATA_TYPE_INT16_ARRAY' value='11'/>
      <enumerator name='DATA_TYPE_UINT16_ARRAY' value='12'/>
      <enumerator name='DATA_TYPE_INT32_ARRAY' value='13'/>
      <enumerator name='DATA_TYPE_UINT32_ARRAY' value='14'/>
      <enumerator name='DATA_TYPE_INT64_ARRAY' value='15'/>
      <enumerator name='DATA_TYPE_UINT64_ARRAY' value='16'/>
      <enumerator name='DATA_TYPE_STRING_ARRAY' value='17'/>
      <enumerator name='DATA_TYPE_HRTIME' value='18'/>
      <enumerator name='DATA_TYPE_NVLIST' value='19'/>
      <enumerator name='DATA_TYPE_NVLIST_ARRAY' value='20'/>
      <enumerator name='DATA_TYPE_BOOLEAN_VALUE' value='21'/>
      <enumerator name='DATA_TYPE_INT8' value='22'/>
      <enumerator name='DATA_TYPE_UINT8' value='23'/>
      <enumerator name='DATA_TYPE_BOOLEAN_ARRAY' value='24'/>
      <enumerator name='DATA_TYPE_INT8_ARRAY' value='25'/>
      <enumerator name='DATA_TYPE_UINT8_ARRAY' value='26'/>
      <enumerator name='DATA_TYPE_DOUBLE' value='27'/>
    </enum-decl>
    <typedef-decl name='data_type_t' type-id='type-id-129' filepath='../../include/sys/nvpair.h' line='71' column='1' id='type-id-93'/>
    <class-decl name='nvpair' size-in-bits='128' is-struct='yes' visibility='default' filepath='../../include/sys/nvpair.h' line='73' column='1' id='type-id-130'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nvp_size' type-id='type-id-13' visibility='default' filepath='../../include/sys/nvpair.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='nvp_name_sz' type-id='type-id-11' visibility='default' filepath='../../include/sys/nvpair.h' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='nvp_reserve' type-id='type-id-11' visibility='default' filepath='../../include/sys/nvpair.h' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='nvp_value_elem' type-id='type-id-13' visibility='default' filepath='../../include/sys/nvpair.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='nvp_type' type-id='type-id-93' visibility='default' filepath='../../include/sys/nvpair.h' line='78' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='nvpair_t' type-id='type-id-130' filepath='../../include/sys/nvpair.h' line='82' column='1' id='type-id-131'/>
    <class-decl name='nvlist' size-in-bits='192' is-struct='yes' visibility='default' filepath='../../include/sys/nvpair.h' line='85' column='1' id='type-id-132'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nvl_version' type-id='type-id-13' visibility='default' filepath='../../include/sys/nvpair.h' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='nvl_nvflag' type-id='type-id-14' visibility='default' filepath='../../include/sys/nvpair.h' line='87' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='nvl_priv' type-id='type-id-16' visibility='default' filepath='../../include/sys/nvpair.h' line='88' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='nvl_flag' type-id='type-id-14' visibility='default' filepath='../../include/sys/nvpair.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='nvl_pad' type-id='type-id-13' visibility='default' filepath='../../include/sys/nvpair.h' line='90' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='nvlist_t' type-id='type-id-132' filepath='../../include/sys/nvpair.h' line='91' column='1' id='type-id-133'/>
    <enum-decl name='boolean_t' naming-typedef-id='type-id-7' filepath='../../lib/libspl/include/sys/stdtypes.h' line='26' column='1' id='type-id-134'>
      <underlying-type type-id='type-id-46'/>
      <enumerator name='B_FALSE' value='0'/>
      <enumerator name='B_TRUE' value='1'/>
    </enum-decl>
    <typedef-decl name='boolean_t' type-id='type-id-134' filepath='../../lib/libspl/include/sys/stdtypes.h' line='29' column='1' id='type-id-7'/>
    <typedef-decl name='uchar_t' type-id='type-id-123' filepath='../../lib/libspl/include/sys/stdtypes.h' line='31' column='1' id='type-id-8'/>
    <typedef-decl name='uint_t' type-id='type-id-34' filepath='../../lib/libspl/include/sys/stdtypes.h' line='33' column='1' id='type-id-19'/>
    <typedef-decl name='hrtime_t' type-id='type-id-121' filepath='../../lib/libspl/include/sys/time.h' line='78' column='1' id='type-id-95'/>
    <class-decl name='nvlist_printops' size-in-bits='3456' is-struct='yes' visibility='default' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='61' column='1' id='type-id-135'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='print_boolean' type-id='type-id-136' visibility='default' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='print_boolean_value' type-id='type-id-137' visibility='default' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='print_byte' type-id='type-id-138' visibility='default' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='print_int8' type-id='type-id-139' visibility='default' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='print_uint8' type-id='type-id-140' visibility='default' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='print_int16' type-id='type-id-141' visibility='default' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='print_uint16' type-id='type-id-142' visibility='default' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='print_int32' type-id='type-id-143' visibility='default' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='print_uint32' type-id='type-id-144' visibility='default' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='print_int64' type-id='type-id-145' visibility='default' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='71' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='print_uint64' type-id='type-id-146' visibility='default' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='print_double' type-id='type-id-147' visibility='default' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='print_string' type-id='type-id-148' visibility='default' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='print_hrtime' type-id='type-id-149' visibility='default' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='print_nvlist' type-id='type-id-150' visibility='default' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1920'>
        <var-decl name='print_boolean_array' type-id='type-id-151' visibility='default' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='print_byte_array' type-id='type-id-152' visibility='default' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='print_int8_array' type-id='type-id-153' visibility='default' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2304'>
        <var-decl name='print_uint8_array' type-id='type-id-154' visibility='default' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='80' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2432'>
        <var-decl name='print_int16_array' type-id='type-id-155' visibility='default' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2560'>
        <var-decl name='print_uint16_array' type-id='type-id-156' visibility='default' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='82' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2688'>
        <var-decl name='print_int32_array' type-id='type-id-157' visibility='default' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='83' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2816'>
        <var-decl name='print_uint32_array' type-id='type-id-158' visibility='default' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2944'>
        <var-decl name='print_int64_array' type-id='type-id-159' visibility='default' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='85' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3072'>
        <var-decl name='print_uint64_array' type-id='type-id-160' visibility='default' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3200'>
        <var-decl name='print_string_array' type-id='type-id-161' visibility='default' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='87' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3328'>
        <var-decl name='print_nvlist_array' type-id='type-id-162' visibility='default' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='88' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='62' column='1' id='type-id-136'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-163' visibility='default' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-49' visibility='default' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='62' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__1' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='63' column='1' id='type-id-137'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-164' visibility='default' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-49' visibility='default' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='63' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__2' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='64' column='1' id='type-id-138'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-165' visibility='default' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-49' visibility='default' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='64' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__3' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='65' column='1' id='type-id-139'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-166' visibility='default' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-49' visibility='default' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='65' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__4' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='66' column='1' id='type-id-140'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-167' visibility='default' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-49' visibility='default' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='66' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__5' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='67' column='1' id='type-id-141'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-168' visibility='default' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-49' visibility='default' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='67' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__6' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='68' column='1' id='type-id-142'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-169' visibility='default' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-49' visibility='default' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='68' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__7' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='69' column='1' id='type-id-143'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-170' visibility='default' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-49' visibility='default' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='69' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__8' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='70' column='1' id='type-id-144'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-171' visibility='default' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-49' visibility='default' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='70' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__9' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='71' column='1' id='type-id-145'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-172' visibility='default' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='71' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-49' visibility='default' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='71' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__10' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='72' column='1' id='type-id-146'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-173' visibility='default' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-49' visibility='default' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='72' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__11' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='73' column='1' id='type-id-147'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-174' visibility='default' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-49' visibility='default' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='73' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__12' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='74' column='1' id='type-id-148'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-175' visibility='default' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-49' visibility='default' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='74' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__13' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='75' column='1' id='type-id-149'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-176' visibility='default' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-49' visibility='default' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='75' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__14' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='76' column='1' id='type-id-150'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-177' visibility='default' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-49' visibility='default' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='76' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__15' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='77' column='1' id='type-id-151'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-178' visibility='default' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-49' visibility='default' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='77' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__16' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='78' column='1' id='type-id-152'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-179' visibility='default' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-49' visibility='default' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='78' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__17' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='79' column='1' id='type-id-153'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-180' visibility='default' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-49' visibility='default' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='79' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__18' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='80' column='1' id='type-id-154'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-181' visibility='default' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='80' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-49' visibility='default' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='80' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__19' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='81' column='1' id='type-id-155'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-182' visibility='default' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-49' visibility='default' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='81' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__20' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='82' column='1' id='type-id-156'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-183' visibility='default' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='82' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-49' visibility='default' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='82' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__21' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='83' column='1' id='type-id-157'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-184' visibility='default' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='83' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-49' visibility='default' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='83' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__22' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='84' column='1' id='type-id-158'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-185' visibility='default' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-49' visibility='default' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='84' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__23' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='85' column='1' id='type-id-159'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-186' visibility='default' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='85' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-49' visibility='default' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='85' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__24' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='86' column='1' id='type-id-160'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-187' visibility='default' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-49' visibility='default' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='86' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__25' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='87' column='1' id='type-id-161'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-188' visibility='default' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='87' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-49' visibility='default' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='87' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__26' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='88' column='1' id='type-id-162'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-189' visibility='default' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='88' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-49' visibility='default' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='88' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='nvlist_prtctl' size-in-bits='576' is-struct='yes' visibility='default' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='91' column='1' id='type-id-190'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nvprt_fp' type-id='type-id-191' visibility='default' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='nvprt_indent_mode' type-id='type-id-127' visibility='default' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='nvprt_indent' type-id='type-id-71' visibility='default' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='nvprt_indentinc' type-id='type-id-71' visibility='default' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='nvprt_nmfmt' type-id='type-id-6' visibility='default' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='nvprt_eomfmt' type-id='type-id-6' visibility='default' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='97' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='nvprt_btwnarrfmt' type-id='type-id-6' visibility='default' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='98' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='nvprt_btwnarrfmt_nl' type-id='type-id-71' visibility='default' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='99' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='nvprt_dfltops' type-id='type-id-192' visibility='default' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='100' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='nvprt_custops' type-id='type-id-192' visibility='default' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='101' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='int8_t' type-id='type-id-193' filepath='/usr/include/bits/stdint-intn.h' line='24' column='1' id='type-id-9'/>
    <typedef-decl name='int16_t' type-id='type-id-194' filepath='/usr/include/bits/stdint-intn.h' line='25' column='1' id='type-id-11'/>
    <typedef-decl name='int32_t' type-id='type-id-195' filepath='/usr/include/bits/stdint-intn.h' line='26' column='1' id='type-id-13'/>
    <typedef-decl name='int64_t' type-id='type-id-196' filepath='/usr/include/bits/stdint-intn.h' line='27' column='1' id='type-id-15'/>
    <typedef-decl name='uint8_t' type-id='type-id-197' filepath='/usr/include/bits/stdint-uintn.h' line='24' column='1' id='type-id-10'/>
    <typedef-decl name='uint16_t' type-id='type-id-198' filepath='/usr/include/bits/stdint-uintn.h' line='25' column='1' id='type-id-12'/>
    <typedef-decl name='uint32_t' type-id='type-id-199' filepath='/usr/include/bits/stdint-uintn.h' line='26' column='1' id='type-id-14'/>
    <typedef-decl name='uint64_t' type-id='type-id-200' filepath='/usr/include/bits/stdint-uintn.h' line='27' column='1' id='type-id-16'/>
    <typedef-decl name='__int8_t' type-id='type-id-122' filepath='/usr/include/bits/types.h' line='37' column='1' id='type-id-193'/>
    <typedef-decl name='__uint8_t' type-id='type-id-123' filepath='/usr/include/bits/types.h' line='38' column='1' id='type-id-197'/>
    <typedef-decl name='__int16_t' type-id='type-id-77' filepath='/usr/include/bits/types.h' line='39' column='1' id='type-id-194'/>
    <typedef-decl name='__uint16_t' type-id='type-id-32' filepath='/usr/include/bits/types.h' line='40' column='1' id='type-id-198'/>
    <typedef-decl name='__int32_t' type-id='type-id-71' filepath='/usr/include/bits/types.h' line='41' column='1' id='type-id-195'/>
    <typedef-decl name='__uint32_t' type-id='type-id-34' filepath='/usr/include/bits/types.h' line='42' column='1' id='type-id-199'/>
    <typedef-decl name='__int64_t' type-id='type-id-36' filepath='/usr/include/bits/types.h' line='44' column='1' id='type-id-196'/>
    <typedef-decl name='__uint64_t' type-id='type-id-38' filepath='/usr/include/bits/types.h' line='45' column='1' id='type-id-200'/>
    <typedef-decl name='__off_t' type-id='type-id-36' filepath='/usr/include/bits/types.h' line='152' column='1' id='type-id-201'/>
    <typedef-decl name='__off64_t' type-id='type-id-36' filepath='/usr/include/bits/types.h' line='153' column='1' id='type-id-202'/>
    <typedef-decl name='FILE' type-id='type-id-203' filepath='/usr/include/bits/types/FILE.h' line='7' column='1' id='type-id-204'/>
    <typedef-decl name='_IO_lock_t' type-id='type-id-2' filepath='/usr/include/bits/types/struct_FILE.h' line='43' column='1' id='type-id-205'/>
    <class-decl name='_IO_FILE' size-in-bits='1728' is-struct='yes' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='49' column='1' id='type-id-203'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_flags' type-id='type-id-71' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_IO_read_ptr' type-id='type-id-5' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_IO_read_end' type-id='type-id-5' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_IO_read_base' type-id='type-id-5' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='_IO_write_base' type-id='type-id-5' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='_IO_write_ptr' type-id='type-id-5' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_IO_write_end' type-id='type-id-5' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='_IO_buf_base' type-id='type-id-5' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='_IO_buf_end' type-id='type-id-5' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='_IO_save_base' type-id='type-id-5' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='_IO_backup_base' type-id='type-id-5' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='_IO_save_end' type-id='type-id-5' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='_markers' type-id='type-id-206' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='_chain' type-id='type-id-207' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='_fileno' type-id='type-id-71' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='_flags2' type-id='type-id-71' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='_old_offset' type-id='type-id-201' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='_cur_column' type-id='type-id-32' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1040'>
        <var-decl name='_vtable_offset' type-id='type-id-122' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1048'>
        <var-decl name='_shortbuf' type-id='type-id-113' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='_lock' type-id='type-id-208' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='_offset' type-id='type-id-202' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='_codecvt' type-id='type-id-209' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='_wide_data' type-id='type-id-210' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='_freeres_list' type-id='type-id-207' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='_freeres_buf' type-id='type-id-49' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='__pad5' type-id='type-id-3' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='_mode' type-id='type-id-71' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='_unused2' type-id='type-id-115' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='98' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__re_long_size_t' type-id='type-id-38' filepath='/usr/include/regex.h' line='56' column='1' id='type-id-211'/>
    <typedef-decl name='reg_syntax_t' type-id='type-id-38' filepath='/usr/include/regex.h' line='72' column='1' id='type-id-212'/>
    <class-decl name='re_pattern_buffer' size-in-bits='512' is-struct='yes' visibility='default' filepath='/usr/include/regex.h' line='413' column='1' id='type-id-213'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='buffer' type-id='type-id-214' visibility='default' filepath='/usr/include/regex.h' line='417' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='allocated' type-id='type-id-211' visibility='default' filepath='/usr/include/regex.h' line='420' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='used' type-id='type-id-211' visibility='default' filepath='/usr/include/regex.h' line='423' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='syntax' type-id='type-id-212' visibility='default' filepath='/usr/include/regex.h' line='426' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='fastmap' type-id='type-id-5' visibility='default' filepath='/usr/include/regex.h' line='431' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='translate' type-id='type-id-215' visibility='default' filepath='/usr/include/regex.h' line='437' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='re_nsub' type-id='type-id-3' visibility='default' filepath='/usr/include/regex.h' line='440' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='can_be_null' type-id='type-id-34' visibility='default' filepath='/usr/include/regex.h' line='446' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='449'>
        <var-decl name='regs_allocated' type-id='type-id-34' visibility='default' filepath='/usr/include/regex.h' line='457' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='451'>
        <var-decl name='fastmap_accurate' type-id='type-id-34' visibility='default' filepath='/usr/include/regex.h' line='461' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='452'>
        <var-decl name='no_sub' type-id='type-id-34' visibility='default' filepath='/usr/include/regex.h' line='465' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='453'>
        <var-decl name='not_bol' type-id='type-id-34' visibility='default' filepath='/usr/include/regex.h' line='469' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='454'>
        <var-decl name='not_eol' type-id='type-id-34' visibility='default' filepath='/usr/include/regex.h' line='472' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='455'>
        <var-decl name='newline_anchor' type-id='type-id-34' visibility='default' filepath='/usr/include/regex.h' line='475' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='regex_t' type-id='type-id-213' filepath='/usr/include/regex.h' line='478' column='1' id='type-id-216'/>
    <typedef-decl name='regoff_t' type-id='type-id-71' filepath='/usr/include/regex.h' line='490' column='1' id='type-id-217'/>
    <class-decl name='regmatch_t' size-in-bits='64' is-struct='yes' naming-typedef-id='type-id-218' visibility='default' filepath='/usr/include/regex.h' line='517' column='1' id='type-id-219'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='rm_so' type-id='type-id-217' visibility='default' filepath='/usr/include/regex.h' line='519' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='rm_eo' type-id='type-id-217' visibility='default' filepath='/usr/include/regex.h' line='520' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='regmatch_t' type-id='type-id-219' filepath='/usr/include/regex.h' line='521' column='1' id='type-id-218'/>
    <typedef-decl name='size_t' type-id='type-id-38' filepath='/usr/lib/gcc/x86_64-redhat-linux/10/include/stddef.h' line='209' column='1' id='type-id-3'/>
    <pointer-type-def type-id='type-id-204' size-in-bits='64' id='type-id-191'/>
    <qualified-type-def type-id='type-id-191' restrict='yes' id='type-id-220'/>
    <pointer-type-def type-id='type-id-203' size-in-bits='64' id='type-id-207'/>
    <pointer-type-def type-id='type-id-117' size-in-bits='64' id='type-id-209'/>
    <pointer-type-def type-id='type-id-205' size-in-bits='64' id='type-id-208'/>
    <pointer-type-def type-id='type-id-118' size-in-bits='64' id='type-id-206'/>
    <pointer-type-def type-id='type-id-119' size-in-bits='64' id='type-id-210'/>
    <pointer-type-def type-id='type-id-7' size-in-bits='64' id='type-id-18'/>
    <pointer-type-def type-id='type-id-18' size-in-bits='64' id='type-id-97'/>
    <pointer-type-def type-id='type-id-112' size-in-bits='64' id='type-id-5'/>
    <pointer-type-def type-id='type-id-5' size-in-bits='64' id='type-id-66'/>
    <pointer-type-def type-id='type-id-66' size-in-bits='64' id='type-id-107'/>
    <qualified-type-def type-id='type-id-112' const='yes' id='type-id-221'/>
    <pointer-type-def type-id='type-id-221' size-in-bits='64' id='type-id-6'/>
    <qualified-type-def type-id='type-id-6' restrict='yes' id='type-id-110'/>
    <qualified-type-def type-id='type-id-216' const='yes' id='type-id-222'/>
    <pointer-type-def type-id='type-id-222' size-in-bits='64' id='type-id-223'/>
    <qualified-type-def type-id='type-id-223' restrict='yes' id='type-id-224'/>
    <pointer-type-def type-id='type-id-94' size-in-bits='64' id='type-id-96'/>
    <pointer-type-def type-id='type-id-95' size-in-bits='64' id='type-id-109'/>
    <pointer-type-def type-id='type-id-225' size-in-bits='64' id='type-id-178'/>
    <pointer-type-def type-id='type-id-226' size-in-bits='64' id='type-id-175'/>
    <pointer-type-def type-id='type-id-227' size-in-bits='64' id='type-id-188'/>
    <pointer-type-def type-id='type-id-228' size-in-bits='64' id='type-id-174'/>
    <pointer-type-def type-id='type-id-229' size-in-bits='64' id='type-id-163'/>
    <pointer-type-def type-id='type-id-230' size-in-bits='64' id='type-id-182'/>
    <pointer-type-def type-id='type-id-231' size-in-bits='64' id='type-id-184'/>
    <pointer-type-def type-id='type-id-232' size-in-bits='64' id='type-id-186'/>
    <pointer-type-def type-id='type-id-233' size-in-bits='64' id='type-id-180'/>
    <pointer-type-def type-id='type-id-234' size-in-bits='64' id='type-id-177'/>
    <pointer-type-def type-id='type-id-235' size-in-bits='64' id='type-id-189'/>
    <pointer-type-def type-id='type-id-236' size-in-bits='64' id='type-id-164'/>
    <pointer-type-def type-id='type-id-237' size-in-bits='64' id='type-id-176'/>
    <pointer-type-def type-id='type-id-238' size-in-bits='64' id='type-id-168'/>
    <pointer-type-def type-id='type-id-239' size-in-bits='64' id='type-id-170'/>
    <pointer-type-def type-id='type-id-240' size-in-bits='64' id='type-id-172'/>
    <pointer-type-def type-id='type-id-241' size-in-bits='64' id='type-id-166'/>
    <pointer-type-def type-id='type-id-242' size-in-bits='64' id='type-id-165'/>
    <pointer-type-def type-id='type-id-243' size-in-bits='64' id='type-id-169'/>
    <pointer-type-def type-id='type-id-244' size-in-bits='64' id='type-id-171'/>
    <pointer-type-def type-id='type-id-245' size-in-bits='64' id='type-id-173'/>
    <pointer-type-def type-id='type-id-246' size-in-bits='64' id='type-id-167'/>
    <pointer-type-def type-id='type-id-247' size-in-bits='64' id='type-id-179'/>
    <pointer-type-def type-id='type-id-248' size-in-bits='64' id='type-id-183'/>
    <pointer-type-def type-id='type-id-249' size-in-bits='64' id='type-id-185'/>
    <pointer-type-def type-id='type-id-250' size-in-bits='64' id='type-id-187'/>
    <pointer-type-def type-id='type-id-251' size-in-bits='64' id='type-id-181'/>
    <pointer-type-def type-id='type-id-252' size-in-bits='64' id='type-id-253'/>
    <pointer-type-def type-id='type-id-254' size-in-bits='64' id='type-id-255'/>
    <pointer-type-def type-id='type-id-256' size-in-bits='64' id='type-id-257'/>
    <pointer-type-def type-id='type-id-258' size-in-bits='64' id='type-id-259'/>
    <pointer-type-def type-id='type-id-260' size-in-bits='64' id='type-id-261'/>
    <pointer-type-def type-id='type-id-262' size-in-bits='64' id='type-id-263'/>
    <pointer-type-def type-id='type-id-264' size-in-bits='64' id='type-id-265'/>
    <pointer-type-def type-id='type-id-266' size-in-bits='64' id='type-id-267'/>
    <pointer-type-def type-id='type-id-268' size-in-bits='64' id='type-id-269'/>
    <pointer-type-def type-id='type-id-270' size-in-bits='64' id='type-id-271'/>
    <pointer-type-def type-id='type-id-272' size-in-bits='64' id='type-id-273'/>
    <pointer-type-def type-id='type-id-274' size-in-bits='64' id='type-id-275'/>
    <pointer-type-def type-id='type-id-276' size-in-bits='64' id='type-id-277'/>
    <pointer-type-def type-id='type-id-278' size-in-bits='64' id='type-id-279'/>
    <pointer-type-def type-id='type-id-280' size-in-bits='64' id='type-id-281'/>
    <pointer-type-def type-id='type-id-282' size-in-bits='64' id='type-id-283'/>
    <pointer-type-def type-id='type-id-284' size-in-bits='64' id='type-id-285'/>
    <pointer-type-def type-id='type-id-286' size-in-bits='64' id='type-id-287'/>
    <pointer-type-def type-id='type-id-288' size-in-bits='64' id='type-id-289'/>
    <pointer-type-def type-id='type-id-290' size-in-bits='64' id='type-id-291'/>
    <pointer-type-def type-id='type-id-292' size-in-bits='64' id='type-id-293'/>
    <pointer-type-def type-id='type-id-294' size-in-bits='64' id='type-id-295'/>
    <pointer-type-def type-id='type-id-296' size-in-bits='64' id='type-id-297'/>
    <pointer-type-def type-id='type-id-298' size-in-bits='64' id='type-id-299'/>
    <pointer-type-def type-id='type-id-300' size-in-bits='64' id='type-id-301'/>
    <pointer-type-def type-id='type-id-302' size-in-bits='64' id='type-id-303'/>
    <pointer-type-def type-id='type-id-304' size-in-bits='64' id='type-id-305'/>
    <pointer-type-def type-id='type-id-11' size-in-bits='64' id='type-id-23'/>
    <pointer-type-def type-id='type-id-23' size-in-bits='64' id='type-id-101'/>
    <pointer-type-def type-id='type-id-13' size-in-bits='64' id='type-id-25'/>
    <pointer-type-def type-id='type-id-25' size-in-bits='64' id='type-id-103'/>
    <pointer-type-def type-id='type-id-15' size-in-bits='64' id='type-id-27'/>
    <pointer-type-def type-id='type-id-27' size-in-bits='64' id='type-id-105'/>
    <pointer-type-def type-id='type-id-9' size-in-bits='64' id='type-id-21'/>
    <pointer-type-def type-id='type-id-21' size-in-bits='64' id='type-id-99'/>
    <pointer-type-def type-id='type-id-135' size-in-bits='64' id='type-id-192'/>
    <pointer-type-def type-id='type-id-190' size-in-bits='64' id='type-id-125'/>
    <pointer-type-def type-id='type-id-133' size-in-bits='64' id='type-id-1'/>
    <pointer-type-def type-id='type-id-1' size-in-bits='64' id='type-id-30'/>
    <pointer-type-def type-id='type-id-30' size-in-bits='64' id='type-id-108'/>
    <pointer-type-def type-id='type-id-131' size-in-bits='64' id='type-id-17'/>
    <pointer-type-def type-id='type-id-120' size-in-bits='64' id='type-id-214'/>
    <pointer-type-def type-id='type-id-216' size-in-bits='64' id='type-id-306'/>
    <pointer-type-def type-id='type-id-218' size-in-bits='64' id='type-id-307'/>
    <qualified-type-def type-id='type-id-307' restrict='yes' id='type-id-308'/>
    <pointer-type-def type-id='type-id-8' size-in-bits='64' id='type-id-20'/>
    <pointer-type-def type-id='type-id-20' size-in-bits='64' id='type-id-98'/>
    <pointer-type-def type-id='type-id-12' size-in-bits='64' id='type-id-24'/>
    <pointer-type-def type-id='type-id-24' size-in-bits='64' id='type-id-102'/>
    <pointer-type-def type-id='type-id-14' size-in-bits='64' id='type-id-26'/>
    <pointer-type-def type-id='type-id-26' size-in-bits='64' id='type-id-104'/>
    <pointer-type-def type-id='type-id-16' size-in-bits='64' id='type-id-28'/>
    <pointer-type-def type-id='type-id-28' size-in-bits='64' id='type-id-106'/>
    <pointer-type-def type-id='type-id-10' size-in-bits='64' id='type-id-22'/>
    <pointer-type-def type-id='type-id-22' size-in-bits='64' id='type-id-100'/>
    <pointer-type-def type-id='type-id-19' size-in-bits='64' id='type-id-31'/>
    <pointer-type-def type-id='type-id-123' size-in-bits='64' id='type-id-215'/>
    <pointer-type-def type-id='type-id-2' size-in-bits='64' id='type-id-49'/>
    <class-decl name='_IO_codecvt' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-117'/>
    <class-decl name='_IO_marker' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-118'/>
    <class-decl name='_IO_wide_data' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-119'/>
    <class-decl name='re_dfa_t' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-120'/>
    <function-decl name='nvlist_next_nvpair' mangled-name='nvlist_next_nvpair' filepath='../../include/sys/nvpair.h' line='242' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_next_nvpair'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-17'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='nvpair_name' mangled-name='nvpair_name' filepath='../../include/sys/nvpair.h' line='244' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_name'>
      <parameter type-id='type-id-17'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvpair_type' mangled-name='nvpair_type' filepath='../../include/sys/nvpair.h' line='245' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_type'>
      <parameter type-id='type-id-17'/>
      <return type-id='type-id-93'/>
    </function-decl>
    <function-decl name='nvpair_type_is_array' mangled-name='nvpair_type_is_array' filepath='../../include/sys/nvpair.h' line='246' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_type_is_array'>
      <parameter type-id='type-id-17'/>
      <return type-id='type-id-71'/>
    </function-decl>
    <function-decl name='nvpair_value_boolean_value' mangled-name='nvpair_value_boolean_value' filepath='../../include/sys/nvpair.h' line='247' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_boolean_value'>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-18'/>
      <return type-id='type-id-71'/>
    </function-decl>
    <function-decl name='nvpair_value_byte' mangled-name='nvpair_value_byte' filepath='../../include/sys/nvpair.h' line='248' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_byte'>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-20'/>
      <return type-id='type-id-71'/>
    </function-decl>
    <function-decl name='nvpair_value_int8' mangled-name='nvpair_value_int8' filepath='../../include/sys/nvpair.h' line='249' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_int8'>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-21'/>
      <return type-id='type-id-71'/>
    </function-decl>
    <function-decl name='nvpair_value_uint8' mangled-name='nvpair_value_uint8' filepath='../../include/sys/nvpair.h' line='250' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_uint8'>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-22'/>
      <return type-id='type-id-71'/>
    </function-decl>
    <function-decl name='nvpair_value_int16' mangled-name='nvpair_value_int16' filepath='../../include/sys/nvpair.h' line='251' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_int16'>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-23'/>
      <return type-id='type-id-71'/>
    </function-decl>
    <function-decl name='nvpair_value_uint16' mangled-name='nvpair_value_uint16' filepath='../../include/sys/nvpair.h' line='252' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_uint16'>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-24'/>
      <return type-id='type-id-71'/>
    </function-decl>
    <function-decl name='nvpair_value_int32' mangled-name='nvpair_value_int32' filepath='../../include/sys/nvpair.h' line='253' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_int32'>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-25'/>
      <return type-id='type-id-71'/>
    </function-decl>
    <function-decl name='nvpair_value_uint32' mangled-name='nvpair_value_uint32' filepath='../../include/sys/nvpair.h' line='254' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_uint32'>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-26'/>
      <return type-id='type-id-71'/>
    </function-decl>
    <function-decl name='nvpair_value_int64' mangled-name='nvpair_value_int64' filepath='../../include/sys/nvpair.h' line='255' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_int64'>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-27'/>
      <return type-id='type-id-71'/>
    </function-decl>
    <function-decl name='nvpair_value_uint64' mangled-name='nvpair_value_uint64' filepath='../../include/sys/nvpair.h' line='256' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_uint64'>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-28'/>
      <return type-id='type-id-71'/>
    </function-decl>
    <function-decl name='nvpair_value_string' mangled-name='nvpair_value_string' filepath='../../include/sys/nvpair.h' line='257' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_string'>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-66'/>
      <return type-id='type-id-71'/>
    </function-decl>
    <function-decl name='nvpair_value_nvlist' mangled-name='nvpair_value_nvlist' filepath='../../include/sys/nvpair.h' line='258' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_nvlist'>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-30'/>
      <return type-id='type-id-71'/>
    </function-decl>
    <function-decl name='nvpair_value_boolean_array' mangled-name='nvpair_value_boolean_array' filepath='../../include/sys/nvpair.h' line='259' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_boolean_array'>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-97'/>
      <parameter type-id='type-id-31'/>
      <return type-id='type-id-71'/>
    </function-decl>
    <function-decl name='nvpair_value_byte_array' mangled-name='nvpair_value_byte_array' filepath='../../include/sys/nvpair.h' line='260' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_byte_array'>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-98'/>
      <parameter type-id='type-id-31'/>
      <return type-id='type-id-71'/>
    </function-decl>
    <function-decl name='nvpair_value_int8_array' mangled-name='nvpair_value_int8_array' filepath='../../include/sys/nvpair.h' line='261' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_int8_array'>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-99'/>
      <parameter type-id='type-id-31'/>
      <return type-id='type-id-71'/>
    </function-decl>
    <function-decl name='nvpair_value_uint8_array' mangled-name='nvpair_value_uint8_array' filepath='../../include/sys/nvpair.h' line='262' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_uint8_array'>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-100'/>
      <parameter type-id='type-id-31'/>
      <return type-id='type-id-71'/>
    </function-decl>
    <function-decl name='nvpair_value_int16_array' mangled-name='nvpair_value_int16_array' filepath='../../include/sys/nvpair.h' line='263' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_int16_array'>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-101'/>
      <parameter type-id='type-id-31'/>
      <return type-id='type-id-71'/>
    </function-decl>
    <function-decl name='nvpair_value_uint16_array' mangled-name='nvpair_value_uint16_array' filepath='../../include/sys/nvpair.h' line='264' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_uint16_array'>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-102'/>
      <parameter type-id='type-id-31'/>
      <return type-id='type-id-71'/>
    </function-decl>
    <function-decl name='nvpair_value_int32_array' mangled-name='nvpair_value_int32_array' filepath='../../include/sys/nvpair.h' line='265' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_int32_array'>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-103'/>
      <parameter type-id='type-id-31'/>
      <return type-id='type-id-71'/>
    </function-decl>
    <function-decl name='nvpair_value_uint32_array' mangled-name='nvpair_value_uint32_array' filepath='../../include/sys/nvpair.h' line='266' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_uint32_array'>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-104'/>
      <parameter type-id='type-id-31'/>
      <return type-id='type-id-71'/>
    </function-decl>
    <function-decl name='nvpair_value_int64_array' mangled-name='nvpair_value_int64_array' filepath='../../include/sys/nvpair.h' line='267' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_int64_array'>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-105'/>
      <parameter type-id='type-id-31'/>
      <return type-id='type-id-71'/>
    </function-decl>
    <function-decl name='nvpair_value_uint64_array' mangled-name='nvpair_value_uint64_array' filepath='../../include/sys/nvpair.h' line='268' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_uint64_array'>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-106'/>
      <parameter type-id='type-id-31'/>
      <return type-id='type-id-71'/>
    </function-decl>
    <function-decl name='nvpair_value_string_array' mangled-name='nvpair_value_string_array' filepath='../../include/sys/nvpair.h' line='269' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_string_array'>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-107'/>
      <parameter type-id='type-id-31'/>
      <return type-id='type-id-71'/>
    </function-decl>
    <function-decl name='nvpair_value_nvlist_array' mangled-name='nvpair_value_nvlist_array' filepath='../../include/sys/nvpair.h' line='270' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_nvlist_array'>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-108'/>
      <parameter type-id='type-id-31'/>
      <return type-id='type-id-71'/>
    </function-decl>
    <function-decl name='nvpair_value_hrtime' mangled-name='nvpair_value_hrtime' filepath='../../include/sys/nvpair.h' line='271' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_hrtime'>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-109'/>
      <return type-id='type-id-71'/>
    </function-decl>
    <function-decl name='nvpair_value_double' mangled-name='nvpair_value_double' filepath='../../include/sys/nvpair.h' line='273' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_double'>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-96'/>
      <return type-id='type-id-71'/>
    </function-decl>
    <function-decl name='nvlist_prtctl_setdest' mangled-name='nvlist_prtctl_setdest' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='312' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctl_setdest'>
      <parameter type-id='type-id-126' name='pctl' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='312' column='1'/>
      <parameter type-id='type-id-191' name='fp' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='312' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_prtctl_getdest' mangled-name='nvlist_prtctl_getdest' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='318' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctl_getdest'>
      <parameter type-id='type-id-126' name='pctl' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='318' column='1'/>
      <return type-id='type-id-191'/>
    </function-decl>
    <function-decl name='nvlist_prtctl_setindent' mangled-name='nvlist_prtctl_setindent' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='325' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctl_setindent'>
      <parameter type-id='type-id-126' name='pctl' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='325' column='1'/>
      <parameter type-id='type-id-127' name='mode' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='325' column='1'/>
      <parameter type-id='type-id-71' name='start' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='326' column='1'/>
      <parameter type-id='type-id-71' name='inc' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='326' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_prtctl_doindent' mangled-name='nvlist_prtctl_doindent' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='343' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctl_doindent'>
      <parameter type-id='type-id-126' name='pctl' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='343' column='1'/>
      <parameter type-id='type-id-71' name='onemore' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='343' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_prtctl_setfmt' mangled-name='nvlist_prtctl_setfmt' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='350' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctl_setfmt'>
      <parameter type-id='type-id-126' name='pctl' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='350' column='1'/>
      <parameter type-id='type-id-128' name='which' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='350' column='1'/>
      <parameter type-id='type-id-6' name='fmt' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='351' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_prtctl_dofmt' mangled-name='nvlist_prtctl_dofmt' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='383' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctl_dofmt'>
      <parameter type-id='type-id-126' name='pctl' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='383' column='1'/>
      <parameter type-id='type-id-128' name='which' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='383' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_boolean' mangled-name='nvlist_prtctlop_boolean' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='430' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_boolean'>
      <parameter type-id='type-id-126' name='pctl' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='430' column='1'/>
      <parameter type-id='type-id-261' name='func' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='430' column='1'/>
      <parameter type-id='type-id-49' name='private' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='430' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_boolean_value' mangled-name='nvlist_prtctlop_boolean_value' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='431' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_boolean_value'>
      <parameter type-id='type-id-126' name='pctl' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='431' column='1'/>
      <parameter type-id='type-id-275' name='func' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='431' column='1'/>
      <parameter type-id='type-id-49' name='private' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='431' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_byte' mangled-name='nvlist_prtctlop_byte' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='432' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_byte'>
      <parameter type-id='type-id-126' name='pctl' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='432' column='1'/>
      <parameter type-id='type-id-287' name='func' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='432' column='1'/>
      <parameter type-id='type-id-49' name='private' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='432' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_int8' mangled-name='nvlist_prtctlop_int8' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='433' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_int8'>
      <parameter type-id='type-id-126' name='pctl' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='433' column='1'/>
      <parameter type-id='type-id-285' name='func' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='433' column='1'/>
      <parameter type-id='type-id-49' name='private' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='433' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_uint8' mangled-name='nvlist_prtctlop_uint8' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='434' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_uint8'>
      <parameter type-id='type-id-126' name='pctl' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='434' column='1'/>
      <parameter type-id='type-id-295' name='func' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='434' column='1'/>
      <parameter type-id='type-id-49' name='private' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='434' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_int16' mangled-name='nvlist_prtctlop_int16' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='435' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_int16'>
      <parameter type-id='type-id-126' name='pctl' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='435' column='1'/>
      <parameter type-id='type-id-279' name='func' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='435' column='1'/>
      <parameter type-id='type-id-49' name='private' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='435' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_uint16' mangled-name='nvlist_prtctlop_uint16' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='436' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_uint16'>
      <parameter type-id='type-id-126' name='pctl' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='436' column='1'/>
      <parameter type-id='type-id-289' name='func' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='436' column='1'/>
      <parameter type-id='type-id-49' name='private' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='436' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_int32' mangled-name='nvlist_prtctlop_int32' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='437' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_int32'>
      <parameter type-id='type-id-126' name='pctl' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='437' column='1'/>
      <parameter type-id='type-id-281' name='func' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='437' column='1'/>
      <parameter type-id='type-id-49' name='private' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='437' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_uint32' mangled-name='nvlist_prtctlop_uint32' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='438' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_uint32'>
      <parameter type-id='type-id-126' name='pctl' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='438' column='1'/>
      <parameter type-id='type-id-291' name='func' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='438' column='1'/>
      <parameter type-id='type-id-49' name='private' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='438' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_int64' mangled-name='nvlist_prtctlop_int64' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='439' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_int64'>
      <parameter type-id='type-id-126' name='pctl' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='439' column='1'/>
      <parameter type-id='type-id-283' name='func' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='439' column='1'/>
      <parameter type-id='type-id-49' name='private' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='439' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_uint64' mangled-name='nvlist_prtctlop_uint64' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='440' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_uint64'>
      <parameter type-id='type-id-126' name='pctl' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='440' column='1'/>
      <parameter type-id='type-id-293' name='func' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='440' column='1'/>
      <parameter type-id='type-id-49' name='private' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='440' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_double' mangled-name='nvlist_prtctlop_double' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='441' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_double'>
      <parameter type-id='type-id-126' name='pctl' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='441' column='1'/>
      <parameter type-id='type-id-259' name='func' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='441' column='1'/>
      <parameter type-id='type-id-49' name='private' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='441' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_string' mangled-name='nvlist_prtctlop_string' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='442' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_string'>
      <parameter type-id='type-id-126' name='pctl' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='442' column='1'/>
      <parameter type-id='type-id-255' name='func' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='442' column='1'/>
      <parameter type-id='type-id-49' name='private' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='442' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_hrtime' mangled-name='nvlist_prtctlop_hrtime' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='443' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_hrtime'>
      <parameter type-id='type-id-126' name='pctl' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='443' column='1'/>
      <parameter type-id='type-id-277' name='func' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='443' column='1'/>
      <parameter type-id='type-id-49' name='private' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='443' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_nvlist' mangled-name='nvlist_prtctlop_nvlist' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='444' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_nvlist'>
      <parameter type-id='type-id-126' name='pctl' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='444' column='1'/>
      <parameter type-id='type-id-271' name='func' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='444' column='1'/>
      <parameter type-id='type-id-49' name='private' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='444' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_boolean_array' mangled-name='nvlist_prtctlop_boolean_array' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='456' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_boolean_array'>
      <parameter type-id='type-id-126' name='pctl' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='456' column='1'/>
      <parameter type-id='type-id-253' name='func' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='456' column='1'/>
      <parameter type-id='type-id-49' name='private' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='456' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_byte_array' mangled-name='nvlist_prtctlop_byte_array' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='457' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_byte_array'>
      <parameter type-id='type-id-126' name='pctl' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='457' column='1'/>
      <parameter type-id='type-id-297' name='func' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='457' column='1'/>
      <parameter type-id='type-id-49' name='private' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='457' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_int8_array' mangled-name='nvlist_prtctlop_int8_array' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='458' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_int8_array'>
      <parameter type-id='type-id-126' name='pctl' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='458' column='1'/>
      <parameter type-id='type-id-269' name='func' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='458' column='1'/>
      <parameter type-id='type-id-49' name='private' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='458' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_uint8_array' mangled-name='nvlist_prtctlop_uint8_array' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='459' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_uint8_array'>
      <parameter type-id='type-id-126' name='pctl' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='459' column='1'/>
      <parameter type-id='type-id-305' name='func' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='459' column='1'/>
      <parameter type-id='type-id-49' name='private' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='459' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_int16_array' mangled-name='nvlist_prtctlop_int16_array' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='460' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_int16_array'>
      <parameter type-id='type-id-126' name='pctl' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='460' column='1'/>
      <parameter type-id='type-id-263' name='func' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='460' column='1'/>
      <parameter type-id='type-id-49' name='private' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='460' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_uint16_array' mangled-name='nvlist_prtctlop_uint16_array' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='461' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_uint16_array'>
      <parameter type-id='type-id-126' name='pctl' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='461' column='1'/>
      <parameter type-id='type-id-299' name='func' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='461' column='1'/>
      <parameter type-id='type-id-49' name='private' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='461' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_int32_array' mangled-name='nvlist_prtctlop_int32_array' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='462' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_int32_array'>
      <parameter type-id='type-id-126' name='pctl' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='462' column='1'/>
      <parameter type-id='type-id-265' name='func' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='462' column='1'/>
      <parameter type-id='type-id-49' name='private' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='462' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_uint32_array' mangled-name='nvlist_prtctlop_uint32_array' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='463' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_uint32_array'>
      <parameter type-id='type-id-126' name='pctl' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='463' column='1'/>
      <parameter type-id='type-id-301' name='func' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='463' column='1'/>
      <parameter type-id='type-id-49' name='private' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='463' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_int64_array' mangled-name='nvlist_prtctlop_int64_array' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='464' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_int64_array'>
      <parameter type-id='type-id-126' name='pctl' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='464' column='1'/>
      <parameter type-id='type-id-267' name='func' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='464' column='1'/>
      <parameter type-id='type-id-49' name='private' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='464' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_uint64_array' mangled-name='nvlist_prtctlop_uint64_array' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='465' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_uint64_array'>
      <parameter type-id='type-id-126' name='pctl' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='465' column='1'/>
      <parameter type-id='type-id-303' name='func' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='465' column='1'/>
      <parameter type-id='type-id-49' name='private' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='465' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_string_array' mangled-name='nvlist_prtctlop_string_array' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='466' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_string_array'>
      <parameter type-id='type-id-126' name='pctl' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='466' column='1'/>
      <parameter type-id='type-id-257' name='func' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='466' column='1'/>
      <parameter type-id='type-id-49' name='private' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='466' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_nvlist_array' mangled-name='nvlist_prtctlop_nvlist_array' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='467' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_nvlist_array'>
      <parameter type-id='type-id-126' name='pctl' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='467' column='1'/>
      <parameter type-id='type-id-273' name='func' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='467' column='1'/>
      <parameter type-id='type-id-49' name='private' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='467' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_prtctl_alloc' mangled-name='nvlist_prtctl_alloc' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='527' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctl_alloc'>
      <return type-id='type-id-126'/>
    </function-decl>
    <function-decl name='nvlist_prtctl_free' mangled-name='nvlist_prtctl_free' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='546' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctl_free'>
      <parameter type-id='type-id-126' name='pctl' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='546' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_print' mangled-name='nvlist_print' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='757' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_print'>
      <parameter type-id='type-id-191' name='fp' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='757' column='1'/>
      <parameter type-id='type-id-1' name='nvl' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='757' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_prt' mangled-name='nvlist_prt' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='766' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prt'>
      <parameter type-id='type-id-1' name='nvl' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='766' column='1'/>
      <parameter type-id='type-id-126' name='pctl' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='766' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='dump_nvlist' mangled-name='dump_nvlist' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='794' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dump_nvlist'>
      <parameter type-id='type-id-1' name='list' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='794' column='1'/>
      <parameter type-id='type-id-71' name='indent' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='794' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvpair_value_match_regex' mangled-name='nvpair_value_match_regex' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='949' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_match_regex'>
      <parameter type-id='type-id-17' name='nvp' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='949' column='1'/>
      <parameter type-id='type-id-71' name='ai' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='949' column='1'/>
      <parameter type-id='type-id-5' name='value' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='950' column='1'/>
      <parameter type-id='type-id-306' name='value_regex' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='950' column='1'/>
      <parameter type-id='type-id-66' name='ep' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='950' column='1'/>
      <return type-id='type-id-71'/>
    </function-decl>
    <function-decl name='nvpair_value_match' mangled-name='nvpair_value_match' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='1274' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_match'>
      <parameter type-id='type-id-17' name='nvp' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='1274' column='1'/>
      <parameter type-id='type-id-71' name='ai' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='1274' column='1'/>
      <parameter type-id='type-id-5' name='value' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='1274' column='1'/>
      <parameter type-id='type-id-66' name='ep' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair.c' line='1274' column='1'/>
      <return type-id='type-id-71'/>
    </function-decl>
    <function-decl name='dcgettext' filepath='/usr/include/libintl.h' line='51' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-71'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='regexec' filepath='/usr/include/regex.h' line='643' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-224'/>
      <parameter type-id='type-id-110'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-308'/>
      <parameter type-id='type-id-71'/>
      <return type-id='type-id-71'/>
    </function-decl>
    <function-decl name='fprintf' filepath='/usr/include/stdio.h' line='326' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-220'/>
      <parameter type-id='type-id-110'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-71'/>
    </function-decl>
    <function-decl name='printf' filepath='/usr/include/stdio.h' line='332' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-6'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-71'/>
    </function-decl>
    <function-decl name='malloc' filepath='/usr/include/stdlib.h' line='539' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-49'/>
    </function-decl>
    <function-decl name='calloc' filepath='/usr/include/stdlib.h' line='542' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-49'/>
    </function-decl>
    <function-decl name='free' filepath='/usr/include/stdlib.h' line='565' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-49'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='strcmp' filepath='/usr/include/string.h' line='140' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-71'/>
    </function-decl>
    <function-decl name='strcspn' filepath='/usr/include/string.h' line='277' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='strspn' filepath='/usr/include/string.h' line='281' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-225'>
      <parameter type-id='type-id-125'/>
      <parameter type-id='type-id-49'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-71'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-226'>
      <parameter type-id='type-id-125'/>
      <parameter type-id='type-id-49'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-71'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-227'>
      <parameter type-id='type-id-125'/>
      <parameter type-id='type-id-49'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-66'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-71'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-228'>
      <parameter type-id='type-id-125'/>
      <parameter type-id='type-id-49'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-94'/>
      <return type-id='type-id-71'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-229'>
      <parameter type-id='type-id-125'/>
      <parameter type-id='type-id-49'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-71'/>
      <return type-id='type-id-71'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-230'>
      <parameter type-id='type-id-125'/>
      <parameter type-id='type-id-49'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-71'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-231'>
      <parameter type-id='type-id-125'/>
      <parameter type-id='type-id-49'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-25'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-71'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-232'>
      <parameter type-id='type-id-125'/>
      <parameter type-id='type-id-49'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-71'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-233'>
      <parameter type-id='type-id-125'/>
      <parameter type-id='type-id-49'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-21'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-71'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-234'>
      <parameter type-id='type-id-125'/>
      <parameter type-id='type-id-49'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-71'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-235'>
      <parameter type-id='type-id-125'/>
      <parameter type-id='type-id-49'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-30'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-71'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-236'>
      <parameter type-id='type-id-125'/>
      <parameter type-id='type-id-49'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-71'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-237'>
      <parameter type-id='type-id-125'/>
      <parameter type-id='type-id-49'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-95'/>
      <return type-id='type-id-71'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-238'>
      <parameter type-id='type-id-125'/>
      <parameter type-id='type-id-49'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-11'/>
      <return type-id='type-id-71'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-239'>
      <parameter type-id='type-id-125'/>
      <parameter type-id='type-id-49'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-13'/>
      <return type-id='type-id-71'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-240'>
      <parameter type-id='type-id-125'/>
      <parameter type-id='type-id-49'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-71'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-241'>
      <parameter type-id='type-id-125'/>
      <parameter type-id='type-id-49'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-71'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-242'>
      <parameter type-id='type-id-125'/>
      <parameter type-id='type-id-49'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-71'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-243'>
      <parameter type-id='type-id-125'/>
      <parameter type-id='type-id-49'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-12'/>
      <return type-id='type-id-71'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-244'>
      <parameter type-id='type-id-125'/>
      <parameter type-id='type-id-49'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-14'/>
      <return type-id='type-id-71'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-245'>
      <parameter type-id='type-id-125'/>
      <parameter type-id='type-id-49'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-71'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-246'>
      <parameter type-id='type-id-125'/>
      <parameter type-id='type-id-49'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-10'/>
      <return type-id='type-id-71'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-247'>
      <parameter type-id='type-id-125'/>
      <parameter type-id='type-id-49'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-20'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-71'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-248'>
      <parameter type-id='type-id-125'/>
      <parameter type-id='type-id-49'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-24'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-71'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-249'>
      <parameter type-id='type-id-125'/>
      <parameter type-id='type-id-49'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-71'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-250'>
      <parameter type-id='type-id-125'/>
      <parameter type-id='type-id-49'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-28'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-71'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-251'>
      <parameter type-id='type-id-125'/>
      <parameter type-id='type-id-49'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-22'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-71'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-252'>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-49'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-71'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-254'>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-49'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-71'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-256'>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-49'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-66'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-71'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-258'>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-49'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-94'/>
      <return type-id='type-id-71'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-260'>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-49'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-71'/>
      <return type-id='type-id-71'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-262'>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-49'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-71'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-264'>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-49'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-25'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-71'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-266'>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-49'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-71'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-268'>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-49'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-21'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-71'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-270'>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-49'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-71'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-272'>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-49'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-30'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-71'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-274'>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-49'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-71'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-276'>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-49'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-95'/>
      <return type-id='type-id-71'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-278'>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-49'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-11'/>
      <return type-id='type-id-71'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-280'>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-49'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-13'/>
      <return type-id='type-id-71'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-282'>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-49'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-71'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-284'>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-49'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-71'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-286'>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-49'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-71'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-288'>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-49'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-12'/>
      <return type-id='type-id-71'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-290'>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-49'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-14'/>
      <return type-id='type-id-71'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-292'>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-49'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-71'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-294'>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-49'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-10'/>
      <return type-id='type-id-71'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-296'>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-49'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-20'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-71'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-298'>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-49'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-24'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-71'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-300'>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-49'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-71'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-302'>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-49'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-28'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-71'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-304'>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-49'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-22'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-71'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='libnvpair_json.c' comp-dir-path='/home/hutter2/release20/lib/libnvpair' language='LANG_C99'>
    <array-type-def dimensions='1' type-id='type-id-112' size-in-bits='32' id='type-id-309'>
      <subrange length='4' type-id='type-id-38' id='type-id-310'/>
    </array-type-def>
    <class-decl name='__mbstate_t' size-in-bits='64' is-struct='yes' naming-typedef-id='type-id-311' visibility='default' filepath='/usr/include/bits/types/__mbstate_t.h' line='13' column='1' id='type-id-312'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__count' type-id='type-id-71' visibility='default' filepath='/usr/include/bits/types/__mbstate_t.h' line='15' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='__value' type-id='type-id-313' visibility='default' filepath='/usr/include/bits/types/__mbstate_t.h' line='20' column='1'/>
      </data-member>
    </class-decl>
    <union-decl name='__anonymous_union__' size-in-bits='32' is-anonymous='yes' visibility='default' filepath='/usr/include/bits/types/__mbstate_t.h' line='16' column='1' id='type-id-313'>
      <data-member access='public'>
        <var-decl name='__wch' type-id='type-id-34' visibility='default' filepath='/usr/include/bits/types/__mbstate_t.h' line='18' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__wchb' type-id='type-id-309' visibility='default' filepath='/usr/include/bits/types/__mbstate_t.h' line='19' column='1'/>
      </data-member>
    </union-decl>
    <typedef-decl name='__mbstate_t' type-id='type-id-312' filepath='/usr/include/bits/types/__mbstate_t.h' line='21' column='1' id='type-id-311'/>
    <typedef-decl name='mbstate_t' type-id='type-id-311' filepath='/usr/include/bits/types/mbstate_t.h' line='6' column='1' id='type-id-314'/>
    <typedef-decl name='wchar_t' type-id='type-id-71' filepath='/usr/lib/gcc/x86_64-redhat-linux/10/include/stddef.h' line='321' column='1' id='type-id-315'/>
    <pointer-type-def type-id='type-id-314' size-in-bits='64' id='type-id-316'/>
    <qualified-type-def type-id='type-id-316' restrict='yes' id='type-id-317'/>
    <pointer-type-def type-id='type-id-315' size-in-bits='64' id='type-id-318'/>
    <qualified-type-def type-id='type-id-318' restrict='yes' id='type-id-319'/>
    <function-decl name='fnvpair_value_boolean_value' mangled-name='fnvpair_value_boolean_value' filepath='../../include/sys/nvpair.h' line='341' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvpair_value_boolean_value'>
      <parameter type-id='type-id-17'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='fnvpair_value_byte' mangled-name='fnvpair_value_byte' filepath='../../include/sys/nvpair.h' line='342' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvpair_value_byte'>
      <parameter type-id='type-id-17'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='fnvpair_value_int8' mangled-name='fnvpair_value_int8' filepath='../../include/sys/nvpair.h' line='343' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvpair_value_int8'>
      <parameter type-id='type-id-17'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='fnvpair_value_int16' mangled-name='fnvpair_value_int16' filepath='../../include/sys/nvpair.h' line='344' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvpair_value_int16'>
      <parameter type-id='type-id-17'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='fnvpair_value_int32' mangled-name='fnvpair_value_int32' filepath='../../include/sys/nvpair.h' line='345' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvpair_value_int32'>
      <parameter type-id='type-id-17'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='fnvpair_value_int64' mangled-name='fnvpair_value_int64' filepath='../../include/sys/nvpair.h' line='346' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvpair_value_int64'>
      <parameter type-id='type-id-17'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='fnvpair_value_uint8' mangled-name='fnvpair_value_uint8' filepath='../../include/sys/nvpair.h' line='347' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvpair_value_uint8'>
      <parameter type-id='type-id-17'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='fnvpair_value_uint16' mangled-name='fnvpair_value_uint16' filepath='../../include/sys/nvpair.h' line='348' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvpair_value_uint16'>
      <parameter type-id='type-id-17'/>
      <return type-id='type-id-12'/>
    </function-decl>
    <function-decl name='fnvpair_value_uint32' mangled-name='fnvpair_value_uint32' filepath='../../include/sys/nvpair.h' line='349' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvpair_value_uint32'>
      <parameter type-id='type-id-17'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='fnvpair_value_uint64' mangled-name='fnvpair_value_uint64' filepath='../../include/sys/nvpair.h' line='350' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvpair_value_uint64'>
      <parameter type-id='type-id-17'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='fnvpair_value_string' mangled-name='fnvpair_value_string' filepath='../../include/sys/nvpair.h' line='351' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvpair_value_string'>
      <parameter type-id='type-id-17'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='fnvpair_value_nvlist' mangled-name='fnvpair_value_nvlist' filepath='../../include/sys/nvpair.h' line='352' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvpair_value_nvlist'>
      <parameter type-id='type-id-17'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='libspl_assertf' mangled-name='libspl_assertf' filepath='../../lib/libspl/include/assert.h' line='40' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='libspl_assertf'>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-71'/>
      <parameter type-id='type-id-6'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_print_json' mangled-name='nvlist_print_json' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair_json.c' line='118' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_print_json'>
      <parameter type-id='type-id-191' name='fp' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair_json.c' line='118' column='1'/>
      <parameter type-id='type-id-1' name='nvl' filepath='/home/hutter2/release20/lib/libnvpair/libnvpair_json.c' line='118' column='1'/>
      <return type-id='type-id-71'/>
    </function-decl>
    <function-decl name='__ctype_get_mb_cur_max' filepath='/usr/include/stdlib.h' line='97' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='mbrtowc' filepath='/usr/include/wchar.h' line='296' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-319'/>
      <parameter type-id='type-id-110'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-317'/>
      <return type-id='type-id-3'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='nvpair_alloc_system.c' comp-dir-path='/home/hutter2/release20/lib/libnvpair' language='LANG_C99'>
    <class-decl name='__va_list_tag' size-in-bits='192' is-struct='yes' visibility='default' id='type-id-320'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='gp_offset' type-id='type-id-34' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='fp_offset' type-id='type-id-34' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='overflow_arg_area' type-id='type-id-49' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='reg_save_area' type-id='type-id-49' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='nv_alloc_ops_t' type-id='type-id-321' filepath='../../include/sys/nvpair.h' line='123' column='1' id='type-id-322'/>
    <class-decl name='nv_alloc' size-in-bits='128' is-struct='yes' visibility='default' filepath='../../include/sys/nvpair.h' line='125' column='1' id='type-id-323'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nva_ops' type-id='type-id-92' visibility='default' filepath='../../include/sys/nvpair.h' line='126' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='nva_arg' type-id='type-id-49' visibility='default' filepath='../../include/sys/nvpair.h' line='127' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='nv_alloc_t' type-id='type-id-323' filepath='../../include/sys/nvpair.h' line='128' column='1' id='type-id-324'/>
    <class-decl name='nv_alloc_ops' size-in-bits='320' is-struct='yes' visibility='default' filepath='../../include/sys/nvpair.h' line='130' column='1' id='type-id-321'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nv_ao_init' type-id='type-id-325' visibility='default' filepath='../../include/sys/nvpair.h' line='131' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='nv_ao_fini' type-id='type-id-326' visibility='default' filepath='../../include/sys/nvpair.h' line='132' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='nv_ao_alloc' type-id='type-id-327' visibility='default' filepath='../../include/sys/nvpair.h' line='133' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='nv_ao_free' type-id='type-id-328' visibility='default' filepath='../../include/sys/nvpair.h' line='134' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='nv_ao_reset' type-id='type-id-326' visibility='default' filepath='../../include/sys/nvpair.h' line='135' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-320' size-in-bits='64' id='type-id-329'/>
    <qualified-type-def type-id='type-id-322' const='yes' id='type-id-111'/>
    <pointer-type-def type-id='type-id-111' size-in-bits='64' id='type-id-92'/>
    <pointer-type-def type-id='type-id-330' size-in-bits='64' id='type-id-325'/>
    <pointer-type-def type-id='type-id-324' size-in-bits='64' id='type-id-91'/>
    <pointer-type-def type-id='type-id-331' size-in-bits='64' id='type-id-326'/>
    <pointer-type-def type-id='type-id-332' size-in-bits='64' id='type-id-328'/>
    <pointer-type-def type-id='type-id-333' size-in-bits='64' id='type-id-327'/>
    <var-decl name='nv_alloc_nosleep' type-id='type-id-91' mangled-name='nv_alloc_nosleep' visibility='default' filepath='../../include/sys/nvpair.h' line='139' column='1' elf-symbol-id='nv_alloc_nosleep'/>
    <var-decl name='nv_alloc_sleep_def' type-id='type-id-324' mangled-name='nv_alloc_sleep_def' visibility='default' filepath='/home/hutter2/release20/lib/libnvpair/nvpair_alloc_system.c' line='54' column='1' elf-symbol-id='nv_alloc_sleep_def'/>
    <var-decl name='nv_alloc_nosleep_def' type-id='type-id-324' mangled-name='nv_alloc_nosleep_def' visibility='default' filepath='/home/hutter2/release20/lib/libnvpair/nvpair_alloc_system.c' line='59' column='1' elf-symbol-id='nv_alloc_nosleep_def'/>
    <var-decl name='nv_alloc_sleep' type-id='type-id-91' mangled-name='nv_alloc_sleep' visibility='default' filepath='/home/hutter2/release20/lib/libnvpair/nvpair_alloc_system.c' line='64' column='1' elf-symbol-id='nv_alloc_sleep'/>
    <function-type size-in-bits='64' id='type-id-330'>
      <parameter type-id='type-id-91'/>
      <parameter type-id='type-id-329'/>
      <return type-id='type-id-71'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-331'>
      <parameter type-id='type-id-91'/>
      <return type-id='type-id-2'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-332'>
      <parameter type-id='type-id-91'/>
      <parameter type-id='type-id-49'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-2'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-333'>
      <parameter type-id='type-id-91'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-49'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='assert.c' comp-dir-path='/home/hutter2/release20/lib/libspl' language='LANG_C99'>
    <var-decl name='aok' type-id='type-id-71' mangled-name='aok' visibility='default' filepath='../../lib/libspl/include/assert.h' line='37' column='1' elf-symbol-id='aok'/>
    <function-decl name='vfprintf' filepath='/usr/include/stdio.h' line='341' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-220'/>
      <parameter type-id='type-id-110'/>
      <parameter type-id='type-id-329'/>
      <return type-id='type-id-71'/>
    </function-decl>
    <function-decl name='abort' filepath='/usr/include/stdlib.h' line='591' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-2'/>
    </function-decl>
  </abi-instr>
</abi-corpus>
