<abi-corpus path='libnvpair.so' architecture='elf-amd-x86_64' soname='libnvpair.so.3'>
  <elf-needed>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='dump_nvlist' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fnvlist_add_boolean' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fnvlist_add_boolean_array' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fnvlist_add_boolean_value' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fnvlist_add_byte' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fnvlist_add_byte_array' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fnvlist_add_int16' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fnvlist_add_int16_array' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fnvlist_add_int32' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='nvpair_name' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_type' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_type_is_array' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_boolean_array' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_boolean_value' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_byte' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_byte_array' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_double' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_hrtime' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_int16' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_int16_array' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_int32' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_int32_array' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_int64' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_int64_array' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_int8' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_int8_array' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_match' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_match_regex' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_nvlist' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_nvlist_array' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_string' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_string_array' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_uint16' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_uint16_array' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_uint32' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_uint32_array' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_uint64' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_uint64_array' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_uint8' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_uint8_array' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <elf-variable-symbols>
    <elf-symbol name='libspl_assert_ok' size='4' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nv_alloc_nosleep' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nv_alloc_nosleep_def' size='16' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nv_alloc_sleep' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nv_alloc_sleep_def' size='16' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nv_fixed_ops' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nv_fixed_ops_def' size='40' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvlist_hashtable_init_size' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_max_recursion' size='4' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-variable-symbols>
  <abi-instr version='1.0' address-size='64' path='libnvpair.c' comp-dir-path='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair' language='LANG_C99'>
    <type-decl name='void' id='type-id-1'/>
    <class-decl name='nvlist_prtctl' size-in-bits='576' is-struct='yes' visibility='default' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='91' column='1' id='type-id-2'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nvprt_fp' type-id='type-id-3' visibility='default' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='nvprt_indent_mode' type-id='type-id-4' visibility='default' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='nvprt_indent' type-id='type-id-5' visibility='default' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='nvprt_indentinc' type-id='type-id-5' visibility='default' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='nvprt_nmfmt' type-id='type-id-6' visibility='default' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='nvprt_eomfmt' type-id='type-id-6' visibility='default' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='97' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='nvprt_btwnarrfmt' type-id='type-id-6' visibility='default' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='98' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='nvprt_btwnarrfmt_nl' type-id='type-id-5' visibility='default' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='99' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='nvprt_dfltops' type-id='type-id-7' visibility='default' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='100' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='nvprt_custops' type-id='type-id-7' visibility='default' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='101' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_IO_FILE' size-in-bits='1728' is-struct='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='49' column='1' id='type-id-8'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_flags' type-id='type-id-5' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_IO_read_ptr' type-id='type-id-9' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_IO_read_end' type-id='type-id-9' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_IO_read_base' type-id='type-id-9' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='_IO_write_base' type-id='type-id-9' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='_IO_write_ptr' type-id='type-id-9' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_IO_write_end' type-id='type-id-9' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='_IO_buf_base' type-id='type-id-9' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='_IO_buf_end' type-id='type-id-9' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='_IO_save_base' type-id='type-id-9' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='_IO_backup_base' type-id='type-id-9' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='_IO_save_end' type-id='type-id-9' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='_markers' type-id='type-id-10' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='_chain' type-id='type-id-11' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='_fileno' type-id='type-id-5' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='_flags2' type-id='type-id-5' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='_old_offset' type-id='type-id-12' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='_cur_column' type-id='type-id-13' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1040'>
        <var-decl name='_vtable_offset' type-id='type-id-14' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1048'>
        <var-decl name='_shortbuf' type-id='type-id-15' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='_offset' type-id='type-id-16' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='_codecvt' type-id='type-id-17' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='_wide_data' type-id='type-id-18' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='_freeres_list' type-id='type-id-11' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='_freeres_buf' type-id='type-id-19' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='__pad5' type-id='type-id-20' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='_mode' type-id='type-id-5' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='_unused2' type-id='type-id-21' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='98' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='int' size-in-bits='32' id='type-id-5'/>
    <type-decl name='char' size-in-bits='8' id='type-id-22'/>
    <pointer-type-def type-id='type-id-22' size-in-bits='64' id='type-id-9'/>
    <class-decl name='_IO_marker' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-23'/>
    <pointer-type-def type-id='type-id-23' size-in-bits='64' id='type-id-10'/>
    <pointer-type-def type-id='type-id-8' size-in-bits='64' id='type-id-11'/>
    <type-decl name='long int' size-in-bits='64' id='type-id-24'/>
    <typedef-decl name='__off_t' type-id='type-id-24' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='150' column='1' id='type-id-12'/>
    <type-decl name='unsigned short int' size-in-bits='16' id='type-id-13'/>
    <type-decl name='signed char' size-in-bits='8' id='type-id-14'/>
    <type-decl name='__ARRAY_SIZE_TYPE__' size-in-bits='64' id='type-id-25'/>

    <array-type-def dimensions='1' type-id='type-id-22' size-in-bits='8' id='type-id-15'>
      <subrange length='1' type-id='type-id-25' id='type-id-26'/>

    </array-type-def>
    <typedef-decl name='__off64_t' type-id='type-id-24' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='151' column='1' id='type-id-16'/>
    <class-decl name='_IO_codecvt' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-27'/>
    <pointer-type-def type-id='type-id-27' size-in-bits='64' id='type-id-17'/>
    <class-decl name='_IO_wide_data' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-28'/>
    <pointer-type-def type-id='type-id-28' size-in-bits='64' id='type-id-18'/>
    <pointer-type-def type-id='type-id-1' size-in-bits='64' id='type-id-19'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-29'/>
    <typedef-decl name='size_t' type-id='type-id-29' filepath='/usr/lib/llvm-13/lib/clang/13.0.0/include/stddef.h' line='46' column='1' id='type-id-20'/>

    <array-type-def dimensions='1' type-id='type-id-22' size-in-bits='160' id='type-id-21'>
      <subrange length='20' type-id='type-id-25' id='type-id-30'/>

    </array-type-def>
    <typedef-decl name='FILE' type-id='type-id-8' filepath='/usr/include/x86_64-linux-gnu/bits/types/FILE.h' line='7' column='1' id='type-id-31'/>
    <pointer-type-def type-id='type-id-31' size-in-bits='64' id='type-id-3'/>
    <type-decl name='unnamed-enum-underlying-type' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='type-id-32'/>
    <enum-decl name='nvlist_indent_mode' filepath='../../include/libnvpair.h' line='86' column='1' id='type-id-4'>
      <underlying-type type-id='type-id-32'/>
      <enumerator name='NVLIST_INDENT_ABS' value='0'/>
      <enumerator name='NVLIST_INDENT_TABBED' value='1'/>
    </enum-decl>
    <qualified-type-def type-id='type-id-22' const='yes' id='type-id-33'/>
    <pointer-type-def type-id='type-id-33' size-in-bits='64' id='type-id-6'/>
    <class-decl name='nvlist_printops' size-in-bits='3456' is-struct='yes' visibility='default' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='61' column='1' id='type-id-34'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='print_boolean' type-id='type-id-35' visibility='default' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='print_boolean_value' type-id='type-id-36' visibility='default' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='print_byte' type-id='type-id-37' visibility='default' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='print_int8' type-id='type-id-38' visibility='default' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='print_uint8' type-id='type-id-39' visibility='default' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='print_int16' type-id='type-id-40' visibility='default' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='print_uint16' type-id='type-id-41' visibility='default' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='print_int32' type-id='type-id-42' visibility='default' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='print_uint32' type-id='type-id-43' visibility='default' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='print_int64' type-id='type-id-44' visibility='default' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='71' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='print_uint64' type-id='type-id-45' visibility='default' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='print_double' type-id='type-id-46' visibility='default' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='print_string' type-id='type-id-47' visibility='default' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='print_hrtime' type-id='type-id-48' visibility='default' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='print_nvlist' type-id='type-id-49' visibility='default' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1920'>
        <var-decl name='print_boolean_array' type-id='type-id-50' visibility='default' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='print_byte_array' type-id='type-id-51' visibility='default' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='print_int8_array' type-id='type-id-52' visibility='default' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2304'>
        <var-decl name='print_uint8_array' type-id='type-id-53' visibility='default' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='80' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2432'>
        <var-decl name='print_int16_array' type-id='type-id-54' visibility='default' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2560'>
        <var-decl name='print_uint16_array' type-id='type-id-55' visibility='default' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='82' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2688'>
        <var-decl name='print_int32_array' type-id='type-id-56' visibility='default' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='83' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2816'>
        <var-decl name='print_uint32_array' type-id='type-id-57' visibility='default' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2944'>
        <var-decl name='print_int64_array' type-id='type-id-58' visibility='default' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='85' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3072'>
        <var-decl name='print_uint64_array' type-id='type-id-59' visibility='default' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3200'>
        <var-decl name='print_string_array' type-id='type-id-60' visibility='default' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='87' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3328'>
        <var-decl name='print_nvlist_array' type-id='type-id-61' visibility='default' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='88' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='62' column='1' id='type-id-35'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-62' visibility='default' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-19' visibility='default' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='62' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-2' size-in-bits='64' id='type-id-63'/>
    <class-decl name='nvlist' size-in-bits='192' is-struct='yes' visibility='default' filepath='../../include/sys/nvpair.h' line='85' column='1' id='type-id-64'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nvl_version' type-id='type-id-65' visibility='default' filepath='../../include/sys/nvpair.h' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='nvl_nvflag' type-id='type-id-66' visibility='default' filepath='../../include/sys/nvpair.h' line='87' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='nvl_priv' type-id='type-id-67' visibility='default' filepath='../../include/sys/nvpair.h' line='88' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='nvl_flag' type-id='type-id-66' visibility='default' filepath='../../include/sys/nvpair.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='nvl_pad' type-id='type-id-65' visibility='default' filepath='../../include/sys/nvpair.h' line='90' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__int32_t' type-id='type-id-5' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='40' column='1' id='type-id-68'/>
    <typedef-decl name='int32_t' type-id='type-id-68' filepath='/usr/include/x86_64-linux-gnu/bits/stdint-intn.h' line='26' column='1' id='type-id-65'/>
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-69'/>
    <typedef-decl name='__uint32_t' type-id='type-id-69' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='41' column='1' id='type-id-70'/>
    <typedef-decl name='uint32_t' type-id='type-id-70' filepath='/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h' line='26' column='1' id='type-id-66'/>
    <typedef-decl name='__uint64_t' type-id='type-id-29' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='44' column='1' id='type-id-71'/>
    <typedef-decl name='uint64_t' type-id='type-id-71' filepath='/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h' line='27' column='1' id='type-id-67'/>
    <typedef-decl name='nvlist_t' type-id='type-id-64' filepath='../../include/sys/nvpair.h' line='91' column='1' id='type-id-72'/>
    <pointer-type-def type-id='type-id-72' size-in-bits='64' id='type-id-73'/>
    <pointer-type-def type-id='type-id-74' size-in-bits='64' id='type-id-62'/>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='63' column='1' id='type-id-36'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-75' visibility='default' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-19' visibility='default' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='63' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' filepath='../../lib/libspl/include/sys/stdtypes.h' line='26' column='1' id='type-id-76'>
      <underlying-type type-id='type-id-32'/>
      <enumerator name='B_FALSE' value='0'/>
      <enumerator name='B_TRUE' value='1'/>
    </enum-decl>
    <typedef-decl name='boolean_t' type-id='type-id-76' filepath='../../lib/libspl/include/sys/stdtypes.h' line='29' column='1' id='type-id-77'/>
    <pointer-type-def type-id='type-id-78' size-in-bits='64' id='type-id-75'/>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='64' column='1' id='type-id-37'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-79' visibility='default' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-19' visibility='default' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='64' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='unsigned char' size-in-bits='8' id='type-id-80'/>
    <typedef-decl name='uchar_t' type-id='type-id-80' filepath='../../lib/libspl/include/sys/stdtypes.h' line='31' column='1' id='type-id-81'/>
    <pointer-type-def type-id='type-id-82' size-in-bits='64' id='type-id-79'/>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='65' column='1' id='type-id-38'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-83' visibility='default' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-19' visibility='default' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='65' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__int8_t' type-id='type-id-14' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='36' column='1' id='type-id-84'/>
    <typedef-decl name='int8_t' type-id='type-id-84' filepath='/usr/include/x86_64-linux-gnu/bits/stdint-intn.h' line='24' column='1' id='type-id-85'/>
    <pointer-type-def type-id='type-id-86' size-in-bits='64' id='type-id-83'/>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='66' column='1' id='type-id-39'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-87' visibility='default' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-19' visibility='default' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='66' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__uint8_t' type-id='type-id-80' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='37' column='1' id='type-id-88'/>
    <typedef-decl name='uint8_t' type-id='type-id-88' filepath='/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h' line='24' column='1' id='type-id-89'/>
    <pointer-type-def type-id='type-id-90' size-in-bits='64' id='type-id-87'/>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='67' column='1' id='type-id-40'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-91' visibility='default' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-19' visibility='default' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='67' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='short int' size-in-bits='16' id='type-id-92'/>
    <typedef-decl name='__int16_t' type-id='type-id-92' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='38' column='1' id='type-id-93'/>
    <typedef-decl name='int16_t' type-id='type-id-93' filepath='/usr/include/x86_64-linux-gnu/bits/stdint-intn.h' line='25' column='1' id='type-id-94'/>
    <pointer-type-def type-id='type-id-95' size-in-bits='64' id='type-id-91'/>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='68' column='1' id='type-id-41'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-96' visibility='default' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-19' visibility='default' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='68' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__uint16_t' type-id='type-id-13' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='39' column='1' id='type-id-97'/>
    <typedef-decl name='uint16_t' type-id='type-id-97' filepath='/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h' line='25' column='1' id='type-id-98'/>
    <pointer-type-def type-id='type-id-99' size-in-bits='64' id='type-id-96'/>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='69' column='1' id='type-id-42'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-100' visibility='default' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-19' visibility='default' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='69' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-101' size-in-bits='64' id='type-id-100'/>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='70' column='1' id='type-id-43'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-102' visibility='default' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-19' visibility='default' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='70' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-103' size-in-bits='64' id='type-id-102'/>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='71' column='1' id='type-id-44'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-104' visibility='default' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='71' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-19' visibility='default' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='71' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__int64_t' type-id='type-id-24' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='43' column='1' id='type-id-105'/>
    <typedef-decl name='int64_t' type-id='type-id-105' filepath='/usr/include/x86_64-linux-gnu/bits/stdint-intn.h' line='27' column='1' id='type-id-106'/>
    <pointer-type-def type-id='type-id-107' size-in-bits='64' id='type-id-104'/>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='72' column='1' id='type-id-45'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-108' visibility='default' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-19' visibility='default' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='72' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-109' size-in-bits='64' id='type-id-108'/>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='73' column='1' id='type-id-46'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-110' visibility='default' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-19' visibility='default' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='73' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='double' size-in-bits='64' id='type-id-111'/>
    <pointer-type-def type-id='type-id-112' size-in-bits='64' id='type-id-110'/>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='74' column='1' id='type-id-47'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-113' visibility='default' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-19' visibility='default' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='74' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-114' size-in-bits='64' id='type-id-113'/>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='75' column='1' id='type-id-48'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-115' visibility='default' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-19' visibility='default' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='75' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='long long int' size-in-bits='64' id='type-id-116'/>
    <typedef-decl name='hrtime_t' type-id='type-id-116' filepath='../../lib/libspl/include/sys/time.h' line='78' column='1' id='type-id-117'/>
    <pointer-type-def type-id='type-id-118' size-in-bits='64' id='type-id-115'/>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='76' column='1' id='type-id-49'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-119' visibility='default' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-19' visibility='default' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='76' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-120' size-in-bits='64' id='type-id-119'/>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='77' column='1' id='type-id-50'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-121' visibility='default' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-19' visibility='default' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='77' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-77' size-in-bits='64' id='type-id-122'/>
    <typedef-decl name='uint_t' type-id='type-id-69' filepath='../../lib/libspl/include/sys/stdtypes.h' line='33' column='1' id='type-id-123'/>
    <pointer-type-def type-id='type-id-124' size-in-bits='64' id='type-id-121'/>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='78' column='1' id='type-id-51'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-125' visibility='default' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-19' visibility='default' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='78' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-81' size-in-bits='64' id='type-id-126'/>
    <pointer-type-def type-id='type-id-127' size-in-bits='64' id='type-id-125'/>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='79' column='1' id='type-id-52'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-128' visibility='default' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-19' visibility='default' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='79' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-85' size-in-bits='64' id='type-id-129'/>
    <pointer-type-def type-id='type-id-130' size-in-bits='64' id='type-id-128'/>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='80' column='1' id='type-id-53'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-131' visibility='default' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='80' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-19' visibility='default' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='80' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-89' size-in-bits='64' id='type-id-132'/>
    <pointer-type-def type-id='type-id-133' size-in-bits='64' id='type-id-131'/>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='81' column='1' id='type-id-54'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-134' visibility='default' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-19' visibility='default' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='81' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-94' size-in-bits='64' id='type-id-135'/>
    <pointer-type-def type-id='type-id-136' size-in-bits='64' id='type-id-134'/>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='82' column='1' id='type-id-55'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-137' visibility='default' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='82' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-19' visibility='default' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='82' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-98' size-in-bits='64' id='type-id-138'/>
    <pointer-type-def type-id='type-id-139' size-in-bits='64' id='type-id-137'/>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='83' column='1' id='type-id-56'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-140' visibility='default' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='83' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-19' visibility='default' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='83' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-65' size-in-bits='64' id='type-id-141'/>
    <pointer-type-def type-id='type-id-142' size-in-bits='64' id='type-id-140'/>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='84' column='1' id='type-id-57'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-143' visibility='default' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-19' visibility='default' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='84' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-66' size-in-bits='64' id='type-id-144'/>
    <pointer-type-def type-id='type-id-145' size-in-bits='64' id='type-id-143'/>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='85' column='1' id='type-id-58'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-146' visibility='default' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='85' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-19' visibility='default' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='85' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-106' size-in-bits='64' id='type-id-147'/>
    <pointer-type-def type-id='type-id-148' size-in-bits='64' id='type-id-146'/>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='86' column='1' id='type-id-59'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-149' visibility='default' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-19' visibility='default' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='86' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-67' size-in-bits='64' id='type-id-150'/>
    <pointer-type-def type-id='type-id-151' size-in-bits='64' id='type-id-149'/>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='87' column='1' id='type-id-60'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-152' visibility='default' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='87' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-19' visibility='default' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='87' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-9' size-in-bits='64' id='type-id-153'/>
    <pointer-type-def type-id='type-id-154' size-in-bits='64' id='type-id-152'/>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='88' column='1' id='type-id-61'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-155' visibility='default' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='88' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-19' visibility='default' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='88' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-73' size-in-bits='64' id='type-id-156'/>
    <pointer-type-def type-id='type-id-157' size-in-bits='64' id='type-id-155'/>
    <pointer-type-def type-id='type-id-34' size-in-bits='64' id='type-id-7'/>
    <typedef-decl name='nvlist_prtctl_t' type-id='type-id-63' filepath='../../include/libnvpair.h' line='84' column='1' id='type-id-158'/>
    <function-decl name='nvlist_prtctl_setdest' mangled-name='nvlist_prtctl_setdest' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='312' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctl_setdest'>
      <parameter type-id='type-id-158' name='pctl' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='312' column='1'/>
      <parameter type-id='type-id-3' name='fp' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='312' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='nvlist_prtctl_getdest' mangled-name='nvlist_prtctl_getdest' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='318' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctl_getdest'>
      <parameter type-id='type-id-158' name='pctl' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='318' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='nvlist_prtctl_setindent' mangled-name='nvlist_prtctl_setindent' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='325' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctl_setindent'>
      <parameter type-id='type-id-158' name='pctl' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='325' column='1'/>
      <parameter type-id='type-id-4' name='mode' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='325' column='1'/>
      <parameter type-id='type-id-5' name='start' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='326' column='1'/>
      <parameter type-id='type-id-5' name='inc' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='326' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='nvlist_prtctl_doindent' mangled-name='nvlist_prtctl_doindent' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='343' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctl_doindent'>
      <parameter type-id='type-id-158' name='pctl' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='343' column='1'/>
      <parameter type-id='type-id-5' name='onemore' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='343' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <enum-decl name='nvlist_prtctl_fmt' filepath='../../include/libnvpair.h' line='104' column='1' id='type-id-159'>
      <underlying-type type-id='type-id-32'/>
      <enumerator name='NVLIST_FMT_MEMBER_NAME' value='0'/>
      <enumerator name='NVLIST_FMT_MEMBER_POSTAMBLE' value='1'/>
      <enumerator name='NVLIST_FMT_BTWN_ARRAY' value='2'/>
    </enum-decl>
    <function-decl name='nvlist_prtctl_setfmt' mangled-name='nvlist_prtctl_setfmt' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='350' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctl_setfmt'>
      <parameter type-id='type-id-158' name='pctl' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='350' column='1'/>
      <parameter type-id='type-id-159' name='which' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='350' column='1'/>
      <parameter type-id='type-id-6' name='fmt' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='351' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='nvlist_prtctl_dofmt' mangled-name='nvlist_prtctl_dofmt' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='383' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctl_dofmt'>
      <parameter type-id='type-id-158' name='pctl' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='383' column='1'/>
      <parameter type-id='type-id-159' name='which' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='383' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <pointer-type-def type-id='type-id-160' size-in-bits='64' id='type-id-161'/>
    <function-decl name='nvlist_prtctlop_boolean' mangled-name='nvlist_prtctlop_boolean' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='430' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_boolean'>
      <parameter type-id='type-id-158' name='pctl' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='430' column='1'/>
      <parameter type-id='type-id-161' name='func' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='430' column='1'/>
      <parameter type-id='type-id-19' name='private' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='430' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <pointer-type-def type-id='type-id-162' size-in-bits='64' id='type-id-163'/>
    <function-decl name='nvlist_prtctlop_boolean_value' mangled-name='nvlist_prtctlop_boolean_value' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='431' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_boolean_value'>
      <parameter type-id='type-id-158' name='pctl' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='431' column='1'/>
      <parameter type-id='type-id-163' name='func' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='431' column='1'/>
      <parameter type-id='type-id-19' name='private' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='431' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <pointer-type-def type-id='type-id-164' size-in-bits='64' id='type-id-165'/>
    <function-decl name='nvlist_prtctlop_byte' mangled-name='nvlist_prtctlop_byte' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='432' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_byte'>
      <parameter type-id='type-id-158' name='pctl' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='432' column='1'/>
      <parameter type-id='type-id-165' name='func' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='432' column='1'/>
      <parameter type-id='type-id-19' name='private' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='432' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <pointer-type-def type-id='type-id-166' size-in-bits='64' id='type-id-167'/>
    <function-decl name='nvlist_prtctlop_int8' mangled-name='nvlist_prtctlop_int8' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='433' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_int8'>
      <parameter type-id='type-id-158' name='pctl' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='433' column='1'/>
      <parameter type-id='type-id-167' name='func' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='433' column='1'/>
      <parameter type-id='type-id-19' name='private' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='433' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <pointer-type-def type-id='type-id-168' size-in-bits='64' id='type-id-169'/>
    <function-decl name='nvlist_prtctlop_uint8' mangled-name='nvlist_prtctlop_uint8' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='434' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_uint8'>
      <parameter type-id='type-id-158' name='pctl' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='434' column='1'/>
      <parameter type-id='type-id-169' name='func' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='434' column='1'/>
      <parameter type-id='type-id-19' name='private' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='434' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <pointer-type-def type-id='type-id-170' size-in-bits='64' id='type-id-171'/>
    <function-decl name='nvlist_prtctlop_int16' mangled-name='nvlist_prtctlop_int16' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='435' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_int16'>
      <parameter type-id='type-id-158' name='pctl' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='435' column='1'/>
      <parameter type-id='type-id-171' name='func' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='435' column='1'/>
      <parameter type-id='type-id-19' name='private' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='435' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <pointer-type-def type-id='type-id-172' size-in-bits='64' id='type-id-173'/>
    <function-decl name='nvlist_prtctlop_uint16' mangled-name='nvlist_prtctlop_uint16' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='436' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_uint16'>
      <parameter type-id='type-id-158' name='pctl' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='436' column='1'/>
      <parameter type-id='type-id-173' name='func' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='436' column='1'/>
      <parameter type-id='type-id-19' name='private' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='436' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <pointer-type-def type-id='type-id-174' size-in-bits='64' id='type-id-175'/>
    <function-decl name='nvlist_prtctlop_int32' mangled-name='nvlist_prtctlop_int32' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='437' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_int32'>
      <parameter type-id='type-id-158' name='pctl' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='437' column='1'/>
      <parameter type-id='type-id-175' name='func' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='437' column='1'/>
      <parameter type-id='type-id-19' name='private' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='437' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <pointer-type-def type-id='type-id-176' size-in-bits='64' id='type-id-177'/>
    <function-decl name='nvlist_prtctlop_uint32' mangled-name='nvlist_prtctlop_uint32' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='438' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_uint32'>
      <parameter type-id='type-id-158' name='pctl' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='438' column='1'/>
      <parameter type-id='type-id-177' name='func' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='438' column='1'/>
      <parameter type-id='type-id-19' name='private' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='438' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <pointer-type-def type-id='type-id-178' size-in-bits='64' id='type-id-179'/>
    <function-decl name='nvlist_prtctlop_int64' mangled-name='nvlist_prtctlop_int64' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='439' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_int64'>
      <parameter type-id='type-id-158' name='pctl' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='439' column='1'/>
      <parameter type-id='type-id-179' name='func' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='439' column='1'/>
      <parameter type-id='type-id-19' name='private' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='439' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <pointer-type-def type-id='type-id-180' size-in-bits='64' id='type-id-181'/>
    <function-decl name='nvlist_prtctlop_uint64' mangled-name='nvlist_prtctlop_uint64' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='440' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_uint64'>
      <parameter type-id='type-id-158' name='pctl' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='440' column='1'/>
      <parameter type-id='type-id-181' name='func' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='440' column='1'/>
      <parameter type-id='type-id-19' name='private' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='440' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <pointer-type-def type-id='type-id-182' size-in-bits='64' id='type-id-183'/>
    <function-decl name='nvlist_prtctlop_double' mangled-name='nvlist_prtctlop_double' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='441' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_double'>
      <parameter type-id='type-id-158' name='pctl' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='441' column='1'/>
      <parameter type-id='type-id-183' name='func' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='441' column='1'/>
      <parameter type-id='type-id-19' name='private' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='441' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <pointer-type-def type-id='type-id-184' size-in-bits='64' id='type-id-185'/>
    <function-decl name='nvlist_prtctlop_string' mangled-name='nvlist_prtctlop_string' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='442' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_string'>
      <parameter type-id='type-id-158' name='pctl' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='442' column='1'/>
      <parameter type-id='type-id-185' name='func' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='442' column='1'/>
      <parameter type-id='type-id-19' name='private' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='442' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <pointer-type-def type-id='type-id-186' size-in-bits='64' id='type-id-187'/>
    <function-decl name='nvlist_prtctlop_hrtime' mangled-name='nvlist_prtctlop_hrtime' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='443' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_hrtime'>
      <parameter type-id='type-id-158' name='pctl' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='443' column='1'/>
      <parameter type-id='type-id-187' name='func' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='443' column='1'/>
      <parameter type-id='type-id-19' name='private' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='443' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <pointer-type-def type-id='type-id-188' size-in-bits='64' id='type-id-189'/>
    <function-decl name='nvlist_prtctlop_nvlist' mangled-name='nvlist_prtctlop_nvlist' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='444' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_nvlist'>
      <parameter type-id='type-id-158' name='pctl' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='444' column='1'/>
      <parameter type-id='type-id-189' name='func' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='444' column='1'/>
      <parameter type-id='type-id-19' name='private' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='444' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <pointer-type-def type-id='type-id-190' size-in-bits='64' id='type-id-191'/>
    <function-decl name='nvlist_prtctlop_boolean_array' mangled-name='nvlist_prtctlop_boolean_array' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='456' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_boolean_array'>
      <parameter type-id='type-id-158' name='pctl' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='456' column='1'/>
      <parameter type-id='type-id-191' name='func' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='456' column='1'/>
      <parameter type-id='type-id-19' name='private' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='456' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <pointer-type-def type-id='type-id-192' size-in-bits='64' id='type-id-193'/>
    <function-decl name='nvlist_prtctlop_byte_array' mangled-name='nvlist_prtctlop_byte_array' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='457' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_byte_array'>
      <parameter type-id='type-id-158' name='pctl' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='457' column='1'/>
      <parameter type-id='type-id-193' name='func' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='457' column='1'/>
      <parameter type-id='type-id-19' name='private' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='457' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <pointer-type-def type-id='type-id-194' size-in-bits='64' id='type-id-195'/>
    <function-decl name='nvlist_prtctlop_int8_array' mangled-name='nvlist_prtctlop_int8_array' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='458' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_int8_array'>
      <parameter type-id='type-id-158' name='pctl' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='458' column='1'/>
      <parameter type-id='type-id-195' name='func' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='458' column='1'/>
      <parameter type-id='type-id-19' name='private' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='458' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <pointer-type-def type-id='type-id-196' size-in-bits='64' id='type-id-197'/>
    <function-decl name='nvlist_prtctlop_uint8_array' mangled-name='nvlist_prtctlop_uint8_array' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='459' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_uint8_array'>
      <parameter type-id='type-id-158' name='pctl' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='459' column='1'/>
      <parameter type-id='type-id-197' name='func' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='459' column='1'/>
      <parameter type-id='type-id-19' name='private' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='459' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <pointer-type-def type-id='type-id-198' size-in-bits='64' id='type-id-199'/>
    <function-decl name='nvlist_prtctlop_int16_array' mangled-name='nvlist_prtctlop_int16_array' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='460' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_int16_array'>
      <parameter type-id='type-id-158' name='pctl' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='460' column='1'/>
      <parameter type-id='type-id-199' name='func' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='460' column='1'/>
      <parameter type-id='type-id-19' name='private' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='460' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <pointer-type-def type-id='type-id-200' size-in-bits='64' id='type-id-201'/>
    <function-decl name='nvlist_prtctlop_uint16_array' mangled-name='nvlist_prtctlop_uint16_array' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='461' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_uint16_array'>
      <parameter type-id='type-id-158' name='pctl' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='461' column='1'/>
      <parameter type-id='type-id-201' name='func' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='461' column='1'/>
      <parameter type-id='type-id-19' name='private' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='461' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <pointer-type-def type-id='type-id-202' size-in-bits='64' id='type-id-203'/>
    <function-decl name='nvlist_prtctlop_int32_array' mangled-name='nvlist_prtctlop_int32_array' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='462' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_int32_array'>
      <parameter type-id='type-id-158' name='pctl' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='462' column='1'/>
      <parameter type-id='type-id-203' name='func' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='462' column='1'/>
      <parameter type-id='type-id-19' name='private' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='462' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <pointer-type-def type-id='type-id-204' size-in-bits='64' id='type-id-205'/>
    <function-decl name='nvlist_prtctlop_uint32_array' mangled-name='nvlist_prtctlop_uint32_array' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='463' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_uint32_array'>
      <parameter type-id='type-id-158' name='pctl' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='463' column='1'/>
      <parameter type-id='type-id-205' name='func' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='463' column='1'/>
      <parameter type-id='type-id-19' name='private' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='463' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <pointer-type-def type-id='type-id-206' size-in-bits='64' id='type-id-207'/>
    <function-decl name='nvlist_prtctlop_int64_array' mangled-name='nvlist_prtctlop_int64_array' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='464' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_int64_array'>
      <parameter type-id='type-id-158' name='pctl' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='464' column='1'/>
      <parameter type-id='type-id-207' name='func' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='464' column='1'/>
      <parameter type-id='type-id-19' name='private' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='464' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <pointer-type-def type-id='type-id-208' size-in-bits='64' id='type-id-209'/>
    <function-decl name='nvlist_prtctlop_uint64_array' mangled-name='nvlist_prtctlop_uint64_array' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='465' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_uint64_array'>
      <parameter type-id='type-id-158' name='pctl' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='465' column='1'/>
      <parameter type-id='type-id-209' name='func' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='465' column='1'/>
      <parameter type-id='type-id-19' name='private' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='465' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <pointer-type-def type-id='type-id-210' size-in-bits='64' id='type-id-211'/>
    <function-decl name='nvlist_prtctlop_string_array' mangled-name='nvlist_prtctlop_string_array' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='466' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_string_array'>
      <parameter type-id='type-id-158' name='pctl' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='466' column='1'/>
      <parameter type-id='type-id-211' name='func' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='466' column='1'/>
      <parameter type-id='type-id-19' name='private' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='466' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <pointer-type-def type-id='type-id-212' size-in-bits='64' id='type-id-213'/>
    <function-decl name='nvlist_prtctlop_nvlist_array' mangled-name='nvlist_prtctlop_nvlist_array' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='467' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_nvlist_array'>
      <parameter type-id='type-id-158' name='pctl' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='467' column='1'/>
      <parameter type-id='type-id-213' name='func' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='467' column='1'/>
      <parameter type-id='type-id-19' name='private' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='467' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='nvlist_prtctl_alloc' mangled-name='nvlist_prtctl_alloc' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='527' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctl_alloc'>
      <return type-id='type-id-158'/>
    </function-decl>
    <function-decl name='nvlist_prtctl_free' mangled-name='nvlist_prtctl_free' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='546' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctl_free'>
      <parameter type-id='type-id-158' name='pctl' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='546' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='nvlist_print' mangled-name='nvlist_print' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='757' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_print'>
      <parameter type-id='type-id-3' name='fp' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='757' column='1'/>
      <parameter type-id='type-id-73' name='nvl' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='757' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <class-decl name='nvpair' size-in-bits='128' is-struct='yes' visibility='default' filepath='../../include/sys/nvpair.h' line='73' column='1' id='type-id-214'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nvp_size' type-id='type-id-65' visibility='default' filepath='../../include/sys/nvpair.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='nvp_name_sz' type-id='type-id-94' visibility='default' filepath='../../include/sys/nvpair.h' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='nvp_reserve' type-id='type-id-94' visibility='default' filepath='../../include/sys/nvpair.h' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='nvp_value_elem' type-id='type-id-65' visibility='default' filepath='../../include/sys/nvpair.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='nvp_type' type-id='type-id-215' visibility='default' filepath='../../include/sys/nvpair.h' line='78' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' filepath='../../include/sys/nvpair.h' line='37' column='1' id='type-id-216'>
      <underlying-type type-id='type-id-32'/>
      <enumerator name='DATA_TYPE_DONTCARE' value='-1'/>
      <enumerator name='DATA_TYPE_UNKNOWN' value='0'/>
      <enumerator name='DATA_TYPE_BOOLEAN' value='1'/>
      <enumerator name='DATA_TYPE_BYTE' value='2'/>
      <enumerator name='DATA_TYPE_INT16' value='3'/>
      <enumerator name='DATA_TYPE_UINT16' value='4'/>
      <enumerator name='DATA_TYPE_INT32' value='5'/>
      <enumerator name='DATA_TYPE_UINT32' value='6'/>
      <enumerator name='DATA_TYPE_INT64' value='7'/>
      <enumerator name='DATA_TYPE_UINT64' value='8'/>
      <enumerator name='DATA_TYPE_STRING' value='9'/>
      <enumerator name='DATA_TYPE_BYTE_ARRAY' value='10'/>
      <enumerator name='DATA_TYPE_INT16_ARRAY' value='11'/>
      <enumerator name='DATA_TYPE_UINT16_ARRAY' value='12'/>
      <enumerator name='DATA_TYPE_INT32_ARRAY' value='13'/>
      <enumerator name='DATA_TYPE_UINT32_ARRAY' value='14'/>
      <enumerator name='DATA_TYPE_INT64_ARRAY' value='15'/>
      <enumerator name='DATA_TYPE_UINT64_ARRAY' value='16'/>
      <enumerator name='DATA_TYPE_STRING_ARRAY' value='17'/>
      <enumerator name='DATA_TYPE_HRTIME' value='18'/>
      <enumerator name='DATA_TYPE_NVLIST' value='19'/>
      <enumerator name='DATA_TYPE_NVLIST_ARRAY' value='20'/>
      <enumerator name='DATA_TYPE_BOOLEAN_VALUE' value='21'/>
      <enumerator name='DATA_TYPE_INT8' value='22'/>
      <enumerator name='DATA_TYPE_UINT8' value='23'/>
      <enumerator name='DATA_TYPE_BOOLEAN_ARRAY' value='24'/>
      <enumerator name='DATA_TYPE_INT8_ARRAY' value='25'/>
      <enumerator name='DATA_TYPE_UINT8_ARRAY' value='26'/>
      <enumerator name='DATA_TYPE_DOUBLE' value='27'/>
    </enum-decl>
    <typedef-decl name='data_type_t' type-id='type-id-216' filepath='../../include/sys/nvpair.h' line='71' column='1' id='type-id-215'/>
    <pointer-type-def type-id='type-id-214' size-in-bits='64' id='type-id-217'/>
    <pointer-type-def type-id='type-id-64' size-in-bits='64' id='type-id-218'/>
    <function-decl name='nvlist_next_nvpair' filepath='../../include/sys/nvpair.h' line='242' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-218'/>
      <parameter type-id='type-id-217'/>
      <return type-id='type-id-217'/>
    </function-decl>
    <function-decl name='nvpair_type' filepath='../../include/sys/nvpair.h' line='245' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-217'/>
      <return type-id='type-id-216'/>
    </function-decl>
    <function-decl name='nvpair_name' filepath='../../include/sys/nvpair.h' line='244' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-217'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <pointer-type-def type-id='type-id-80' size-in-bits='64' id='type-id-219'/>
    <function-decl name='nvpair_value_byte' filepath='../../include/sys/nvpair.h' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-217'/>
      <parameter type-id='type-id-219'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <pointer-type-def type-id='type-id-92' size-in-bits='64' id='type-id-220'/>
    <function-decl name='nvpair_value_int16' filepath='../../include/sys/nvpair.h' line='251' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-217'/>
      <parameter type-id='type-id-220'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <pointer-type-def type-id='type-id-13' size-in-bits='64' id='type-id-221'/>
    <function-decl name='nvpair_value_uint16' filepath='../../include/sys/nvpair.h' line='252' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-217'/>
      <parameter type-id='type-id-221'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <pointer-type-def type-id='type-id-5' size-in-bits='64' id='type-id-222'/>
    <function-decl name='nvpair_value_int32' filepath='../../include/sys/nvpair.h' line='253' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-217'/>
      <parameter type-id='type-id-222'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <pointer-type-def type-id='type-id-69' size-in-bits='64' id='type-id-223'/>
    <function-decl name='nvpair_value_uint32' filepath='../../include/sys/nvpair.h' line='254' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-217'/>
      <parameter type-id='type-id-223'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <pointer-type-def type-id='type-id-24' size-in-bits='64' id='type-id-224'/>
    <function-decl name='nvpair_value_int64' filepath='../../include/sys/nvpair.h' line='255' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-217'/>
      <parameter type-id='type-id-224'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <pointer-type-def type-id='type-id-29' size-in-bits='64' id='type-id-225'/>
    <function-decl name='nvpair_value_uint64' filepath='../../include/sys/nvpair.h' line='256' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-217'/>
      <parameter type-id='type-id-225'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvpair_value_string' filepath='../../include/sys/nvpair.h' line='257' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-217'/>
      <parameter type-id='type-id-153'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <pointer-type-def type-id='type-id-219' size-in-bits='64' id='type-id-226'/>
    <function-decl name='nvpair_value_byte_array' filepath='../../include/sys/nvpair.h' line='260' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-217'/>
      <parameter type-id='type-id-226'/>
      <parameter type-id='type-id-223'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <pointer-type-def type-id='type-id-220' size-in-bits='64' id='type-id-227'/>
    <function-decl name='nvpair_value_int16_array' filepath='../../include/sys/nvpair.h' line='263' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-217'/>
      <parameter type-id='type-id-227'/>
      <parameter type-id='type-id-223'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <pointer-type-def type-id='type-id-221' size-in-bits='64' id='type-id-228'/>
    <function-decl name='nvpair_value_uint16_array' filepath='../../include/sys/nvpair.h' line='264' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-217'/>
      <parameter type-id='type-id-228'/>
      <parameter type-id='type-id-223'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <pointer-type-def type-id='type-id-222' size-in-bits='64' id='type-id-229'/>
    <function-decl name='nvpair_value_int32_array' filepath='../../include/sys/nvpair.h' line='265' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-217'/>
      <parameter type-id='type-id-229'/>
      <parameter type-id='type-id-223'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <pointer-type-def type-id='type-id-223' size-in-bits='64' id='type-id-230'/>
    <function-decl name='nvpair_value_uint32_array' filepath='../../include/sys/nvpair.h' line='266' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-217'/>
      <parameter type-id='type-id-230'/>
      <parameter type-id='type-id-223'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <pointer-type-def type-id='type-id-224' size-in-bits='64' id='type-id-231'/>
    <function-decl name='nvpair_value_int64_array' filepath='../../include/sys/nvpair.h' line='267' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-217'/>
      <parameter type-id='type-id-231'/>
      <parameter type-id='type-id-223'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <pointer-type-def type-id='type-id-225' size-in-bits='64' id='type-id-232'/>
    <function-decl name='nvpair_value_uint64_array' filepath='../../include/sys/nvpair.h' line='268' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-217'/>
      <parameter type-id='type-id-232'/>
      <parameter type-id='type-id-223'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <pointer-type-def type-id='type-id-153' size-in-bits='64' id='type-id-233'/>
    <function-decl name='nvpair_value_string_array' filepath='../../include/sys/nvpair.h' line='269' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-217'/>
      <parameter type-id='type-id-233'/>
      <parameter type-id='type-id-223'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <pointer-type-def type-id='type-id-116' size-in-bits='64' id='type-id-234'/>
    <function-decl name='nvpair_value_hrtime' filepath='../../include/sys/nvpair.h' line='271' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-217'/>
      <parameter type-id='type-id-234'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <pointer-type-def type-id='type-id-218' size-in-bits='64' id='type-id-235'/>
    <function-decl name='nvpair_value_nvlist' filepath='../../include/sys/nvpair.h' line='258' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-217'/>
      <parameter type-id='type-id-235'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <pointer-type-def type-id='type-id-235' size-in-bits='64' id='type-id-236'/>
    <function-decl name='nvpair_value_nvlist_array' filepath='../../include/sys/nvpair.h' line='270' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-217'/>
      <parameter type-id='type-id-236'/>
      <parameter type-id='type-id-223'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <pointer-type-def type-id='type-id-76' size-in-bits='64' id='type-id-237'/>
    <function-decl name='nvpair_value_boolean_value' filepath='../../include/sys/nvpair.h' line='247' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-217'/>
      <parameter type-id='type-id-237'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <pointer-type-def type-id='type-id-14' size-in-bits='64' id='type-id-238'/>
    <function-decl name='nvpair_value_int8' filepath='../../include/sys/nvpair.h' line='249' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-217'/>
      <parameter type-id='type-id-238'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvpair_value_uint8' filepath='../../include/sys/nvpair.h' line='250' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-217'/>
      <parameter type-id='type-id-219'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <pointer-type-def type-id='type-id-237' size-in-bits='64' id='type-id-239'/>
    <function-decl name='nvpair_value_boolean_array' filepath='../../include/sys/nvpair.h' line='259' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-217'/>
      <parameter type-id='type-id-239'/>
      <parameter type-id='type-id-223'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <pointer-type-def type-id='type-id-238' size-in-bits='64' id='type-id-240'/>
    <function-decl name='nvpair_value_int8_array' filepath='../../include/sys/nvpair.h' line='261' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-217'/>
      <parameter type-id='type-id-240'/>
      <parameter type-id='type-id-223'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvpair_value_uint8_array' filepath='../../include/sys/nvpair.h' line='262' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-217'/>
      <parameter type-id='type-id-226'/>
      <parameter type-id='type-id-223'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <pointer-type-def type-id='type-id-111' size-in-bits='64' id='type-id-241'/>
    <function-decl name='nvpair_value_double' filepath='../../include/sys/nvpair.h' line='273' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-217'/>
      <parameter type-id='type-id-241'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvlist_prt' mangled-name='nvlist_prt' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='766' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prt'>
      <parameter type-id='type-id-73' name='nvl' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='766' column='1'/>
      <parameter type-id='type-id-158' name='pctl' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='766' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='dump_nvlist' mangled-name='dump_nvlist' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='794' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dump_nvlist'>
      <parameter type-id='type-id-73' name='list' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='794' column='1'/>
      <parameter type-id='type-id-5' name='indent' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='794' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='dcgettext' filepath='/usr/include/libintl.h' line='51' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <typedef-decl name='nvpair_t' type-id='type-id-214' filepath='../../include/sys/nvpair.h' line='82' column='1' id='type-id-242'/>
    <pointer-type-def type-id='type-id-242' size-in-bits='64' id='type-id-243'/>
    <class-decl name='re_pattern_buffer' size-in-bits='512' is-struct='yes' visibility='default' filepath='/usr/include/regex.h' line='413' column='1' id='type-id-244'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='buffer' type-id='type-id-245' visibility='default' filepath='/usr/include/regex.h' line='417' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='allocated' type-id='type-id-246' visibility='default' filepath='/usr/include/regex.h' line='420' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='used' type-id='type-id-246' visibility='default' filepath='/usr/include/regex.h' line='423' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='syntax' type-id='type-id-247' visibility='default' filepath='/usr/include/regex.h' line='426' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='fastmap' type-id='type-id-9' visibility='default' filepath='/usr/include/regex.h' line='431' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='translate' type-id='type-id-219' visibility='default' filepath='/usr/include/regex.h' line='437' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='re_nsub' type-id='type-id-20' visibility='default' filepath='/usr/include/regex.h' line='440' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31'>
        <var-decl name='can_be_null' type-id='type-id-69' visibility='default' filepath='/usr/include/regex.h' line='446' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='29'>
        <var-decl name='regs_allocated' type-id='type-id-69' visibility='default' filepath='/usr/include/regex.h' line='457' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='28'>
        <var-decl name='fastmap_accurate' type-id='type-id-69' visibility='default' filepath='/usr/include/regex.h' line='461' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='27'>
        <var-decl name='no_sub' type-id='type-id-69' visibility='default' filepath='/usr/include/regex.h' line='465' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='26'>
        <var-decl name='not_bol' type-id='type-id-69' visibility='default' filepath='/usr/include/regex.h' line='469' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='25'>
        <var-decl name='not_eol' type-id='type-id-69' visibility='default' filepath='/usr/include/regex.h' line='472' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='newline_anchor' type-id='type-id-69' visibility='default' filepath='/usr/include/regex.h' line='475' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='re_dfa_t' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-248'/>
    <pointer-type-def type-id='type-id-248' size-in-bits='64' id='type-id-245'/>
    <typedef-decl name='__re_long_size_t' type-id='type-id-29' filepath='/usr/include/regex.h' line='56' column='1' id='type-id-246'/>
    <typedef-decl name='reg_syntax_t' type-id='type-id-29' filepath='/usr/include/regex.h' line='72' column='1' id='type-id-247'/>
    <typedef-decl name='regex_t' type-id='type-id-244' filepath='/usr/include/regex.h' line='478' column='1' id='type-id-249'/>
    <pointer-type-def type-id='type-id-249' size-in-bits='64' id='type-id-250'/>
    <function-decl name='nvpair_value_match_regex' mangled-name='nvpair_value_match_regex' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='949' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_match_regex'>
      <parameter type-id='type-id-243' name='nvp' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='949' column='1'/>
      <parameter type-id='type-id-5' name='ai' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='949' column='1'/>
      <parameter type-id='type-id-9' name='value' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='950' column='1'/>
      <parameter type-id='type-id-250' name='value_regex' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='950' column='1'/>
      <parameter type-id='type-id-153' name='ep' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='950' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvpair_type_is_array' filepath='../../include/sys/nvpair.h' line='246' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-217'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <qualified-type-def type-id='type-id-244' const='yes' id='type-id-251'/>
    <pointer-type-def type-id='type-id-251' size-in-bits='64' id='type-id-252'/>
    <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/regex.h' line='517' column='1' id='type-id-253'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='rm_so' type-id='type-id-254' visibility='default' filepath='/usr/include/regex.h' line='519' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='rm_eo' type-id='type-id-254' visibility='default' filepath='/usr/include/regex.h' line='520' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='regoff_t' type-id='type-id-5' filepath='/usr/include/regex.h' line='490' column='1' id='type-id-254'/>
    <pointer-type-def type-id='type-id-253' size-in-bits='64' id='type-id-255'/>
    <function-decl name='regexec' filepath='/usr/include/regex.h' line='643' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-252'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-29'/>
      <parameter type-id='type-id-255'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvpair_value_match' mangled-name='nvpair_value_match' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='1274' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_match'>
      <parameter type-id='type-id-243' name='nvp' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='1274' column='1'/>
      <parameter type-id='type-id-5' name='ai' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='1274' column='1'/>
      <parameter type-id='type-id-9' name='value' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='1274' column='1'/>
      <parameter type-id='type-id-153' name='ep' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair.c' line='1274' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-124'>
      <parameter type-id='type-id-63'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-73'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-122'/>
      <parameter type-id='type-id-123'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-114'>
      <parameter type-id='type-id-63'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-73'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-154'>
      <parameter type-id='type-id-63'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-73'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-153'/>
      <parameter type-id='type-id-123'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-112'>
      <parameter type-id='type-id-63'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-73'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-111'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-74'>
      <parameter type-id='type-id-63'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-73'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-136'>
      <parameter type-id='type-id-63'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-73'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-135'/>
      <parameter type-id='type-id-123'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-142'>
      <parameter type-id='type-id-63'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-73'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-141'/>
      <parameter type-id='type-id-123'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-148'>
      <parameter type-id='type-id-63'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-73'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-147'/>
      <parameter type-id='type-id-123'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-130'>
      <parameter type-id='type-id-63'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-73'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-129'/>
      <parameter type-id='type-id-123'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-120'>
      <parameter type-id='type-id-63'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-73'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-73'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-157'>
      <parameter type-id='type-id-63'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-73'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-156'/>
      <parameter type-id='type-id-123'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-78'>
      <parameter type-id='type-id-63'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-73'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-77'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-118'>
      <parameter type-id='type-id-63'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-73'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-117'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-95'>
      <parameter type-id='type-id-63'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-73'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-94'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-101'>
      <parameter type-id='type-id-63'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-73'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-65'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-107'>
      <parameter type-id='type-id-63'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-73'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-106'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-86'>
      <parameter type-id='type-id-63'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-73'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-85'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-82'>
      <parameter type-id='type-id-63'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-73'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-81'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-99'>
      <parameter type-id='type-id-63'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-73'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-98'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-103'>
      <parameter type-id='type-id-63'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-73'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-66'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-109'>
      <parameter type-id='type-id-63'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-73'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-67'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-90'>
      <parameter type-id='type-id-63'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-73'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-89'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-127'>
      <parameter type-id='type-id-63'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-73'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-123'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-139'>
      <parameter type-id='type-id-63'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-73'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-138'/>
      <parameter type-id='type-id-123'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-145'>
      <parameter type-id='type-id-63'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-73'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-144'/>
      <parameter type-id='type-id-123'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-151'>
      <parameter type-id='type-id-63'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-73'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-150'/>
      <parameter type-id='type-id-123'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-133'>
      <parameter type-id='type-id-63'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-73'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-132'/>
      <parameter type-id='type-id-123'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-190'>
      <parameter type-id='type-id-158'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-73'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-122'/>
      <parameter type-id='type-id-123'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-184'>
      <parameter type-id='type-id-158'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-73'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-210'>
      <parameter type-id='type-id-158'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-73'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-153'/>
      <parameter type-id='type-id-123'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-182'>
      <parameter type-id='type-id-158'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-73'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-111'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-160'>
      <parameter type-id='type-id-158'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-73'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-198'>
      <parameter type-id='type-id-158'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-73'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-135'/>
      <parameter type-id='type-id-123'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-202'>
      <parameter type-id='type-id-158'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-73'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-141'/>
      <parameter type-id='type-id-123'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-206'>
      <parameter type-id='type-id-158'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-73'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-147'/>
      <parameter type-id='type-id-123'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-194'>
      <parameter type-id='type-id-158'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-73'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-129'/>
      <parameter type-id='type-id-123'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-188'>
      <parameter type-id='type-id-158'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-73'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-73'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-212'>
      <parameter type-id='type-id-158'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-73'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-156'/>
      <parameter type-id='type-id-123'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-162'>
      <parameter type-id='type-id-158'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-73'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-77'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-186'>
      <parameter type-id='type-id-158'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-73'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-117'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-170'>
      <parameter type-id='type-id-158'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-73'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-94'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-174'>
      <parameter type-id='type-id-158'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-73'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-65'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-178'>
      <parameter type-id='type-id-158'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-73'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-106'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-166'>
      <parameter type-id='type-id-158'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-73'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-85'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-164'>
      <parameter type-id='type-id-158'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-73'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-81'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-172'>
      <parameter type-id='type-id-158'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-73'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-98'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-176'>
      <parameter type-id='type-id-158'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-73'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-66'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-180'>
      <parameter type-id='type-id-158'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-73'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-67'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-168'>
      <parameter type-id='type-id-158'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-73'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-89'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-192'>
      <parameter type-id='type-id-158'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-73'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-123'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-200'>
      <parameter type-id='type-id-158'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-73'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-138'/>
      <parameter type-id='type-id-123'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-204'>
      <parameter type-id='type-id-158'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-73'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-144'/>
      <parameter type-id='type-id-123'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-208'>
      <parameter type-id='type-id-158'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-73'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-150'/>
      <parameter type-id='type-id-123'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-196'>
      <parameter type-id='type-id-158'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-73'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-132'/>
      <parameter type-id='type-id-123'/>
      <return type-id='type-id-5'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='libnvpair_json.c' comp-dir-path='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair' language='LANG_C99'>
    <function-decl name='nvlist_print_json' mangled-name='nvlist_print_json' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair_json.c' line='118' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_print_json'>
      <parameter type-id='type-id-3' name='fp' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair_json.c' line='118' column='1'/>
      <parameter type-id='type-id-73' name='nvl' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/libnvpair_json.c' line='118' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='fnvpair_value_byte' filepath='../../include/sys/nvpair.h' line='342' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-217'/>
      <return type-id='type-id-80'/>
    </function-decl>
    <function-decl name='fnvpair_value_int16' filepath='../../include/sys/nvpair.h' line='344' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-217'/>
      <return type-id='type-id-92'/>
    </function-decl>
    <function-decl name='fnvpair_value_uint16' filepath='../../include/sys/nvpair.h' line='348' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-217'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='fnvpair_value_int32' filepath='../../include/sys/nvpair.h' line='345' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-217'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='fnvpair_value_uint32' filepath='../../include/sys/nvpair.h' line='349' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-217'/>
      <return type-id='type-id-69'/>
    </function-decl>
    <function-decl name='fnvpair_value_int64' filepath='../../include/sys/nvpair.h' line='346' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-217'/>
      <return type-id='type-id-24'/>
    </function-decl>
    <function-decl name='fnvpair_value_uint64' filepath='../../include/sys/nvpair.h' line='350' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-217'/>
      <return type-id='type-id-29'/>
    </function-decl>
    <function-decl name='fnvpair_value_string' filepath='../../include/sys/nvpair.h' line='351' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-217'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='libspl_assertf' filepath='../../lib/libspl/include/assert.h' line='40' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-6'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='fnvpair_value_nvlist' filepath='../../include/sys/nvpair.h' line='352' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-217'/>
      <return type-id='type-id-218'/>
    </function-decl>
    <function-decl name='fnvpair_value_boolean_value' filepath='../../include/sys/nvpair.h' line='341' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-217'/>
      <return type-id='type-id-76'/>
    </function-decl>
    <function-decl name='fnvpair_value_int8' filepath='../../include/sys/nvpair.h' line='343' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-217'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='fnvpair_value_uint8' filepath='../../include/sys/nvpair.h' line='347' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-217'/>
      <return type-id='type-id-80'/>
    </function-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h' line='13' column='1' id='type-id-256'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__count' type-id='type-id-5' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h' line='15' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='__value' type-id='type-id-257' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h' line='20' column='1'/>
      </data-member>
    </class-decl>
    <union-decl name='__anonymous_union__' size-in-bits='32' is-anonymous='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h' line='16' column='1' id='type-id-257'>
      <data-member access='private'>
        <var-decl name='__wch' type-id='type-id-69' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h' line='18' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='__wchb' type-id='type-id-258' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h' line='19' column='1'/>
      </data-member>
    </union-decl>

    <array-type-def dimensions='1' type-id='type-id-22' size-in-bits='32' id='type-id-258'>
      <subrange length='4' type-id='type-id-25' id='type-id-259'/>

    </array-type-def>
    <pointer-type-def type-id='type-id-256' size-in-bits='64' id='type-id-260'/>
    <function-decl name='mbrtowc' filepath='/usr/include/wchar.h' line='296' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-222'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-29'/>
      <parameter type-id='type-id-260'/>
      <return type-id='type-id-29'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='nvpair_alloc_system.c' comp-dir-path='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair' language='LANG_C99'>
    <class-decl name='nv_alloc' size-in-bits='128' is-struct='yes' visibility='default' filepath='../../include/sys/nvpair.h' line='125' column='1' id='type-id-261'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nva_ops' type-id='type-id-262' visibility='default' filepath='../../include/sys/nvpair.h' line='126' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='nva_arg' type-id='type-id-19' visibility='default' filepath='../../include/sys/nvpair.h' line='127' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='nv_alloc_ops' size-in-bits='320' is-struct='yes' visibility='default' filepath='../../include/sys/nvpair.h' line='130' column='1' id='type-id-263'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nv_ao_init' type-id='type-id-264' visibility='default' filepath='../../include/sys/nvpair.h' line='131' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='nv_ao_fini' type-id='type-id-265' visibility='default' filepath='../../include/sys/nvpair.h' line='132' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='nv_ao_alloc' type-id='type-id-266' visibility='default' filepath='../../include/sys/nvpair.h' line='133' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='nv_ao_free' type-id='type-id-267' visibility='default' filepath='../../include/sys/nvpair.h' line='134' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='nv_ao_reset' type-id='type-id-265' visibility='default' filepath='../../include/sys/nvpair.h' line='135' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='nv_alloc_t' type-id='type-id-261' filepath='../../include/sys/nvpair.h' line='128' column='1' id='type-id-268'/>
    <pointer-type-def type-id='type-id-268' size-in-bits='64' id='type-id-269'/>
    <class-decl name='__va_list_tag' size-in-bits='192' is-struct='yes' visibility='default' id='type-id-270'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='gp_offset' type-id='type-id-69' visibility='default' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/nvpair_alloc_system.c' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='fp_offset' type-id='type-id-69' visibility='default' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/nvpair_alloc_system.c' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='overflow_arg_area' type-id='type-id-19' visibility='default' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/nvpair_alloc_system.c' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='reg_save_area' type-id='type-id-19' visibility='default' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/nvpair_alloc_system.c' line='54' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-270' size-in-bits='64' id='type-id-271'/>
    <pointer-type-def type-id='type-id-272' size-in-bits='64' id='type-id-264'/>
    <pointer-type-def type-id='type-id-273' size-in-bits='64' id='type-id-265'/>
    <pointer-type-def type-id='type-id-274' size-in-bits='64' id='type-id-266'/>
    <pointer-type-def type-id='type-id-275' size-in-bits='64' id='type-id-267'/>
    <typedef-decl name='nv_alloc_ops_t' type-id='type-id-263' filepath='../../include/sys/nvpair.h' line='123' column='1' id='type-id-276'/>
    <qualified-type-def type-id='type-id-276' const='yes' id='type-id-277'/>
    <pointer-type-def type-id='type-id-277' size-in-bits='64' id='type-id-262'/>
    <var-decl name='nv_alloc_sleep_def' type-id='type-id-268' mangled-name='nv_alloc_sleep_def' visibility='default' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/nvpair_alloc_system.c' line='54' column='1' elf-symbol-id='nv_alloc_sleep_def'/>
    <var-decl name='nv_alloc_nosleep_def' type-id='type-id-268' mangled-name='nv_alloc_nosleep_def' visibility='default' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/nvpair_alloc_system.c' line='59' column='1' elf-symbol-id='nv_alloc_nosleep_def'/>
    <var-decl name='nv_alloc_sleep' type-id='type-id-269' mangled-name='nv_alloc_sleep' visibility='default' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/nvpair_alloc_system.c' line='64' column='1' elf-symbol-id='nv_alloc_sleep'/>
    <var-decl name='nv_alloc_nosleep' type-id='type-id-269' mangled-name='nv_alloc_nosleep' visibility='default' filepath='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair/nvpair_alloc_system.c' line='65' column='1' elf-symbol-id='nv_alloc_nosleep'/>
    <function-type size-in-bits='64' id='type-id-272'>
      <parameter type-id='type-id-269'/>
      <parameter type-id='type-id-271'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-273'>
      <parameter type-id='type-id-269'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-275'>
      <parameter type-id='type-id-269'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-20'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-274'>
      <parameter type-id='type-id-269'/>
      <parameter type-id='type-id-20'/>
      <return type-id='type-id-19'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../../module/nvpair/nvpair_alloc_fixed.c' comp-dir-path='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair' language='LANG_C99'>
    <var-decl name='nv_fixed_ops_def' type-id='type-id-277' mangled-name='nv_fixed_ops_def' visibility='default' filepath='../../module/nvpair/nvpair_alloc_fixed.c' line='103' column='1' elf-symbol-id='nv_fixed_ops_def'/>
    <var-decl name='nv_fixed_ops' type-id='type-id-262' mangled-name='nv_fixed_ops' visibility='default' filepath='../../module/nvpair/nvpair_alloc_fixed.c' line='111' column='1' elf-symbol-id='nv_fixed_ops'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../../module/nvpair/nvpair.c' comp-dir-path='/mnt/filling/store/nabijaczleweli/code/zfs/lib/libnvpair' language='LANG_C99'>
    <var-decl name='nvpair_max_recursion' type-id='type-id-5' mangled-name='nvpair_max_recursion' visibility='default' filepath='../../module/nvpair/nvpair.c' line='151' column='1' elf-symbol-id='nvpair_max_recursion'/>
    <var-decl name='nvlist_hashtable_init_size' type-id='type-id-67' mangled-name='nvlist_hashtable_init_size' visibility='default' filepath='../../module/nvpair/nvpair.c' line='154' column='1' elf-symbol-id='nvlist_hashtable_init_size'/>
    <function-decl name='nv_alloc_init' mangled-name='nv_alloc_init' filepath='../../module/nvpair/nvpair.c' line='157' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nv_alloc_init'>
      <parameter type-id='type-id-269' name='nva' filepath='../../module/nvpair/nvpair.c' line='157' column='1'/>
      <parameter type-id='type-id-262' name='nvo' filepath='../../module/nvpair/nvpair.c' line='157' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nv_alloc_reset' mangled-name='nv_alloc_reset' filepath='../../module/nvpair/nvpair.c' line='174' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nv_alloc_reset'>
      <parameter type-id='type-id-269' name='nva' filepath='../../module/nvpair/nvpair.c' line='174' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='nv_alloc_fini' mangled-name='nv_alloc_fini' filepath='../../module/nvpair/nvpair.c' line='181' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nv_alloc_fini'>
      <parameter type-id='type-id-269' name='nva' filepath='../../module/nvpair/nvpair.c' line='174' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='nvlist_lookup_nv_alloc' mangled-name='nvlist_lookup_nv_alloc' filepath='../../module/nvpair/nvpair.c' line='188' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_nv_alloc'>
      <parameter type-id='type-id-73' name='nvl' filepath='../../module/nvpair/nvpair.c' line='188' column='1'/>
      <return type-id='type-id-269'/>
    </function-decl>
    <function-decl name='nvlist_nvflag' mangled-name='nvlist_nvflag' filepath='../../module/nvpair/nvpair.c' line='559' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_nvflag'>
      <parameter type-id='type-id-73' name='nvl' filepath='../../module/nvpair/nvpair.c' line='559' column='1'/>
      <return type-id='type-id-123'/>
    </function-decl>
    <function-decl name='nvlist_alloc' mangled-name='nvlist_alloc' filepath='../../module/nvpair/nvpair.c' line='585' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_alloc'>
      <parameter type-id='type-id-156' name='nvlp' filepath='../../module/nvpair/nvpair.c' line='585' column='1'/>
      <parameter type-id='type-id-123' name='nvflag' filepath='../../module/nvpair/nvpair.c' line='585' column='1'/>
      <parameter type-id='type-id-5' name='kmflag' filepath='../../module/nvpair/nvpair.c' line='585' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvlist_xalloc' mangled-name='nvlist_xalloc' filepath='../../module/nvpair/nvpair.c' line='591' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_xalloc'>
      <parameter type-id='type-id-156' name='nvlp' filepath='../../module/nvpair/nvpair.c' line='591' column='1'/>
      <parameter type-id='type-id-123' name='nvflag' filepath='../../module/nvpair/nvpair.c' line='591' column='1'/>
      <parameter type-id='type-id-269' name='nva' filepath='../../module/nvpair/nvpair.c' line='591' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvlist_free' mangled-name='nvlist_free' filepath='../../module/nvpair/nvpair.c' line='866' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_free'>
      <parameter type-id='type-id-73' name='nvl' filepath='../../module/nvpair/nvpair.c' line='866' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='nvlist_dup' mangled-name='nvlist_dup' filepath='../../module/nvpair/nvpair.c' line='916' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_dup'>
      <parameter type-id='type-id-73' name='nvl' filepath='../../module/nvpair/nvpair.c' line='916' column='1'/>
      <parameter type-id='type-id-156' name='nvlp' filepath='../../module/nvpair/nvpair.c' line='916' column='1'/>
      <parameter type-id='type-id-5' name='kmflag' filepath='../../module/nvpair/nvpair.c' line='916' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvlist_xdup' mangled-name='nvlist_xdup' filepath='../../module/nvpair/nvpair.c' line='922' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_xdup'>
      <parameter type-id='type-id-73' name='nvl' filepath='../../module/nvpair/nvpair.c' line='922' column='1'/>
      <parameter type-id='type-id-156' name='nvlp' filepath='../../module/nvpair/nvpair.c' line='922' column='1'/>
      <parameter type-id='type-id-269' name='nva' filepath='../../module/nvpair/nvpair.c' line='922' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvlist_remove_all' mangled-name='nvlist_remove_all' filepath='../../module/nvpair/nvpair.c' line='945' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_remove_all'>
      <parameter type-id='type-id-73' name='nvl' filepath='../../module/nvpair/nvpair.c' line='945' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='945' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvlist_remove_nvpair' mangled-name='nvlist_remove_nvpair' filepath='../../module/nvpair/nvpair.c' line='978' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_remove_nvpair'>
      <parameter type-id='type-id-73' name='nvl' filepath='../../module/nvpair/nvpair.c' line='978' column='1'/>
      <parameter type-id='type-id-243' name='nvp' filepath='../../module/nvpair/nvpair.c' line='978' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvlist_remove' mangled-name='nvlist_remove' filepath='../../module/nvpair/nvpair.c' line='965' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_remove'>
      <parameter type-id='type-id-73' name='nvl' filepath='../../module/nvpair/nvpair.c' line='965' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='965' column='1'/>
      <parameter type-id='type-id-215' name='type' filepath='../../module/nvpair/nvpair.c' line='965' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvlist_add_boolean' mangled-name='nvlist_add_boolean' filepath='../../module/nvpair/nvpair.c' line='1276' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_boolean'>
      <parameter type-id='type-id-73' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1276' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1276' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvlist_add_boolean_value' mangled-name='nvlist_add_boolean_value' filepath='../../module/nvpair/nvpair.c' line='1282' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_boolean_value'>
      <parameter type-id='type-id-73' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1282' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1282' column='1'/>
      <parameter type-id='type-id-77' name='val' filepath='../../module/nvpair/nvpair.c' line='1282' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvlist_add_byte' mangled-name='nvlist_add_byte' filepath='../../module/nvpair/nvpair.c' line='1288' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_byte'>
      <parameter type-id='type-id-73' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1288' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1288' column='1'/>
      <parameter type-id='type-id-81' name='val' filepath='../../module/nvpair/nvpair.c' line='1288' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvlist_add_int8' mangled-name='nvlist_add_int8' filepath='../../module/nvpair/nvpair.c' line='1294' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_int8'>
      <parameter type-id='type-id-73' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1294' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1294' column='1'/>
      <parameter type-id='type-id-85' name='val' filepath='../../module/nvpair/nvpair.c' line='1294' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvlist_add_uint8' mangled-name='nvlist_add_uint8' filepath='../../module/nvpair/nvpair.c' line='1300' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_uint8'>
      <parameter type-id='type-id-73' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1300' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1300' column='1'/>
      <parameter type-id='type-id-89' name='val' filepath='../../module/nvpair/nvpair.c' line='1300' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvlist_add_int16' mangled-name='nvlist_add_int16' filepath='../../module/nvpair/nvpair.c' line='1306' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_int16'>
      <parameter type-id='type-id-73' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1306' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1306' column='1'/>
      <parameter type-id='type-id-94' name='val' filepath='../../module/nvpair/nvpair.c' line='1306' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvlist_add_uint16' mangled-name='nvlist_add_uint16' filepath='../../module/nvpair/nvpair.c' line='1312' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_uint16'>
      <parameter type-id='type-id-73' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1312' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1312' column='1'/>
      <parameter type-id='type-id-98' name='val' filepath='../../module/nvpair/nvpair.c' line='1312' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvlist_add_int32' mangled-name='nvlist_add_int32' filepath='../../module/nvpair/nvpair.c' line='1318' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_int32'>
      <parameter type-id='type-id-73' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1318' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1318' column='1'/>
      <parameter type-id='type-id-65' name='val' filepath='../../module/nvpair/nvpair.c' line='1318' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvlist_add_uint32' mangled-name='nvlist_add_uint32' filepath='../../module/nvpair/nvpair.c' line='1324' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_uint32'>
      <parameter type-id='type-id-73' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1324' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1324' column='1'/>
      <parameter type-id='type-id-66' name='val' filepath='../../module/nvpair/nvpair.c' line='1324' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvlist_add_int64' mangled-name='nvlist_add_int64' filepath='../../module/nvpair/nvpair.c' line='1330' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_int64'>
      <parameter type-id='type-id-73' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1330' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1330' column='1'/>
      <parameter type-id='type-id-106' name='val' filepath='../../module/nvpair/nvpair.c' line='1330' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvlist_add_uint64' mangled-name='nvlist_add_uint64' filepath='../../module/nvpair/nvpair.c' line='1336' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_uint64'>
      <parameter type-id='type-id-73' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1336' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1336' column='1'/>
      <parameter type-id='type-id-67' name='val' filepath='../../module/nvpair/nvpair.c' line='1336' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvlist_add_double' mangled-name='nvlist_add_double' filepath='../../module/nvpair/nvpair.c' line='1343' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_double'>
      <parameter type-id='type-id-73' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1343' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1343' column='1'/>
      <parameter type-id='type-id-111' name='val' filepath='../../module/nvpair/nvpair.c' line='1343' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvlist_add_string' mangled-name='nvlist_add_string' filepath='../../module/nvpair/nvpair.c' line='1350' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_string'>
      <parameter type-id='type-id-73' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1350' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1350' column='1'/>
      <parameter type-id='type-id-6' name='val' filepath='../../module/nvpair/nvpair.c' line='1350' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvlist_add_boolean_array' mangled-name='nvlist_add_boolean_array' filepath='../../module/nvpair/nvpair.c' line='1356' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_boolean_array'>
      <parameter type-id='type-id-73' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1356' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1356' column='1'/>
      <parameter type-id='type-id-122' name='a' filepath='../../module/nvpair/nvpair.c' line='1357' column='1'/>
      <parameter type-id='type-id-123' name='n' filepath='../../module/nvpair/nvpair.c' line='1357' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvlist_add_byte_array' mangled-name='nvlist_add_byte_array' filepath='../../module/nvpair/nvpair.c' line='1363' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_byte_array'>
      <parameter type-id='type-id-73' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1363' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1363' column='1'/>
      <parameter type-id='type-id-126' name='a' filepath='../../module/nvpair/nvpair.c' line='1363' column='1'/>
      <parameter type-id='type-id-123' name='n' filepath='../../module/nvpair/nvpair.c' line='1363' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvlist_add_int8_array' mangled-name='nvlist_add_int8_array' filepath='../../module/nvpair/nvpair.c' line='1369' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_int8_array'>
      <parameter type-id='type-id-73' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1369' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1369' column='1'/>
      <parameter type-id='type-id-129' name='a' filepath='../../module/nvpair/nvpair.c' line='1369' column='1'/>
      <parameter type-id='type-id-123' name='n' filepath='../../module/nvpair/nvpair.c' line='1369' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvlist_add_uint8_array' mangled-name='nvlist_add_uint8_array' filepath='../../module/nvpair/nvpair.c' line='1375' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_uint8_array'>
      <parameter type-id='type-id-73' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1375' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1375' column='1'/>
      <parameter type-id='type-id-132' name='a' filepath='../../module/nvpair/nvpair.c' line='1375' column='1'/>
      <parameter type-id='type-id-123' name='n' filepath='../../module/nvpair/nvpair.c' line='1375' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvlist_add_int16_array' mangled-name='nvlist_add_int16_array' filepath='../../module/nvpair/nvpair.c' line='1381' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_int16_array'>
      <parameter type-id='type-id-73' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1381' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1381' column='1'/>
      <parameter type-id='type-id-135' name='a' filepath='../../module/nvpair/nvpair.c' line='1381' column='1'/>
      <parameter type-id='type-id-123' name='n' filepath='../../module/nvpair/nvpair.c' line='1381' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvlist_add_uint16_array' mangled-name='nvlist_add_uint16_array' filepath='../../module/nvpair/nvpair.c' line='1387' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_uint16_array'>
      <parameter type-id='type-id-73' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1387' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1387' column='1'/>
      <parameter type-id='type-id-138' name='a' filepath='../../module/nvpair/nvpair.c' line='1387' column='1'/>
      <parameter type-id='type-id-123' name='n' filepath='../../module/nvpair/nvpair.c' line='1387' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvlist_add_int32_array' mangled-name='nvlist_add_int32_array' filepath='../../module/nvpair/nvpair.c' line='1393' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_int32_array'>
      <parameter type-id='type-id-73' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1393' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1393' column='1'/>
      <parameter type-id='type-id-141' name='a' filepath='../../module/nvpair/nvpair.c' line='1393' column='1'/>
      <parameter type-id='type-id-123' name='n' filepath='../../module/nvpair/nvpair.c' line='1393' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvlist_add_uint32_array' mangled-name='nvlist_add_uint32_array' filepath='../../module/nvpair/nvpair.c' line='1399' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_uint32_array'>
      <parameter type-id='type-id-73' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1399' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1399' column='1'/>
      <parameter type-id='type-id-144' name='a' filepath='../../module/nvpair/nvpair.c' line='1399' column='1'/>
      <parameter type-id='type-id-123' name='n' filepath='../../module/nvpair/nvpair.c' line='1399' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvlist_add_int64_array' mangled-name='nvlist_add_int64_array' filepath='../../module/nvpair/nvpair.c' line='1405' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_int64_array'>
      <parameter type-id='type-id-73' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1405' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1405' column='1'/>
      <parameter type-id='type-id-147' name='a' filepath='../../module/nvpair/nvpair.c' line='1405' column='1'/>
      <parameter type-id='type-id-123' name='n' filepath='../../module/nvpair/nvpair.c' line='1405' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvlist_add_uint64_array' mangled-name='nvlist_add_uint64_array' filepath='../../module/nvpair/nvpair.c' line='1411' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_uint64_array'>
      <parameter type-id='type-id-73' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1411' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1411' column='1'/>
      <parameter type-id='type-id-150' name='a' filepath='../../module/nvpair/nvpair.c' line='1411' column='1'/>
      <parameter type-id='type-id-123' name='n' filepath='../../module/nvpair/nvpair.c' line='1411' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <qualified-type-def type-id='type-id-9' const='yes' id='type-id-278'/>
    <pointer-type-def type-id='type-id-278' size-in-bits='64' id='type-id-279'/>
    <function-decl name='nvlist_add_string_array' mangled-name='nvlist_add_string_array' filepath='../../module/nvpair/nvpair.c' line='1417' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_string_array'>
      <parameter type-id='type-id-73' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1417' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1417' column='1'/>
      <parameter type-id='type-id-279' name='a' filepath='../../module/nvpair/nvpair.c' line='1418' column='1'/>
      <parameter type-id='type-id-123' name='n' filepath='../../module/nvpair/nvpair.c' line='1418' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvlist_add_hrtime' mangled-name='nvlist_add_hrtime' filepath='../../module/nvpair/nvpair.c' line='1424' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_hrtime'>
      <parameter type-id='type-id-73' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1424' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1424' column='1'/>
      <parameter type-id='type-id-117' name='val' filepath='../../module/nvpair/nvpair.c' line='1424' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvlist_add_nvlist' mangled-name='nvlist_add_nvlist' filepath='../../module/nvpair/nvpair.c' line='1430' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_nvlist'>
      <parameter type-id='type-id-73' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1430' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1430' column='1'/>
      <parameter type-id='type-id-73' name='val' filepath='../../module/nvpair/nvpair.c' line='1430' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvlist_add_nvlist_array' mangled-name='nvlist_add_nvlist_array' filepath='../../module/nvpair/nvpair.c' line='1436' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_nvlist_array'>
      <parameter type-id='type-id-73' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1436' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1436' column='1'/>
      <parameter type-id='type-id-156' name='a' filepath='../../module/nvpair/nvpair.c' line='1436' column='1'/>
      <parameter type-id='type-id-123' name='n' filepath='../../module/nvpair/nvpair.c' line='1436' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvlist_next_nvpair' mangled-name='nvlist_next_nvpair' filepath='../../module/nvpair/nvpair.c' line='1443' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_next_nvpair'>
      <parameter type-id='type-id-73' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1443' column='1'/>
      <parameter type-id='type-id-243' name='nvp' filepath='../../module/nvpair/nvpair.c' line='1443' column='1'/>
      <return type-id='type-id-243'/>
    </function-decl>
    <function-decl name='nvlist_prev_nvpair' mangled-name='nvlist_prev_nvpair' filepath='../../module/nvpair/nvpair.c' line='1472' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prev_nvpair'>
      <parameter type-id='type-id-73' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1443' column='1'/>
      <parameter type-id='type-id-243' name='nvp' filepath='../../module/nvpair/nvpair.c' line='1443' column='1'/>
      <return type-id='type-id-243'/>
    </function-decl>
    <function-decl name='nvlist_empty' mangled-name='nvlist_empty' filepath='../../module/nvpair/nvpair.c' line='1496' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_empty'>
      <parameter type-id='type-id-73' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1496' column='1'/>
      <return type-id='type-id-77'/>
    </function-decl>
    <function-decl name='nvpair_name' mangled-name='nvpair_name' filepath='../../module/nvpair/nvpair.c' line='1508' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_name'>
      <parameter type-id='type-id-243' name='nvp' filepath='../../module/nvpair/nvpair.c' line='1508' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='nvpair_type' mangled-name='nvpair_type' filepath='../../module/nvpair/nvpair.c' line='1514' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_type'>
      <parameter type-id='type-id-243' name='nvp' filepath='../../module/nvpair/nvpair.c' line='1514' column='1'/>
      <return type-id='type-id-215'/>
    </function-decl>
    <function-decl name='nvpair_type_is_array' mangled-name='nvpair_type_is_array' filepath='../../module/nvpair/nvpair.c' line='1520' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_type_is_array'>
      <parameter type-id='type-id-243' name='nvp' filepath='../../module/nvpair/nvpair.c' line='1520' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvlist_lookup_boolean' mangled-name='nvlist_lookup_boolean' filepath='../../module/nvpair/nvpair.c' line='1636' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_boolean'>
      <parameter type-id='type-id-73' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1276' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1276' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvlist_lookup_boolean_value' mangled-name='nvlist_lookup_boolean_value' filepath='../../module/nvpair/nvpair.c' line='1642' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_boolean_value'>
      <parameter type-id='type-id-73' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1642' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1642' column='1'/>
      <parameter type-id='type-id-122' name='val' filepath='../../module/nvpair/nvpair.c' line='1642' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvlist_lookup_byte' mangled-name='nvlist_lookup_byte' filepath='../../module/nvpair/nvpair.c' line='1649' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_byte'>
      <parameter type-id='type-id-73' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1649' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1649' column='1'/>
      <parameter type-id='type-id-126' name='val' filepath='../../module/nvpair/nvpair.c' line='1649' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvlist_lookup_int8' mangled-name='nvlist_lookup_int8' filepath='../../module/nvpair/nvpair.c' line='1655' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_int8'>
      <parameter type-id='type-id-73' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1655' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1655' column='1'/>
      <parameter type-id='type-id-129' name='val' filepath='../../module/nvpair/nvpair.c' line='1655' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvlist_lookup_uint8' mangled-name='nvlist_lookup_uint8' filepath='../../module/nvpair/nvpair.c' line='1661' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_uint8'>
      <parameter type-id='type-id-73' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1661' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1661' column='1'/>
      <parameter type-id='type-id-132' name='val' filepath='../../module/nvpair/nvpair.c' line='1661' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvlist_lookup_int16' mangled-name='nvlist_lookup_int16' filepath='../../module/nvpair/nvpair.c' line='1667' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_int16'>
      <parameter type-id='type-id-73' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1667' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1667' column='1'/>
      <parameter type-id='type-id-135' name='val' filepath='../../module/nvpair/nvpair.c' line='1667' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvlist_lookup_uint16' mangled-name='nvlist_lookup_uint16' filepath='../../module/nvpair/nvpair.c' line='1673' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_uint16'>
      <parameter type-id='type-id-73' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1673' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1673' column='1'/>
      <parameter type-id='type-id-138' name='val' filepath='../../module/nvpair/nvpair.c' line='1673' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvlist_lookup_int32' mangled-name='nvlist_lookup_int32' filepath='../../module/nvpair/nvpair.c' line='1679' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_int32'>
      <parameter type-id='type-id-73' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1679' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1679' column='1'/>
      <parameter type-id='type-id-141' name='val' filepath='../../module/nvpair/nvpair.c' line='1679' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvlist_lookup_uint32' mangled-name='nvlist_lookup_uint32' filepath='../../module/nvpair/nvpair.c' line='1685' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_uint32'>
      <parameter type-id='type-id-73' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1685' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1685' column='1'/>
      <parameter type-id='type-id-144' name='val' filepath='../../module/nvpair/nvpair.c' line='1685' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvlist_lookup_int64' mangled-name='nvlist_lookup_int64' filepath='../../module/nvpair/nvpair.c' line='1691' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_int64'>
      <parameter type-id='type-id-73' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1691' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1691' column='1'/>
      <parameter type-id='type-id-147' name='val' filepath='../../module/nvpair/nvpair.c' line='1691' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvlist_lookup_uint64' mangled-name='nvlist_lookup_uint64' filepath='../../module/nvpair/nvpair.c' line='1697' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_uint64'>
      <parameter type-id='type-id-73' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1697' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1697' column='1'/>
      <parameter type-id='type-id-150' name='val' filepath='../../module/nvpair/nvpair.c' line='1697' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvlist_lookup_double' mangled-name='nvlist_lookup_double' filepath='../../module/nvpair/nvpair.c' line='1704' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_double'>
      <parameter type-id='type-id-73' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1704' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1704' column='1'/>
      <parameter type-id='type-id-241' name='val' filepath='../../module/nvpair/nvpair.c' line='1704' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvlist_lookup_string' mangled-name='nvlist_lookup_string' filepath='../../module/nvpair/nvpair.c' line='1711' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_string'>
      <parameter type-id='type-id-73' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1711' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1711' column='1'/>
      <parameter type-id='type-id-153' name='val' filepath='../../module/nvpair/nvpair.c' line='1711' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvlist_lookup_nvlist' mangled-name='nvlist_lookup_nvlist' filepath='../../module/nvpair/nvpair.c' line='1717' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_nvlist'>
      <parameter type-id='type-id-73' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1717' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1717' column='1'/>
      <parameter type-id='type-id-156' name='val' filepath='../../module/nvpair/nvpair.c' line='1717' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <pointer-type-def type-id='type-id-122' size-in-bits='64' id='type-id-280'/>
    <pointer-type-def type-id='type-id-123' size-in-bits='64' id='type-id-281'/>
    <function-decl name='nvlist_lookup_boolean_array' mangled-name='nvlist_lookup_boolean_array' filepath='../../module/nvpair/nvpair.c' line='1723' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_boolean_array'>
      <parameter type-id='type-id-73' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1723' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1723' column='1'/>
      <parameter type-id='type-id-280' name='a' filepath='../../module/nvpair/nvpair.c' line='1724' column='1'/>
      <parameter type-id='type-id-281' name='n' filepath='../../module/nvpair/nvpair.c' line='1724' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <pointer-type-def type-id='type-id-126' size-in-bits='64' id='type-id-282'/>
    <function-decl name='nvlist_lookup_byte_array' mangled-name='nvlist_lookup_byte_array' filepath='../../module/nvpair/nvpair.c' line='1731' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_byte_array'>
      <parameter type-id='type-id-73' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1731' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1731' column='1'/>
      <parameter type-id='type-id-282' name='a' filepath='../../module/nvpair/nvpair.c' line='1732' column='1'/>
      <parameter type-id='type-id-281' name='n' filepath='../../module/nvpair/nvpair.c' line='1732' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <pointer-type-def type-id='type-id-129' size-in-bits='64' id='type-id-283'/>
    <function-decl name='nvlist_lookup_int8_array' mangled-name='nvlist_lookup_int8_array' filepath='../../module/nvpair/nvpair.c' line='1738' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_int8_array'>
      <parameter type-id='type-id-73' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1738' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1738' column='1'/>
      <parameter type-id='type-id-283' name='a' filepath='../../module/nvpair/nvpair.c' line='1738' column='1'/>
      <parameter type-id='type-id-281' name='n' filepath='../../module/nvpair/nvpair.c' line='1738' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <pointer-type-def type-id='type-id-132' size-in-bits='64' id='type-id-284'/>
    <function-decl name='nvlist_lookup_uint8_array' mangled-name='nvlist_lookup_uint8_array' filepath='../../module/nvpair/nvpair.c' line='1744' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_uint8_array'>
      <parameter type-id='type-id-73' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1744' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1744' column='1'/>
      <parameter type-id='type-id-284' name='a' filepath='../../module/nvpair/nvpair.c' line='1745' column='1'/>
      <parameter type-id='type-id-281' name='n' filepath='../../module/nvpair/nvpair.c' line='1745' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <pointer-type-def type-id='type-id-135' size-in-bits='64' id='type-id-285'/>
    <function-decl name='nvlist_lookup_int16_array' mangled-name='nvlist_lookup_int16_array' filepath='../../module/nvpair/nvpair.c' line='1751' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_int16_array'>
      <parameter type-id='type-id-73' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1751' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1751' column='1'/>
      <parameter type-id='type-id-285' name='a' filepath='../../module/nvpair/nvpair.c' line='1752' column='1'/>
      <parameter type-id='type-id-281' name='n' filepath='../../module/nvpair/nvpair.c' line='1752' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <pointer-type-def type-id='type-id-138' size-in-bits='64' id='type-id-286'/>
    <function-decl name='nvlist_lookup_uint16_array' mangled-name='nvlist_lookup_uint16_array' filepath='../../module/nvpair/nvpair.c' line='1758' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_uint16_array'>
      <parameter type-id='type-id-73' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1758' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1758' column='1'/>
      <parameter type-id='type-id-286' name='a' filepath='../../module/nvpair/nvpair.c' line='1759' column='1'/>
      <parameter type-id='type-id-281' name='n' filepath='../../module/nvpair/nvpair.c' line='1759' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <pointer-type-def type-id='type-id-141' size-in-bits='64' id='type-id-287'/>
    <function-decl name='nvlist_lookup_int32_array' mangled-name='nvlist_lookup_int32_array' filepath='../../module/nvpair/nvpair.c' line='1765' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_int32_array'>
      <parameter type-id='type-id-73' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1765' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1765' column='1'/>
      <parameter type-id='type-id-287' name='a' filepath='../../module/nvpair/nvpair.c' line='1766' column='1'/>
      <parameter type-id='type-id-281' name='n' filepath='../../module/nvpair/nvpair.c' line='1766' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <pointer-type-def type-id='type-id-144' size-in-bits='64' id='type-id-288'/>
    <function-decl name='nvlist_lookup_uint32_array' mangled-name='nvlist_lookup_uint32_array' filepath='../../module/nvpair/nvpair.c' line='1772' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_uint32_array'>
      <parameter type-id='type-id-73' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1772' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1772' column='1'/>
      <parameter type-id='type-id-288' name='a' filepath='../../module/nvpair/nvpair.c' line='1773' column='1'/>
      <parameter type-id='type-id-281' name='n' filepath='../../module/nvpair/nvpair.c' line='1773' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <pointer-type-def type-id='type-id-147' size-in-bits='64' id='type-id-289'/>
    <function-decl name='nvlist_lookup_int64_array' mangled-name='nvlist_lookup_int64_array' filepath='../../module/nvpair/nvpair.c' line='1779' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_int64_array'>
      <parameter type-id='type-id-73' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1779' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1779' column='1'/>
      <parameter type-id='type-id-289' name='a' filepath='../../module/nvpair/nvpair.c' line='1780' column='1'/>
      <parameter type-id='type-id-281' name='n' filepath='../../module/nvpair/nvpair.c' line='1780' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <pointer-type-def type-id='type-id-150' size-in-bits='64' id='type-id-290'/>
    <function-decl name='nvlist_lookup_uint64_array' mangled-name='nvlist_lookup_uint64_array' filepath='../../module/nvpair/nvpair.c' line='1786' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_uint64_array'>
      <parameter type-id='type-id-73' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1786' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1786' column='1'/>
      <parameter type-id='type-id-290' name='a' filepath='../../module/nvpair/nvpair.c' line='1787' column='1'/>
      <parameter type-id='type-id-281' name='n' filepath='../../module/nvpair/nvpair.c' line='1787' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvlist_lookup_string_array' mangled-name='nvlist_lookup_string_array' filepath='../../module/nvpair/nvpair.c' line='1793' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_string_array'>
      <parameter type-id='type-id-73' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1793' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1793' column='1'/>
      <parameter type-id='type-id-233' name='a' filepath='../../module/nvpair/nvpair.c' line='1794' column='1'/>
      <parameter type-id='type-id-281' name='n' filepath='../../module/nvpair/nvpair.c' line='1794' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <pointer-type-def type-id='type-id-156' size-in-bits='64' id='type-id-291'/>
    <function-decl name='nvlist_lookup_nvlist_array' mangled-name='nvlist_lookup_nvlist_array' filepath='../../module/nvpair/nvpair.c' line='1800' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_nvlist_array'>
      <parameter type-id='type-id-73' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1800' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1800' column='1'/>
      <parameter type-id='type-id-291' name='a' filepath='../../module/nvpair/nvpair.c' line='1801' column='1'/>
      <parameter type-id='type-id-281' name='n' filepath='../../module/nvpair/nvpair.c' line='1801' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <pointer-type-def type-id='type-id-117' size-in-bits='64' id='type-id-292'/>
    <function-decl name='nvlist_lookup_hrtime' mangled-name='nvlist_lookup_hrtime' filepath='../../module/nvpair/nvpair.c' line='1807' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_hrtime'>
      <parameter type-id='type-id-73' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1807' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1807' column='1'/>
      <parameter type-id='type-id-292' name='val' filepath='../../module/nvpair/nvpair.c' line='1807' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvlist_lookup_pairs' mangled-name='nvlist_lookup_pairs' filepath='../../module/nvpair/nvpair.c' line='1813' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_pairs'>
      <parameter type-id='type-id-73' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1813' column='1'/>
      <parameter type-id='type-id-5' name='flag' filepath='../../module/nvpair/nvpair.c' line='1813' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <pointer-type-def type-id='type-id-243' size-in-bits='64' id='type-id-293'/>
    <function-decl name='nvlist_lookup_nvpair' mangled-name='nvlist_lookup_nvpair' filepath='../../module/nvpair/nvpair.c' line='2063' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_nvpair'>
      <parameter type-id='type-id-73' name='nvl' filepath='../../module/nvpair/nvpair.c' line='2063' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='2063' column='1'/>
      <parameter type-id='type-id-293' name='ret' filepath='../../module/nvpair/nvpair.c' line='2063' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvlist_lookup_nvpair_embedded_index' mangled-name='nvlist_lookup_nvpair_embedded_index' filepath='../../module/nvpair/nvpair.c' line='2073' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_nvpair_embedded_index'>
      <parameter type-id='type-id-73' name='nvl' filepath='../../module/nvpair/nvpair.c' line='2073' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='2074' column='1'/>
      <parameter type-id='type-id-293' name='ret' filepath='../../module/nvpair/nvpair.c' line='2074' column='1'/>
      <parameter type-id='type-id-222' name='ip' filepath='../../module/nvpair/nvpair.c' line='2074' column='1'/>
      <parameter type-id='type-id-153' name='ep' filepath='../../module/nvpair/nvpair.c' line='2074' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvlist_exists' mangled-name='nvlist_exists' filepath='../../module/nvpair/nvpair.c' line='2080' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_exists'>
      <parameter type-id='type-id-73' name='nvl' filepath='../../module/nvpair/nvpair.c' line='2080' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='2080' column='1'/>
      <return type-id='type-id-77'/>
    </function-decl>
    <function-decl name='nvpair_value_boolean_value' mangled-name='nvpair_value_boolean_value' filepath='../../module/nvpair/nvpair.c' line='2101' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_boolean_value'>
      <parameter type-id='type-id-243' name='nvp' filepath='../../module/nvpair/nvpair.c' line='2101' column='1'/>
      <parameter type-id='type-id-122' name='val' filepath='../../module/nvpair/nvpair.c' line='2101' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvpair_value_byte' mangled-name='nvpair_value_byte' filepath='../../module/nvpair/nvpair.c' line='2107' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_byte'>
      <parameter type-id='type-id-243' name='nvp' filepath='../../module/nvpair/nvpair.c' line='2107' column='1'/>
      <parameter type-id='type-id-126' name='val' filepath='../../module/nvpair/nvpair.c' line='2107' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvpair_value_int8' mangled-name='nvpair_value_int8' filepath='../../module/nvpair/nvpair.c' line='2113' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_int8'>
      <parameter type-id='type-id-243' name='nvp' filepath='../../module/nvpair/nvpair.c' line='2113' column='1'/>
      <parameter type-id='type-id-129' name='val' filepath='../../module/nvpair/nvpair.c' line='2113' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvpair_value_uint8' mangled-name='nvpair_value_uint8' filepath='../../module/nvpair/nvpair.c' line='2119' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_uint8'>
      <parameter type-id='type-id-243' name='nvp' filepath='../../module/nvpair/nvpair.c' line='2119' column='1'/>
      <parameter type-id='type-id-132' name='val' filepath='../../module/nvpair/nvpair.c' line='2119' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvpair_value_int16' mangled-name='nvpair_value_int16' filepath='../../module/nvpair/nvpair.c' line='2125' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_int16'>
      <parameter type-id='type-id-243' name='nvp' filepath='../../module/nvpair/nvpair.c' line='2125' column='1'/>
      <parameter type-id='type-id-135' name='val' filepath='../../module/nvpair/nvpair.c' line='2125' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvpair_value_uint16' mangled-name='nvpair_value_uint16' filepath='../../module/nvpair/nvpair.c' line='2131' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_uint16'>
      <parameter type-id='type-id-243' name='nvp' filepath='../../module/nvpair/nvpair.c' line='2131' column='1'/>
      <parameter type-id='type-id-138' name='val' filepath='../../module/nvpair/nvpair.c' line='2131' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvpair_value_int32' mangled-name='nvpair_value_int32' filepath='../../module/nvpair/nvpair.c' line='2137' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_int32'>
      <parameter type-id='type-id-243' name='nvp' filepath='../../module/nvpair/nvpair.c' line='2137' column='1'/>
      <parameter type-id='type-id-141' name='val' filepath='../../module/nvpair/nvpair.c' line='2137' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvpair_value_uint32' mangled-name='nvpair_value_uint32' filepath='../../module/nvpair/nvpair.c' line='2143' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_uint32'>
      <parameter type-id='type-id-243' name='nvp' filepath='../../module/nvpair/nvpair.c' line='2143' column='1'/>
      <parameter type-id='type-id-144' name='val' filepath='../../module/nvpair/nvpair.c' line='2143' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvpair_value_int64' mangled-name='nvpair_value_int64' filepath='../../module/nvpair/nvpair.c' line='2149' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_int64'>
      <parameter type-id='type-id-243' name='nvp' filepath='../../module/nvpair/nvpair.c' line='2149' column='1'/>
      <parameter type-id='type-id-147' name='val' filepath='../../module/nvpair/nvpair.c' line='2149' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvpair_value_uint64' mangled-name='nvpair_value_uint64' filepath='../../module/nvpair/nvpair.c' line='2155' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_uint64'>
      <parameter type-id='type-id-243' name='nvp' filepath='../../module/nvpair/nvpair.c' line='2155' column='1'/>
      <parameter type-id='type-id-150' name='val' filepath='../../module/nvpair/nvpair.c' line='2155' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvpair_value_double' mangled-name='nvpair_value_double' filepath='../../module/nvpair/nvpair.c' line='2162' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_double'>
      <parameter type-id='type-id-243' name='nvp' filepath='../../module/nvpair/nvpair.c' line='2162' column='1'/>
      <parameter type-id='type-id-241' name='val' filepath='../../module/nvpair/nvpair.c' line='2162' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvpair_value_string' mangled-name='nvpair_value_string' filepath='../../module/nvpair/nvpair.c' line='2169' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_string'>
      <parameter type-id='type-id-243' name='nvp' filepath='../../module/nvpair/nvpair.c' line='2169' column='1'/>
      <parameter type-id='type-id-153' name='val' filepath='../../module/nvpair/nvpair.c' line='2169' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvpair_value_nvlist' mangled-name='nvpair_value_nvlist' filepath='../../module/nvpair/nvpair.c' line='2175' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_nvlist'>
      <parameter type-id='type-id-243' name='nvp' filepath='../../module/nvpair/nvpair.c' line='2175' column='1'/>
      <parameter type-id='type-id-156' name='val' filepath='../../module/nvpair/nvpair.c' line='2175' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvpair_value_boolean_array' mangled-name='nvpair_value_boolean_array' filepath='../../module/nvpair/nvpair.c' line='2181' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_boolean_array'>
      <parameter type-id='type-id-243' name='nvp' filepath='../../module/nvpair/nvpair.c' line='2181' column='1'/>
      <parameter type-id='type-id-280' name='val' filepath='../../module/nvpair/nvpair.c' line='2181' column='1'/>
      <parameter type-id='type-id-281' name='nelem' filepath='../../module/nvpair/nvpair.c' line='2181' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvpair_value_byte_array' mangled-name='nvpair_value_byte_array' filepath='../../module/nvpair/nvpair.c' line='2187' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_byte_array'>
      <parameter type-id='type-id-243' name='nvp' filepath='../../module/nvpair/nvpair.c' line='2187' column='1'/>
      <parameter type-id='type-id-282' name='val' filepath='../../module/nvpair/nvpair.c' line='2187' column='1'/>
      <parameter type-id='type-id-281' name='nelem' filepath='../../module/nvpair/nvpair.c' line='2187' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvpair_value_int8_array' mangled-name='nvpair_value_int8_array' filepath='../../module/nvpair/nvpair.c' line='2193' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_int8_array'>
      <parameter type-id='type-id-243' name='nvp' filepath='../../module/nvpair/nvpair.c' line='2193' column='1'/>
      <parameter type-id='type-id-283' name='val' filepath='../../module/nvpair/nvpair.c' line='2193' column='1'/>
      <parameter type-id='type-id-281' name='nelem' filepath='../../module/nvpair/nvpair.c' line='2193' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvpair_value_uint8_array' mangled-name='nvpair_value_uint8_array' filepath='../../module/nvpair/nvpair.c' line='2199' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_uint8_array'>
      <parameter type-id='type-id-243' name='nvp' filepath='../../module/nvpair/nvpair.c' line='2199' column='1'/>
      <parameter type-id='type-id-284' name='val' filepath='../../module/nvpair/nvpair.c' line='2199' column='1'/>
      <parameter type-id='type-id-281' name='nelem' filepath='../../module/nvpair/nvpair.c' line='2199' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvpair_value_int16_array' mangled-name='nvpair_value_int16_array' filepath='../../module/nvpair/nvpair.c' line='2205' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_int16_array'>
      <parameter type-id='type-id-243' name='nvp' filepath='../../module/nvpair/nvpair.c' line='2205' column='1'/>
      <parameter type-id='type-id-285' name='val' filepath='../../module/nvpair/nvpair.c' line='2205' column='1'/>
      <parameter type-id='type-id-281' name='nelem' filepath='../../module/nvpair/nvpair.c' line='2205' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvpair_value_uint16_array' mangled-name='nvpair_value_uint16_array' filepath='../../module/nvpair/nvpair.c' line='2211' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_uint16_array'>
      <parameter type-id='type-id-243' name='nvp' filepath='../../module/nvpair/nvpair.c' line='2211' column='1'/>
      <parameter type-id='type-id-286' name='val' filepath='../../module/nvpair/nvpair.c' line='2211' column='1'/>
      <parameter type-id='type-id-281' name='nelem' filepath='../../module/nvpair/nvpair.c' line='2211' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvpair_value_int32_array' mangled-name='nvpair_value_int32_array' filepath='../../module/nvpair/nvpair.c' line='2217' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_int32_array'>
      <parameter type-id='type-id-243' name='nvp' filepath='../../module/nvpair/nvpair.c' line='2217' column='1'/>
      <parameter type-id='type-id-287' name='val' filepath='../../module/nvpair/nvpair.c' line='2217' column='1'/>
      <parameter type-id='type-id-281' name='nelem' filepath='../../module/nvpair/nvpair.c' line='2217' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvpair_value_uint32_array' mangled-name='nvpair_value_uint32_array' filepath='../../module/nvpair/nvpair.c' line='2223' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_uint32_array'>
      <parameter type-id='type-id-243' name='nvp' filepath='../../module/nvpair/nvpair.c' line='2223' column='1'/>
      <parameter type-id='type-id-288' name='val' filepath='../../module/nvpair/nvpair.c' line='2223' column='1'/>
      <parameter type-id='type-id-281' name='nelem' filepath='../../module/nvpair/nvpair.c' line='2223' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvpair_value_int64_array' mangled-name='nvpair_value_int64_array' filepath='../../module/nvpair/nvpair.c' line='2229' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_int64_array'>
      <parameter type-id='type-id-243' name='nvp' filepath='../../module/nvpair/nvpair.c' line='2229' column='1'/>
      <parameter type-id='type-id-289' name='val' filepath='../../module/nvpair/nvpair.c' line='2229' column='1'/>
      <parameter type-id='type-id-281' name='nelem' filepath='../../module/nvpair/nvpair.c' line='2229' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvpair_value_uint64_array' mangled-name='nvpair_value_uint64_array' filepath='../../module/nvpair/nvpair.c' line='2235' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_uint64_array'>
      <parameter type-id='type-id-243' name='nvp' filepath='../../module/nvpair/nvpair.c' line='2235' column='1'/>
      <parameter type-id='type-id-290' name='val' filepath='../../module/nvpair/nvpair.c' line='2235' column='1'/>
      <parameter type-id='type-id-281' name='nelem' filepath='../../module/nvpair/nvpair.c' line='2235' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvpair_value_string_array' mangled-name='nvpair_value_string_array' filepath='../../module/nvpair/nvpair.c' line='2241' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_string_array'>
      <parameter type-id='type-id-243' name='nvp' filepath='../../module/nvpair/nvpair.c' line='2241' column='1'/>
      <parameter type-id='type-id-233' name='val' filepath='../../module/nvpair/nvpair.c' line='2241' column='1'/>
      <parameter type-id='type-id-281' name='nelem' filepath='../../module/nvpair/nvpair.c' line='2241' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvpair_value_nvlist_array' mangled-name='nvpair_value_nvlist_array' filepath='../../module/nvpair/nvpair.c' line='2247' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_nvlist_array'>
      <parameter type-id='type-id-243' name='nvp' filepath='../../module/nvpair/nvpair.c' line='2247' column='1'/>
      <parameter type-id='type-id-291' name='val' filepath='../../module/nvpair/nvpair.c' line='2247' column='1'/>
      <parameter type-id='type-id-281' name='nelem' filepath='../../module/nvpair/nvpair.c' line='2247' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvpair_value_hrtime' mangled-name='nvpair_value_hrtime' filepath='../../module/nvpair/nvpair.c' line='2253' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_hrtime'>
      <parameter type-id='type-id-243' name='nvp' filepath='../../module/nvpair/nvpair.c' line='2253' column='1'/>
      <parameter type-id='type-id-292' name='val' filepath='../../module/nvpair/nvpair.c' line='2253' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvlist_add_nvpair' mangled-name='nvlist_add_nvpair' filepath='../../module/nvpair/nvpair.c' line='2262' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_nvpair'>
      <parameter type-id='type-id-73' name='nvl' filepath='../../module/nvpair/nvpair.c' line='2262' column='1'/>
      <parameter type-id='type-id-243' name='nvp' filepath='../../module/nvpair/nvpair.c' line='2262' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvlist_merge' mangled-name='nvlist_merge' filepath='../../module/nvpair/nvpair.c' line='2279' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_merge'>
      <parameter type-id='type-id-73' name='dst' filepath='../../module/nvpair/nvpair.c' line='2279' column='1'/>
      <parameter type-id='type-id-73' name='nvl' filepath='../../module/nvpair/nvpair.c' line='2279' column='1'/>
      <parameter type-id='type-id-5' name='flag' filepath='../../module/nvpair/nvpair.c' line='2279' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <pointer-type-def type-id='type-id-20' size-in-bits='64' id='type-id-294'/>
    <function-decl name='nvlist_size' mangled-name='nvlist_size' filepath='../../module/nvpair/nvpair.c' line='2648' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_size'>
      <parameter type-id='type-id-73' name='nvl' filepath='../../module/nvpair/nvpair.c' line='2648' column='1'/>
      <parameter type-id='type-id-294' name='size' filepath='../../module/nvpair/nvpair.c' line='2648' column='1'/>
      <parameter type-id='type-id-5' name='encoding' filepath='../../module/nvpair/nvpair.c' line='2648' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <class-decl name='XDR' size-in-bits='384' is-struct='yes' visibility='default' filepath='/usr/include/rpc/xdr.h' line='110' column='1' id='type-id-295'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='x_op' type-id='type-id-296' visibility='default' filepath='/usr/include/rpc/xdr.h' line='112' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='x_ops' type-id='type-id-297' visibility='default' filepath='/usr/include/rpc/xdr.h' line='136' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='x_public' type-id='type-id-298' visibility='default' filepath='/usr/include/rpc/xdr.h' line='137' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='x_private' type-id='type-id-298' visibility='default' filepath='/usr/include/rpc/xdr.h' line='138' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='x_base' type-id='type-id-298' visibility='default' filepath='/usr/include/rpc/xdr.h' line='139' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='x_handy' type-id='type-id-299' visibility='default' filepath='/usr/include/rpc/xdr.h' line='140' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='xdr_op' filepath='/usr/include/rpc/xdr.h' line='81' column='1' id='type-id-296'>
      <underlying-type type-id='type-id-32'/>
      <enumerator name='XDR_ENCODE' value='0'/>
      <enumerator name='XDR_DECODE' value='1'/>
      <enumerator name='XDR_FREE' value='2'/>
    </enum-decl>
    <class-decl name='xdr_ops' size-in-bits='640' is-struct='yes' visibility='default' filepath='/usr/include/rpc/xdr.h' line='113' column='1' id='type-id-300'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='x_getlong' type-id='type-id-301' visibility='default' filepath='/usr/include/rpc/xdr.h' line='115' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='x_putlong' type-id='type-id-302' visibility='default' filepath='/usr/include/rpc/xdr.h' line='117' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='x_getbytes' type-id='type-id-303' visibility='default' filepath='/usr/include/rpc/xdr.h' line='119' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='x_putbytes' type-id='type-id-304' visibility='default' filepath='/usr/include/rpc/xdr.h' line='121' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='x_getpostn' type-id='type-id-305' visibility='default' filepath='/usr/include/rpc/xdr.h' line='123' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='x_setpostn' type-id='type-id-306' visibility='default' filepath='/usr/include/rpc/xdr.h' line='125' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='x_inline' type-id='type-id-307' visibility='default' filepath='/usr/include/rpc/xdr.h' line='127' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='x_destroy' type-id='type-id-308' visibility='default' filepath='/usr/include/rpc/xdr.h' line='129' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='x_getint32' type-id='type-id-309' visibility='default' filepath='/usr/include/rpc/xdr.h' line='131' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='x_putint32' type-id='type-id-310' visibility='default' filepath='/usr/include/rpc/xdr.h' line='133' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='bool_t' type-id='type-id-5' filepath='/usr/include/rpc/types.h' line='37' column='1' id='type-id-311'/>
    <typedef-decl name='XDR' type-id='type-id-295' filepath='/usr/include/rpc/xdr.h' line='109' column='1' id='type-id-312'/>
    <pointer-type-def type-id='type-id-312' size-in-bits='64' id='type-id-313'/>
    <pointer-type-def type-id='type-id-314' size-in-bits='64' id='type-id-301'/>
    <qualified-type-def type-id='type-id-24' const='yes' id='type-id-315'/>
    <pointer-type-def type-id='type-id-315' size-in-bits='64' id='type-id-316'/>
    <pointer-type-def type-id='type-id-317' size-in-bits='64' id='type-id-302'/>
    <typedef-decl name='__caddr_t' type-id='type-id-9' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='201' column='1' id='type-id-318'/>
    <typedef-decl name='caddr_t' type-id='type-id-318' filepath='/usr/include/x86_64-linux-gnu/sys/types.h' line='115' column='1' id='type-id-298'/>
    <typedef-decl name='__u_int' type-id='type-id-69' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='32' column='1' id='type-id-319'/>
    <typedef-decl name='u_int' type-id='type-id-319' filepath='/usr/include/x86_64-linux-gnu/sys/types.h' line='35' column='1' id='type-id-299'/>
    <pointer-type-def type-id='type-id-320' size-in-bits='64' id='type-id-303'/>
    <pointer-type-def type-id='type-id-321' size-in-bits='64' id='type-id-304'/>
    <qualified-type-def type-id='type-id-312' const='yes' id='type-id-322'/>
    <pointer-type-def type-id='type-id-322' size-in-bits='64' id='type-id-323'/>
    <pointer-type-def type-id='type-id-324' size-in-bits='64' id='type-id-305'/>
    <pointer-type-def type-id='type-id-325' size-in-bits='64' id='type-id-306'/>
    <pointer-type-def type-id='type-id-326' size-in-bits='64' id='type-id-307'/>
    <pointer-type-def type-id='type-id-327' size-in-bits='64' id='type-id-308'/>
    <pointer-type-def type-id='type-id-328' size-in-bits='64' id='type-id-309'/>
    <qualified-type-def type-id='type-id-65' const='yes' id='type-id-329'/>
    <pointer-type-def type-id='type-id-329' size-in-bits='64' id='type-id-330'/>
    <pointer-type-def type-id='type-id-331' size-in-bits='64' id='type-id-310'/>
    <pointer-type-def type-id='type-id-300' size-in-bits='64' id='type-id-297'/>
    <function-decl name='xdrmem_create' filepath='/usr/include/rpc/xdr.h' line='350' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-313'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-69'/>
      <parameter type-id='type-id-296'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='nvlist_pack' mangled-name='nvlist_pack' filepath='../../module/nvpair/nvpair.c' line='2657' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_pack'>
      <parameter type-id='type-id-73' name='nvl' filepath='../../module/nvpair/nvpair.c' line='2657' column='1'/>
      <parameter type-id='type-id-153' name='bufp' filepath='../../module/nvpair/nvpair.c' line='2657' column='1'/>
      <parameter type-id='type-id-294' name='buflen' filepath='../../module/nvpair/nvpair.c' line='2657' column='1'/>
      <parameter type-id='type-id-5' name='encoding' filepath='../../module/nvpair/nvpair.c' line='2657' column='1'/>
      <parameter type-id='type-id-5' name='kmflag' filepath='../../module/nvpair/nvpair.c' line='2658' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvlist_xpack' mangled-name='nvlist_xpack' filepath='../../module/nvpair/nvpair.c' line='2665' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_xpack'>
