<abi-corpus architecture='elf-amd-x86_64' soname='libuutil.so.3'>
  <elf-needed>
    <dependency name='libpthread.so.0'/>
    <dependency name='libc.so.6'/>
    <dependency name='ld-linux-x86-64.so.2'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='_fini' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_init' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_sol_getmntent' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='atomic_add_16' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='atomic_add_16_nv' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='atomic_add_32' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='atomic_add_32_nv' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='atomic_add_64' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='atomic_add_64_nv' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='uu_list_walk_next' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='uu_list_walk_start' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='uu_memdup' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='uu_msprintf' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='uu_panic' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='uu_set_error' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='uu_setpname' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='uu_strbw' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='uu_strcaseeq' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='uu_strdup' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='uu_streq' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='uu_strerror' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='uu_strndup' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='uu_vdie' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='uu_vwarn' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='uu_vxdie' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='uu_warn' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='uu_xdie' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='uu_zalloc' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <elf-variable-symbols>
    <elf-symbol name='libspl_assert_ok' size='4' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='uu_exit_fatal_value' size='4' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='uu_exit_ok_value' size='4' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='uu_exit_usage_value' size='4' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-variable-symbols>
  <abi-instr version='1.0' address-size='64' path='uu_alloc.c' comp-dir-path='/home/runner/work/zfs/zfs/lib/libuutil' language='LANG_C99'>
    <type-decl name='char' size-in-bits='8' id='type-id-1'/>
    <pointer-type-def type-id='type-id-1' size-in-bits='64' id='type-id-2'/>
    <qualified-type-def type-id='type-id-1' const='yes' id='type-id-3'/>
    <pointer-type-def type-id='type-id-3' size-in-bits='64' id='type-id-4'/>
    <function-decl name='uu_msprintf' mangled-name='uu_msprintf' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_msprintf'>
      <parameter type-id='type-id-4' name='format'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <type-decl name='void' id='type-id-5'/>
    <pointer-type-def type-id='type-id-5' size-in-bits='64' id='type-id-6'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-7'/>
    <typedef-decl name='size_t' type-id='type-id-7' id='type-id-8'/>
    <function-decl name='uu_memdup' mangled-name='uu_memdup' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_memdup'>
      <parameter type-id='type-id-6' name='buf'/>
      <parameter type-id='type-id-8' name='sz'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='uu_strndup' mangled-name='uu_strndup' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_strndup'>
      <parameter type-id='type-id-4' name='s'/>
      <parameter type-id='type-id-8' name='n'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='uu_strdup' mangled-name='uu_strdup' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_strdup'>
      <parameter type-id='type-id-4' name='str'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='uu_free' mangled-name='uu_free' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_free'>
      <parameter type-id='type-id-6' name='p'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='uu_zalloc' mangled-name='uu_zalloc' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_zalloc'>
      <parameter type-id='type-id-8' name='n'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='__builtin___vsnprintf_chk' mangled-name='__vsnprintf_chk' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='__stack_chk_fail' mangled-name='__stack_chk_fail' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='__builtin_memcpy' mangled-name='memcpy' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='strnlen' mangled-name='strnlen' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='strlen' mangled-name='strlen' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='free' mangled-name='free' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='__builtin_calloc' mangled-name='calloc' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='uu_set_error' mangled-name='uu_set_error' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-5'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='uu_avl.c' comp-dir-path='/home/runner/work/zfs/zfs/lib/libuutil' language='LANG_C99'>
    <function-decl name='uu_avl_release' mangled-name='uu_avl_release' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_avl_release'>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='uu_avl_lockup' mangled-name='uu_avl_lockup' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_avl_lockup'>
      <return type-id='type-id-5'/>
    </function-decl>
    <class-decl name='uu_avl' size-in-bits='960' is-struct='yes' visibility='default' id='type-id-9'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ua_next_enc' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ua_prev_enc' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ua_pool' type-id='type-id-11' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='ua_parent_enc' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='ua_debug' type-id='type-id-12' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='264'>
        <var-decl name='ua_index' type-id='type-id-12' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='ua_tree' type-id='type-id-13' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='ua_null_walk' type-id='type-id-14' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='uintptr_t' type-id='type-id-7' id='type-id-10'/>
    <class-decl name='uu_avl_pool' size-in-bits='2176' is-struct='yes' visibility='default' id='type-id-15'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='uap_next' type-id='type-id-11' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='uap_prev' type-id='type-id-11' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='uap_name' type-id='type-id-16' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='uap_nodeoffset' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='uap_objsize' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='uap_cmp' type-id='type-id-17' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='uap_debug' type-id='type-id-12' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='840'>
        <var-decl name='uap_last_index' type-id='type-id-12' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='uap_lock' type-id='type-id-18' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='uap_null_avl' type-id='type-id-19' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='uu_avl_pool_t' type-id='type-id-15' id='type-id-20'/>
    <pointer-type-def type-id='type-id-20' size-in-bits='64' id='type-id-11'/>

    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='512' id='type-id-16'>
      <subrange length='64' type-id='type-id-7' id='type-id-21'/>

    </array-type-def>
    <type-decl name='int' size-in-bits='32' id='type-id-22'/>
    <typedef-decl name='uu_compare_fn_t' type-id='type-id-23' id='type-id-24'/>
    <pointer-type-def type-id='type-id-24' size-in-bits='64' id='type-id-17'/>
    <type-decl name='unsigned char' size-in-bits='8' id='type-id-25'/>
    <typedef-decl name='__uint8_t' type-id='type-id-25' id='type-id-26'/>
    <typedef-decl name='uint8_t' type-id='type-id-26' id='type-id-12'/>
    <union-decl name='__anonymous_union__' size-in-bits='320' is-anonymous='yes' visibility='default' id='type-id-27'>
      <data-member access='private'>
        <var-decl name='__data' type-id='type-id-28' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='__size' type-id='type-id-29' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='__align' type-id='type-id-30' visibility='default'/>
      </data-member>
    </union-decl>
    <class-decl name='__pthread_mutex_s' size-in-bits='320' is-struct='yes' visibility='default' id='type-id-28'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__lock' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='__count' type-id='type-id-31' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__owner' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='__nusers' type-id='type-id-31' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='__kind' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='__spins' type-id='type-id-32' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='176'>
        <var-decl name='__elision' type-id='type-id-32' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='__list' type-id='type-id-33' visibility='default'/>
      </data-member>
    </class-decl>
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-31'/>
    <type-decl name='short int' size-in-bits='16' id='type-id-32'/>
    <class-decl name='__pthread_internal_list' size-in-bits='128' is-struct='yes' visibility='default' id='type-id-34'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__prev' type-id='type-id-35' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__next' type-id='type-id-35' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-34' size-in-bits='64' id='type-id-35'/>
    <typedef-decl name='__pthread_list_t' type-id='type-id-34' id='type-id-33'/>

    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='320' id='type-id-29'>
      <subrange length='40' type-id='type-id-7' id='type-id-36'/>

    </array-type-def>
    <type-decl name='long int' size-in-bits='64' id='type-id-30'/>
    <typedef-decl name='pthread_mutex_t' type-id='type-id-27' id='type-id-18'/>
    <typedef-decl name='uu_avl_t' type-id='type-id-9' id='type-id-19'/>
    <class-decl name='avl_tree' size-in-bits='320' is-struct='yes' visibility='default' id='type-id-13'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='avl_root' type-id='type-id-37' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='avl_compar' type-id='type-id-38' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='avl_offset' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='avl_numnodes' type-id='type-id-39' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='avl_pad' type-id='type-id-8' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='avl_node' size-in-bits='192' is-struct='yes' visibility='default' id='type-id-40'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='avl_child' type-id='type-id-41' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='avl_pcb' type-id='type-id-10' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-40' size-in-bits='64' id='type-id-37'/>

    <array-type-def dimensions='1' type-id='type-id-37' size-in-bits='128' id='type-id-41'>
      <subrange length='2' type-id='type-id-7' id='type-id-42'/>

    </array-type-def>
    <pointer-type-def type-id='type-id-43' size-in-bits='64' id='type-id-38'/>
    <typedef-decl name='ulong_t' type-id='type-id-7' id='type-id-39'/>
    <class-decl name='uu_avl_walk' size-in-bits='320' is-struct='yes' visibility='default' id='type-id-44'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='uaw_next' type-id='type-id-45' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='uaw_prev' type-id='type-id-45' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='uaw_avl' type-id='type-id-46' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='uaw_next_result' type-id='type-id-6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='uaw_dir' type-id='type-id-47' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='264'>
        <var-decl name='uaw_robust' type-id='type-id-12' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='uu_avl_walk_t' type-id='type-id-44' id='type-id-14'/>
    <pointer-type-def type-id='type-id-14' size-in-bits='64' id='type-id-45'/>
    <pointer-type-def type-id='type-id-19' size-in-bits='64' id='type-id-46'/>
    <type-decl name='signed char' size-in-bits='8' id='type-id-48'/>
    <typedef-decl name='__int8_t' type-id='type-id-48' id='type-id-49'/>
    <typedef-decl name='int8_t' type-id='type-id-49' id='type-id-47'/>
    <typedef-decl name='uu_avl_index_t' type-id='type-id-10' id='type-id-50'/>
    <function-decl name='uu_avl_nearest_prev' mangled-name='uu_avl_nearest_prev' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_avl_nearest_prev'>
      <parameter type-id='type-id-46' name='ap'/>
      <parameter type-id='type-id-50' name='idx'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='uu_avl_nearest_next' mangled-name='uu_avl_nearest_next' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_avl_nearest_next'>
      <parameter type-id='type-id-46' name='ap'/>
      <parameter type-id='type-id-50' name='idx'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='uu_avl_insert' mangled-name='uu_avl_insert' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_avl_insert'>
      <parameter type-id='type-id-46' name='ap'/>
      <parameter type-id='type-id-6' name='elem'/>
      <parameter type-id='type-id-50' name='idx'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <pointer-type-def type-id='type-id-50' size-in-bits='64' id='type-id-51'/>
    <function-decl name='uu_avl_find' mangled-name='uu_avl_find' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_avl_find'>
      <parameter type-id='type-id-46' name='ap'/>
      <parameter type-id='type-id-6' name='elem'/>
      <parameter type-id='type-id-6' name='private'/>
      <parameter type-id='type-id-51' name='out'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <pointer-type-def type-id='type-id-6' size-in-bits='64' id='type-id-52'/>
    <function-decl name='uu_avl_teardown' mangled-name='uu_avl_teardown' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_avl_teardown'>
      <parameter type-id='type-id-46' name='ap'/>
      <parameter type-id='type-id-52' name='cookie'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='uu_avl_remove' mangled-name='uu_avl_remove' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_avl_remove'>
      <parameter type-id='type-id-46' name='ap'/>
      <parameter type-id='type-id-6' name='elem'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <typedef-decl name='uu_walk_fn_t' type-id='type-id-43' id='type-id-53'/>
    <pointer-type-def type-id='type-id-53' size-in-bits='64' id='type-id-54'/>
    <typedef-decl name='__uint32_t' type-id='type-id-31' id='type-id-55'/>
    <typedef-decl name='uint32_t' type-id='type-id-55' id='type-id-56'/>
    <function-decl name='uu_avl_walk' mangled-name='uu_avl_walk' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_avl_walk'>
      <parameter type-id='type-id-46' name='ap'/>
      <parameter type-id='type-id-54' name='func'/>
      <parameter type-id='type-id-6' name='private'/>
      <parameter type-id='type-id-56' name='flags'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='uu_avl_walk_end' mangled-name='uu_avl_walk_end' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_avl_walk_end'>
      <parameter type-id='type-id-45' name='wp'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='uu_avl_walk_next' mangled-name='uu_avl_walk_next' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_avl_walk_next'>
      <parameter type-id='type-id-45' name='wp'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='uu_avl_walk_start' mangled-name='uu_avl_walk_start' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_avl_walk_start'>
      <parameter type-id='type-id-46' name='ap'/>
      <parameter type-id='type-id-56' name='flags'/>
      <return type-id='type-id-45'/>
    </function-decl>
    <function-decl name='uu_avl_prev' mangled-name='uu_avl_prev' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_avl_prev'>
      <parameter type-id='type-id-46' name='ap'/>
      <parameter type-id='type-id-6' name='node'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='uu_avl_next' mangled-name='uu_avl_next' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_avl_next'>
      <parameter type-id='type-id-46' name='ap'/>
      <parameter type-id='type-id-6' name='node'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='uu_avl_last' mangled-name='uu_avl_last' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_avl_last'>
      <parameter type-id='type-id-46' name='ap'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='uu_avl_first' mangled-name='uu_avl_first' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_avl_first'>
      <parameter type-id='type-id-46' name='ap'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='uu_avl_numnodes' mangled-name='uu_avl_numnodes' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_avl_numnodes'>
      <parameter type-id='type-id-46' name='ap'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='uu_avl_destroy' mangled-name='uu_avl_destroy' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_avl_destroy'>
      <parameter type-id='type-id-46' name='ap'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='uu_avl_create' mangled-name='uu_avl_create' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_avl_create'>
      <parameter type-id='type-id-11' name='pp'/>
      <parameter type-id='type-id-6' name='parent'/>
      <parameter type-id='type-id-56' name='flags'/>
      <return type-id='type-id-46'/>
    </function-decl>
    <class-decl name='uu_avl_node' size-in-bits='192' is-struct='yes' visibility='default' id='type-id-57'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='uan_opaque' type-id='type-id-58' visibility='default'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-10' size-in-bits='192' id='type-id-58'>
      <subrange length='3' type-id='type-id-7' id='type-id-59'/>

    </array-type-def>
    <typedef-decl name='uu_avl_node_t' type-id='type-id-57' id='type-id-60'/>
    <pointer-type-def type-id='type-id-60' size-in-bits='64' id='type-id-61'/>
    <function-decl name='uu_avl_node_fini' mangled-name='uu_avl_node_fini' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_avl_node_fini'>
      <parameter type-id='type-id-6' name='base'/>
      <parameter type-id='type-id-61' name='np'/>
      <parameter type-id='type-id-11' name='pp'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='uu_avl_node_init' mangled-name='uu_avl_node_init' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_avl_node_init'>
      <parameter type-id='type-id-6' name='base'/>
      <parameter type-id='type-id-61' name='np'/>
      <parameter type-id='type-id-11' name='pp'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='uu_avl_pool_destroy' mangled-name='uu_avl_pool_destroy' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_avl_pool_destroy'>
      <parameter type-id='type-id-11' name='pp'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='uu_avl_pool_create' mangled-name='uu_avl_pool_create' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_avl_pool_create'>
      <parameter type-id='type-id-4' name='name'/>
      <parameter type-id='type-id-8' name='objsize'/>
      <parameter type-id='type-id-8' name='nodeoffset'/>
      <parameter type-id='type-id-17' name='compare_func'/>
      <parameter type-id='type-id-56' name='flags'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='pthread_mutex_unlock' mangled-name='pthread_mutex_unlock' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='pthread_mutex_lock' mangled-name='pthread_mutex_lock' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='uu_panic' mangled-name='uu_panic' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='avl_nearest' mangled-name='avl_nearest' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='avl_insert' mangled-name='avl_insert' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='avl_find' mangled-name='avl_find' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='avl_destroy_nodes' mangled-name='avl_destroy_nodes' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='avl_remove' mangled-name='avl_remove' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='uu_free' mangled-name='uu_free' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='uu_zalloc' mangled-name='uu_zalloc' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='avl_last' mangled-name='avl_last' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='avl_first' mangled-name='avl_first' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='avl_walk' mangled-name='avl_walk' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='avl_numnodes' mangled-name='avl_numnodes' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='avl_destroy' mangled-name='avl_destroy' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='avl_create' mangled-name='avl_create' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='pthread_mutex_destroy' mangled-name='pthread_mutex_destroy' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='uu_check_name' mangled-name='uu_check_name' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='strlcpy' mangled-name='strlcpy' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='pthread_mutex_init' mangled-name='pthread_mutex_init' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-43'>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-22'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-23'>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-22'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='uu_ident.c' comp-dir-path='/home/runner/work/zfs/zfs/lib/libuutil' language='LANG_C99'>
    <typedef-decl name='uint_t' type-id='type-id-31' id='type-id-62'/>
    <function-decl name='uu_check_name' mangled-name='uu_check_name' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_check_name'>
      <parameter type-id='type-id-4' name='name'/>
      <parameter type-id='type-id-62' name='flags'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='strchr' mangled-name='strchr' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-5'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='uu_list.c' comp-dir-path='/home/runner/work/zfs/zfs/lib/libuutil' language='LANG_C99'>
    <function-decl name='uu_list_release' mangled-name='uu_list_release' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_release'>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='uu_list_lockup' mangled-name='uu_list_lockup' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_lockup'>
      <return type-id='type-id-5'/>
    </function-decl>
    <class-decl name='uu_list' size-in-bits='896' is-struct='yes' visibility='default' id='type-id-63'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ul_next_enc' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ul_prev_enc' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ul_pool' type-id='type-id-64' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='ul_parent_enc' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='ul_offset' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='ul_numnodes' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='ul_debug' type-id='type-id-12' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='392'>
        <var-decl name='ul_sorted' type-id='type-id-12' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='400'>
        <var-decl name='ul_index' type-id='type-id-12' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='ul_null_node' type-id='type-id-65' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='ul_null_walk' type-id='type-id-66' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='uu_list_pool' size-in-bits='2112' is-struct='yes' visibility='default' id='type-id-67'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ulp_next' type-id='type-id-64' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ulp_prev' type-id='type-id-64' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ulp_name' type-id='type-id-16' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='ulp_nodeoffset' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='ulp_objsize' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='ulp_cmp' type-id='type-id-17' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='ulp_debug' type-id='type-id-12' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='840'>
        <var-decl name='ulp_last_index' type-id='type-id-12' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='ulp_lock' type-id='type-id-18' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='ulp_null_list' type-id='type-id-68' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='uu_list_pool_t' type-id='type-id-67' id='type-id-69'/>
    <pointer-type-def type-id='type-id-69' size-in-bits='64' id='type-id-64'/>
    <typedef-decl name='uu_list_t' type-id='type-id-63' id='type-id-68'/>
    <class-decl name='uu_list_node_impl' size-in-bits='128' is-struct='yes' visibility='default' id='type-id-70'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='uln_next' type-id='type-id-71' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='uln_prev' type-id='type-id-71' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-70' size-in-bits='64' id='type-id-71'/>
    <typedef-decl name='uu_list_node_impl_t' type-id='type-id-70' id='type-id-65'/>
    <class-decl name='uu_list_walk' size-in-bits='320' is-struct='yes' visibility='default' id='type-id-72'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ulw_next' type-id='type-id-73' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ulw_prev' type-id='type-id-73' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ulw_list' type-id='type-id-74' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='ulw_dir' type-id='type-id-47' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='200'>
        <var-decl name='ulw_robust' type-id='type-id-12' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='ulw_next_result' type-id='type-id-75' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='uu_list_walk_t' type-id='type-id-72' id='type-id-66'/>
    <pointer-type-def type-id='type-id-66' size-in-bits='64' id='type-id-73'/>
    <pointer-type-def type-id='type-id-68' size-in-bits='64' id='type-id-74'/>
    <pointer-type-def type-id='type-id-65' size-in-bits='64' id='type-id-75'/>
    <function-decl name='uu_list_prev' mangled-name='uu_list_prev' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_prev'>
      <parameter type-id='type-id-74' name='lp'/>
      <parameter type-id='type-id-6' name='elem'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='uu_list_next' mangled-name='uu_list_next' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_next'>
      <parameter type-id='type-id-74' name='lp'/>
      <parameter type-id='type-id-6' name='elem'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='uu_list_last' mangled-name='uu_list_last' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_last'>
      <parameter type-id='type-id-74' name='lp'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='uu_list_first' mangled-name='uu_list_first' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_first'>
      <parameter type-id='type-id-74' name='lp'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='uu_list_numnodes' mangled-name='uu_list_numnodes' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_numnodes'>
      <parameter type-id='type-id-74' name='lp'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='uu_list_insert_after' mangled-name='uu_list_insert_after' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_insert_after'>
      <parameter type-id='type-id-74' name='lp'/>
      <parameter type-id='type-id-6' name='target'/>
      <parameter type-id='type-id-6' name='elem'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='uu_list_insert_before' mangled-name='uu_list_insert_before' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_insert_before'>
      <parameter type-id='type-id-74' name='lp'/>
      <parameter type-id='type-id-6' name='target'/>
      <parameter type-id='type-id-6' name='elem'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='uu_list_teardown' mangled-name='uu_list_teardown' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_teardown'>
      <parameter type-id='type-id-74' name='lp'/>
      <parameter type-id='type-id-52' name='cookie'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='uu_list_remove' mangled-name='uu_list_remove' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_remove'>
      <parameter type-id='type-id-74' name='lp'/>
      <parameter type-id='type-id-6' name='elem'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='uu_list_walk' mangled-name='uu_list_walk' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_walk'>
      <parameter type-id='type-id-74' name='lp'/>
      <parameter type-id='type-id-54' name='func'/>
      <parameter type-id='type-id-6' name='private'/>
      <parameter type-id='type-id-56' name='flags'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='uu_list_walk_end' mangled-name='uu_list_walk_end' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_walk_end'>
      <parameter type-id='type-id-73' name='wp'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='uu_list_walk_next' mangled-name='uu_list_walk_next' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_walk_next'>
      <parameter type-id='type-id-73' name='wp'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='uu_list_walk_start' mangled-name='uu_list_walk_start' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_walk_start'>
      <parameter type-id='type-id-74' name='lp'/>
      <parameter type-id='type-id-56' name='flags'/>
      <return type-id='type-id-73'/>
    </function-decl>
    <typedef-decl name='uu_list_index_t' type-id='type-id-10' id='type-id-76'/>
    <function-decl name='uu_list_nearest_prev' mangled-name='uu_list_nearest_prev' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_nearest_prev'>
      <parameter type-id='type-id-74' name='lp'/>
      <parameter type-id='type-id-76' name='idx'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='uu_list_nearest_next' mangled-name='uu_list_nearest_next' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_nearest_next'>
      <parameter type-id='type-id-74' name='lp'/>
      <parameter type-id='type-id-76' name='idx'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <pointer-type-def type-id='type-id-76' size-in-bits='64' id='type-id-77'/>
    <function-decl name='uu_list_find' mangled-name='uu_list_find' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_find'>
      <parameter type-id='type-id-74' name='lp'/>
      <parameter type-id='type-id-6' name='elem'/>
      <parameter type-id='type-id-6' name='private'/>
      <parameter type-id='type-id-77' name='out'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='uu_list_insert' mangled-name='uu_list_insert' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_insert'>
      <parameter type-id='type-id-74' name='lp'/>
      <parameter type-id='type-id-6' name='elem'/>
      <parameter type-id='type-id-76' name='idx'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='uu_list_destroy' mangled-name='uu_list_destroy' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_destroy'>
      <parameter type-id='type-id-74' name='lp'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='uu_list_create' mangled-name='uu_list_create' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_create'>
      <parameter type-id='type-id-64' name='pp'/>
      <parameter type-id='type-id-6' name='parent'/>
      <parameter type-id='type-id-56' name='flags'/>
      <return type-id='type-id-74'/>
    </function-decl>
    <class-decl name='uu_list_node' size-in-bits='128' is-struct='yes' visibility='default' id='type-id-78'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='uln_opaque' type-id='type-id-79' visibility='default'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-10' size-in-bits='128' id='type-id-79'>
      <subrange length='2' type-id='type-id-7' id='type-id-42'/>

    </array-type-def>
    <typedef-decl name='uu_list_node_t' type-id='type-id-78' id='type-id-80'/>
    <pointer-type-def type-id='type-id-80' size-in-bits='64' id='type-id-81'/>
    <function-decl name='uu_list_node_fini' mangled-name='uu_list_node_fini' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_node_fini'>
      <parameter type-id='type-id-6' name='base'/>
      <parameter type-id='type-id-81' name='np_arg'/>
      <parameter type-id='type-id-64' name='pp'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='uu_list_node_init' mangled-name='uu_list_node_init' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_node_init'>
      <parameter type-id='type-id-6' name='base'/>
      <parameter type-id='type-id-81' name='np_arg'/>
      <parameter type-id='type-id-64' name='pp'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='uu_list_pool_destroy' mangled-name='uu_list_pool_destroy' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_pool_destroy'>
      <parameter type-id='type-id-64' name='pp'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='uu_list_pool_create' mangled-name='uu_list_pool_create' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_pool_create'>
      <parameter type-id='type-id-4' name='name'/>
      <parameter type-id='type-id-8' name='objsize'/>
      <parameter type-id='type-id-8' name='nodeoffset'/>
      <parameter type-id='type-id-17' name='compare_func'/>
      <parameter type-id='type-id-56' name='flags'/>
      <return type-id='type-id-64'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='uu_misc.c' comp-dir-path='/home/runner/work/zfs/zfs/lib/libuutil' language='LANG_C99'>
    <function-decl name='uu_panic' mangled-name='uu_panic' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_panic'>
      <parameter type-id='type-id-4' name='format'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='uu_strerror' mangled-name='uu_strerror' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_strerror'>
      <parameter type-id='type-id-56' name='code'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='uu_error' mangled-name='uu_error' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_error'>
      <return type-id='type-id-56'/>
    </function-decl>
    <function-decl name='uu_set_error' mangled-name='uu_set_error' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_set_error'>
      <parameter type-id='type-id-62' name='code'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='pthread_atfork' mangled-name='pthread_atfork' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='__vfprintf_chk' mangled-name='__vfprintf_chk' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='pthread_self' mangled-name='pthread_self' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='pause' mangled-name='pause' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='abort' mangled-name='abort' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='dcgettext' mangled-name='dcgettext' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='__errno_location' mangled-name='__errno_location' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='pthread_getspecific' mangled-name='pthread_getspecific' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='pthread_setspecific' mangled-name='pthread_setspecific' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='pthread_key_create' mangled-name='pthread_key_create' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-5'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='uu_pname.c' comp-dir-path='/home/runner/work/zfs/zfs/lib/libuutil' language='LANG_C99'>
    <var-decl name='uu_exit_ok_value' type-id='type-id-22' mangled-name='uu_exit_ok_value' visibility='default' elf-symbol-id='uu_exit_ok_value'/>
    <var-decl name='uu_exit_fatal_value' type-id='type-id-22' mangled-name='uu_exit_fatal_value' visibility='default' elf-symbol-id='uu_exit_fatal_value'/>
    <var-decl name='uu_exit_usage_value' type-id='type-id-22' mangled-name='uu_exit_usage_value' visibility='default' elf-symbol-id='uu_exit_usage_value'/>
    <function-decl name='uu_getpname' mangled-name='uu_getpname' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_getpname'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='uu_setpname' mangled-name='uu_setpname' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_setpname'>
      <parameter type-id='type-id-2' name='arg0'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='uu_xdie' mangled-name='uu_xdie' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_xdie'>
      <parameter type-id='type-id-22' name='status'/>
      <parameter type-id='type-id-4' name='format'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <class-decl name='__va_list_tag' size-in-bits='192' is-struct='yes' visibility='default' id='type-id-82'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='gp_offset' type-id='type-id-31' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='fp_offset' type-id='type-id-31' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='overflow_arg_area' type-id='type-id-6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='reg_save_area' type-id='type-id-6' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-82' size-in-bits='64' id='type-id-83'/>
    <function-decl name='uu_vxdie' mangled-name='uu_vxdie' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_vxdie'>
      <parameter type-id='type-id-22' name='status'/>
      <parameter type-id='type-id-4' name='format'/>
      <parameter type-id='type-id-83' name='alist'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='uu_die' mangled-name='uu_die' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_die'>
      <parameter type-id='type-id-4' name='format'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='uu_vdie' mangled-name='uu_vdie' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_vdie'>
      <parameter type-id='type-id-4' name='format'/>
      <parameter type-id='type-id-83' name='alist'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='uu_warn' mangled-name='uu_warn' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_warn'>
      <parameter type-id='type-id-4' name='format'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='uu_vwarn' mangled-name='uu_vwarn' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_vwarn'>
      <parameter type-id='type-id-4' name='format'/>
      <parameter type-id='type-id-83' name='alist'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='uu_alt_exit' mangled-name='uu_alt_exit' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_alt_exit'>
      <parameter type-id='type-id-22' name='profile'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <pointer-type-def type-id='type-id-22' size-in-bits='64' id='type-id-84'/>
    <function-decl name='uu_exit_usage' mangled-name='uu_exit_usage' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_exit_usage'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='uu_exit_fatal' mangled-name='uu_exit_fatal' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_exit_fatal'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='uu_exit_ok' mangled-name='uu_exit_ok' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_exit_ok'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='strrchr' mangled-name='strrchr' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='getexecname' mangled-name='getexecname' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='exit' mangled-name='exit' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='__fprintf_chk' mangled-name='__fprintf_chk' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='strerror' mangled-name='strerror' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-5'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='uu_string.c' comp-dir-path='/home/runner/work/zfs/zfs/lib/libuutil' language='LANG_C99'>
    <type-decl name='unnamed-enum-underlying-type' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='type-id-85'/>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' id='type-id-86'>
      <underlying-type type-id='type-id-85'/>
      <enumerator name='B_FALSE' value='0'/>
      <enumerator name='B_TRUE' value='1'/>
    </enum-decl>
    <typedef-decl name='boolean_t' type-id='type-id-86' id='type-id-87'/>
    <function-decl name='uu_strbw' mangled-name='uu_strbw' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_strbw'>
      <parameter type-id='type-id-4' name='a'/>
      <parameter type-id='type-id-4' name='b'/>
      <return type-id='type-id-87'/>
    </function-decl>
    <function-decl name='uu_strcaseeq' mangled-name='uu_strcaseeq' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_strcaseeq'>
      <parameter type-id='type-id-4' name='a'/>
      <parameter type-id='type-id-4' name='b'/>
      <return type-id='type-id-87'/>
    </function-decl>
    <function-decl name='uu_streq' mangled-name='uu_streq' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_streq'>
      <parameter type-id='type-id-4' name='a'/>
      <parameter type-id='type-id-4' name='b'/>
      <return type-id='type-id-87'/>
    </function-decl>
    <function-decl name='strncmp' mangled-name='strncmp' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='strcasecmp' mangled-name='strcasecmp' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='strcmp' mangled-name='strcmp' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-5'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../../module/avl/avl.c' comp-dir-path='/home/runner/work/zfs/zfs/lib/libavl' language='LANG_C99'>
    <typedef-decl name='avl_tree_t' type-id='type-id-13' id='type-id-88'/>
    <pointer-type-def type-id='type-id-88' size-in-bits='64' id='type-id-89'/>
    <function-decl name='avl_destroy_nodes' mangled-name='avl_destroy_nodes' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_destroy_nodes'>
      <parameter type-id='type-id-89' name='tree'/>
      <parameter type-id='type-id-52' name='cookie'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='avl_is_empty' mangled-name='avl_is_empty' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_is_empty'>
      <parameter type-id='type-id-89' name='tree'/>
      <return type-id='type-id-87'/>
    </function-decl>
    <function-decl name='avl_numnodes' mangled-name='avl_numnodes' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_numnodes'>
      <parameter type-id='type-id-89' name='tree'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='avl_destroy' mangled-name='avl_destroy' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_destroy'>
      <parameter type-id='type-id-89' name='tree'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='avl_create' mangled-name='avl_create' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_create'>
      <parameter type-id='type-id-89' name='tree'/>
      <parameter type-id='type-id-38' name='compar'/>
      <parameter type-id='type-id-8' name='size'/>
      <parameter type-id='type-id-8' name='offset'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='avl_swap' mangled-name='avl_swap' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_swap'>
      <parameter type-id='type-id-89' name='tree1'/>
      <parameter type-id='type-id-89' name='tree2'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='avl_update' mangled-name='avl_update' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_update'>
      <parameter type-id='type-id-89' name='t'/>
      <parameter type-id='type-id-6' name='obj'/>
      <return type-id='type-id-87'/>
    </function-decl>
    <function-decl name='avl_update_gt' mangled-name='avl_update_gt' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_update_gt'>
      <parameter type-id='type-id-89' name='t'/>
      <parameter type-id='type-id-6' name='obj'/>
      <return type-id='type-id-87'/>
    </function-decl>
    <function-decl name='avl_update_lt' mangled-name='avl_update_lt' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_update_lt'>
      <parameter type-id='type-id-89' name='t'/>
      <parameter type-id='type-id-6' name='obj'/>
      <return type-id='type-id-87'/>
    </function-decl>
    <function-decl name='avl_remove' mangled-name='avl_remove' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_remove'>
      <parameter type-id='type-id-89' name='tree'/>
      <parameter type-id='type-id-6' name='data'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='avl_add' mangled-name='avl_add' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_add'>
      <parameter type-id='type-id-89' name='tree'/>
      <parameter type-id='type-id-6' name='new_node'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='avl_insert_here' mangled-name='avl_insert_here' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_insert_here'>
      <parameter type-id='type-id-89' name='tree'/>
      <parameter type-id='type-id-6' name='new_data'/>
      <parameter type-id='type-id-6' name='here'/>
      <parameter type-id='type-id-22' name='direction'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <typedef-decl name='avl_index_t' type-id='type-id-10' id='type-id-90'/>
    <function-decl name='avl_insert' mangled-name='avl_insert' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_insert'>
      <parameter type-id='type-id-89' name='tree'/>
      <parameter type-id='type-id-6' name='new_data'/>
      <parameter type-id='type-id-90' name='where'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <pointer-type-def type-id='type-id-90' size-in-bits='64' id='type-id-91'/>
    <function-decl name='avl_find' mangled-name='avl_find' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_find'>
      <parameter type-id='type-id-89' name='tree'/>
      <parameter type-id='type-id-6' name='value'/>
      <parameter type-id='type-id-91' name='where'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='avl_nearest' mangled-name='avl_nearest' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_nearest'>
      <parameter type-id='type-id-89' name='tree'/>
      <parameter type-id='type-id-90' name='where'/>
      <parameter type-id='type-id-22' name='direction'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='avl_last' mangled-name='avl_last' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_last'>
      <parameter type-id='type-id-89' name='tree'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='avl_first' mangled-name='avl_first' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_first'>
      <parameter type-id='type-id-89' name='tree'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='avl_walk' mangled-name='avl_walk' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_walk'>
      <parameter type-id='type-id-89' name='tree'/>
      <parameter type-id='type-id-6' name='oldnode'/>
      <parameter type-id='type-id-22' name='left'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='libspl_assertf' mangled-name='libspl_assertf' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-5'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='atomic.c' comp-dir-path='/home/runner/work/zfs/zfs/lib/libspl' language='LANG_C99'>
    <function-decl name='membar_consumer' mangled-name='membar_consumer' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='membar_consumer'>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='membar_producer' mangled-name='membar_producer' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='membar_producer'>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='membar_enter' mangled-name='membar_enter' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='membar_enter'>
      <return type-id='type-id-5'/>
    </function-decl>
    <qualified-type-def type-id='type-id-39' volatile='yes' id='type-id-92'/>
    <pointer-type-def type-id='type-id-92' size-in-bits='64' id='type-id-93'/>
    <function-decl name='atomic_clear_long_excl' mangled-name='atomic_clear_long_excl' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_clear_long_excl'>
      <parameter type-id='type-id-93' name='target'/>
      <parameter type-id='type-id-62' name='value'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='atomic_set_long_excl' mangled-name='atomic_set_long_excl' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_set_long_excl'>
      <parameter type-id='type-id-93' name='target'/>
      <parameter type-id='type-id-62' name='value'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <qualified-type-def type-id='type-id-5' volatile='yes' id='type-id-94'/>
    <pointer-type-def type-id='type-id-94' size-in-bits='64' id='type-id-95'/>
    <function-decl name='atomic_swap_ptr' mangled-name='atomic_swap_ptr' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_swap_ptr'>
      <parameter type-id='type-id-95' name='target'/>
      <parameter type-id='type-id-6' name='bits'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='atomic_swap_ulong' mangled-name='atomic_swap_ulong' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_swap_ulong'>
      <parameter type-id='type-id-93' name='target'/>
      <parameter type-id='type-id-39' name='bits'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <qualified-type-def type-id='type-id-56' volatile='yes' id='type-id-96'/>
    <pointer-type-def type-id='type-id-96' size-in-bits='64' id='type-id-97'/>
    <function-decl name='atomic_swap_32' mangled-name='atomic_swap_32' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_swap_32'>
      <parameter type-id='type-id-97' name='target'/>
      <parameter type-id='type-id-56' name='bits'/>
      <return type-id='type-id-56'/>
    </function-decl>
    <type-decl name='unsigned short int' size-in-bits='16' id='type-id-98'/>
    <typedef-decl name='__uint16_t' type-id='type-id-98' id='type-id-99'/>
    <typedef-decl name='uint16_t' type-id='type-id-99' id='type-id-100'/>
    <qualified-type-def type-id='type-id-100' volatile='yes' id='type-id-101'/>
    <pointer-type-def type-id='type-id-101' size-in-bits='64' id='type-id-102'/>
    <function-decl name='atomic_swap_16' mangled-name='atomic_swap_16' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_swap_16'>
      <parameter type-id='type-id-102' name='target'/>
      <parameter type-id='type-id-100' name='bits'/>
      <return type-id='type-id-100'/>
    </function-decl>
    <qualified-type-def type-id='type-id-12' volatile='yes' id='type-id-103'/>
    <pointer-type-def type-id='type-id-103' size-in-bits='64' id='type-id-104'/>
    <function-decl name='atomic_swap_8' mangled-name='atomic_swap_8' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_swap_8'>
      <parameter type-id='type-id-104' name='target'/>
      <parameter type-id='type-id-12' name='bits'/>
      <return type-id='type-id-12'/>
    </function-decl>
    <function-decl name='atomic_cas_ptr' mangled-name='atomic_cas_ptr' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_cas_ptr'>
      <parameter type-id='type-id-95' name='target'/>
      <parameter type-id='type-id-6' name='exp'/>
      <parameter type-id='type-id-6' name='des'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='atomic_and_ulong_nv' mangled-name='atomic_and_ulong_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_and_ulong_nv'>
      <parameter type-id='type-id-93' name='target'/>
      <parameter type-id='type-id-39' name='bits'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='atomic_and_32_nv' mangled-name='atomic_and_32_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_and_32_nv'>
      <parameter type-id='type-id-97' name='target'/>
      <parameter type-id='type-id-56' name='bits'/>
      <return type-id='type-id-56'/>
    </function-decl>
    <function-decl name='atomic_and_16_nv' mangled-name='atomic_and_16_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_and_16_nv'>
      <parameter type-id='type-id-102' name='target'/>
      <parameter type-id='type-id-100' name='bits'/>
      <return type-id='type-id-100'/>
    </function-decl>
    <function-decl name='atomic_and_8_nv' mangled-name='atomic_and_8_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_and_8_nv'>
      <parameter type-id='type-id-104' name='target'/>
      <parameter type-id='type-id-12' name='bits'/>
      <return type-id='type-id-12'/>
    </function-decl>
    <function-decl name='atomic_or_ulong_nv' mangled-name='atomic_or_ulong_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_or_ulong_nv'>
      <parameter type-id='type-id-93' name='target'/>
      <parameter type-id='type-id-39' name='bits'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='atomic_or_32_nv' mangled-name='atomic_or_32_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_or_32_nv'>
      <parameter type-id='type-id-97' name='target'/>
      <parameter type-id='type-id-56' name='bits'/>
      <return type-id='type-id-56'/>
    </function-decl>
    <function-decl name='atomic_or_16_nv' mangled-name='atomic_or_16_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_or_16_nv'>
      <parameter type-id='type-id-102' name='target'/>
      <parameter type-id='type-id-100' name='bits'/>
      <return type-id='type-id-100'/>
    </function-decl>
    <function-decl name='atomic_or_8_nv' mangled-name='atomic_or_8_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_or_8_nv'>
      <parameter type-id='type-id-104' name='target'/>
      <parameter type-id='type-id-12' name='bits'/>
      <return type-id='type-id-12'/>
    </function-decl>
    <typedef-decl name='__ssize_t' type-id='type-id-30' id='type-id-105'/>
    <typedef-decl name='ssize_t' type-id='type-id-105' id='type-id-106'/>
    <function-decl name='atomic_sub_ptr_nv' mangled-name='atomic_sub_ptr_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_sub_ptr_nv'>
      <parameter type-id='type-id-95' name='target'/>
      <parameter type-id='type-id-106' name='bits'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='atomic_sub_long_nv' mangled-name='atomic_sub_long_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_sub_long_nv'>
      <parameter type-id='type-id-93' name='target'/>
      <parameter type-id='type-id-30' name='bits'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <typedef-decl name='__int32_t' type-id='type-id-22' id='type-id-107'/>
    <typedef-decl name='int32_t' type-id='type-id-107' id='type-id-108'/>
    <function-decl name='atomic_sub_32_nv' mangled-name='atomic_sub_32_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_sub_32_nv'>
      <parameter type-id='type-id-97' name='target'/>
      <parameter type-id='type-id-108' name='bits'/>
      <return type-id='type-id-56'/>
    </function-decl>
    <typedef-decl name='__int16_t' type-id='type-id-32' id='type-id-109'/>
    <typedef-decl name='int16_t' type-id='type-id-109' id='type-id-110'/>
    <function-decl name='atomic_sub_16_nv' mangled-name='atomic_sub_16_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_sub_16_nv'>
      <parameter type-id='type-id-102' name='target'/>
      <parameter type-id='type-id-110' name='bits'/>
      <return type-id='type-id-100'/>
    </function-decl>
    <function-decl name='atomic_sub_8_nv' mangled-name='atomic_sub_8_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_sub_8_nv'>
      <parameter type-id='type-id-104' name='target'/>
      <parameter type-id='type-id-47' name='bits'/>
      <return type-id='type-id-12'/>
    </function-decl>
    <function-decl name='atomic_add_ptr_nv' mangled-name='atomic_add_ptr_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_ptr_nv'>
      <parameter type-id='type-id-95' name='target'/>
      <parameter type-id='type-id-106' name='bits'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='atomic_add_long_nv' mangled-name='atomic_add_long_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_long_nv'>
      <parameter type-id='type-id-93' name='target'/>
      <parameter type-id='type-id-30' name='bits'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='atomic_add_32_nv' mangled-name='atomic_add_32_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_32_nv'>
      <parameter type-id='type-id-97' name='target'/>
      <parameter type-id='type-id-108' name='bits'/>
      <return type-id='type-id-56'/>
    </function-decl>
    <function-decl name='atomic_add_16_nv' mangled-name='atomic_add_16_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_16_nv'>
      <parameter type-id='type-id-102' name='target'/>
      <parameter type-id='type-id-110' name='bits'/>
      <return type-id='type-id-100'/>
    </function-decl>
    <function-decl name='atomic_add_8_nv' mangled-name='atomic_add_8_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_8_nv'>
      <parameter type-id='type-id-104' name='target'/>
      <parameter type-id='type-id-47' name='bits'/>
      <return type-id='type-id-12'/>
    </function-decl>
    <function-decl name='atomic_dec_ulong_nv' mangled-name='atomic_dec_ulong_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_dec_ulong_nv'>
      <parameter type-id='type-id-93' name='target'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='atomic_dec_32_nv' mangled-name='atomic_dec_32_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_dec_32_nv'>
      <parameter type-id='type-id-97' name='target'/>
      <return type-id='type-id-56'/>
    </function-decl>
    <function-decl name='atomic_dec_16_nv' mangled-name='atomic_dec_16_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_dec_16_nv'>
      <parameter type-id='type-id-102' name='target'/>
      <return type-id='type-id-100'/>
    </function-decl>
    <function-decl name='atomic_dec_8_nv' mangled-name='atomic_dec_8_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_dec_8_nv'>
      <parameter type-id='type-id-104' name='target'/>
      <return type-id='type-id-12'/>
    </function-decl>
    <function-decl name='atomic_inc_ulong_nv' mangled-name='atomic_inc_ulong_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_inc_ulong_nv'>
      <parameter type-id='type-id-93' name='target'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='atomic_inc_32_nv' mangled-name='atomic_inc_32_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_inc_32_nv'>
      <parameter type-id='type-id-97' name='target'/>
      <return type-id='type-id-56'/>
    </function-decl>
    <function-decl name='atomic_inc_16_nv' mangled-name='atomic_inc_16_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_inc_16_nv'>
      <parameter type-id='type-id-102' name='target'/>
      <return type-id='type-id-100'/>
    </function-decl>
    <function-decl name='atomic_inc_8_nv' mangled-name='atomic_inc_8_nv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_inc_8_nv'>
      <parameter type-id='type-id-104' name='target'/>
      <return type-id='type-id-12'/>
    </function-decl>
    <function-decl name='atomic_and_ulong' mangled-name='atomic_and_ulong' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_and_ulong'>
      <parameter type-id='type-id-93' name='target'/>
      <parameter type-id='type-id-39' name='bits'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='atomic_and_32' mangled-name='atomic_and_32' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_and_32'>
      <parameter type-id='type-id-97' name='target'/>
      <parameter type-id='type-id-56' name='bits'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='atomic_and_16' mangled-name='atomic_and_16' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_and_16'>
      <parameter type-id='type-id-102' name='target'/>
      <parameter type-id='type-id-100' name='bits'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='atomic_and_8' mangled-name='atomic_and_8' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_and_8'>
      <parameter type-id='type-id-104' name='target'/>
      <parameter type-id='type-id-12' name='bits'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='atomic_or_ulong' mangled-name='atomic_or_ulong' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_or_ulong'>
      <parameter type-id='type-id-93' name='target'/>
      <parameter type-id='type-id-39' name='bits'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='atomic_or_32' mangled-name='atomic_or_32' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_or_32'>
      <parameter type-id='type-id-97' name='target'/>
      <parameter type-id='type-id-56' name='bits'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='atomic_or_16' mangled-name='atomic_or_16' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_or_16'>
      <parameter type-id='type-id-102' name='target'/>
      <parameter type-id='type-id-100' name='bits'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='atomic_or_8' mangled-name='atomic_or_8' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_or_8'>
      <parameter type-id='type-id-104' name='target'/>
      <parameter type-id='type-id-12' name='bits'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='atomic_sub_ptr' mangled-name='atomic_sub_ptr' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_sub_ptr'>
      <parameter type-id='type-id-95' name='target'/>
      <parameter type-id='type-id-106' name='bits'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='atomic_sub_long' mangled-name='atomic_sub_long' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_sub_long'>
      <parameter type-id='type-id-93' name='target'/>
      <parameter type-id='type-id-30' name='bits'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='atomic_sub_32' mangled-name='atomic_sub_32' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_sub_32'>
      <parameter type-id='type-id-97' name='target'/>
      <parameter type-id='type-id-108' name='bits'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='atomic_sub_16' mangled-name='atomic_sub_16' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_sub_16'>
      <parameter type-id='type-id-102' name='target'/>
      <parameter type-id='type-id-110' name='bits'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='atomic_sub_8' mangled-name='atomic_sub_8' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_sub_8'>
      <parameter type-id='type-id-104' name='target'/>
      <parameter type-id='type-id-47' name='bits'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='atomic_add_ptr' mangled-name='atomic_add_ptr' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_ptr'>
      <parameter type-id='type-id-95' name='target'/>
      <parameter type-id='type-id-106' name='bits'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='atomic_add_long' mangled-name='atomic_add_long' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_long'>
      <parameter type-id='type-id-93' name='target'/>
      <parameter type-id='type-id-30' name='bits'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='atomic_add_32' mangled-name='atomic_add_32' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_32'>
      <parameter type-id='type-id-97' name='target'/>
      <parameter type-id='type-id-108' name='bits'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='atomic_add_16' mangled-name='atomic_add_16' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_16'>
      <parameter type-id='type-id-102' name='target'/>
      <parameter type-id='type-id-110' name='bits'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='atomic_add_8' mangled-name='atomic_add_8' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_8'>
      <parameter type-id='type-id-104' name='target'/>
      <parameter type-id='type-id-47' name='bits'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='atomic_dec_ulong' mangled-name='atomic_dec_ulong' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_dec_ulong'>
      <parameter type-id='type-id-93' name='target'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='atomic_dec_32' mangled-name='atomic_dec_32' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_dec_32'>
      <parameter type-id='type-id-97' name='target'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='atomic_dec_16' mangled-name='atomic_dec_16' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_dec_16'>
      <parameter type-id='type-id-102' name='target'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='atomic_dec_8' mangled-name='atomic_dec_8' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_dec_8'>
      <parameter type-id='type-id-104' name='target'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='atomic_inc_ulong' mangled-name='atomic_inc_ulong' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_inc_ulong'>
      <parameter type-id='type-id-93' name='target'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='atomic_inc_32' mangled-name='atomic_inc_32' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_inc_32'>
      <parameter type-id='type-id-97' name='target'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='atomic_inc_16' mangled-name='atomic_inc_16' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_inc_16'>
      <parameter type-id='type-id-102' name='target'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='atomic_inc_8' mangled-name='atomic_inc_8' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_inc_8'>
      <parameter type-id='type-id-104' name='target'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='atomic_cas_8' mangled-name='atomic_cas_8' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_cas_8'>
      <parameter type-id='type-id-104' name='target'/>
      <parameter type-id='type-id-12' name='exp'/>
      <parameter type-id='type-id-12' name='des'/>
      <return type-id='type-id-12'/>
    </function-decl>
    <function-decl name='atomic_cas_16' mangled-name='atomic_cas_16' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_cas_16'>
      <parameter type-id='type-id-102' name='target'/>
      <parameter type-id='type-id-100' name='exp'/>
      <parameter type-id='type-id-100' name='des'/>
      <return type-id='type-id-100'/>
    </function-decl>
    <function-decl name='atomic_cas_32' mangled-name='atomic_cas_32' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_cas_32'>
      <parameter type-id='type-id-97' name='target'/>
      <parameter type-id='type-id-56' name='exp'/>
      <parameter type-id='type-id-56' name='des'/>
      <return type-id='type-id-56'/>
    </function-decl>
    <function-decl name='atomic_cas_ulong' mangled-name='atomic_cas_ulong' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_cas_ulong'>
      <parameter type-id='type-id-93' name='target'/>
      <parameter type-id='type-id-39' name='exp'/>
      <parameter type-id='type-id-39' name='des'/>
      <return type-id='type-id-39'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='getexecname.c' comp-dir-path='/home/runner/work/zfs/zfs/lib/libspl' language='LANG_C99'>
    <function-decl name='getexecname' mangled-name='getexecname' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getexecname'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='getexecname_impl' mangled-name='getexecname_impl' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-5'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='list.c' comp-dir-path='/home/runner/work/zfs/zfs/lib/libspl' language='LANG_C99'>
    <class-decl name='list' size-in-bits='256' is-struct='yes' visibility='default' id='type-id-111'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='list_size' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='list_offset' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='list_head' type-id='type-id-112' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='list_node' size-in-bits='128' is-struct='yes' visibility='default' id='type-id-112'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-113' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='prev' type-id='type-id-113' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-112' size-in-bits='64' id='type-id-113'/>
    <typedef-decl name='list_t' type-id='type-id-111' id='type-id-114'/>
    <pointer-type-def type-id='type-id-114' size-in-bits='64' id='type-id-115'/>
    <function-decl name='list_is_empty' mangled-name='list_is_empty' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_is_empty'>
      <parameter type-id='type-id-115' name='list'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <typedef-decl name='list_node_t' type-id='type-id-112' id='type-id-116'/>
    <pointer-type-def type-id='type-id-116' size-in-bits='64' id='type-id-117'/>
    <function-decl name='list_link_active' mangled-name='list_link_active' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_link_active'>
      <parameter type-id='type-id-117' name='ln'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='list_link_init' mangled-name='list_link_init' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_link_init'>
      <parameter type-id='type-id-117' name='ln'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='list_link_replace' mangled-name='list_link_replace' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_link_replace'>
      <parameter type-id='type-id-117' name='lold'/>
      <parameter type-id='type-id-117' name='lnew'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='list_move_tail' mangled-name='list_move_tail' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_move_tail'>
      <parameter type-id='type-id-115' name='dst'/>
      <parameter type-id='type-id-115' name='src'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='list_prev' mangled-name='list_prev' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_prev'>
      <parameter type-id='type-id-115' name='list'/>
      <parameter type-id='type-id-6' name='object'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='list_next' mangled-name='list_next' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_next'>
      <parameter type-id='type-id-115' name='list'/>
      <parameter type-id='type-id-6' name='object'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='list_tail' mangled-name='list_tail' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_tail'>
      <parameter type-id='type-id-115' name='list'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='list_head' mangled-name='list_head' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_head'>
      <parameter type-id='type-id-115' name='list'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='list_remove_tail' mangled-name='list_remove_tail' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_remove_tail'>
      <parameter type-id='type-id-115' name='list'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='list_remove_head' mangled-name='list_remove_head' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_remove_head'>
      <parameter type-id='type-id-115' name='list'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='list_remove' mangled-name='list_remove' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_remove'>
      <parameter type-id='type-id-115' name='list'/>
      <parameter type-id='type-id-6' name='object'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='list_insert_tail' mangled-name='list_insert_tail' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_insert_tail'>
      <parameter type-id='type-id-115' name='list'/>
      <parameter type-id='type-id-6' name='object'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='list_insert_head' mangled-name='list_insert_head' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_insert_head'>
      <parameter type-id='type-id-115' name='list'/>
      <parameter type-id='type-id-6' name='object'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='list_insert_before' mangled-name='list_insert_before' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_insert_before'>
      <parameter type-id='type-id-115' name='list'/>
      <parameter type-id='type-id-6' name='object'/>
      <parameter type-id='type-id-6' name='nobject'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='list_insert_after' mangled-name='list_insert_after' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_insert_after'>
      <parameter type-id='type-id-115' name='list'/>
      <parameter type-id='type-id-6' name='object'/>
      <parameter type-id='type-id-6' name='nobject'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='list_destroy' mangled-name='list_destroy' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_destroy'>
      <parameter type-id='type-id-115' name='list'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='list_create' mangled-name='list_create' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_create'>
      <parameter type-id='type-id-115' name='list'/>
      <parameter type-id='type-id-8' name='size'/>
      <parameter type-id='type-id-8' name='offset'/>
      <return type-id='type-id-5'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='mkdirp.c' comp-dir-path='/home/runner/work/zfs/zfs/lib/libspl' language='LANG_C99'>
    <typedef-decl name='__mode_t' type-id='type-id-31' id='type-id-118'/>
    <typedef-decl name='mode_t' type-id='type-id-118' id='type-id-119'/>
    <function-decl name='mkdirp' mangled-name='mkdirp' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='mkdirp'>
      <parameter type-id='type-id-4' name='d'/>
      <parameter type-id='type-id-119' name='mode'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='__mbstowcs_alias' mangled-name='mbstowcs' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='__wcstombs_alias' mangled-name='wcstombs' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='strdup' mangled-name='strdup' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='mkdir' mangled-name='mkdir' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='access' mangled-name='access' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-5'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='page.c' comp-dir-path='/home/runner/work/zfs/zfs/lib/libspl' language='LANG_C99'>
    <function-decl name='spl_pagesize' mangled-name='spl_pagesize' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spl_pagesize'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='sysconf' mangled-name='sysconf' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-5'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='strlcat.c' comp-dir-path='/home/runner/work/zfs/zfs/lib/libspl' language='LANG_C99'>
    <function-decl name='strlcat' mangled-name='strlcat' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strlcat'>
      <parameter type-id='type-id-2' name='dst'/>
      <parameter type-id='type-id-4' name='src'/>
      <parameter type-id='type-id-8' name='dstsize'/>
      <return type-id='type-id-8'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='strlcpy.c' comp-dir-path='/home/runner/work/zfs/zfs/lib/libspl' language='LANG_C99'>
    <function-decl name='strlcpy' mangled-name='strlcpy' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strlcpy'>
      <parameter type-id='type-id-2' name='dst'/>
      <parameter type-id='type-id-4' name='src'/>
      <parameter type-id='type-id-8' name='len'/>
      <return type-id='type-id-8'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='timestamp.c' comp-dir-path='/home/runner/work/zfs/zfs/lib/libspl' language='LANG_C99'>
    <function-decl name='print_timestamp' mangled-name='print_timestamp' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='print_timestamp'>
      <parameter type-id='type-id-62' name='timestamp_fmt'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='__builtin_puts' mangled-name='puts' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='localtime' mangled-name='localtime' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='strftime' mangled-name='strftime' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='__printf_chk' mangled-name='__printf_chk' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='time' mangled-name='time' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nl_langinfo' mangled-name='nl_langinfo' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-5'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='os/linux/getexecname.c' comp-dir-path='/home/runner/work/zfs/zfs/lib/libspl' language='LANG_C99'>
    <function-decl name='__readlink_alias' mangled-name='readlink' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-5'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='os/linux/gethostid.c' comp-dir-path='/home/runner/work/zfs/zfs/lib/libspl' language='LANG_C99'>
    <function-decl name='get_system_hostid' mangled-name='get_system_hostid' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='get_system_hostid'>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='__open_alias' mangled-name='open64' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='__read_alias' mangled-name='read' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='close' mangled-name='close' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='getenv' mangled-name='getenv' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='strtoull' mangled-name='strtoull' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='fopen' mangled-name='fopen64' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='fscanf' mangled-name='fscanf' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='fclose' mangled-name='fclose' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-5'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='os/linux/getmntany.c' comp-dir-path='/home/runner/work/zfs/zfs/lib/libspl' language='LANG_C99'>
    <class-decl name='extmnttab' size-in-bits='320' is-struct='yes' visibility='default' id='type-id-120'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mnt_special' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='mnt_mountp' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='mnt_fstype' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='mnt_mntopts' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='mnt_major' type-id='type-id-62' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='mnt_minor' type-id='type-id-62' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-120' size-in-bits='64' id='type-id-121'/>
    <class-decl name='stat64' size-in-bits='1152' is-struct='yes' visibility='default' id='type-id-122'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='st_dev' type-id='type-id-123' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='st_ino' type-id='type-id-124' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='st_nlink' type-id='type-id-125' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='st_mode' type-id='type-id-118' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='st_uid' type-id='type-id-126' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='st_gid' type-id='type-id-127' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='__pad0' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='st_rdev' type-id='type-id-123' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='st_size' type-id='type-id-128' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='st_blksize' type-id='type-id-129' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='st_blocks' type-id='type-id-130' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='st_atim' type-id='type-id-131' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='st_mtim' type-id='type-id-131' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='st_ctim' type-id='type-id-131' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='__glibc_reserved' type-id='type-id-132' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__dev_t' type-id='type-id-7' id='type-id-123'/>
    <typedef-decl name='__ino64_t' type-id='type-id-7' id='type-id-124'/>
    <typedef-decl name='__nlink_t' type-id='type-id-7' id='type-id-125'/>
    <typedef-decl name='__uid_t' type-id='type-id-31' id='type-id-126'/>
    <typedef-decl name='__gid_t' type-id='type-id-31' id='type-id-127'/>
    <typedef-decl name='__off_t' type-id='type-id-30' id='type-id-128'/>
    <typedef-decl name='__blksize_t' type-id='type-id-30' id='type-id-129'/>
    <typedef-decl name='__blkcnt64_t' type-id='type-id-30' id='type-id-130'/>
    <class-decl name='timespec' size-in-bits='128' is-struct='yes' visibility='default' id='type-id-131'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tv_sec' type-id='type-id-133' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tv_nsec' type-id='type-id-134' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__time_t' type-id='type-id-30' id='type-id-133'/>
    <typedef-decl name='__syscall_slong_t' type-id='type-id-30' id='type-id-134'/>

    <array-type-def dimensions='1' type-id='type-id-134' size-in-bits='192' id='type-id-132'>
      <subrange length='3' type-id='type-id-7' id='type-id-59'/>

    </array-type-def>
    <pointer-type-def type-id='type-id-122' size-in-bits='64' id='type-id-135'/>
    <function-decl name='getextmntent' mangled-name='getextmntent' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getextmntent'>
      <parameter type-id='type-id-4' name='path'/>
      <parameter type-id='type-id-121' name='entry'/>
      <parameter type-id='type-id-135' name='statbuf'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <class-decl name='_IO_FILE' size-in-bits='1728' is-struct='yes' visibility='default' id='type-id-136'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_flags' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_IO_read_ptr' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_IO_read_end' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_IO_read_base' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='_IO_write_base' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='_IO_write_ptr' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_IO_write_end' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='_IO_buf_base' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='_IO_buf_end' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='_IO_save_base' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='_IO_backup_base' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='_IO_save_end' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='_markers' type-id='type-id-137' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='_chain' type-id='type-id-138' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='_fileno' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='_flags2' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='_old_offset' type-id='type-id-128' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='_cur_column' type-id='type-id-98' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1040'>
        <var-decl name='_vtable_offset' type-id='type-id-48' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1048'>
        <var-decl name='_shortbuf' type-id='type-id-139' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='_offset' type-id='type-id-140' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='__pad1' type-id='type-id-6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='__pad2' type-id='type-id-6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='__pad3' type-id='type-id-6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='__pad4' type-id='type-id-6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='__pad5' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='_mode' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='_unused2' type-id='type-id-141' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='_IO_marker' size-in-bits='192' is-struct='yes' visibility='default' id='type-id-142'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_next' type-id='type-id-137' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_sbuf' type-id='type-id-138' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_pos' type-id='type-id-22' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-142' size-in-bits='64' id='type-id-137'/>
    <pointer-type-def type-id='type-id-136' size-in-bits='64' id='type-id-138'/>

    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='8' id='type-id-139'>
      <subrange length='1' type-id='type-id-7' id='type-id-143'/>

    </array-type-def>
    <typedef-decl name='__off64_t' type-id='type-id-30' id='type-id-140'/>

    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='160' id='type-id-141'>
      <subrange length='20' type-id='type-id-7' id='type-id-144'/>

    </array-type-def>
    <typedef-decl name='FILE' type-id='type-id-136' id='type-id-145'/>
    <pointer-type-def type-id='type-id-145' size-in-bits='64' id='type-id-146'/>
    <class-decl name='mnttab' size-in-bits='256' is-struct='yes' visibility='default' id='type-id-147'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mnt_special' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='mnt_mountp' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='mnt_fstype' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='mnt_mntopts' type-id='type-id-2' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-147' size-in-bits='64' id='type-id-148'/>
    <function-decl name='getmntany' mangled-name='getmntany' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getmntany'>
      <parameter type-id='type-id-146' name='fp'/>
      <parameter type-id='type-id-148' name='mgetp'/>
      <parameter type-id='type-id-148' name='mrefp'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='_sol_getmntent' mangled-name='_sol_getmntent' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_sol_getmntent'>
      <parameter type-id='type-id-146' name='fp'/>
      <parameter type-id='type-id-148' name='mgetp'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='__xstat64' mangled-name='__xstat64' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='__builtin_fwrite' mangled-name='fwrite' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='feof' mangled-name='feof' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='getmntent_r' mangled-name='getmntent_r' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-5'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='os/linux/zone.c' comp-dir-path='/home/runner/work/zfs/zfs/lib/libspl' language='LANG_C99'>
    <typedef-decl name='zoneid_t' type-id='type-id-22' id='type-id-149'/>
    <function-decl name='getzoneid' mangled-name='getzoneid' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getzoneid'>
      <return type-id='type-id-149'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='assert.c' comp-dir-path='/home/runner/work/zfs/zfs/lib/libspl' language='LANG_C99'>
    <var-decl name='libspl_assert_ok' type-id='type-id-22' mangled-name='libspl_assert_ok' visibility='default' elf-symbol-id='libspl_assert_ok'/>
    <function-decl name='libspl_assertf' mangled-name='libspl_assertf' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='libspl_assertf'>
      <parameter type-id='type-id-4' name='file'/>
      <parameter type-id='type-id-4' name='func'/>
      <parameter type-id='type-id-22' name='line'/>
      <parameter type-id='type-id-4' name='format'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='__builtin_fputc' mangled-name='fputc' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-5'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='pthread_atfork.c' comp-dir-path='/build/glibc-S9d2JN/glibc-2.27/nptl' language='LANG_C99'>
    <function-decl name='__register_atfork' mangled-name='__register_atfork' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-5'/>
    </function-decl>
  </abi-instr>
</abi-corpus>
